------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/linreg2.log
  log type:  text
 opened on:   8 Mar 2021, 12:56:48

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2
> 004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extende
> d to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
(2,109 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,113 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,737 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. 
. ** use twage : nwage1 equiv
. drop if lwage3 ==.
(4,303,612 observations deleted)

. 
. ** FIXME currently only using MORG so >=83 - merge to gen may_morg
. drop if year < 1983
(556,661 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(594 observations deleted)

. 
. ********************************************************************************
. 
. rename twage nwage1

. 
. ** keep needed variables
. ** FIXME add partt to list once defined in clean_nber_morg
. keep state year quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa p
> artt public marr hisprace hispracesex eweight alloc1 covered

. 
. drop if hispracesex ==.
(252,588 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(3203635 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(3578405 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. drop if hisprace > 2
(372,864 observations deleted)

. 
. gen period = 3 if inrange(year, 2000, 2019)
(1,896,825 missing values generated)

.         replace period = 2 if inrange(year, 1988, 2000)
(1,308,591 real changes made)

.         replace period = 1 if inrange(year, 1983, 1988)
(801,530 real changes made)

. 
. ** hisprace: Black == 1, white == 0
. replace hisprace = hisprace - 1
(3,505,520 real changes made)

. 
. eststo clear

. 
. forval i = 1(1)3{
  2.         reg lwage3 covered##hisprace i.state i.year i.nind educ exper exper2 exper3 exper4 
> edex i.ee_cl marr partt public cmsa i.nocc3 i.quarter if             female == 0 & period == `
> i' [w = finalwt1], vce(cluster state_ind)
  3. 
.         eststo naive_mal_`i'
  4. 
.         reg lwage3 covered##hisprace i.state i.year i.nind educ exper exper2 exper3 exper4 ede
> x i.ee_cl marr partt public cmsa i.nocc3 i.quarter if             female == 1 & period == `i' 
> [w = finalwt1], vce(cluster state_ind)
  5. 
.         eststo naive_fem_`i'
  6.         
.         esttab naive_mal_`i' naive_fem_`i' using $tabs/naive`i'.tex, se title(OLS Regression o
> f Log Real Trimmed Wages on Union Coverage and Race) nonumbers mtitles("Men" "Women") keep(1.c
> overed 1.hisprace 1.covered#1.hisprace) replace
  7. }
(analytic weights assumed)
(sum of wgt is 2,167,259,754)

Linear regression                               Number of obs     =    312,495
                                                F(99, 560)        =     694.76
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5062
                                                Root MSE          =     .41395

                                (Std. Err. adjusted for 561 clusters in state_ind)
----------------------------------------------------------------------------------
                 |               Robust
          lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       1.covered |   .1715491   .0105323    16.29   0.000     .1508615    .1922367
      1.hisprace |  -.1878503   .0056926   -33.00   0.000    -.1990318   -.1766687
                 |
covered#hisprace |
            1 1  |   .0567684   .0099335     5.71   0.000     .0372569    .0762799
                 |
           state |
             NH  |   .0919284   .0329511     2.79   0.005     .0272056    .1566513
             VT  |   .0187861   .0347851     0.54   0.589    -.0495392    .0871114
             MA  |   .1195466   .0301887     3.96   0.000     .0602496    .1788435
             RI  |   .0037115   .0305932     0.12   0.903    -.0563798    .0638029
             CT  |   .1388392   .0285374     4.87   0.000     .0827857    .1948926
             NY  |   .1146085    .027781     4.13   0.000     .0600407    .1691762
             NJ  |   .1883532   .0296801     6.35   0.000     .1300552    .2466511
             PA  |    .027047   .0261828     1.03   0.302    -.0243815    .0784756
             OH  |   .0542574   .0286342     1.89   0.059    -.0019862    .1105009
             IN  |   .0274957   .0291584     0.94   0.346    -.0297775     .084769
             IL  |   .1427263   .0279856     5.10   0.000     .0877568    .1976959
             MI  |   .1112798   .0310236     3.59   0.000      .050343    .1722166
             WI  |   .0348125   .0300405     1.16   0.247    -.0241933    .0938183
             MN  |   .1122177   .0286188     3.92   0.000     .0560044    .1684309
             IA  |   .0410599   .0307477     1.34   0.182    -.0193351    .1014549
             MO  |   .0415075   .0282327     1.47   0.142    -.0139473    .0969624
             ND  |   .0163755   .0328497     0.50   0.618    -.0481483    .0808993
             SD  |  -.0615322   .0300265    -2.05   0.041    -.1205105    -.002554
             NE  |  -.0431681   .0308589    -1.40   0.162    -.1037814    .0174452
             KS  |   .0597081   .0268234     2.23   0.026     .0070213    .1123949
             DE  |   .0728608   .0342185     2.13   0.034     .0056486     .140073
             MD  |    .126129    .029858     4.22   0.000     .0674817    .1847763
             DC  |   .2151148   .0336609     6.39   0.000     .1489978    .2812318
             VA  |   .0980653   .0359708     2.73   0.007     .0274112    .1687195
             WV  |   .0757579    .079966     0.95   0.344     -.081312    .2328279
             NC  |   .0152001   .0291407     0.52   0.602    -.0420383    .0724384
             SC  |   .0111042   .0306012     0.36   0.717     -.049003    .0712114
             GA  |   .0624018   .0309674     2.02   0.044     .0015753    .1232283
             FL  |   .0180884   .0283863     0.64   0.524    -.0376682     .073845
             KY  |   .0160237   .0291657     0.55   0.583    -.0412637    .0733112
             TN  |   -.028568   .0274407    -1.04   0.298    -.0824672    .0253313
             AL  |   -.009213    .027301    -0.34   0.736    -.0628378    .0444119
             MS  |  -.0237676   .0289276    -0.82   0.412    -.0805875    .0330523
             AR  |  -.0387012   .0323674    -1.20   0.232    -.1022776    .0248753
             LA  |    .094748   .0294388     3.22   0.001      .036924    .1525719
             OK  |   .0635033   .0346286     1.83   0.067    -.0045145    .1315212
             TX  |   .1271881   .0284454     4.47   0.000     .0713153    .1830608
             MT  |   .0391256   .0318043     1.23   0.219    -.0233447    .1015958
             ID  |   .0460122   .0331674     1.39   0.166    -.0191355    .1111599
             WY  |   .2676781   .0523626     5.11   0.000     .1648269    .3705292
             CO  |   .1397089   .0319437     4.37   0.000     .0769648     .202453
             NM  |   .1388338   .0482787     2.88   0.004     .0440044    .2336632
             AZ  |   .1043525   .0268721     3.88   0.000       .05157     .157135
             UT  |   .0142769   .0279029     0.51   0.609    -.0405303     .069084
             NV  |   .1180956   .0365041     3.24   0.001     .0463939    .1897972
             WA  |   .1218863   .0288303     4.23   0.000     .0652577     .178515
             OR  |   .0625029   .0277329     2.25   0.025     .0080296    .1169762
             CA  |   .2202793   .0274991     8.01   0.000     .1662652    .2742933
             AK  |   .5745549   .0404531    14.20   0.000     .4950965    .6540134
             HI  |   .1069027    .034005     3.14   0.002     .0401097    .1736957
                 |
            year |
           1984  |  -.0021694   .0029887    -0.73   0.468    -.0080398     .003701
           1985  |   .0054147   .0039292     1.38   0.169    -.0023032    .0131325
           1986  |   .0157823   .0042491     3.71   0.000     .0074361    .0241285
           1987  |   .0104807   .0050687     2.07   0.039     .0005247    .0204367
           1988  |   .0048616   .0056511     0.86   0.390    -.0062383    .0159615
                 |
            nind |
              2  |   .1769284   .0363466     4.87   0.000     .1055361    .2483207
              3  |   .1177083   .0353625     3.33   0.001     .0482489    .1871677
              4  |  -.0669728   .0353098    -1.90   0.058    -.1363286    .0023831
              5  |   .1619687   .0358346     4.52   0.000      .091582    .2323553
              6  |   .1326732   .0372397     3.56   0.000     .0595266    .2058199
              7  |  -.0421429   .0370724    -1.14   0.256    -.1149608     .030675
              8  |  -.0859372   .0374294    -2.30   0.022    -.1594565    -.012418
              9  |   -.148329   .0376202    -3.94   0.000    -.2222229   -.0744351
             10  |  -.1481486   .0366282    -4.04   0.000     -.220094   -.0762032
             11  |     .14611   .0382492     3.82   0.000     .0709805    .2212396
                 |
            educ |    .048882   .0030647    15.95   0.000     .0428622    .0549018
           exper |   .0524292   .0023376    22.43   0.000     .0478377    .0570206
          exper2 |  -.0012043   .0001453    -8.29   0.000    -.0014897    -.000919
          exper3 |   7.54e-06   4.61e-06     1.63   0.103    -1.52e-06    .0000166
          exper4 |   2.55e-08   4.79e-08     0.53   0.595    -6.87e-08    1.20e-07
            edex |  -.0002684   .0000929    -2.89   0.004    -.0004509   -.0000858
                 |
           ee_cl |
              2  |   .0098915   .0063265     1.56   0.118    -.0025351    .0223182
              3  |   .0074147   .0096072     0.77   0.441    -.0114558    .0262852
              4  |   .0941107   .0140669     6.69   0.000     .0664803    .1217411
              5  |   -.118814   .0086274   -13.77   0.000    -.1357601   -.1018679
              6  |  -.0302084    .008025    -3.76   0.000    -.0459712   -.0144456
              7  |  -.0152298   .0100785    -1.51   0.131    -.0350261    .0045666
              8  |   .1106446   .0141012     7.85   0.000     .0829468    .1383423
              9  |  -.1358881   .0123579   -11.00   0.000    -.1601615   -.1116146
             10  |  -.0600828   .0116005    -5.18   0.000    -.0828687   -.0372969
             11  |  -.0040162   .0129763    -0.31   0.757    -.0295043     .021472
             12  |   .1505424   .0143641    10.48   0.000     .1223282    .1787566
             13  |   -.087174   .0152949    -5.70   0.000    -.1172164   -.0571315
             14  |  -.0623219   .0134251    -4.64   0.000    -.0886917   -.0359521
             15  |  -.0256445   .0145324    -1.76   0.078    -.0541891    .0029001
             16  |    .135535   .0154659     8.76   0.000     .1051568    .1659131
                 |
            marr |   .1261689   .0036683    34.39   0.000     .1189636    .1333741
           partt |  -.1896406   .0063226   -29.99   0.000    -.2020594   -.1772218
          public |  -.0837136   .0092328    -9.07   0.000    -.1018488   -.0655784
            cmsa |   .1444612   .0056613    25.52   0.000     .1333413    .1555812
                 |
           nocc3 |
              2  |  -.1749806   .0077731   -22.51   0.000    -.1902485   -.1597126
              3  |  -.3575222   .0146548   -24.40   0.000    -.3863072   -.3287372
              4  |   -.232819   .0066463   -35.03   0.000    -.2458738   -.2197643
                 |
         quarter |
              2  |   .0064215   .0026903     2.39   0.017     .0011372    .0117058
              3  |   .0141719   .0027588     5.14   0.000     .0087529    .0195908
              4  |   .0202322    .002606     7.76   0.000     .0151134    .0253509
                 |
           _cons |   .5845281   .0535993    10.91   0.000     .4792479    .6898082
----------------------------------------------------------------------------------
(analytic weights assumed)
(sum of wgt is 1,917,831,567)

Linear regression                               Number of obs     =    286,909
                                                F(99, 560)        =     496.87
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4956
                                                Root MSE          =     .35561

                                (Std. Err. adjusted for 561 clusters in state_ind)
----------------------------------------------------------------------------------
                 |               Robust
          lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       1.covered |   .1632063   .0086025    18.97   0.000     .1463092    .1801034
      1.hisprace |   -.073659   .0059123   -12.46   0.000    -.0852719   -.0620461
                 |
covered#hisprace |
            1 1  |   .0206137   .0094048     2.19   0.029     .0021406    .0390868
                 |
           state |
             NH  |   .0816124   .0273503     2.98   0.003     .0278907     .135334
             VT  |   .0339475    .028922     1.17   0.241    -.0228614    .0907564
             MA  |    .068624   .0243538     2.82   0.005      .020788      .11646
             RI  |  -.0214763   .0422971    -0.51   0.612    -.1045567     .061604
             CT  |   .0915649   .0260994     3.51   0.000     .0403001    .1428297
             NY  |   .0732374     .02553     2.87   0.004     .0230911    .1233838
             NJ  |   .0980402   .0269182     3.64   0.000     .0451672    .1509131
             PA  |  -.0201846    .027511    -0.73   0.463     -.074222    .0338528
             OH  |  -.0065182   .0279465    -0.23   0.816     -.061411    .0483747
             IN  |  -.0360362   .0266029    -1.35   0.176    -.0882899    .0162175
             IL  |   .0527381   .0244615     2.16   0.032     .0046905    .1007857
             MI  |   .0404715   .0315999     1.28   0.201    -.0215973    .1025402
             WI  |  -.0091192   .0274546    -0.33   0.740    -.0630459    .0448074
             MN  |   .0798394    .024726     3.23   0.001     .0312724    .1284064
             IA  |  -.0209128   .0274328    -0.76   0.446    -.0747966    .0329709
             MO  |  -.0275173   .0257096    -1.07   0.285    -.0780163    .0229818
             ND  |  -.0026875   .0264405    -0.10   0.919    -.0546222    .0492471
             SD  |  -.0838378   .0307952    -2.72   0.007    -.1443261   -.0233496
             NE  |  -.0710429   .0257871    -2.75   0.006    -.1216942   -.0203916
             KS  |   .0024309   .0260639     0.09   0.926     -.048764    .0536258
             DE  |   .0178522   .0263199     0.68   0.498    -.0338456      .06955
             MD  |   .0703851   .0269702     2.61   0.009     .0174101    .1233601
             DC  |   .1843605   .0310181     5.94   0.000     .1234345    .2452865
             VA  |   .0341126   .0284051     1.20   0.230     -.021681    .0899062
             WV  |  -.0272967   .0281177    -0.97   0.332    -.0825257    .0279323
             NC  |  -.0278822   .0248059    -1.12   0.261    -.0766061    .0208416
             SC  |    -.03866   .0289384    -1.34   0.182     -.095501    .0181809
             GA  |   .0110532   .0284364     0.39   0.698    -.0448018    .0669082
             FL  |  -.0196319   .0244632    -0.80   0.423    -.0676828    .0284189
             KY  |  -.0430828   .0256576    -1.68   0.094    -.0934797    .0073141
             TN  |  -.0782094   .0274301    -2.85   0.005    -.1320878    -.024331
             AL  |  -.0848235   .0251114    -3.38   0.001    -.1341476   -.0354994
             MS  |  -.0914229   .0293133    -3.12   0.002    -.1490003   -.0338455
             AR  |  -.0741007   .0279501    -2.65   0.008    -.1290006   -.0192008
             LA  |  -.0169311   .0242702    -0.70   0.486    -.0646029    .0307408
             OK  |   .0039453   .0295783     0.13   0.894    -.0541526    .0620433
             TX  |   .0491584    .027927     1.76   0.079    -.0056961    .1040129
             MT  |   .0026479    .025813     0.10   0.918    -.0480543      .05335
             ID  |  -.0184133   .0255189    -0.72   0.471    -.0685379    .0317112
             WY  |   .1274783   .0307108     4.15   0.000      .067156    .1878007
             CO  |   .0585676   .0258527     2.27   0.024     .0077875    .1093478
             NM  |   .0014148   .0271639     0.05   0.958    -.0519408    .0547704
             AZ  |   .0069792   .0246774     0.28   0.777    -.0414923    .0554507
             UT  |  -.0343622   .0263716    -1.30   0.193    -.0861616    .0174372
             NV  |   .0761792   .0285044     2.67   0.008     .0201907    .1321677
             WA  |   .0997222   .0270094     3.69   0.000       .04667    .1527744
             OR  |   .0157701   .0255173     0.62   0.537    -.0343512    .0658914
             CA  |   .1529805    .024105     6.35   0.000     .1056333    .2003278
             AK  |   .4369572   .0325129    13.44   0.000     .3730951    .5008193
             HI  |   .0425198   .0336185     1.26   0.206    -.0235139    .1085535
                 |
            year |
           1984  |  -.0043669   .0024316    -1.80   0.073    -.0091432    .0004093
           1985  |   .0000416   .0034746     0.01   0.990    -.0067833    .0068665
           1986  |   .0140019   .0035059     3.99   0.000     .0071156    .0208882
           1987  |    .015576   .0042688     3.65   0.000     .0071912    .0239608
           1988  |   .0150334   .0051716     2.91   0.004     .0048753    .0251914
                 |
            nind |
              2  |   .0476439   .0544766     0.87   0.382    -.0593595    .1546473
              3  |   .0710347   .0535902     1.33   0.186    -.0342277     .176297
              4  |  -.1933199   .0541999    -3.57   0.000    -.2997798   -.0868599
              5  |   .1908733   .0548304     3.48   0.001     .0831749    .2985716
              6  |   .0386605    .054881     0.70   0.481    -.0691373    .1464583
              7  |  -.0172099   .0548921    -0.31   0.754    -.1250295    .0906097
              8  |   -.013978   .0549452    -0.25   0.799    -.1219019    .0939458
              9  |  -.1581506   .0548187    -2.88   0.004     -.265826   -.0504751
             10  |   -.162372   .0550465    -2.95   0.003     -.270495   -.0542491
             11  |   .0187568    .055495     0.34   0.735    -.0902469    .1277605
                 |
            educ |   .0623914   .0028803    21.66   0.000     .0567339     .068049
           exper |   .0622223   .0025788    24.13   0.000      .057157    .0672877
          exper2 |  -.0026884   .0001541   -17.45   0.000    -.0029911   -.0023857
          exper3 |   .0000588   4.79e-06    12.28   0.000     .0000494    .0000682
          exper4 |  -4.67e-07   4.96e-08    -9.41   0.000    -5.64e-07   -3.69e-07
            edex |  -.0007792   .0000896    -8.70   0.000    -.0009552   -.0006032
                 |
           ee_cl |
              2  |  -.0349621   .0061301    -5.70   0.000    -.0470029   -.0229213
              3  |  -.0530295   .0092279    -5.75   0.000    -.0711551   -.0349039
              4  |  -.0204095   .0153758    -1.33   0.185    -.0506108    .0097917
              5  |  -.0973852   .0083195   -11.71   0.000    -.1137265   -.0810439
              6  |  -.0664894   .0071173    -9.34   0.000    -.0804693   -.0525096
              7  |  -.0462143   .0098421    -4.70   0.000    -.0655463   -.0268823
              8  |  -.0104959   .0144614    -0.73   0.468    -.0389011    .0179094
              9  |  -.0670385   .0110788    -6.05   0.000    -.0887996   -.0452774
             10  |    -.05865   .0099764    -5.88   0.000    -.0782458   -.0390542
             11  |  -.0432788   .0115334    -3.75   0.000    -.0659328   -.0206247
             12  |  -.0153306   .0140477    -1.09   0.276    -.0429232    .0122621
             13  |  -.0650538   .0142617    -4.56   0.000    -.0930667   -.0370409
             14  |  -.0611101   .0124903    -4.89   0.000    -.0856436   -.0365766
             15  |  -.0404133   .0129146    -3.13   0.002    -.0657803   -.0150462
             16  |   .0181201   .0153254     1.18   0.238    -.0119822    .0482223
                 |
            marr |   .0014003   .0024241     0.58   0.564     -.003361    .0061617
           partt |  -.1407219   .0053152   -26.48   0.000    -.1511621   -.1302818
          public |   .0305285   .0083229     3.67   0.000     .0141805    .0468765
            cmsa |   .1323295   .0045535    29.06   0.000     .1233856    .1412735
                 |
           nocc3 |
              2  |  -.2091119   .0042458   -49.25   0.000    -.2174516   -.2007723
              3  |  -.4004959   .0117616   -34.05   0.000     -.423598   -.3773937
              4  |  -.3009544   .0106402   -28.28   0.000    -.3218539   -.2800548
                 |
         quarter |
              2  |   .0103777   .0024109     4.30   0.000     .0056421    .0151133
              3  |   .0173555   .0026886     6.46   0.000     .0120745    .0226364
              4  |   .0234868   .0025387     9.25   0.000     .0185003    .0284733
                 |
           _cons |   .5192885   .0695495     7.47   0.000     .3826788    .6558982
----------------------------------------------------------------------------------
(output written to /Users/amedeusdsouza/econ499/tabs/naive1.tex)
(analytic weights assumed)
(sum of wgt is 3,782,391,106)

Linear regression                               Number of obs     =    474,062
                                                F(103, 560)       =     790.07
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4929
                                                Root MSE          =     .42122

                                (Std. Err. adjusted for 561 clusters in state_ind)
----------------------------------------------------------------------------------
                 |               Robust
          lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       1.covered |   .1593543   .0077931    20.45   0.000     .1440469    .1746617
      1.hisprace |  -.1857613   .0044535   -41.71   0.000    -.1945089   -.1770136
                 |
covered#hisprace |
            1 1  |   .0381246   .0093655     4.07   0.000     .0197288    .0565205
                 |
           state |
             NH  |    .094065   .0204051     4.61   0.000     .0539852    .1341448
             VT  |   .0327361   .0215613     1.52   0.130    -.0096149     .075087
             MA  |    .105824   .0185695     5.70   0.000     .0693497    .1422984
             RI  |   .0179254   .0223265     0.80   0.422    -.0259286    .0617793
             CT  |   .1279038   .0183743     6.96   0.000      .091813    .1639947
             NY  |   .0976078   .0218095     4.48   0.000     .0547694    .1404462
             NJ  |    .166552    .024135     6.90   0.000     .1191458    .2139582
             PA  |    .004315   .0169581     0.25   0.799    -.0289943    .0376243
             OH  |  -.0027556   .0190001    -0.15   0.885    -.0400757    .0345646
             IN  |   .0206768   .0165154     1.25   0.211     -.011763    .0531166
             IL  |   .0874104   .0186777     4.68   0.000     .0507235    .1240973
             MI  |   .0709387   .0209924     3.38   0.001     .0297052    .1121721
             WI  |   .0106987   .0190728     0.56   0.575    -.0267643    .0481617
             MN  |   .0497271   .0198201     2.51   0.012     .0107963    .0886579
             IA  |   -.016377   .0235927    -0.69   0.488     -.062718    .0299639
             MO  |  -.0234083   .0188491    -1.24   0.215    -.0604319    .0136154
             ND  |  -.0637214   .0253982    -2.51   0.012    -.1136087    -.013834
             SD  |  -.0709894   .0225416    -3.15   0.002    -.1152658    -.026713
             NE  |  -.0606253   .0210782    -2.88   0.004    -.1020272   -.0192234
             KS  |  -.0286998   .0191088    -1.50   0.134    -.0662335    .0088338
             DE  |   .0827655   .0221876     3.73   0.000     .0391844    .1263467
             MD  |   .1142413    .018992     6.02   0.000     .0769369    .1515456
             DC  |   .1480124   .0240758     6.15   0.000     .1007226    .1953022
             VA  |   .0875061   .0230615     3.79   0.000     .0422086    .1328036
             WV  |  -.0212153   .0511869    -0.41   0.679     -.121757    .0793264
             NC  |   .0141327   .0193511     0.73   0.465    -.0238769    .0521423
             SC  |  -.0057327   .0209045    -0.27   0.784    -.0467936    .0353281
             GA  |   .0456646   .0229305     1.99   0.047     .0006244    .0907049
             FL  |  -.0299777   .0197413    -1.52   0.129    -.0687538    .0087985
             KY  |  -.0210139   .0210475    -1.00   0.319    -.0623556    .0203278
             TN  |  -.0491803   .0182239    -2.70   0.007    -.0849758   -.0133847
             AL  |  -.0460312   .0166848    -2.76   0.006    -.0788035   -.0132588
             MS  |  -.0606742   .0196481    -3.09   0.002    -.0992671   -.0220812
             AR  |  -.0976242   .0191618    -5.09   0.000     -.135262   -.0599864
             LA  |  -.0042335   .0205736    -0.21   0.837    -.0446444    .0361774
             OK  |  -.0613989   .0201213    -3.05   0.002    -.1009213   -.0218765
             TX  |   .0278568   .0188317     1.48   0.140    -.0091325    .0648462
             MT  |  -.0427579   .0241129    -1.77   0.077    -.0901206    .0046048
             ID  |   .0063041   .0197715     0.32   0.750    -.0325313    .0451395
             WY  |   .0616573   .0550471     1.12   0.263    -.0464666    .1697813
             CO  |   .0389684   .0175535     2.22   0.027     .0044896    .0734472
             NM  |   -.025949   .0310828    -0.83   0.404     -.087002    .0351041
             AZ  |   -.002636   .0173911    -0.15   0.880    -.0367957    .0315237
             UT  |  -.0340089    .020926    -1.63   0.105    -.0751119    .0070942
             NV  |   .0695637   .0287369     2.42   0.016     .0131184     .126009
             WA  |   .0642914   .0190972     3.37   0.001     .0267804    .1018024
             OR  |   .0253861   .0200401     1.27   0.206    -.0139768    .0647489
             CA  |   .1572052   .0180527     8.71   0.000     .1217458    .1926645
             AK  |   .2817408    .037965     7.42   0.000     .2071695     .356312
             HI  |   .1044616   .0369155     2.83   0.005     .0319518    .1769714
                 |
            year |
           1990  |  -.0129737   .0026473    -4.90   0.000    -.0181736   -.0077738
           1991  |  -.0256985   .0030696    -8.37   0.000    -.0317278   -.0196692
           1992  |  -.0275173   .0031761    -8.66   0.000    -.0337559   -.0212787
           1993  |  -.0357583   .0034808   -10.27   0.000    -.0425953   -.0289213
           1996  |  -.0338026    .003725    -9.07   0.000    -.0411193   -.0264859
           1997  |  -.0174652   .0040864    -4.27   0.000    -.0254918   -.0094387
           1998  |   .0069419   .0039457     1.76   0.079    -.0008084    .0146921
           1999  |   .0292737   .0045624     6.42   0.000     .0203121    .0382352
           2000  |   .0390022   .0049275     7.92   0.000     .0293235    .0486809
                 |
            nind |
              2  |   .1722469   .0238341     7.23   0.000     .1254318     .219062
              3  |   .1336478     .02227     6.00   0.000     .0899049    .1773907
              4  |  -.0316699   .0222963    -1.42   0.156    -.0754645    .0121246
              5  |   .1539929   .0231412     6.65   0.000     .1085388     .199447
              6  |   .1673972   .0249376     6.71   0.000     .1184144    .2163799
              7  |   .0242553   .0231624     1.05   0.295    -.0212405    .0697511
              8  |  -.0284601   .0229427    -1.24   0.215    -.0735244    .0166042
              9  |  -.1235032   .0241636    -5.11   0.000    -.1709656   -.0760409
             10  |  -.0977535    .023307    -4.19   0.000    -.1435333   -.0519737
             11  |   .1553341   .0238772     6.51   0.000     .1084343    .2022338
                 |
            educ |   .0660362   .0026428    24.99   0.000     .0608452    .0712271
           exper |   .0515889   .0019476    26.49   0.000     .0477635    .0554143
          exper2 |  -.0012854   .0001174   -10.95   0.000     -.001516   -.0010548
          exper3 |   .0000136   4.02e-06     3.37   0.001     5.67e-06    .0000215
          exper4 |  -4.78e-08   4.48e-08    -1.07   0.287    -1.36e-07    4.03e-08
            edex |  -.0005423    .000085    -6.38   0.000    -.0007093   -.0003754
                 |
           ee_cl |
              2  |  -.0527018   .0065736    -8.02   0.000    -.0656138   -.0397899
              3  |  -.0613179   .0082928    -7.39   0.000    -.0776067    -.045029
              4  |  -.0178333   .0137263    -1.30   0.194    -.0447947     .009128
              5  |  -.1292833   .0075858   -17.04   0.000    -.1441833   -.1143833
              6  |  -.0780387   .0076845   -10.16   0.000    -.0931328   -.0629447
              7  |  -.0524146   .0091936    -5.70   0.000    -.0704728   -.0343563
              8  |   .0484346   .0124595     3.89   0.000     .0239616    .0729076
              9  |  -.1421616   .0105052   -13.53   0.000    -.1627959   -.1215272
             10  |  -.0904702   .0097293    -9.30   0.000    -.1095806   -.0713598
             11  |   -.049708   .0100076    -4.97   0.000     -.069365    -.030051
             12  |   .0647986   .0133882     4.84   0.000     .0385013    .0910959
             13  |  -.0643758   .0142916    -4.50   0.000    -.0924475    -.036304
             14  |  -.0627992   .0122526    -5.13   0.000    -.0868659   -.0387326
             15  |  -.0280569   .0120209    -2.33   0.020    -.0516685   -.0044453
             16  |   .0949674   .0143178     6.63   0.000     .0668442    .1230907
                 |
            marr |   .1209842   .0030904    39.15   0.000      .114914    .1270544
           partt |  -.1942575   .0062201   -31.23   0.000    -.2064752   -.1820398
          public |  -.0553186    .007081    -7.81   0.000    -.0692272   -.0414101
            cmsa |   .1471144   .0050063    29.39   0.000     .1372809    .1569479
                 |
           nocc3 |
              2  |  -.1827552    .006664   -27.42   0.000    -.1958446   -.1696658
              3  |  -.3190177   .0125849   -25.35   0.000    -.3437371   -.2942984
              4  |  -.2354066   .0055503   -42.41   0.000    -.2463085   -.2245048
                 |
         quarter |
              2  |   .0035117   .0024358     1.44   0.150    -.0012728    .0082962
              3  |    .009462   .0023056     4.10   0.000     .0049332    .0139908
              4  |   .0224526     .00231     9.72   0.000     .0179154    .0269899
                 |
           _cons |   .4781995   .0406122    11.77   0.000     .3984287    .5579703
----------------------------------------------------------------------------------
(analytic weights assumed)
(sum of wgt is 3,584,192,790)

Linear regression                               Number of obs     =    465,740
                                                F(103, 560)       =     658.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4799
                                                Root MSE          =     .38178

                                (Std. Err. adjusted for 561 clusters in state_ind)
----------------------------------------------------------------------------------
                 |               Robust
          lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       1.covered |   .1392169   .0066966    20.79   0.000     .1260635    .1523704
      1.hisprace |  -.0974935    .004558   -21.39   0.000    -.1064464   -.0885405
                 |
covered#hisprace |
            1 1  |    .039515   .0096047     4.11   0.000     .0206493    .0583807
                 |
           state |
             NH  |    .061933    .019857     3.12   0.002     .0229297    .1009363
             VT  |   .0279745   .0215572     1.30   0.195    -.0143684    .0703174
             MA  |   .0814344   .0194615     4.18   0.000     .0432079    .1196609
             RI  |  -.0076103   .0249835    -0.30   0.761     -.056683    .0414624
             CT  |   .1067372   .0233541     4.57   0.000     .0608649    .1526095
             NY  |   .0531031   .0209939     2.53   0.012     .0118668    .0943395
             NJ  |   .1127208   .0211331     5.33   0.000      .071211    .1542306
             PA  |  -.0265974   .0193903    -1.37   0.171     -.064684    .0114892
             OH  |  -.0631652    .019521    -3.24   0.001    -.1015085   -.0248218
             IN  |  -.0635879   .0182095    -3.49   0.001     -.099355   -.0278207
             IL  |  -.0013837   .0170472    -0.08   0.935    -.0348679    .0321006
             MI  |   -.012499    .023004    -0.54   0.587    -.0576837    .0326857
             WI  |  -.0338966   .0178928    -1.89   0.059    -.0690419    .0012486
             MN  |   .0228829   .0161659     1.42   0.157    -.0088703    .0546362
             IA  |  -.0697192    .018545    -3.76   0.000    -.1061455   -.0332929
             MO  |  -.0686479   .0169417    -4.05   0.000    -.1019249   -.0353709
             ND  |  -.1330166   .0189942    -7.00   0.000    -.1703252    -.095708
             SD  |  -.1213171    .024483    -4.96   0.000    -.1694069   -.0732273
             NE  |  -.1186264   .0204985    -5.79   0.000    -.1588896   -.0783631
             KS  |  -.0927511   .0182287    -5.09   0.000    -.1285561   -.0569462
             DE  |   .0638747   .0213969     2.99   0.003     .0218468    .1059026
             MD  |   .0569774   .0200739     2.84   0.005     .0175482    .0964067
             DC  |    .120523   .0232656     5.18   0.000     .0748246    .1662215
             VA  |   .0075995   .0244306     0.31   0.756    -.0403873    .0555863
             WV  |  -.1246636   .0289251    -4.31   0.000    -.1814786   -.0678486
             NC  |  -.0450068   .0162064    -2.78   0.006    -.0768396    -.013174
             SC  |  -.0860772    .018483    -4.66   0.000    -.1223817   -.0497727
             GA  |  -.0195022   .0180153    -1.08   0.279    -.0548881    .0158837
             FL  |  -.0606416   .0180731    -3.36   0.001     -.096141   -.0251423
             KY  |  -.0873191   .0171414    -5.09   0.000    -.1209884   -.0536498
             TN  |  -.1070625   .0168962    -6.34   0.000    -.1402501   -.0738748
             AL  |  -.1283381   .0179023    -7.17   0.000     -.163502   -.0931742
             MS  |  -.1411341   .0206346    -6.84   0.000    -.1816649   -.1006034
             AR  |  -.1427879   .0199865    -7.14   0.000    -.1820456   -.1035303
             LA  |  -.1235179   .0176326    -7.01   0.000    -.1581521   -.0888837
             OK  |  -.1360024   .0208039    -6.54   0.000    -.1768657   -.0951391
             TX  |  -.0489841     .02155    -2.27   0.023    -.0913127   -.0066555
             MT  |  -.1014307   .0195148    -5.20   0.000    -.1397619   -.0630996
             ID  |  -.0587282   .0193564    -3.03   0.003    -.0967481   -.0207082
             WY  |  -.0907638   .0236882    -3.83   0.000    -.1372925   -.0442352
             CO  |  -.0194647   .0186027    -1.05   0.296    -.0560043     .017075
             NM  |  -.1167173   .0229282    -5.09   0.000    -.1617531   -.0716816
             AZ  |  -.0365599   .0186727    -1.96   0.051    -.0732369    .0001172
             UT  |  -.0919471   .0195659    -4.70   0.000    -.1303786   -.0535156
             NV  |   .0167378   .0284242     0.59   0.556    -.0390932    .0725689
             WA  |   .0191176   .0175753     1.09   0.277    -.0154039    .0536391
             OR  |  -.0220553   .0211808    -1.04   0.298    -.0636588    .0195482
             CA  |   .1047811   .0164243     6.38   0.000     .0725203    .1370419
             AK  |   .1923608   .0213911     8.99   0.000     .1503443    .2343773
             HI  |   .0592002    .027815     2.13   0.034     .0045657    .1138348
                 |
            year |
           1990  |  -.0062985   .0024725    -2.55   0.011     -.011155    -.001442
           1991  |  -.0021881   .0027108    -0.81   0.420    -.0075128    .0031365
           1992  |    .011366   .0030964     3.67   0.000      .005284     .017448
           1993  |   .0089743   .0030878     2.91   0.004     .0029093    .0150393
           1996  |   .0004531   .0033344     0.14   0.892    -.0060965    .0070026
           1997  |   .0136119     .00351     3.88   0.000     .0067174    .0205064
           1998  |   .0437278   .0034003    12.86   0.000     .0370488    .0504068
           1999  |   .0611835   .0035793    17.09   0.000      .054153    .0682139
           2000  |   .0745093   .0041187    18.09   0.000     .0664193    .0825993
                 |
            nind |
              2  |   .1089139   .0317183     3.43   0.001     .0466125    .1712153
              3  |   .1440016   .0308768     4.66   0.000     .0833532      .20465
              4  |  -.0690032   .0311459    -2.22   0.027    -.1301803   -.0078261
              5  |   .2116748   .0317253     6.67   0.000     .1493596    .2739899
              6  |   .1328395   .0317577     4.18   0.000     .0704607    .1952184
              7  |   .0683229   .0318327     2.15   0.032     .0057969     .130849
              8  |   .0461657   .0314344     1.47   0.142    -.0155781    .1079094
              9  |  -.1172177    .031899    -3.67   0.000     -.179874   -.0545613
             10  |  -.0805626    .031384    -2.57   0.011    -.1422074   -.0189178
             11  |   .1039009   .0333028     3.12   0.002     .0384874    .1693145
                 |
            educ |   .0793846   .0026401    30.07   0.000      .074199    .0845703
           exper |   .0552638   .0021608    25.58   0.000     .0510195    .0595081
          exper2 |  -.0019849   .0001158   -17.14   0.000    -.0022123   -.0017575
          exper3 |    .000036   3.81e-06     9.43   0.000     .0000285    .0000434
          exper4 |  -2.40e-07   4.14e-08    -5.81   0.000    -3.21e-07   -1.59e-07
            edex |  -.0007344   .0000897    -8.19   0.000    -.0009106   -.0005582
                 |
           ee_cl |
              2  |  -.1023168   .0063871   -16.02   0.000    -.1148624   -.0897712
              3  |  -.1225021   .0098157   -12.48   0.000    -.1417822   -.1032219
              4  |  -.1083391   .0168194    -6.44   0.000    -.1413759   -.0753022
              5  |  -.1564052   .0094104   -16.62   0.000    -.1748893   -.1379212
              6  |  -.1401178   .0080542   -17.40   0.000     -.155938   -.1242975
              7  |   -.118115   .0100088   -11.80   0.000    -.1377744   -.0984556
              8  |  -.0617136   .0177425    -3.48   0.001    -.0965637   -.0268636
              9  |  -.1453071   .0123152   -11.80   0.000    -.1694966   -.1211175
             10  |   -.140306   .0095267   -14.73   0.000    -.1590184   -.1215935
             11  |  -.1082975   .0118316    -9.15   0.000    -.1315373   -.0850577
             12  |  -.0735825    .016465    -4.47   0.000    -.1059232   -.0412417
             13  |   -.105006   .0141696    -7.41   0.000    -.1328381   -.0771738
             14  |  -.1277457    .011374   -11.23   0.000    -.1500866   -.1054048
             15  |  -.0880953   .0127828    -6.89   0.000    -.1132035   -.0629871
             16  |  -.0686781   .0155957    -4.40   0.000    -.0993114   -.0380448
                 |
            marr |   .0186686   .0020464     9.12   0.000      .014649    .0226881
           partt |   -.119217   .0059617   -20.00   0.000    -.1309271   -.1075068
          public |   .0325192   .0074404     4.37   0.000     .0179046    .0471337
            cmsa |   .1526624   .0043138    35.39   0.000     .1441891    .1611356
                 |
           nocc3 |
              2  |   -.228059   .0032939   -69.24   0.000    -.2345289    -.221589
              3  |  -.3333173   .0072917   -45.71   0.000    -.3476399   -.3189948
              4  |  -.3065435   .0076804   -39.91   0.000    -.3216295   -.2914575
                 |
         quarter |
              2  |   .0109433   .0020507     5.34   0.000     .0069152    .0149714
              3  |   .0224085   .0020053    11.17   0.000     .0184697    .0263472
              4  |   .0281262   .0018909    14.87   0.000      .024412    .0318403
                 |
           _cons |   .3263682   .0475342     6.87   0.000     .2330011    .4197352
----------------------------------------------------------------------------------
(output written to /Users/amedeusdsouza/econ499/tabs/naive2.tex)
(analytic weights assumed)
(sum of wgt is 5,427,445,659)

Linear regression                               Number of obs     =    594,117
                                                F(112, 560)       =    1105.20
                                                Prob > F          =     0.0000
                                                R-squared         =     0.5098
                                                Root MSE          =     .41866

                                (Std. Err. adjusted for 561 clusters in state_ind)
----------------------------------------------------------------------------------
                 |               Robust
          lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       1.covered |   .1503468   .0084762    17.74   0.000     .1336977    .1669959
      1.hisprace |   -.183459   .0037828   -48.50   0.000    -.1908892   -.1760288
                 |
covered#hisprace |
            1 1  |   .0395227    .008226     4.80   0.000     .0233652    .0556802
                 |
           state |
             NH  |   .1034776   .0172942     5.98   0.000     .0695082    .1374471
             VT  |   .0379009    .018776     2.02   0.044      .001021    .0747808
             MA  |   .1332984   .0199226     6.69   0.000     .0941662    .1724307
             RI  |   .0336267   .0197108     1.71   0.089    -.0050894    .0723427
             CT  |    .137303   .0159065     8.63   0.000     .1060593    .1685467
             NY  |   .0727815   .0232202     3.13   0.002     .0271722    .1183909
             NJ  |   .1695324   .0184635     9.18   0.000     .1332661    .2057986
             PA  |   .0090304   .0171606     0.53   0.599    -.0246765    .0427374
             OH  |  -.0343602    .016642    -2.06   0.039    -.0670485   -.0016719
             IN  |  -.0137215    .016805    -0.82   0.415    -.0467299     .019287
             IL  |   .0656994   .0179068     3.67   0.000     .0305266    .1008721
             MI  |  -.0041771    .019033    -0.22   0.826    -.0415619    .0332077
             WI  |   .0179117   .0180483     0.99   0.321     -.017539    .0533624
             MN  |   .0727301   .0189644     3.84   0.000       .03548    .1099802
             IA  |  -.0108016   .0208402    -0.52   0.604     -.051736    .0301329
             MO  |  -.0160203   .0185708    -0.86   0.389    -.0524971    .0204566
             ND  |   .0518607   .0304552     1.70   0.089    -.0079596     .111681
             SD  |  -.0451269    .022787    -1.98   0.048    -.0898854   -.0003684
             NE  |  -.0429996   .0210388    -2.04   0.041    -.0843243    -.001675
             KS  |  -.0267354   .0165045    -1.62   0.106    -.0591536    .0056829
             DE  |   .0401064   .0256028     1.57   0.118    -.0101828    .0903955
             MD  |   .1567492   .0243491     6.44   0.000     .1089225    .2045759
             DC  |    .196585   .0221523     8.87   0.000     .1530733    .2400967
             VA  |   .1232439   .0329837     3.74   0.000      .058457    .1880308
             WV  |  -.0565448   .0401581    -1.41   0.160    -.1354238    .0223341
             NC  |  -.0190378   .0174564    -1.09   0.276    -.0533259    .0152503
             SC  |  -.0371141   .0220406    -1.68   0.093    -.0804064    .0061782
             GA  |   .0327327   .0206574     1.58   0.114    -.0078427    .0733082
             FL  |  -.0366519   .0172904    -2.12   0.034    -.0706138     -.00269
             KY  |  -.0512091   .0178694    -2.87   0.004    -.0863084   -.0161098
             TN  |  -.0602845   .0163092    -3.70   0.000    -.0923191   -.0282499
             AL  |  -.0232077   .0178854    -1.30   0.195    -.0583383     .011923
             MS  |  -.0424751   .0186308    -2.28   0.023    -.0790699   -.0058804
             AR  |  -.0962333   .0222359    -4.33   0.000    -.1399091   -.0525574
             LA  |   .0045243   .0233798     0.19   0.847    -.0413984    .0504471
             OK  |  -.0584915   .0196454    -2.98   0.003    -.0970793   -.0199038
             TX  |   .0468036   .0176626     2.65   0.008     .0121106    .0814966
             MT  |  -.0220547   .0237156    -0.93   0.353    -.0686371    .0245277
             ID  |  -.0387485   .0171732    -2.26   0.024    -.0724802   -.0050168
             WY  |   .1667351     .05264     3.17   0.002     .0633391    .2701311
             CO  |    .053353   .0173494     3.08   0.002     .0192752    .0874307
             NM  |   -.006717   .0284702    -0.24   0.814    -.0626385    .0492045
             AZ  |   .0171294    .017726     0.97   0.334    -.0176882    .0519469
             UT  |  -.0121284   .0176084    -0.69   0.491     -.046715    .0224582
             NV  |    .068665   .0247375     2.78   0.006     .0200753    .1172547
             WA  |   .1113978   .0189268     5.89   0.000     .0742215    .1485741
             OR  |   .0175817   .0192629     0.91   0.362    -.0202546     .055418
             CA  |   .1581346   .0157301    10.05   0.000     .1272374    .1890317
             AK  |   .1967207     .02993     6.57   0.000      .137932    .2555094
             HI  |   .1205698   .0295446     4.08   0.000     .0625381    .1786015
                 |
            year |
           2002  |   .0054327   .0038574     1.41   0.160     -.002144    .0130093
           2003  |  -.0067153   .0037348    -1.80   0.073    -.0140512    .0006206
           2004  |  -.0138264   .0039834    -3.47   0.001    -.0216505   -.0060022
           2005  |  -.0262596   .0042875    -6.12   0.000    -.0346811   -.0178381
           2006  |  -.0292727   .0045315    -6.46   0.000    -.0381735    -.020372
           2007  |  -.0289596   .0043169    -6.71   0.000    -.0374389   -.0204803
           2008  |  -.0361952   .0048691    -7.43   0.000    -.0457592   -.0266312
           2009  |  -.0220651   .0048217    -4.58   0.000    -.0315358   -.0125943
           2010  |  -.0312498   .0050583    -6.18   0.000    -.0411853   -.0213142
           2011  |  -.0534031   .0046923   -11.38   0.000    -.0626198   -.0441863
           2012  |  -.0559684   .0047392   -11.81   0.000    -.0652772   -.0466596
           2013  |  -.0610235   .0048617   -12.55   0.000    -.0705728   -.0514741
           2014  |  -.0618005   .0050891   -12.14   0.000    -.0717965   -.0518044
           2015  |  -.0418862   .0046326    -9.04   0.000    -.0509855   -.0327869
           2016  |  -.0271919   .0047797    -5.69   0.000    -.0365802   -.0178037
           2017  |  -.0234067   .0053666    -4.36   0.000    -.0339478   -.0128655
           2018  |  -.0140696   .0048215    -2.92   0.004    -.0235401   -.0045992
           2019  |   .0069906   .0048373     1.45   0.149    -.0025108     .016492
                 |
            nind |
              2  |    .072355   .0246428     2.94   0.003     .0239513    .1207586
              3  |   .0371013   .0239565     1.55   0.122    -.0099543    .0841568
              4  |  -.1319152   .0238145    -5.54   0.000    -.1786919   -.0851386
              5  |   .0332414   .0239762     1.39   0.166    -.0138528    .0803356
              6  |   .0746863   .0255609     2.92   0.004     .0244794    .1248933
              7  |  -.0376146   .0243785    -1.54   0.123    -.0854991    .0102699
              8  |  -.1271874   .0246465    -5.16   0.000    -.1755982   -.0787766
              9  |   -.274328   .0252386   -10.87   0.000     -.323902   -.2247541
             10  |  -.1572479   .0244134    -6.44   0.000    -.2052009   -.1092949
             11  |   .0601052    .026145     2.30   0.022     .0087509    .1114594
                 |
            educ |   .0738979   .0022635    32.65   0.000      .069452    .0783439
           exper |   .0419548   .0021105    19.88   0.000     .0378092    .0461003
          exper2 |   -.000644   .0001291    -4.99   0.000    -.0008976   -.0003904
          exper3 |  -3.96e-06   4.21e-06    -0.94   0.347    -.0000122    4.31e-06
          exper4 |   1.21e-07   4.56e-08     2.66   0.008     3.19e-08    2.11e-07
            edex |  -.0004985    .000093    -5.36   0.000    -.0006812   -.0003159
                 |
           ee_cl |
              2  |  -.0754186   .0064435   -11.70   0.000    -.0880749   -.0627623
              3  |  -.0862943   .0084398   -10.22   0.000    -.1028718   -.0697168
              4  |  -.0652816   .0139342    -4.69   0.000    -.0926513    -.037912
              5  |  -.1404897   .0100056   -14.04   0.000    -.1601427   -.1208366
              6  |  -.1140329   .0084882   -13.43   0.000    -.1307055   -.0973602
              7  |  -.0873681   .0100028    -8.73   0.000    -.1070157   -.0677204
              8  |  -.0032292   .0142242    -0.23   0.820    -.0311685    .0247101
              9  |  -.1814748   .0119909   -15.13   0.000    -.2050273   -.1579222
             10  |  -.1293118   .0100595   -12.85   0.000    -.1490709   -.1095528
             11  |  -.0816415   .0108812    -7.50   0.000    -.1030146   -.0602685
             12  |  -.0074547   .0142902    -0.52   0.602    -.0355236    .0206142
             13  |  -.1487617   .0167624    -8.87   0.000    -.1816865   -.1158369
             14  |   -.113636   .0118941    -9.55   0.000    -.1369984   -.0902735
             15  |  -.0766015   .0117834    -6.50   0.000    -.0997465   -.0534565
             16  |  -.0180053   .0145418    -1.24   0.216    -.0465685    .0105579
                 |
            marr |   .1317995    .002714    48.56   0.000     .1264686    .1371304
           partt |  -.2255073   .0055537   -40.61   0.000    -.2364158   -.2145987
          public |  -.0379136   .0059262    -6.40   0.000    -.0495539   -.0262733
            cmsa |   .1420706   .0047452    29.94   0.000     .1327499    .1513912
                 |
           nocc3 |
              2  |  -.2160482   .0052485   -41.16   0.000    -.2263574   -.2057389
              3  |  -.2959594   .0100049   -29.58   0.000    -.3156111   -.2763077
              4  |  -.2492087    .005655   -44.07   0.000    -.2603164   -.2381011
                 |
         quarter |
              2  |   .0038084   .0019156     1.99   0.047     .0000459     .007571
              3  |   .0022568   .0021684     1.04   0.298    -.0020025     .006516
              4  |   .0097149   .0020286     4.79   0.000     .0057304    .0136994
                 |
           _cons |   .6126415   .0367255    16.68   0.000      .540505     .684778
----------------------------------------------------------------------------------
(analytic weights assumed)
(sum of wgt is 5,428,488,651)

Linear regression                               Number of obs     =    613,343
                                                F(112, 560)       =     658.05
                                                Prob > F          =     0.0000
                                                R-squared         =     0.4865
                                                Root MSE          =     .40764

                                (Std. Err. adjusted for 561 clusters in state_ind)
----------------------------------------------------------------------------------
                 |               Robust
          lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
       1.covered |   .1002176   .0077765    12.89   0.000     .0849429    .1154924
      1.hisprace |  -.1132728   .0047922   -23.64   0.000    -.1226857   -.1038598
                 |
covered#hisprace |
            1 1  |   .0545018   .0092277     5.91   0.000     .0363765     .072627
                 |
           state |
             NH  |   .0645689   .0146135     4.42   0.000     .0358649    .0932729
             VT  |   .0467842    .015286     3.06   0.002     .0167594    .0768091
             MA  |    .118391     .01358     8.72   0.000     .0917169     .145065
             RI  |   .0370148   .0205287     1.80   0.072    -.0033078    .0773375
             CT  |   .1107255   .0132394     8.36   0.000     .0847206    .1367304
             NY  |   .0540948   .0234245     2.31   0.021     .0080843    .1001054
             NJ  |   .1344903   .0245904     5.47   0.000     .0861896     .182791
             PA  |  -.0315025   .0137814    -2.29   0.023    -.0585719    -.004433
             OH  |  -.0558128   .0129721    -4.30   0.000    -.0812926   -.0303329
             IN  |   -.067368   .0126602    -5.32   0.000    -.0922352   -.0425008
             IL  |   .0099335   .0122936     0.81   0.419    -.0142137    .0340807
             MI  |  -.0344188   .0176428    -1.95   0.052     -.069073    .0002353
             WI  |  -.0034423     .01473    -0.23   0.815    -.0323752    .0254905
             MN  |    .056679   .0146389     3.87   0.000      .027925    .0854329
             IA  |  -.0506609   .0139656    -3.63   0.000    -.0780922   -.0232296
             MO  |  -.0766547   .0128049    -5.99   0.000    -.1018062   -.0515031
             ND  |  -.0410478   .0197545    -2.08   0.038    -.0798496   -.0022459
             SD  |  -.0798001   .0225141    -3.54   0.000    -.1240226   -.0355777
             NE  |  -.0747198   .0203119    -3.68   0.000    -.1146165   -.0348231
             KS  |  -.0776609   .0150682    -5.15   0.000    -.1072581   -.0480638
             DE  |   .0324965    .018868     1.72   0.086    -.0045641    .0695572
             MD  |   .1413222   .0255832     5.52   0.000     .0910715    .1915729
             DC  |   .1920139   .0221687     8.66   0.000       .14847    .2355578
             VA  |   .0558278    .029955     1.86   0.063      -.00301    .1146655
             WV  |   -.154754   .0175369    -8.82   0.000    -.1892002   -.1203078
             NC  |   -.058464   .0105725    -5.53   0.000    -.0792306   -.0376973
             SC  |  -.0946449   .0121727    -7.78   0.000    -.1185545   -.0707352
             GA  |  -.0277453   .0130459    -2.13   0.034    -.0533702   -.0021204
             FL  |  -.0568393   .0114632    -4.96   0.000    -.0793554   -.0343232
             KY  |  -.0807078    .014278    -5.65   0.000    -.1087528   -.0526629
             TN  |  -.0902828   .0115835    -7.79   0.000    -.1130352   -.0675304
             AL  |  -.1107561   .0114098    -9.71   0.000    -.1331673   -.0883449
             MS  |  -.1277775    .013385    -9.55   0.000    -.1540684   -.1014867
             AR  |  -.1298865   .0132817    -9.78   0.000    -.1559745   -.1037985
             LA  |  -.1159921   .0112949   -10.27   0.000    -.1381776   -.0938066
             OK  |  -.1504588   .0162952    -9.23   0.000    -.1824659   -.1184517
             TX  |  -.0130234   .0161101    -0.81   0.419     -.044667    .0186202
             MT  |  -.0589555   .0183239    -3.22   0.001    -.0949475   -.0229635
             ID  |  -.0663031   .0193204    -3.43   0.001    -.1042524   -.0283537
             WY  |   .0151513    .023475     0.65   0.519    -.0309586    .0612612
             CO  |   .0186348   .0202062     0.92   0.357    -.0210545     .058324
             NM  |  -.0641497   .0219307    -2.93   0.004    -.1072261   -.0210733
             AZ  |   -.003954   .0172793    -0.23   0.819    -.0378941    .0299861
             UT  |  -.0589667   .0128072    -4.60   0.000    -.0841227   -.0338107
             NV  |   .0409567   .0185267     2.21   0.027     .0045664     .077347
             WA  |   .0745497    .015222     4.90   0.000     .0446506    .1044488
             OR  |  -.0014307   .0183496    -0.08   0.938    -.0374732    .0346118
             CA  |   .1375608   .0112154    12.27   0.000     .1155313    .1595903
             AK  |   .1573538   .0180585     8.71   0.000      .121883    .1928245
             HI  |    .075088   .0388962     1.93   0.054    -.0013122    .1514883
                 |
            year |
           2002  |     .01308   .0033667     3.89   0.000     .0064671    .0196928
           2003  |   .0151678   .0035941     4.22   0.000     .0081083    .0222274
           2004  |   .0064138   .0039617     1.62   0.106    -.0013678    .0141954
           2005  |  -.0030483    .003874    -0.79   0.432    -.0106578    .0045611
           2006  |  -.0074494   .0043213    -1.72   0.085    -.0159374    .0010387
           2007  |  -.0069508   .0040403    -1.72   0.086    -.0148867    .0009851
           2008  |  -.0150062   .0043108    -3.48   0.001    -.0234734   -.0065389
           2009  |    .001758   .0043063     0.41   0.683    -.0067006    .0102165
           2010  |  -.0010714   .0043638    -0.25   0.806    -.0096428    .0074999
           2011  |  -.0202498   .0045291    -4.47   0.000     -.029146   -.0113536
           2012  |  -.0370868   .0045324    -8.18   0.000    -.0459893   -.0281842
           2013  |  -.0363678   .0045869    -7.93   0.000    -.0453773   -.0273582
           2014  |  -.0404327   .0047255    -8.56   0.000    -.0497147   -.0311508
           2015  |  -.0250526   .0043989    -5.70   0.000     -.033693   -.0164122
           2016  |  -.0135558   .0043483    -3.12   0.002    -.0220969   -.0050148
           2017  |  -.0041084   .0045181    -0.91   0.364    -.0129829     .004766
           2018  |   .0001543   .0046694     0.03   0.974    -.0090174    .0093259
           2019  |   .0118321   .0047539     2.49   0.013     .0024944    .0211697
                 |
            nind |
              2  |   .0463235   .0505846     0.92   0.360    -.0530351    .1456822
              3  |   .0820563   .0500168     1.64   0.101    -.0161872    .1802999
              4  |  -.1430816   .0502526    -2.85   0.005    -.2417881    -.044375
              5  |   .0612912   .0504677     1.21   0.225     -.037838    .1604204
              6  |   .0661173   .0506393     1.31   0.192     -.033349    .1655836
              7  |  -.0244806   .0506755    -0.48   0.629    -.1240178    .0750566
              8  |  -.0454911   .0505153    -0.90   0.368    -.1447137    .0537315
              9  |   -.251929    .050807    -4.96   0.000    -.3517245   -.1521335
             10  |  -.1276904   .0506159    -2.52   0.012    -.2271106   -.0282702
             11  |   .0534534   .0523101     1.02   0.307    -.0492945    .1562014
                 |
            educ |   .1020845   .0031927    31.97   0.000     .0958133    .1083557
           exper |    .046812   .0021395    21.88   0.000     .0426095    .0510145
          exper2 |  -.0013363   .0001202   -11.12   0.000    -.0015724   -.0011002
          exper3 |   .0000176   4.01e-06     4.39   0.000     9.75e-06    .0000255
          exper4 |  -6.58e-08   4.37e-08    -1.51   0.133    -1.52e-07    2.00e-08
            edex |  -.0006019   .0001001    -6.01   0.000    -.0007986   -.0004052
                 |
           ee_cl |
              2  |  -.1479129   .0072965   -20.27   0.000    -.1622448   -.1335809
              3  |  -.1826917   .0101804   -17.95   0.000     -.202688   -.1626954
              4  |  -.2248933   .0185152   -12.15   0.000     -.261261   -.1885256
              5  |  -.1619911   .0106749   -15.17   0.000    -.1829588   -.1410234
              6  |  -.2031494   .0105506   -19.25   0.000     -.223873   -.1824258
              7  |   -.205468   .0123936   -16.58   0.000    -.2298117   -.1811244
              8  |  -.1627188   .0207212    -7.85   0.000    -.2034195   -.1220181
              9  |  -.1934535   .0144107   -13.42   0.000    -.2217591   -.1651479
             10  |  -.2099089   .0125502   -16.73   0.000      -.23456   -.1852577
             11  |  -.1963956   .0137292   -14.30   0.000    -.2233627   -.1694286
             12  |  -.1732151   .0193836    -8.94   0.000    -.2112886   -.1351416
             13  |  -.1523741   .0174506    -8.73   0.000    -.1866509   -.1180974
             14  |  -.1801376   .0136187   -13.23   0.000    -.2068876   -.1533877
             15  |  -.1609988   .0143523   -11.22   0.000    -.1891898   -.1328079
             16  |  -.1639219   .0184475    -8.89   0.000    -.2001567   -.1276872
                 |
            marr |   .0441954   .0023089    19.14   0.000     .0396602    .0487306
           partt |  -.1425893   .0073143   -19.49   0.000    -.1569562   -.1282225
          public |  -.0115182   .0082872    -1.39   0.165     -.027796    .0047595
            cmsa |    .154995   .0044159    35.10   0.000     .1463213    .1636687
                 |
           nocc3 |
              2  |  -.2310893   .0053486   -43.21   0.000    -.2415951   -.2205835
              3  |  -.2938342   .0098494   -29.83   0.000    -.3131805    -.274488
              4  |  -.2868658   .0095189   -30.14   0.000    -.3055628   -.2681687
                 |
         quarter |
              2  |   .0079365   .0017087     4.64   0.000     .0045801    .0112928
              3  |    .015726   .0019319     8.14   0.000     .0119313    .0195207
              4  |   .0166971   .0018899     8.83   0.000     .0129849    .0204094
                 |
           _cons |    .245084   .0619849     3.95   0.000     .1233328    .3668353
----------------------------------------------------------------------------------
(output written to /Users/amedeusdsouza/econ499/tabs/naive3.tex)

. 
. panelcombine, use($tabs/naive1.tex $tabs/naive2.tex $tabs/naive3.tex) paneltitles("1983-1988" 
> "1988-2000" "2000-2019") columncount(3) save($tabs/naive.tex)

. 
. log close
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/linreg2.log
  log type:  text
 closed on:   8 Mar 2021, 12:58:46
------------------------------------------------------------------------------------------------
