--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/morediagnostics.log
  log type:  text
 opened on:  16 Mar 2021, 19:16:21

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** FIXME - decide why (current from diagnostics)
. keep if inrange(year, 2000, 2019)
(2,700,182 observations deleted)

. 
. ** keep if inrange(year, 1989, 2019)
. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt pu
> blic marr hisprace hispracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unem
> p.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                        12,852
        from master                         0  (_merge==1)
        from using                     12,852  (_merge==2)

    matched                         1,987,235  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(12,852 observations deleted)

. 
. drop if hispracesex ==.
(147,105 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(1480483 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(1688516 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(231,432 real changes made, 231,432 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(156,966 real changes made, 156,966 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(231,432 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effectiv
> e; signed Dec2012) Mar1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72
> , 82) //incl Idaho which changed in 1985 and Texas which had since 47 but bolstered in 93
(710,782 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57
> , 87, 47, 83, 72, 82)
(710,782 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(187,099 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57
> , 87, 47, 83, 72, 82)
(710,782 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(187,099 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(710,782 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(710,782 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change t
> o treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(231,432 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(156,966 missing values generated)

. 
. sum lwage3 if female == 0, detail

         log trimmed imputed real wage 1-100 in 1979
                           dollars
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .6575367        .000176
 5%     .9278869       .0003089
10%     1.077947       .0004364       Obs             919,463
25%      1.39782       .0005519       Sum of Wgt.     919,463

50%     1.816401                      Mean           1.837923
                        Largest       Std. Dev.      .5910927
75%      2.24833       6.599997
90%     2.636415       6.693619       Variance       .3493906
95%     2.843984       6.837574       Skewness       .2057172
99%     3.126722       7.890163       Kurtosis       2.892216

. 
. scalar mquantwage50 = r(p50)

. 
. gen mindic_greatermed =.
(1,840,130 missing values generated)

.         replace mindic_greatermed = 1 if lwage3 >  mquantwage50 & female == 0
(459,489 real changes made)

.         replace mindic_greatermed = 0 if lwage3 <= mquantwage50 & female == 0
(459,974 real changes made)

.        
. gen blackmindic_greatermed = blackrelwhite*mindic_greatermed
(1,048,697 missing values generated)

. 
. gen treat_stmindic_greatermed = treat_st*mindic_greatermed
(920,667 missing values generated)

.  
. gen treat_stblackmindic_greatermed = treat_stblackrelwhite*mindic_greatermed
(1,048,697 missing values generated)

. 
. sum lwage3 if female == 1, detail

         log trimmed imputed real wage 1-100 in 1979
                           dollars
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .5475511        .000176
 5%     .8575503       .0002989
10%     .9768265       .0003089       Obs             920,667
25%     1.227358       .0003089       Sum of Wgt.     920,667

50%     1.606492                      Mean           1.650375
                        Largest       Std. Dev.      .5569138
75%     2.024022       6.366298
90%     2.405146       6.466865       Variance        .310153
95%     2.631679       6.499778       Skewness       .3882542
99%     3.030456       6.995843       Kurtosis       3.073611

. 
. scalar fquantwage50 = r(p50)

. 
. gen findic_greatermed =.
(1,840,130 missing values generated)

.         replace findic_greatermed = 1 if lwage3 >  fquantwage50 & female == 1
(460,146 real changes made)

.         replace findic_greatermed = 0 if lwage3 <= fquantwage50 & female == 1 
(460,521 real changes made)

.        
. gen blackfindic_greatermed = blackrelwhite*findic_greatermed
(1,022,865 missing values generated)

. 
. gen treat_stfindic_greatermed = treat_st*findic_greatermed
(919,463 missing values generated)

. 
. gen treat_stblackfindic_greatermed = treat_stblackrelwhite*findic_greatermed
(1,022,865 missing values generated)

. 
. reg lwage3 blackrelwhite treat_st mindic_greatermed treat_stblackrelwhite blackmindic_greatermed treat_stmin
> dic_greatermed treat_stblackmindic_greatermed i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.e
> e_cl marr partt  public cmsa i.nocc3 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,739,708,710)

Linear regression                               Number of obs     =    628,445
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7380
                                                Root MSE          =     .30622

                                                   (Std. Err. adjusted for 51 clusters in state)
------------------------------------------------------------------------------------------------
                               |               Robust
                        lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
                 blackrelwhite |  -.0722614   .0070007   -10.32   0.000    -.0863228      -.0582
                      treat_st |  -.0097946   .0116158    -0.84   0.403    -.0331257    .0135365
             mindic_greatermed |   .7366243   .0166818    44.16   0.000      .703118    .7701306
         treat_stblackrelwhite |   .0012029   .0079205     0.15   0.880    -.0147059    .0171117
        blackmindic_greatermed |  -.0061261   .0111188    -0.55   0.584     -.028459    .0162068
     treat_stmindic_greatermed |  -.0061358   .0208854    -0.29   0.770    -.0480854    .0358138
treat_stblackmindic_greatermed |  -.0161617   .0140472    -1.15   0.255    -.0443764     .012053
                               |
                         state |
                           NH  |   .0418433   .0040223    10.40   0.000     .0337642    .0499224
                           VT  |    .019624   .0009439    20.79   0.000     .0177281      .02152
                           MA  |   .0665899   .0070169     9.49   0.000     .0524959    .0806838
                           RI  |   .0133964   .0055973     2.39   0.020      .002154    .0246389
                           CT  |    .056994   .0072813     7.83   0.000     .0423691     .071619
                           NY  |   .0447314   .0057589     7.77   0.000     .0331643    .0562984
                           NJ  |   .0927982   .0074775    12.41   0.000     .0777792    .1078173
                           PA  |   .0016337   .0040888     0.40   0.691    -.0065789    .0098463
                           OH  |   -.020589   .0033825    -6.09   0.000     -.027383    -.013795
                           IN  |  -.0089272   .0035545    -2.51   0.015    -.0160666   -.0017877
                           IL  |    .034136   .0053443     6.39   0.000     .0234017    .0448703
                           MI  |    .002631   .0048066     0.55   0.587    -.0070233    .0122854
                           WI  |  -.0029532   .0035434    -0.83   0.409    -.0100703     .004164
                           MN  |   .0259624   .0049406     5.25   0.000     .0160389    .0358859
                           IA  |   .0031781   .0051937     0.61   0.543    -.0072537    .0136099
                           MO  |  -.0140148    .003546    -3.95   0.000    -.0211371   -.0068925
                           ND  |   .0137058   .0049132     2.79   0.007     .0038374    .0235742
                           SD  |  -.0020297   .0048864    -0.42   0.680    -.0118443    .0077849
                           NE  |  -.0104913   .0055357    -1.90   0.064      -.02161    .0006275
                           KS  |  -.0048687    .006043    -0.81   0.424    -.0170064    .0072691
                           DE  |   .0183029   .0008305    22.04   0.000     .0166347     .019971
                           MD  |   .0760316   .0070013    10.86   0.000     .0619692    .0900941
                           DC  |   .1123956   .0092125    12.20   0.000     .0938917    .1308994
                           VA  |   .0699075   .0074059     9.44   0.000     .0550323    .0847827
                           WV  |  -.0369698    .002065   -17.90   0.000    -.0411174   -.0328222
                           NC  |   .0027388   .0069745     0.39   0.696    -.0112699    .0167474
                           SC  |  -.0089885   .0069407    -1.30   0.201    -.0229293    .0049522
                           GA  |   .0198202   .0071585     2.77   0.008      .005442    .0341985
                           FL  |  -.0038465   .0074137    -0.52   0.606    -.0187374    .0110445
                           KY  |  -.0213874   .0025483    -8.39   0.000    -.0265058   -.0162691
                           TN  |  -.0164436   .0066903    -2.46   0.017    -.0298814   -.0030058
                           AL  |  -.0069906   .0066609    -1.05   0.299    -.0203694    .0063882
                           MS  |   -.011281   .0071226    -1.58   0.120    -.0255871    .0030251
                           AR  |  -.0300848   .0064735    -4.65   0.000    -.0430873   -.0170824
                           LA  |   .0001118   .0072694     0.02   0.988    -.0144893    .0147128
                           OK  |  -.0247981   .0059646    -4.16   0.000    -.0367783   -.0128179
                           TX  |   .0321752   .0074054     4.34   0.000      .017301    .0470495
                           MT  |  -.0204255   .0005183   -39.41   0.000    -.0214665   -.0193845
                           ID  |  -.0137631    .005986    -2.30   0.026    -.0257863   -.0017399
                           WY  |   .0514557   .0063634     8.09   0.000     .0386744     .064237
                           CO  |   .0176186   .0060183     2.93   0.005     .0055305    .0297067
                           NM  |  -.0107574    .004153    -2.59   0.013     -.019099   -.0024158
                           AZ  |   .0184004   .0077454     2.38   0.021     .0028432    .0339575
                           UT  |   -.006642   .0071054    -0.93   0.354    -.0209136    .0076296
                           NV  |   .0460859   .0079421     5.80   0.000     .0301337    .0620381
                           WA  |   .0549413   .0059961     9.16   0.000     .0428979    .0669848
                           OR  |   .0083393   .0048771     1.71   0.093    -.0014565    .0181352
                           CA  |   .0906562    .007332    12.36   0.000     .0759295    .1053829
                           AK  |   .0860892   .0059667    14.43   0.000     .0741048    .0980736
                           HI  |   .0439899   .0058151     7.56   0.000     .0323099      .05567
                               |
                          year |
                         2001  |    .019198   .0028608     6.71   0.000     .0134519    .0249441
                         2002  |    .023705   .0033868     7.00   0.000     .0169025    .0305076
                         2003  |   .0114852   .0029713     3.87   0.000     .0055172    .0174533
                         2004  |   .0041121   .0027395     1.50   0.140    -.0013904    .0096146
                         2005  |  -.0079572   .0031023    -2.56   0.013    -.0141883   -.0017261
                         2006  |   -.010093   .0034383    -2.94   0.005    -.0169991   -.0031869
                         2007  |  -.0065506   .0043297    -1.51   0.137    -.0152471    .0021459
                         2008  |  -.0084205   .0044112    -1.91   0.062    -.0172805    .0004396
                         2009  |   .0102131   .0061976     1.65   0.106    -.0022351    .0226613
                         2010  |   .0039584    .006571     0.60   0.550    -.0092397    .0171566
                         2011  |  -.0097937   .0059487    -1.65   0.106    -.0217421    .0021546
                         2012  |  -.0092199   .0057373    -1.61   0.114    -.0207435    .0023037
                         2013  |  -.0127994   .0053413    -2.40   0.020    -.0235276   -.0020711
                         2014  |  -.0123719    .003874    -3.19   0.002    -.0201531   -.0045907
                         2015  |  -.0050162   .0037615    -1.33   0.188    -.0125715     .002539
                         2016  |   .0036933   .0040434     0.91   0.365    -.0044281    .0118146
                         2017  |  -.0008739   .0052764    -0.17   0.869    -.0114718    .0097241
                         2018  |   .0017614   .0038209     0.46   0.647     -.005913    .0094359
                         2019  |   .0157668   .0039767     3.96   0.000     .0077793    .0237543
                               |
                          nind |
                            2  |    .045343   .0145855     3.11   0.003     .0160473    .0746388
                            3  |   .0345635   .0122424     2.82   0.007     .0099739     .059153
                            4  |  -.0506982   .0126016    -4.02   0.000    -.0760091   -.0253872
                            5  |   .0265558   .0131633     2.02   0.049     .0001166     .052995
                            6  |   .0682688   .0166456     4.10   0.000     .0348351    .1017025
                            7  |   .0035039   .0145181     0.24   0.810    -.0256565    .0326644
                            8  |  -.0312042   .0157887    -1.98   0.054    -.0629167    .0005082
                            9  |  -.1214215   .0169565    -7.16   0.000    -.1554796   -.0873634
                           10  |  -.0546678   .0143623    -3.81   0.000    -.0835153   -.0258203
                           11  |   .0456584   .0157922     2.89   0.006     .0139388     .077378
                               |
                          educ |   .0450754   .0017519    25.73   0.000     .0415566    .0485941
                         exper |   .0274223   .0013768    19.92   0.000     .0246569    .0301877
                        exper2 |  -.0008754   .0000843   -10.38   0.000    -.0010448   -.0007061
                        exper3 |   .0000129   2.91e-06     4.45   0.000     7.08e-06    .0000188
                        exper4 |  -7.07e-08   3.18e-08    -2.23   0.031    -1.35e-07   -6.88e-09
                          edex |  -.0001657   .0000692    -2.40   0.020    -.0003046   -.0000268
                               |
                         ee_cl |
                            2  |   .0221442   .0042588     5.20   0.000       .01359    .0306983
                            3  |   .0067439   .0054805     1.23   0.224    -.0042639    .0177518
                            4  |  -.0567789    .009809    -5.79   0.000    -.0764809   -.0370769
                            5  |    .007975   .0051552     1.55   0.128    -.0023796    .0183295
                            6  |  -.0170678   .0059167    -2.88   0.006    -.0289517   -.0051838
                            7  |  -.0411566   .0082737    -4.97   0.000    -.0577748   -.0245385
                            8  |  -.0180238   .0099616    -1.81   0.076    -.0380323    .0019846
                            9  |  -.0118316    .007078    -1.67   0.101    -.0260483     .002385
                           10  |  -.0379868   .0076686    -4.95   0.000    -.0533897   -.0225839
                           11  |  -.0490548   .0089322    -5.49   0.000    -.0669957   -.0311139
                           12  |   .0073846   .0116634     0.63   0.530    -.0160419    .0308112
                           13  |   .0025449    .009137     0.28   0.782    -.0158073    .0208971
                           14  |  -.0365428   .0085425    -4.28   0.000    -.0537009   -.0193847
                           15  |  -.0440606   .0090373    -4.88   0.000    -.0622126   -.0259086
                           16  |  -4.01e-06   .0127685    -0.00   1.000    -.0256504    .0256423
                               |
                          marr |   .0572674   .0011698    48.95   0.000     .0549177    .0596171
                         partt |  -.1245707   .0069332   -17.97   0.000    -.1384965    -.110645
                        public |  -.0248182   .0033837    -7.33   0.000    -.0316146   -.0180219
                          cmsa |   .0622137   .0044131    14.10   0.000     .0533497    .0710778
                               |
                         nocc3 |
                            2  |  -.0902785    .003679   -24.54   0.000     -.097668   -.0828889
                            3  |  -.1229936   .0034096   -36.07   0.000     -.129842   -.1161452
                            4  |   -.096025   .0045162   -21.26   0.000    -.1050961   -.0869539
                               |
                         unemp |  -.0031788   .0009501    -3.35   0.002    -.0050871   -.0012704
                               |
                       quarter |
                            2  |   .0035648   .0011926     2.99   0.004     .0011695    .0059602
                            3  |   .0023015   .0016789     1.37   0.177    -.0010707    .0056737
                            4  |   .0054392   .0011489     4.73   0.000     .0031317    .0077467
                               |
                         _cons |   .6963175   .0249444    27.91   0.000     .6462153    .7464198
------------------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st findic_greatermed treat_stblackrelwhite blackfindic_greatermed treat_stfin
> dic_greatermed treat_stblackfindic_greatermed i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.e
> e_cl marr partt  public cmsa i.nocc3 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state) 
(sum of wgt is 5,740,898,485)

Linear regression                               Number of obs     =    648,645
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.7173
                                                Root MSE          =     .30186

                                                   (Std. Err. adjusted for 51 clusters in state)
------------------------------------------------------------------------------------------------
                               |               Robust
                        lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
                 blackrelwhite |  -.0273541   .0040467    -6.76   0.000    -.0354822    -.019226
                      treat_st |  -.0004119   .0092872    -0.04   0.965    -.0190657    .0182419
             findic_greatermed |   .7118939   .0143776    49.51   0.000     .6830156    .7407721
         treat_stblackrelwhite |  -.0101365   .0059068    -1.72   0.092    -.0220005    .0017276
        blackfindic_greatermed |  -.0215567   .0102461    -2.10   0.040    -.0421366   -.0009769
     treat_stfindic_greatermed |  -.0263985   .0199967    -1.32   0.193     -.066563    .0137661
treat_stblackfindic_greatermed |  -.0059924    .012161    -0.49   0.624    -.0304185    .0184337
                               |
                         state |
                           NH  |   .0158315   .0036183     4.38   0.000     .0085639     .023099
                           VT  |   .0040136   .0017726     2.26   0.028     .0004531     .007574
                           MA  |   .0584391   .0062818     9.30   0.000     .0458216    .0710565
                           RI  |   .0120193   .0049839     2.41   0.020     .0020089    .0220298
                           CT  |   .0494337    .006218     7.95   0.000     .0369445    .0619228
                           NY  |   .0348587   .0047825     7.29   0.000     .0252527    .0444647
                           NJ  |   .0760682   .0060872    12.50   0.000     .0638417    .0882946
                           PA  |  -.0212738   .0034093    -6.24   0.000    -.0281217    -.014426
                           OH  |  -.0379869   .0029865   -12.72   0.000    -.0439855   -.0319883
                           IN  |  -.0357806   .0027063   -13.22   0.000    -.0412163   -.0303449
                           IL  |   .0004379   .0041751     0.10   0.917    -.0079481    .0088239
                           MI  |  -.0160055   .0035786    -4.47   0.000    -.0231933   -.0088176
                           WI  |  -.0094196   .0027662    -3.41   0.001    -.0149757   -.0038636
                           MN  |   .0117997   .0043627     2.70   0.009      .003037    .0205624
                           IA  |  -.0254734   .0040133    -6.35   0.000    -.0335342   -.0174125
                           MO  |  -.0488332   .0030492   -16.01   0.000    -.0549578   -.0427086
                           ND  |  -.0186937   .0042388    -4.41   0.000    -.0272077   -.0101798
                           SD  |  -.0237414    .004202    -5.65   0.000    -.0321813   -.0153014
                           NE  |  -.0315606   .0043555    -7.25   0.000    -.0403089   -.0228123
                           KS  |  -.0334484   .0043746    -7.65   0.000    -.0422351   -.0246617
                           DE  |     .00976   .0009907     9.85   0.000     .0077701    .0117499
                           MD  |   .0691177   .0065377    10.57   0.000     .0559864     .082249
                           DC  |   .1100547    .009072    12.13   0.000      .091833    .1282763
                           VA  |   .0410215   .0059355     6.91   0.000     .0290997    .0529433
                           WV  |  -.0835325   .0018973   -44.03   0.000    -.0873434   -.0797216
                           NC  |  -.0245564   .0047732    -5.14   0.000    -.0341436   -.0149691
                           SC  |  -.0463214   .0048172    -9.62   0.000     -.055997   -.0366457
                           GA  |  -.0173794   .0052008    -3.34   0.002    -.0278255   -.0069333
                           FL  |  -.0253615   .0055693    -4.55   0.000    -.0365476   -.0141753
                           KY  |  -.0472138   .0021823   -21.64   0.000     -.051597   -.0428306
                           TN  |  -.0409565   .0047072    -8.70   0.000    -.0504112   -.0315018
                           AL  |  -.0584187   .0046956   -12.44   0.000    -.0678501   -.0489872
                           MS  |   -.072498   .0048731   -14.88   0.000    -.0822859   -.0627101
                           AR  |  -.0633695   .0044519   -14.23   0.000    -.0723113   -.0544276
                           LA  |  -.0598924   .0052089   -11.50   0.000    -.0703549     -.04943
                           OK  |  -.0711062   .0044585   -15.95   0.000    -.0800614    -.062151
                           TX  |  -.0118019   .0055452    -2.13   0.038    -.0229398   -.0006639
                           MT  |  -.0250324   .0009217   -27.16   0.000    -.0268838   -.0231811
                           ID  |  -.0262762   .0042193    -6.23   0.000    -.0347508   -.0178016
                           WY  |   .0064628   .0041734     1.55   0.128    -.0019198    .0148454
                           CO  |  -.0100522   .0055367    -1.82   0.075    -.0211731    .0010686
                           NM  |  -.0396877    .003483   -11.39   0.000    -.0466836   -.0326919
                           AZ  |   -.006181   .0059128    -1.05   0.301    -.0180573    .0056952
                           UT  |  -.0246208   .0051569    -4.77   0.000    -.0349788   -.0142628
                           NV  |   .0271862    .005909     4.60   0.000     .0153175    .0390548
                           WA  |   .0287904   .0052732     5.46   0.000     .0181988    .0393819
                           OR  |  -.0059161   .0042322    -1.40   0.168    -.0144168    .0025845
                           CA  |   .0771585   .0063241    12.20   0.000     .0644561    .0898608
                           AK  |   .0599957   .0048639    12.33   0.000     .0502263    .0697651
                           HI  |   .0197796   .0046845     4.22   0.000     .0103705    .0291888
                               |
                          year |
                         2001  |   .0123575   .0027276     4.53   0.000     .0068789    .0178361
                         2002  |   .0139859   .0025352     5.52   0.000     .0088938    .0190779
                         2003  |   .0155706   .0028486     5.47   0.000      .009849    .0212923
                         2004  |    .004357   .0028318     1.54   0.130    -.0013308    .0100447
                         2005  |   .0050431   .0028567     1.77   0.084    -.0006948     .010781
                         2006  |  -.0034592   .0025411    -1.36   0.180    -.0085631    .0016447
                         2007  |    .001105   .0029547     0.37   0.710    -.0048297    .0070397
                         2008  |  -.0007116   .0037216    -0.19   0.849    -.0081867    .0067635
                         2009  |   .0112991    .005069     2.23   0.030     .0011178    .0214804
                         2010  |   .0099844   .0044494     2.24   0.029     .0010475    .0189214
                         2011  |   .0082017    .003876     2.12   0.039     .0004167    .0159868
                         2012  |  -.0042999   .0037542    -1.15   0.258    -.0118405    .0032407
                         2013  |  -.0013459   .0048306    -0.28   0.782    -.0110485    .0083568
                         2014  |  -.0039953   .0039854    -1.00   0.321    -.0120002    .0040096
                         2015  |   .0053381   .0033152     1.61   0.114    -.0013208    .0119969
                         2016  |   .0080586   .0038326     2.10   0.041     .0003605    .0157566
                         2017  |   .0155741   .0042165     3.69   0.001      .007105    .0240432
                         2018  |   .0156756   .0041349     3.79   0.000     .0073706    .0239807
                         2019  |    .019612   .0034124     5.75   0.000      .012758     .026466
                               |
                          nind |
                            2  |  -.0030738   .0344296    -0.09   0.929    -.0722277    .0660801
                            3  |   .0431781   .0307205     1.41   0.166    -.0185258     .104882
                            4  |   -.066474   .0317937    -2.09   0.042    -.1303335   -.0026145
                            5  |    .024016   .0308031     0.78   0.439    -.0378537    .0858858
                            6  |   .0304715   .0329027     0.93   0.359    -.0356155    .0965586
                            7  |  -.0057804   .0332763    -0.17   0.863    -.0726178    .0610569
                            8  |  -.0210665   .0329961    -0.64   0.526    -.0873412    .0452082
                            9  |  -.1365595   .0368916    -3.70   0.001    -.2106585   -.0624604
                           10  |  -.0692243   .0319594    -2.17   0.035    -.1334167    -.005032
                           11  |   .0170031   .0350913     0.48   0.630    -.0534799    .0874861
                               |
                          educ |    .060773   .0016901    35.96   0.000     .0573784    .0641676
                         exper |   .0217209   .0016157    13.44   0.000     .0184757    .0249661
                        exper2 |  -.0006581   .0000977    -6.73   0.000    -.0008544   -.0004618
                        exper3 |   7.28e-06   3.30e-06     2.20   0.032     6.41e-07    .0000139
                        exper4 |  -6.24e-09   3.61e-08    -0.17   0.863    -7.88e-08    6.63e-08
                          edex |  -.0001611   .0000773    -2.08   0.042    -.0003163   -5.82e-06
                               |
                         ee_cl |
                            2  |  -.0247446   .0042924    -5.76   0.000    -.0333661   -.0161231
                            3  |  -.0602225   .0069403    -8.68   0.000    -.0741625   -.0462825
                            4  |  -.1679321   .0112536   -14.92   0.000    -.1905357   -.1453285
                            5  |   -.022911   .0067725    -3.38   0.001     -.036514   -.0093079
                            6  |  -.0660652   .0071407    -9.25   0.000    -.0804078   -.0517227
                            7  |  -.1096203   .0092287   -11.88   0.000    -.1281568   -.0910839
                            8  |  -.1062387   .0099209   -10.71   0.000    -.1261655    -.086312
                            9  |  -.0198548   .0100448    -1.98   0.054    -.0400304    .0003208
                           10  |  -.0727144   .0098518    -7.38   0.000    -.0925023   -.0529265
                           11  |  -.1074305   .0110637    -9.71   0.000    -.1296526   -.0852084
                           12  |  -.0977616    .009752   -10.02   0.000     -.117349   -.0781741
                           13  |   .0194604   .0143034     1.36   0.180     -.009269    .0481897
                           14  |  -.0591466   .0105816    -5.59   0.000    -.0804003   -.0378929
                           15  |  -.0869563   .0105641    -8.23   0.000     -.108175   -.0657376
                           16  |  -.0963303   .0093133   -10.34   0.000    -.1150367    -.077624
                               |
                          marr |   .0230708    .001522    15.16   0.000     .0200137    .0261279
                         partt |  -.0473858   .0037968   -12.48   0.000    -.0550118   -.0397598
                        public |  -.0053292   .0036795    -1.45   0.154    -.0127197    .0020613
                          cmsa |   .0694191   .0040281    17.23   0.000     .0613285    .0775097
                               |
                         nocc3 |
                            2  |  -.1032917   .0063177   -16.35   0.000    -.1159812   -.0906023
                            3  |  -.1170151   .0037795   -30.96   0.000    -.1246065   -.1094238
                            4  |  -.1024508   .0053041   -19.32   0.000    -.1131043   -.0917972
                               |
                         unemp |  -.0009006   .0007463    -1.21   0.233    -.0023996    .0005983
                               |
                       quarter |
                            2  |   .0055291   .0014141     3.91   0.000     .0026888    .0083694
                            3  |   .0108971   .0017432     6.25   0.000     .0073957    .0143985
                            4  |   .0115192   .0010341    11.14   0.000     .0094421    .0135963
                               |
                         _cons |   .4447468   .0332163    13.39   0.000     .3780298    .5114637
------------------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/morediagnostics.log
  log type:  text
 closed on:  16 Mar 2021, 19:18:08
--------------------------------------------------------------------------------------------------------------
