------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/rifdid.log
  log type:  text
 opened on:   8 Mar 2021, 23:03:04

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2
> 004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extende
> d to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
(2,109 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,113 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,737 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,612 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** NOTE in current draft we have not dropped <83, self empl + w/o pay
. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,451,221 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc
>  cmsa partt public marr hisprace hispracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_mo
> rg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,237,006  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,524 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472759 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786904 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,175 real changes made, 324,175 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,799 real changes made, 266,799 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,175 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,20
> 13(28 effective; signed Dec2012) Mar1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,201
> 7(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 
> 87, 47, 83, 72, 82) //incl Idaho which changed in 1985 and Texas which had since 47 but bolste
> red in 93
(1,149,231 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,267 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 
> 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,231 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,836 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 
> 88, 63, 64, 57, 87, 47, 83, 72)
(1,106,040 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,836 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,106,040 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,106,040 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would ne
> ed to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,175 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,799 missing values generated)

. 
. ** mean with nocc3 with quarter fe
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc3 i.quarter unemp [aw = finalwt1] i
> f female == 0, vce(cluster state)
(sum of wgt is 9,221,094,079)

Linear regression                               Number of obs     =  1,069,714
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4955
                                                Root MSE          =     .42386

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1586474   .0066933   -23.70   0.000    -.1720914   -.1452035
             treat_st |   -.038357   .0185647    -2.07   0.044    -.0756454   -.0010686
treat_stblackrelwhite |  -.0252493   .0090089    -2.80   0.007    -.0433441   -.0071544
                      |
                state |
                  NH  |   .0858669   .0049356    17.40   0.000     .0759534    .0957803
                  VT  |   .0219595   .0019424    11.31   0.000     .0180581    .0258609
                  MA  |   .1200168   .0089151    13.46   0.000     .1021104    .1379232
                  RI  |   .0335505   .0089898     3.73   0.000     .0154939    .0516071
                  CT  |   .1323333   .0088532    14.95   0.000     .1145512    .1501154
                  NY  |   .1013028   .0082253    12.32   0.000     .0847818    .1178239
                  NJ  |   .1757013   .0094042    18.68   0.000     .1568124    .1945902
                  PA  |    .010975   .0068907     1.59   0.118    -.0028653    .0248152
                  OH  |  -.0181963   .0066972    -2.72   0.009    -.0316481   -.0047446
                  IN  |   .0054215   .0056053     0.97   0.338    -.0058372    .0166801
                  IL  |   .0853567   .0075302    11.34   0.000     .0702319    .1004815
                  MI  |   .0530117   .0074894     7.08   0.000     .0379688    .0680545
                  WI  |   .0159431   .0052641     3.03   0.004     .0053698    .0265163
                  MN  |   .0602536   .0071706     8.40   0.000      .045851    .0746562
                  IA  |   .0131394   .0171596     0.77   0.447    -.0213268    .0476055
                  MO  |  -.0214901   .0064828    -3.31   0.002    -.0345113   -.0084689
                  ND  |   .0233697   .0179378     1.30   0.199    -.0126595    .0593988
                  SD  |   -.046647   .0170973    -2.73   0.009     -.080988   -.0123061
                  NE  |  -.0340293   .0168988    -2.01   0.049    -.0679716    -.000087
                  KS  |  -.0042298   .0176377    -0.24   0.811    -.0396561    .0311965
                  DE  |   .0538639     .00243    22.17   0.000     .0489831    .0587448
                  MD  |   .1288925   .0094613    13.62   0.000      .109889    .1478961
                  DC  |    .177998   .0114894    15.49   0.000     .1549209    .2010751
                  VA  |   .1227332   .0179541     6.84   0.000     .0866713    .1587951
                  WV  |  -.0335785   .0045713    -7.35   0.000    -.0427602   -.0243968
                  NC  |   .0117098   .0185745     0.63   0.531    -.0255983    .0490178
                  SC  |  -.0059119   .0190475    -0.31   0.758    -.0441699    .0323461
                  GA  |   .0616601   .0191414     3.22   0.002     .0232135    .1001067
                  FL  |  -.0076932   .0197364    -0.39   0.698     -.047335    .0319486
                  KY  |  -.0408499   .0048252    -8.47   0.000    -.0505415   -.0311583
                  TN  |  -.0297008   .0186978    -1.59   0.118    -.0672565    .0078548
                  AL  |  -.0001876   .0190917    -0.01   0.992    -.0385344    .0381592
                  MS  |  -.0223751   .0202209    -1.11   0.274      -.06299    .0182399
                  AR  |  -.0751515   .0189565    -3.96   0.000    -.1132268   -.0370762
                  LA  |   .0288416   .0198144     1.46   0.152    -.0109569      .06864
                  OK  |  -.0582618   .0105901    -5.50   0.000    -.0795326   -.0369909
                  TX  |   .0636532   .0193382     3.29   0.002     .0248113    .1024951
                  MT  |  -.0313072   .0014018   -22.33   0.000    -.0341228   -.0284916
                  ID  |  -.0374144   .0035755   -10.46   0.000     -.044596   -.0302328
                  WY  |   .1707576   .0196604     8.69   0.000     .1312685    .2102468
                  CO  |   .0340621   .0088222     3.86   0.000     .0163422    .0517819
                  NM  |  -.0269983   .0059342    -4.55   0.000    -.0389176    -.015079
                  AZ  |   .0350208   .0196237     1.78   0.080    -.0043946    .0744363
                  UT  |  -.0024882   .0182309    -0.14   0.892     -.039106    .0341295
                  NV  |   .1126245   .0201559     5.59   0.000     .0721402    .1531089
                  WA  |   .1035888   .0079105    13.10   0.000     .0877001    .1194775
                  OR  |    .027771   .0072795     3.81   0.000     .0131496    .0423924
                  CA  |   .1689576    .009407    17.96   0.000     .1500631    .1878522
                  AK  |    .255185   .0065921    38.71   0.000     .2419443    .2684256
                  HI  |   .1068445   .0067674    15.79   0.000     .0932517    .1204373
                      |
                 year |
                1990  |  -.0117836    .002981    -3.95   0.000    -.0177712   -.0057961
                1991  |  -.0182166   .0050617    -3.60   0.001    -.0283833   -.0080498
                1992  |  -.0162663   .0055919    -2.91   0.005     -.027498   -.0050345
                1993  |  -.0287911   .0044296    -6.50   0.000    -.0376881   -.0198941
                1996  |  -.0386571   .0051048    -7.57   0.000    -.0489103   -.0284039
                1997  |  -.0252043   .0048528    -5.19   0.000    -.0349514   -.0154573
                1998  |  -.0040412    .004066    -0.99   0.325     -.012208    .0041256
                1999  |   .0166629   .0052979     3.15   0.003     .0060218     .027304
                2000  |     .02391   .0054696     4.37   0.000      .012924    .0348961
                2001  |   .0430174   .0057203     7.52   0.000     .0315278    .0545069
                2002  |   .0553786   .0057997     9.55   0.000     .0437294    .0670277
                2003  |   .0438949   .0061249     7.17   0.000     .0315926    .0561972
                2004  |   .0336892   .0054753     6.15   0.000     .0226917    .0446867
                2005  |   .0177058   .0058098     3.05   0.004     .0060365    .0293752
                2006  |   .0118753   .0060077     1.98   0.054    -.0001914    .0239421
                2007  |   .0122714   .0072479     1.69   0.097    -.0022864    .0268293
                2008  |   .0133845   .0068435     1.96   0.056    -.0003612    .0271301
                2009  |   .0474489   .0110127     4.31   0.000     .0253293    .0695685
                2010  |   .0399388   .0095291     4.19   0.000     .0207991    .0590786
                2011  |   .0129568    .009128     1.42   0.162    -.0053773    .0312909
                2012  |   .0066685   .0102403     0.65   0.518    -.0138998    .0272368
                2013  |  -.0009071   .0098596    -0.09   0.927    -.0207107    .0188964
                2014  |  -.0089825   .0089579    -1.00   0.321    -.0269749    .0090099
                2015  |   .0066853   .0067796     0.99   0.329     -.006932    .0203025
                2016  |   .0190931   .0073382     2.60   0.012     .0043539    .0338323
                2017  |   .0220211    .008407     2.62   0.012     .0051351    .0389071
                2018  |   .0285262   .0081181     3.51   0.001     .0122205     .044832
                2019  |   .0476762   .0079341     6.01   0.000     .0317402    .0636123
                      |
                 nind |
                   2  |   .1374855   .0288482     4.77   0.000     .0795422    .1954289
                   3  |   .1007685   .0234999     4.29   0.000     .0535676    .1479694
                   4  |  -.0794953   .0252811    -3.14   0.003    -.1302739   -.0287167
                   5  |   .1210465   .0243801     4.96   0.000     .0720777    .1700153
                   6  |   .1220738   .0284334     4.29   0.000     .0649637    .1791839
                   7  |   .0006239   .0267615     0.02   0.981    -.0531282    .0543761
                   8  |  -.0710909   .0269472    -2.64   0.011    -.1252159   -.0169658
                   9  |  -.1771141   .0313713    -5.65   0.000    -.2401253    -.114103
                  10  |  -.1227596   .0277466    -4.42   0.000    -.1784902   -.0670289
                  11  |   .1181142   .0275295     4.29   0.000     .0628196    .1734088
                      |
                 educ |   .0710736   .0018571    38.27   0.000     .0673434    .0748038
                exper |   .0471799   .0018279    25.81   0.000     .0435084    .0508514
               exper2 |  -.0009322   .0001004    -9.28   0.000    -.0011339   -.0007304
               exper3 |   3.99e-06   2.94e-06     1.36   0.181    -1.92e-06    9.91e-06
               exper4 |   4.00e-08   3.12e-08     1.28   0.206    -2.26e-08    1.03e-07
                 edex |  -.0005494   .0000596    -9.22   0.000    -.0006692   -.0004297
                      |
                ee_cl |
                   2  |  -.0667273    .005052   -13.21   0.000    -.0768745     -.05658
                   3  |  -.0739743    .006591   -11.22   0.000    -.0872128   -.0607359
                   4  |  -.0417372   .0112655    -3.70   0.001    -.0643645   -.0191098
                   5  |  -.1445213   .0057385   -25.18   0.000    -.1560475   -.1329951
                   6  |  -.0950134   .0053766   -17.67   0.000    -.1058127   -.0842141
                   7  |  -.0664755   .0071117    -9.35   0.000    -.0807598   -.0521911
                   8  |   .0195097   .0124669     1.56   0.124    -.0055308    .0445502
                   9  |  -.1684842    .006871   -24.52   0.000     -.182285   -.1546833
                  10  |   -.107339   .0077009   -13.94   0.000    -.1228067   -.0918713
                  11  |  -.0616707   .0083574    -7.38   0.000    -.0784569   -.0448844
                  12  |   .0231077   .0127748     1.81   0.076    -.0025513    .0487668
                  13  |  -.0978974   .0116684    -8.39   0.000    -.1213341   -.0744606
                  14  |  -.0864567   .0095962    -9.01   0.000    -.1057312   -.0671822
                  15  |  -.0517322    .009854    -5.25   0.000    -.0715247   -.0319398
                  16  |   .0225231   .0135291     1.66   0.102    -.0046508    .0496971
                      |
                 marr |    .130792   .0022546    58.01   0.000     .1262634    .1353206
                partt |  -.2233662   .0061313   -36.43   0.000    -.2356813   -.2110511
               public |   .0009503   .0073374     0.13   0.897    -.0137874     .015688
                 cmsa |   .1511803   .0091929    16.45   0.000     .1327158    .1696448
                      |
                nocc3 |
                   2  |   -.194145   .0041371   -46.93   0.000    -.2024547   -.1858354
                   3  |  -.2855777   .0038326   -74.51   0.000    -.2932756   -.2778797
                   4  |  -.2182945   .0036954   -59.07   0.000    -.2257169   -.2108722
                      |
              quarter |
                   2  |   .0031011   .0019118     1.62   0.111    -.0007389    .0069411
                   3  |   .0046394    .001867     2.48   0.016     .0008894    .0083894
                   4  |   .0142888   .0016572     8.62   0.000     .0109601    .0176174
                      |
                unemp |  -.0059619   .0020073    -2.97   0.005    -.0099937   -.0019301
                _cons |   .5293045   .0385388    13.73   0.000     .4518971    .6067119
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc3 i.quarter unemp [aw = finalwt1] i
> f female == 1, vce(cluster state)
(sum of wgt is 9,024,398,313)

Linear regression                               Number of obs     =  1,080,778
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4847
                                                Root MSE          =     .40031

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0741068   .0061133   -12.12   0.000    -.0863857   -.0618279
             treat_st |  -.0323156   .0090828    -3.56   0.001     -.050559   -.0140722
treat_stblackrelwhite |  -.0377084   .0076456    -4.93   0.000     -.053065   -.0223518
                      |
                state |
                  NH  |   .0578753   .0038046    15.21   0.000     .0502336    .0655169
                  VT  |   .0358312   .0016129    22.22   0.000     .0325917    .0390707
                  MA  |   .1041767   .0080075    13.01   0.000     .0880932    .1202601
                  RI  |   .0253445   .0080299     3.16   0.003     .0092161     .041473
                  CT  |   .1111182   .0080141    13.87   0.000     .0950215     .127215
                  NY  |   .0662154    .007484     8.85   0.000     .0511833    .0812475
                  NJ  |   .1298744   .0085819    15.13   0.000     .1126372    .1471117
                  PA  |  -.0276157   .0064488    -4.28   0.000    -.0405684   -.0146629
                  OH  |  -.0590295   .0062243    -9.48   0.000    -.0715314   -.0465275
                  IN  |  -.0640417   .0047045   -13.61   0.000    -.0734909   -.0545925
                  IL  |   .0066796   .0070455     0.95   0.348    -.0074717    .0208308
                  MI  |  -.0097736   .0065587    -1.49   0.142    -.0229471    .0033999
                  WI  |  -.0120235    .004612    -2.61   0.012     -.021287   -.0027599
                  MN  |   .0463309   .0059997     7.72   0.000     .0342801    .0583816
                  IA  |  -.0307036   .0084286    -3.64   0.001    -.0476329   -.0137744
                  MO  |  -.0805054   .0060055   -13.41   0.000    -.0925678    -.068443
                  ND  |  -.0563925   .0090071    -6.26   0.000    -.0744839   -.0383012
                  SD  |  -.0776628    .008695    -8.93   0.000    -.0951273   -.0601983
                  NE  |  -.0678588   .0086259    -7.87   0.000    -.0851845   -.0505332
                  KS  |  -.0613732   .0087645    -7.00   0.000    -.0789772   -.0437692
                  DE  |   .0520684   .0025521    20.40   0.000     .0469424    .0571943
                  MD  |   .1020819   .0091055    11.21   0.000     .0837929    .1203709
                  DC  |   .1557143   .0115242    13.51   0.000     .1325672    .1788614
                  VA  |   .0578848   .0097359     5.95   0.000     .0383297    .0774399
                  WV  |  -.1415191   .0027391   -51.67   0.000    -.1470209   -.1360174
                  NC  |  -.0324037   .0092049    -3.52   0.001    -.0508923   -.0139151
                  SC  |  -.0699622   .0094754    -7.38   0.000     -.088994   -.0509303
                  GA  |   .0000847   .0099399     0.01   0.993    -.0198801    .0200495
                  FL  |  -.0289231   .0106841    -2.71   0.009    -.0503827   -.0074635
                  KY  |  -.0863025   .0041122   -20.99   0.000    -.0945621    -.078043
                  TN  |  -.0722972   .0094502    -7.65   0.000    -.0912784   -.0533159
                  AL  |  -.0860459   .0094606    -9.10   0.000    -.1050482   -.0670437
                  MS  |  -.1072503   .0096427   -11.12   0.000    -.1266182   -.0878823
                  AR  |  -.1117847   .0089642   -12.47   0.000    -.1297898   -.0937796
                  LA  |  -.0896903   .0103749    -8.64   0.000    -.1105289   -.0688518
                  OK  |  -.1368213   .0065218   -20.98   0.000    -.1499207   -.1237218
                  TX  |   -.002855   .0102457    -0.28   0.782    -.0234342    .0177241
                  MT  |   -.074787   .0008205   -91.15   0.000    -.0764349    -.073139
                  ID  |  -.0730239   .0030207   -24.17   0.000    -.0790911   -.0669567
                  WY  |   .0059803   .0089846     0.67   0.509    -.0120659    .0240264
                  CO  |  -.0029999   .0079653    -0.38   0.708    -.0189987    .0129989
                  NM  |   -.090178   .0050425   -17.88   0.000    -.1003061   -.0800498
                  AZ  |   .0092185   .0105309     0.88   0.386    -.0119334    .0303704
                  UT  |  -.0502736   .0098098    -5.12   0.000    -.0699772   -.0305699
                  NV  |   .0698963   .0109223     6.40   0.000     .0479582    .0918345
                  WA  |   .0613415   .0071186     8.62   0.000     .0470433    .0756397
                  OR  |  -.0022989   .0066102    -0.35   0.729    -.0155759     .010978
                  CA  |    .130739   .0086268    15.16   0.000     .1134116    .1480663
                  AK  |   .1879467   .0050963    36.88   0.000     .1777104     .198183
                  HI  |   .0706724   .0060345    11.71   0.000     .0585518     .082793
                      |
                 year |
                1990  |  -.0059014   .0026095    -2.26   0.028    -.0111427   -.0006601
                1991  |   .0002701   .0030397     0.09   0.930    -.0058353    .0063754
                1992  |   .0183977   .0040791     4.51   0.000     .0102047    .0265907
                1993  |   .0141329   .0039331     3.59   0.001      .006233    .0220327
                1996  |  -.0003774   .0038791    -0.10   0.923    -.0081687    .0074139
                1997  |   .0111445   .0035666     3.12   0.003     .0039807    .0183083
                1998  |   .0397833   .0037857    10.51   0.000     .0321794    .0473872
                1999  |   .0555506   .0034769    15.98   0.000      .048567    .0625341
                2000  |   .0680526   .0041032    16.59   0.000     .0598111    .0762941
                2001  |   .0811094    .004593    17.66   0.000     .0718842    .0903346
                2002  |   .0971256   .0048213    20.14   0.000     .0874417    .1068096
                2003  |   .0995081   .0048043    20.71   0.000     .0898583    .1091579
                2004  |   .0897316   .0048145    18.64   0.000     .0800613    .0994019
                2005  |   .0791901   .0050174    15.78   0.000     .0691123    .0892679
                2006  |   .0741319   .0044979    16.48   0.000     .0650975    .0831663
                2007  |   .0744943   .0054685    13.62   0.000     .0635105     .085478
                2008  |    .069434   .0063574    10.92   0.000     .0566649    .0822031
                2009  |   .0942959   .0077106    12.23   0.000     .0788086    .1097832
                2010  |   .0920344   .0068244    13.49   0.000     .0783271    .1057417
                2011  |   .0720493   .0057949    12.43   0.000     .0604098    .0836888
                2012  |   .0539872   .0060459     8.93   0.000     .0418436    .0661308
                2013  |   .0550309   .0066444     8.28   0.000     .0416853    .0683766
                2014  |   .0481981   .0059679     8.08   0.000     .0362113    .0601849
                2015  |   .0628836   .0051457    12.22   0.000     .0525482    .0732189
                2016  |   .0742432    .006336    11.72   0.000      .061517    .0869695
                2017  |   .0828755   .0075254    11.01   0.000     .0677603    .0979906
                2018  |   .0859355   .0072167    11.91   0.000     .0714403    .1004307
                2019  |   .0976734   .0066567    14.67   0.000     .0843031    .1110437
                      |
                 nind |
                   2  |   .0905028   .0422735     2.14   0.037      .005594    .1754115
                   3  |   .1246849   .0394437     3.16   0.003     .0454599      .20391
                   4  |  -.0937192   .0403885    -2.32   0.024    -.1748419   -.0125964
                   5  |   .1572547   .0385269     4.08   0.000     .0798711    .2346383
                   6  |   .1064671   .0404985     2.63   0.011     .0251235    .1878107
                   7  |   .0276385   .0419724     0.66   0.513    -.0566656    .1119426
                   8  |   .0112067   .0430079     0.26   0.795    -.0751772    .0975907
                   9  |  -.1668339   .0481783    -3.46   0.001    -.2636029   -.0700649
                  10  |  -.0964047   .0411872    -2.34   0.023    -.1791317   -.0136777
                  11  |   .0868487   .0432999     2.01   0.050    -.0001218    .1738192
                      |
                 educ |   .0947006   .0020894    45.32   0.000     .0905039    .0988972
                exper |   .0507934   .0020855    24.36   0.000     .0466046    .0549823
               exper2 |   -.001618   .0001017   -15.91   0.000    -.0018223   -.0014138
               exper3 |   .0000254   2.84e-06     8.94   0.000     .0000197    .0000311
               exper4 |  -1.39e-07   2.86e-08    -4.86   0.000    -1.96e-07   -8.13e-08
                 edex |  -.0006521   .0000862    -7.57   0.000    -.0008252    -.000479
                      |
                ee_cl |
                   2  |  -.1333653   .0050157   -26.59   0.000    -.1434397   -.1232909
                   3  |   -.167091   .0070108   -23.83   0.000    -.1811726   -.1530094
                   4  |  -.1887666   .0104006   -18.15   0.000    -.2096568   -.1678763
                   5  |  -.1644159   .0080799   -20.35   0.000    -.1806448   -.1481871
                   6  |  -.1787305    .008179   -21.85   0.000    -.1951585   -.1623024
                   7  |  -.1773273   .0092547   -19.16   0.000    -.1959159   -.1587387
                   8  |  -.1296448   .0116163   -11.16   0.000    -.1529769   -.1063127
                   9  |  -.1710786   .0099253   -17.24   0.000    -.1910141   -.1511431
                  10  |  -.1866009   .0104255   -17.90   0.000    -.2075411   -.1656607
                  11  |  -.1695926   .0102512   -16.54   0.000    -.1901828   -.1490024
                  12  |   -.136114   .0105229   -12.94   0.000    -.1572498   -.1149781
                  13  |  -.1294007   .0140408    -9.22   0.000    -.1576026   -.1011989
                  14  |  -.1674269   .0107728   -15.54   0.000    -.1890648    -.145789
                  15  |   -.138212   .0106087   -13.03   0.000    -.1595203   -.1169037
                  16  |  -.1205321   .0110604   -10.90   0.000    -.1427476   -.0983165
                      |
                 marr |   .0355027   .0022365    15.87   0.000     .0310105    .0399949
                partt |   -.140076   .0034024   -41.17   0.000      -.14691   -.1332421
               public |   .0431281   .0059372     7.26   0.000     .0312027    .0550534
                 cmsa |   .1562322   .0081413    19.19   0.000     .1398799    .1725845
                      |
                nocc3 |
                   2  |  -.2278424   .0036219   -62.91   0.000    -.2351172   -.2205675
                   3  |  -.3045223   .0044512   -68.41   0.000    -.3134628   -.2955817
                   4  |  -.2796772   .0063487   -44.05   0.000    -.2924289   -.2669255
                      |
              quarter |
                   2  |   .0089504   .0013969     6.41   0.000     .0061446    .0117563
                   3  |   .0182732   .0016524    11.06   0.000     .0149542    .0215922
                   4  |    .020856   .0011194    18.63   0.000     .0186077    .0231043
                      |
                unemp |   -.002192   .0013616    -1.61   0.114    -.0049269    .0005428
                _cons |   .2024416   .0417204     4.85   0.000     .1186438    .2862395
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc3 i.quarter unemp [aw = finalwt1] i
> f female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 7,596,225,671)

Linear regression                               Number of obs     =    878,887
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5232
                                                Root MSE          =     .42761

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1765534   .0051229   -34.46   0.000     -.186843   -.1662638
             treat_st |   -.028356   .0138586    -2.05   0.046    -.0561919   -.0005202
treat_stblackrelwhite |  -.0044214    .008334    -0.53   0.598    -.0211607    .0123178
                      |
                state |
                  NH  |   .0926263   .0046644    19.86   0.000     .0832575    .1019951
                  VT  |   .0350983    .001952    17.98   0.000     .0311776     .039019
                  MA  |   .1196812   .0088401    13.54   0.000     .1019253    .1374372
                  RI  |   .0295031    .008629     3.42   0.001     .0121712    .0468349
                  CT  |   .1260004   .0087979    14.32   0.000     .1083293    .1436714
                  NY  |   .0746638   .0082687     9.03   0.000     .0580557    .0912719
                  NJ  |     .15999   .0094282    16.97   0.000     .1410529    .1789271
                  PA  |   .0033345   .0067936     0.49   0.626    -.0103109    .0169799
                  OH  |  -.0307333   .0066461    -4.62   0.000    -.0440824   -.0173842
                  IN  |  -.0046131   .0052226    -0.88   0.381    -.0151031    .0058769
                  IL  |   .0654454   .0077554     8.44   0.000     .0498682    .0810226
                  MI  |   .0256619   .0074828     3.43   0.001     .0106322    .0406916
                  WI  |   .0089764   .0049761     1.80   0.077    -.0010183    .0189711
                  MN  |   .0492323   .0069137     7.12   0.000     .0353458    .0631189
                  IA  |   .0010525   .0125271     0.08   0.933     -.024109    .0262139
                  MO  |  -.0372322   .0061969    -6.01   0.000     -.049679   -.0247854
                  ND  |   .0235023   .0131388     1.79   0.080    -.0028878    .0498924
                  SD  |  -.0470203   .0123292    -3.81   0.000    -.0717843   -.0222564
                  NE  |  -.0381766   .0123117    -3.10   0.003    -.0629053   -.0134479
                  KS  |  -.0163527    .013028    -1.26   0.215    -.0425202    .0098148
                  DE  |   .0592197   .0019573    30.26   0.000     .0552884    .0631511
                  MD  |   .1353032   .0092938    14.56   0.000     .1166361    .1539704
                  DC  |   .1905286   .0121923    15.63   0.000     .1660396    .2150176
                  VA  |   .1222753   .0134923     9.06   0.000     .0951752    .1493754
                  WV  |  -.0508813   .0038439   -13.24   0.000    -.0586021   -.0431605
                  NC  |    .018448   .0140049     1.32   0.194    -.0096818    .0465777
                  SC  |   .0065128   .0144174     0.45   0.653    -.0224453     .035471
                  GA  |   .0610139   .0145792     4.18   0.000     .0317307    .0902971
                  FL  |  -.0089098   .0150681    -0.59   0.557    -.0391749    .0213553
                  KY  |  -.0405942   .0044738    -9.07   0.000    -.0495801   -.0316084
                  TN  |  -.0322626   .0141487    -2.28   0.027    -.0606811   -.0038441
                  AL  |  -.0036319   .0144619    -0.25   0.803    -.0326795    .0254157
                  MS  |   -.014095   .0154761    -0.91   0.367    -.0451797    .0169897
                  AR  |  -.0722434   .0141119    -5.12   0.000    -.1005881   -.0438988
                  LA  |   .0300253   .0151002     1.99   0.052    -.0003044    .0603549
                  OK  |  -.0519217    .008391    -6.19   0.000    -.0687755   -.0350679
                  TX  |   .0630949   .0147557     4.28   0.000     .0334572    .0927327
                  MT  |  -.0355469   .0013463   -26.40   0.000     -.038251   -.0328429
                  ID  |  -.0300797   .0034337    -8.76   0.000    -.0369765   -.0231829
                  WY  |   .1673586   .0146374    11.43   0.000     .1379586    .1967585
                  CO  |   .0445261   .0084364     5.28   0.000     .0275811    .0614711
                  NM  |  -.0138872   .0056646    -2.45   0.018     -.025265   -.0025094
                  AZ  |   .0324778   .0150191     2.16   0.035      .002311    .0626446
                  UT  |  -.0042148   .0135886    -0.31   0.758    -.0315083    .0230787
                  NV  |   .0881923   .0153544     5.74   0.000     .0573521    .1190326
                  WA  |    .094264    .007891    11.95   0.000     .0784145    .1101135
                  OR  |   .0219425   .0071753     3.06   0.004     .0075304    .0363545
                  CA  |   .1584933   .0094177    16.83   0.000     .1395773    .1774093
                  AK  |   .2480831    .006075    40.84   0.000     .2358811     .260285
                  HI  |   .1072501   .0065889    16.28   0.000     .0940158    .1204844
                      |
                 year |
                1990  |  -.0087905   .0032616    -2.70   0.010    -.0153417   -.0022393
                1991  |  -.0136027   .0062293    -2.18   0.034    -.0261145   -.0010909
                1992  |  -.0116502   .0056238    -2.07   0.043     -.022946   -.0003544
                1993  |  -.0257484   .0045423    -5.67   0.000    -.0348718   -.0166249
                1996  |  -.0378601   .0059412    -6.37   0.000    -.0497934   -.0259269
                1997  |  -.0234965   .0052522    -4.47   0.000    -.0340458   -.0129472
                1998  |   .0016067   .0047094     0.34   0.734    -.0078524    .0110658
                1999  |   .0251953   .0060766     4.15   0.000       .01299    .0374006
                2000  |   .0348373   .0061083     5.70   0.000     .0225684    .0471062
                2001  |   .0569071   .0062605     9.09   0.000     .0443325    .0694817
                2002  |   .0702624   .0051188    13.73   0.000     .0599809    .0805439
                2003  |    .056135   .0068968     8.14   0.000     .0422823    .0699876
                2004  |    .046427   .0061417     7.56   0.000      .034091     .058763
                2005  |   .0303563   .0065606     4.63   0.000     .0171789    .0435337
                2006  |   .0247515    .005632     4.39   0.000     .0134392    .0360637
                2007  |   .0239594   .0067564     3.55   0.001     .0103887      .03753
                2008  |   .0270936   .0063771     4.25   0.000     .0142847    .0399024
                2009  |   .0639723   .0118411     5.40   0.000     .0401887    .0877559
                2010  |   .0534389   .0105355     5.07   0.000     .0322777       .0746
                2011  |   .0261712   .0098024     2.67   0.010     .0064826    .0458599
                2012  |   .0216948   .0103572     2.09   0.041     .0008916    .0424979
                2013  |    .012213   .0097661     1.25   0.217    -.0074028    .0318289
                2014  |   .0022104    .009152     0.24   0.810    -.0161719    .0205927
                2015  |   .0205052   .0065543     3.13   0.003     .0073405      .03367
                2016  |   .0348194    .007265     4.79   0.000     .0202272    .0494117
                2017  |   .0336161   .0085903     3.91   0.000      .016362    .0508703
                2018  |   .0420994   .0086056     4.89   0.000     .0248146    .0593843
                2019  |   .0629669   .0085025     7.41   0.000     .0458892    .0800446
                      |
                 nind |
                   2  |   .0979426   .0250344     3.91   0.000     .0476595    .1482257
                   3  |   .0986177   .0232356     4.24   0.000     .0519477    .1452878
                   4  |   -.070012   .0250137    -2.80   0.007    -.1202535   -.0197706
                   5  |   .0726146   .0239083     3.04   0.004     .0245934    .1206359
                   6  |   .1212601   .0287051     4.22   0.000     .0636042     .178916
                   7  |   .0005013    .026501     0.02   0.985    -.0527275    .0537302
                   8  |  -.0693834   .0272099    -2.55   0.014    -.1240361   -.0147307
                   9  |  -.2011907   .0282333    -7.13   0.000     -.257899   -.1444823
                  10  |  -.1222851   .0269473    -4.54   0.000    -.1764103   -.0681599
                  11  |   .0775454   .0277343     2.80   0.007     .0218395    .1332513
                      |
                 educ |   .0687201     .00198    34.71   0.000     .0647432     .072697
                exper |   .0420892   .0017744    23.72   0.000     .0385252    .0456532
               exper2 |  -.0006772   .0000915    -7.40   0.000    -.0008611   -.0004934
               exper3 |  -4.32e-06   3.00e-06    -1.44   0.156    -.0000103    1.70e-06
               exper4 |   1.33e-07   3.41e-08     3.90   0.000     6.45e-08    2.01e-07
                 edex |  -.0004449   .0000731    -6.08   0.000    -.0005917    -.000298
                      |
                ee_cl |
                   2  |    -.07347   .0054519   -13.48   0.000    -.0844205   -.0625194
                   3  |  -.0860662    .007019   -12.26   0.000    -.1001642   -.0719683
                   4  |  -.0468899   .0108629    -4.32   0.000    -.0687088   -.0250711
                   5  |   -.137288    .005432   -25.27   0.000    -.1481984   -.1263776
                   6  |  -.1120532   .0063778   -17.57   0.000    -.1248635   -.0992429
                   7  |  -.0896867   .0084313   -10.64   0.000    -.1066214   -.0727519
                   8  |   .0265289   .0119584     2.22   0.031     .0025097     .050548
                   9  |  -.1679571   .0070184   -23.93   0.000    -.1820539   -.1538604
                  10  |  -.1303528   .0083063   -15.69   0.000    -.1470366   -.1136691
                  11  |  -.0778896   .0091742    -8.49   0.000    -.0963165   -.0594628
                  12  |   .0309399   .0130922     2.36   0.022     .0046433    .0572364
                  13  |  -.1124677   .0123879    -9.08   0.000    -.1373496   -.0875858
                  14  |  -.1025299   .0108905    -9.41   0.000    -.1244041   -.0806557
                  15  |  -.0592928   .0111114    -5.34   0.000    -.0816107   -.0369749
                  16  |   .0296106   .0142001     2.09   0.042     .0010889    .0581323
                      |
                 marr |   .1377556   .0024063    57.25   0.000     .1329223    .1425888
                partt |  -.2236458   .0049005   -45.64   0.000    -.2334887   -.2138029
               public |   -.012498   .0071998    -1.74   0.089    -.0269593    .0019633
                 cmsa |   .1454779   .0085081    17.10   0.000     .1283888    .1625669
                      |
                nocc3 |
                   2  |  -.2037845   .0040589   -50.21   0.000    -.2119372   -.1956319
                   3  |  -.3260148   .0037402   -87.16   0.000    -.3335273   -.3185023
                   4  |  -.2666173   .0045483   -58.62   0.000    -.2757529   -.2574817
                      |
              quarter |
                   2  |   .0037689    .001865     2.02   0.049      .000023    .0075148
                   3  |   .0046996   .0018052     2.60   0.012     .0010739    .0083254
                   4  |   .0157843   .0018633     8.47   0.000     .0120417     .019527
                      |
                unemp |  -.0065776   .0019149    -3.44   0.001    -.0104238   -.0027315
                _cons |   .5968118   .0350047    17.05   0.000     .5265028    .6671208
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc3 i.quarter unemp [aw = finalwt1] i
> f female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,732,289,686)

Linear regression                               Number of obs     =    924,344
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4844
                                                Root MSE          =     .40185

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0933439   .0067111   -13.91   0.000    -.1068236   -.0798642
             treat_st |  -.0270086   .0075725    -3.57   0.001    -.0422184   -.0117988
treat_stblackrelwhite |  -.0247286   .0080051    -3.09   0.003    -.0408072   -.0086499
                      |
                state |
                  NH  |    .060043   .0038196    15.72   0.000      .052371    .0677149
                  VT  |   .0435562   .0018618    23.39   0.000     .0398166    .0472957
                  MA  |   .0969686   .0081244    11.94   0.000     .0806503    .1132868
                  RI  |   -.001082   .0082082    -0.13   0.896    -.0175687    .0154047
                  CT  |   .0990718   .0081081    12.22   0.000     .0827863    .1153573
                  NY  |   .0410173   .0076749     5.34   0.000     .0256017    .0564329
                  NJ  |   .1106518   .0087966    12.58   0.000     .0929832    .1283203
                  PA  |  -.0402966   .0065388    -6.16   0.000    -.0534301   -.0271631
                  OH  |  -.0714764   .0062651   -11.41   0.000    -.0840602   -.0588927
                  IN  |  -.0687146   .0046843   -14.67   0.000    -.0781233    -.059306
                  IL  |   .0021495   .0072034     0.30   0.767     -.012319     .016618
                  MI  |  -.0370783   .0067779    -5.47   0.000    -.0506921   -.0234645
                  WI  |  -.0216401   .0045885    -4.72   0.000    -.0308564   -.0124238
                  MN  |   .0332423   .0061569     5.40   0.000     .0208757    .0456089
                  IA  |  -.0411721   .0072339    -5.69   0.000    -.0557018   -.0266425
                  MO  |  -.0808648   .0059159   -13.67   0.000    -.0927472   -.0689824
                  ND  |  -.0601687   .0079328    -7.58   0.000    -.0761021   -.0442353
                  SD  |  -.0787906   .0076626   -10.28   0.000    -.0941814   -.0633999
                  NE  |  -.0700266   .0077499    -9.04   0.000    -.0855927   -.0544606
                  KS  |  -.0641455   .0076397    -8.40   0.000    -.0794902   -.0488007
                  DE  |   .0398275   .0024891    16.00   0.000     .0348279     .044827
                  MD  |   .0986389   .0090678    10.88   0.000     .0804256    .1168522
                  DC  |   .1609809   .0119324    13.49   0.000      .137014    .1849479
                  VA  |   .0548897   .0089334     6.14   0.000     .0369464    .0728329
                  WV  |  -.1524575   .0029677   -51.37   0.000    -.1584183   -.1464968
                  NC  |  -.0304424   .0080859    -3.76   0.000    -.0466834   -.0142014
                  SC  |  -.0642156   .0082855    -7.75   0.000    -.0808575   -.0475737
                  GA  |   .0018617   .0088743     0.21   0.835     -.015963    .0196863
                  FL  |  -.0361456   .0096645    -3.74   0.000    -.0555573   -.0167339
                  KY  |  -.0870812    .004163   -20.92   0.000    -.0954428   -.0787196
                  TN  |  -.0760747   .0083682    -9.09   0.000    -.0928826   -.0592667
                  AL  |  -.0879327   .0082707   -10.63   0.000    -.1045448   -.0713205
                  MS  |  -.1027775   .0083223   -12.35   0.000    -.1194932   -.0860617
                  AR  |  -.1106419   .0076366   -14.49   0.000    -.1259805   -.0953034
                  LA  |  -.0932457   .0092066   -10.13   0.000    -.1117376   -.0747537
                  OK  |  -.1349052   .0062257   -21.67   0.000    -.1474099   -.1224004
                  TX  |  -.0029982   .0092335    -0.32   0.747    -.0215443    .0155479
                  MT  |   -.074238   .0009541   -77.81   0.000    -.0761544   -.0723216
                  ID  |  -.0690017   .0030266   -22.80   0.000    -.0750807   -.0629226
                  WY  |   .0050527   .0076467     0.66   0.512    -.0103062    .0204116
                  CO  |   .0001008   .0079635     0.01   0.990    -.0158944    .0160959
                  NM  |   -.084768   .0049928   -16.98   0.000    -.0947964   -.0747397
                  AZ  |   .0069211   .0095223     0.73   0.471     -.012205    .0260472
                  UT  |  -.0530764   .0087903    -6.04   0.000    -.0707323   -.0354206
                  NV  |   .0505808    .009823     5.15   0.000     .0308508    .0703108
                  WA  |   .0502422   .0074453     6.75   0.000     .0352879    .0651965
                  OR  |  -.0096539   .0069494    -1.39   0.171    -.0236122    .0043043
                  CA  |   .1145105   .0089935    12.73   0.000     .0964466    .1325744
                  AK  |   .1728439   .0054247    31.86   0.000     .1619481    .1837398
                  HI  |   .0659298    .006336    10.41   0.000     .0532036    .0786559
                      |
                 year |
                1990  |  -.0068083   .0023886    -2.85   0.006     -.011606   -.0020106
                1991  |   .0022213   .0034585     0.64   0.524    -.0047254    .0091679
                1992  |   .0215488    .004791     4.50   0.000     .0119258    .0311718
                1993  |   .0146138   .0044427     3.29   0.002     .0056904    .0235372
                1996  |  -.0032827   .0039391    -0.83   0.409    -.0111946    .0046292
                1997  |   .0107835   .0039494     2.73   0.009     .0028509    .0187161
                1998  |   .0416042   .0043569     9.55   0.000     .0328531    .0503554
                1999  |   .0596589   .0042479    14.04   0.000     .0511268     .068191
                2000  |   .0747622   .0046762    15.99   0.000     .0653698    .0841547
                2001  |   .0876639   .0056938    15.40   0.000     .0762275    .0991003
                2002  |   .1050092   .0052079    20.16   0.000     .0945489    .1154695
                2003  |   .1104686   .0056512    19.55   0.000     .0991178    .1218194
                2004  |   .1010263   .0057235    17.65   0.000     .0895304    .1125221
                2005  |   .0894952   .0061214    14.62   0.000     .0771999    .1017905
                2006  |   .0838673   .0051535    16.27   0.000     .0735161    .0942185
                2007  |   .0857324   .0056691    15.12   0.000     .0743456    .0971192
                2008  |   .0805988   .0068605    11.75   0.000     .0668191    .0943785
                2009  |   .1053379   .0088621    11.89   0.000     .0875377     .123138
                2010  |   .1022071   .0077774    13.14   0.000     .0865858    .1178283
                2011  |    .082333   .0068489    12.02   0.000     .0685766    .0960895
                2012  |    .066706   .0064418    10.36   0.000     .0537673    .0796448
                2013  |   .0655451   .0071075     9.22   0.000     .0512692     .079821
                2014  |   .0602358    .006914     8.71   0.000     .0463486    .0741229
                2015  |   .0745304   .0055865    13.34   0.000     .0633095    .0857513
                2016  |   .0859955   .0071536    12.02   0.000     .0716271    .1003638
                2017  |   .0986547   .0080035    12.33   0.000     .0825792    .1147303
                2018  |   .1023616    .008406    12.18   0.000     .0854776    .1192455
                2019  |   .1147239   .0080605    14.23   0.000      .098534    .1309138
                      |
                 nind |
                   2  |   .0737169   .0406557     1.81   0.076    -.0079424    .1553762
                   3  |   .1181023   .0389328     3.03   0.004     .0399035    .1963011
                   4  |  -.0979609   .0393956    -2.49   0.016    -.1770893   -.0188325
                   5  |   .1052571   .0380935     2.76   0.008     .0287441    .1817701
                   6  |   .1036705   .0402352     2.58   0.013     .0228558    .1844852
                   7  |   .0242875   .0415155     0.59   0.561    -.0590988    .1076738
                   8  |   .0028913   .0418684     0.07   0.945    -.0812039    .0869865
                   9  |  -.1932165    .045269    -4.27   0.000    -.2841419   -.1022911
                  10  |  -.0993119   .0401118    -2.48   0.017    -.1798788    -.018745
                  11  |   .0945227   .0443687     2.13   0.038     .0054055      .18364
                      |
                 educ |   .0928967   .0018741    49.57   0.000     .0891324     .096661
                exper |   .0503813     .00215    23.43   0.000      .046063    .0546996
               exper2 |  -.0015334   .0000967   -15.86   0.000    -.0017277   -.0013392
               exper3 |   .0000229   2.88e-06     7.96   0.000     .0000171    .0000287
               exper4 |  -1.11e-07   3.00e-08    -3.69   0.001    -1.71e-07   -5.04e-08
                 edex |  -.0007407   .0000942    -7.86   0.000      -.00093   -.0005514
                      |
                ee_cl |
                   2  |  -.1336768   .0047211   -28.31   0.000    -.1431595   -.1241941
                   3  |  -.1644048   .0061955   -26.54   0.000    -.1768489   -.1519607
                   4  |  -.1806909   .0097406   -18.55   0.000    -.2002554   -.1611263
                   5  |  -.1642095   .0082883   -19.81   0.000    -.1808571   -.1475619
                   6  |  -.1814411   .0076605   -23.69   0.000    -.1968276   -.1660546
                   7  |  -.1752873   .0084691   -20.70   0.000     -.192298   -.1582766
                   8  |  -.1067807   .0102228   -10.45   0.000    -.1273137   -.0862476
                   9  |   -.180117   .0106914   -16.85   0.000    -.2015913   -.1586426
                  10  |  -.1907207   .0100475   -18.98   0.000    -.2109016   -.1705398
                  11  |  -.1657222   .0092639   -17.89   0.000    -.1843292   -.1471151
                  12  |  -.1215062   .0098187   -12.37   0.000    -.1412276   -.1017848
                  13  |  -.1494208   .0154067    -9.70   0.000     -.180366   -.1184755
                  14  |  -.1719473   .0109698   -15.67   0.000    -.1939809   -.1499137
                  15  |  -.1340255   .0098202   -13.65   0.000      -.15375    -.114301
                  16  |  -.1114129   .0111471    -9.99   0.000    -.1338025   -.0890234
                      |
                 marr |   .0406758   .0024635    16.51   0.000     .0357277     .045624
                partt |  -.1432297   .0032291   -44.36   0.000    -.1497156   -.1367438
               public |   .0048631   .0053813     0.90   0.370    -.0059455    .0156717
                 cmsa |   .1558798   .0080651    19.33   0.000     .1396806     .172079
                      |
                nocc3 |
                   2  |  -.2307729   .0033733   -68.41   0.000    -.2375484   -.2239974
                   3  |  -.3111909    .004266   -72.95   0.000    -.3197594   -.3026223
                   4  |  -.3154092   .0067308   -46.86   0.000    -.3289284     -.30189
                      |
              quarter |
                   2  |   .0097724   .0015601     6.26   0.000     .0066389     .012906
                   3  |   .0189381    .001833    10.33   0.000     .0152565    .0226198
                   4  |    .021873   .0012609    17.35   0.000     .0193403    .0244056
                      |
                unemp |  -.0025314   .0015912    -1.59   0.118    -.0057275    .0006646
                _cons |   .2404751   .0407589     5.90   0.000     .1586084    .3223418
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc3 i.quarter unemp [aw = finalwt1] i
> f female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,613,820,660)

Linear regression                               Number of obs     =    189,324
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3340
                                                Root MSE          =     .36301

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1455105   .0122925   -11.84   0.000    -.1702007   -.1208204
             treat_st |  -.0559897   .0324696    -1.72   0.091    -.1212068    .0092274
treat_stblackrelwhite |  -.0186739   .0148552    -1.26   0.215    -.0485114    .0111636
                      |
                state |
                  NH  |    .033912   .0062473     5.43   0.000      .021364    .0464601
                  VT  |   -.025319   .0036249    -6.98   0.000    -.0325998   -.0180381
                  MA  |   .0908308   .0099816     9.10   0.000      .070782    .1108795
                  RI  |   .0312546   .0104045     3.00   0.004     .0103565    .0521526
                  CT  |   .1374019    .009619    14.28   0.000     .1180815    .1567223
                  NY  |   .1078197   .0080051    13.47   0.000     .0917408    .1238985
                  NJ  |   .1786136   .0094679    18.87   0.000     .1595966    .1976305
                  PA  |  -.0015061   .0067811    -0.22   0.825    -.0151263    .0121141
                  OH  |  -.0034322   .0063453    -0.54   0.591    -.0161772    .0093127
                  IN  |   .0172934   .0059561     2.90   0.005     .0053302    .0292566
                  IL  |   .0825908   .0067665    12.21   0.000     .0689999    .0961818
                  MI  |   .0847145   .0069251    12.23   0.000      .070805     .098624
                  WI  |   .0166488   .0058399     2.85   0.006     .0049191    .0283785
                  MN  |   .0575656   .0082416     6.98   0.000     .0410118    .0741194
                  IA  |   .0219841   .0302677     0.73   0.471    -.0388104    .0827786
                  MO  |    .017637   .0069788     2.53   0.015     .0036196    .0316544
                  ND  |   .0356949   .0311093     1.15   0.257    -.0267899    .0981798
                  SD  |  -.0089634   .0300879    -0.30   0.767    -.0693968    .0514699
                  NE  |  -.0180014   .0288305    -0.62   0.535    -.0759092    .0399064
                  KS  |   .0579607   .0297376     1.95   0.057     -.001769    .1176904
                  DE  |    .051935   .0045614    11.39   0.000     .0427732    .0610969
                  MD  |   .1189195   .0093046    12.78   0.000     .1002308    .1376083
                  DC  |   .1331464   .0091048    14.62   0.000     .1148588     .151434
                  VA  |   .1602939   .0300978     5.33   0.000     .0998407    .2207471
                  WV  |  -.0049968     .00743    -0.67   0.504    -.0199204    .0099268
                  NC  |   .0494263   .0319229     1.55   0.128    -.0146928    .1135454
                  SC  |   .0032487    .033132     0.10   0.922    -.0632989    .0697963
                  GA  |   .0953484   .0322665     2.96   0.005     .0305392    .1601576
                  FL  |   .0357136   .0328713     1.09   0.282    -.0303104    .1017375
                  KY  |  -.0304614   .0056689    -5.37   0.000    -.0418477   -.0190752
                  TN  |   .0099557   .0318064     0.31   0.756    -.0539294    .0738407
                  AL  |   .0188107   .0324788     0.58   0.565    -.0464249    .0840463
                  MS  |  -.0062532   .0343882    -0.18   0.856    -.0753239    .0628176
                  AR  |  -.0145406   .0329007    -0.44   0.660    -.0806235    .0515424
                  LA  |   .0611417    .032614     1.87   0.067    -.0043654    .1266488
                  OK  |  -.0424711   .0142289    -2.98   0.004    -.0710508   -.0138914
                  TX  |   .0834044   .0320405     2.60   0.012     .0190492    .1477597
                  MT  |  -.0462491    .003761   -12.30   0.000    -.0538033   -.0386949
                  ID  |  -.0203489   .0031273    -6.51   0.000    -.0266302   -.0140677
                  WY  |   .1909259   .0334997     5.70   0.000     .1236397    .2582121
                  CO  |   .0034224   .0090497     0.38   0.707    -.0147543    .0215992
                  NM  |  -.0415805   .0074339    -5.59   0.000    -.0565119   -.0266491
                  AZ  |   .0726099   .0328911     2.21   0.032     .0065462    .1386737
                  UT  |   .0054488   .0303401     0.18   0.858    -.0554912    .0663887
                  NV  |   .1435584   .0346821     4.14   0.000     .0738974    .2132195
                  WA  |   .1015565   .0077498    13.10   0.000     .0859907    .1171224
                  OR  |   .0235203   .0075282     3.12   0.003     .0083995    .0386411
                  CA  |   .1772163   .0097603    18.16   0.000     .1576121    .1968205
                  AK  |   .2402647   .0078772    30.50   0.000      .224443    .2560865
                  HI  |   .0870067   .0089768     9.69   0.000     .0689762    .1050372
                      |
                 year |
                1990  |  -.0174848    .004931    -3.55   0.001    -.0273889   -.0075806
                1991  |  -.0266704    .006288    -4.24   0.000    -.0393002   -.0140405
                1992  |  -.0234069   .0074394    -3.15   0.003    -.0383493   -.0084645
                1993  |  -.0261474   .0070617    -3.70   0.001    -.0403312   -.0119636
                1996  |  -.0144853   .0060371    -2.40   0.020    -.0266112   -.0023594
                1997  |  -.0059967   .0066396    -0.90   0.371    -.0193327    .0073393
                1998  |   .0029803   .0065749     0.45   0.652    -.0102257    .0161863
                1999  |    .014108   .0068626     2.06   0.045      .000324     .027892
                2000  |   .0109637   .0060289     1.82   0.075    -.0011457    .0230732
                2001  |   .0173428   .0067009     2.59   0.013     .0038836     .030802
                2002  |   .0297905   .0087995     3.39   0.001     .0121161    .0474648
                2003  |   .0391235   .0083325     4.70   0.000     .0223872    .0558598
                2004  |   .0297774   .0064726     4.60   0.000     .0167767    .0427781
                2005  |   .0252086   .0079117     3.19   0.002     .0093175    .0410996
                2006  |   .0201395   .0108558     1.86   0.069     -.001665    .0419441
                2007  |   .0257967   .0124032     2.08   0.043     .0008842    .0507092
                2008  |   .0111082   .0072988     1.52   0.134    -.0035518    .0257682
                2009  |   .0337523   .0118279     2.85   0.006     .0099952    .0575093
                2010  |   .0431362   .0119952     3.60   0.001     .0190432    .0672293
                2011  |    .021888     .01212     1.81   0.077    -.0024558    .0462318
                2012  |   .0053698   .0123951     0.43   0.667    -.0195264     .030266
                2013  |   .0059216   .0105836     0.56   0.578    -.0153361    .0271793
                2014  |   .0105863   .0111241     0.95   0.346    -.0117571    .0329296
                2015  |    .013939   .0098925     1.41   0.165    -.0059306    .0338087
                2016  |   .0132971   .0104504     1.27   0.209    -.0076931    .0342873
                2017  |   .0302476   .0098517     3.07   0.003     .0104599    .0500352
                2018  |   .0291709   .0099532     2.93   0.005     .0091792    .0491625
                2019  |   .0421401   .0108492     3.88   0.000     .0203488    .0639313
                      |
                 nind |
                   2  |   .1001748   .0259574     3.86   0.000     .0480379    .1523117
                   3  |  -.0716038   .0243998    -2.93   0.005    -.1206123   -.0225954
                   4  |  -.2505116   .0284796    -8.80   0.000    -.3077146   -.1933086
                   5  |   .0481025    .023804     2.02   0.049     .0002907    .0959144
                   6  |  -.0674932   .0267798    -2.52   0.015    -.1212821   -.0137043
                   7  |  -.1025643   .0243953    -4.20   0.000    -.1515638   -.0535649
                   8  |  -.1925937   .0271047    -7.11   0.000    -.2470352   -.1381523
                   9  |  -.1762221   .0289397    -6.09   0.000    -.2343492   -.1180951
                  10  |  -.1797479   .0430954    -4.17   0.000    -.2663077   -.0931882
                  11  |   .0751596   .0259592     2.90   0.006      .023019    .1273001
                      |
                 educ |   .0733925   .0042015    17.47   0.000     .0649536    .0818314
                exper |   .0721672   .0025314    28.51   0.000     .0670828    .0772516
               exper2 |  -.0025809   .0001704   -15.14   0.000    -.0029232   -.0022385
               exper3 |   .0000519   4.87e-06    10.66   0.000     .0000421    .0000617
               exper4 |  -4.23e-07   4.75e-08    -8.92   0.000    -5.19e-07   -3.28e-07
                 edex |  -.0008087   .0001072    -7.55   0.000    -.0010239   -.0005934
                      |
                ee_cl |
                   2  |   .0708118   .0171805     4.12   0.000     .0363037    .1053199
                   3  |   .0603018   .0182468     3.30   0.002      .023652    .0969515
                   4  |   .0055996   .0251488     0.22   0.825    -.0449133    .0561125
                   5  |   .0072471   .0219206     0.33   0.742    -.0367817     .051276
                   6  |   .0451547   .0158984     2.84   0.007     .0132218    .0770876
                   7  |   .0582268   .0206024     2.83   0.007     .0168457    .0996079
                   8  |   .0076584   .0230812     0.33   0.741    -.0387016    .0540184
                   9  |     .00022   .0227849     0.01   0.992    -.0455448    .0459848
                  10  |    .031641   .0184632     1.71   0.093    -.0054434    .0687253
                  11  |   .0485943   .0203523     2.39   0.021     .0077155    .0894731
                  12  |   .0517758   .0228934     2.26   0.028      .005793    .0977587
                  13  |   .0351393   .0210505     1.67   0.101    -.0071419    .0774205
                  14  |   .0222499   .0195458     1.14   0.260     -.017009    .0615088
                  15  |   .0438843   .0214806     2.04   0.046     .0007391    .0870294
                  16  |   .0692667   .0211917     3.27   0.002      .026702    .1118314
                      |
                 marr |   .0655066    .002738    23.93   0.000     .0600072    .0710059
                partt |   -.108238   .0178439    -6.07   0.000    -.1440786   -.0723975
               public |  -.0592655   .0078102    -7.59   0.000    -.0749528   -.0435782
                 cmsa |   .1115801   .0111128    10.04   0.000     .0892594    .1339007
                      |
                nocc3 |
                   2  |  -.1867573   .0094029   -19.86   0.000    -.2056435   -.1678711
                   3  |     -.1846   .0088999   -20.74   0.000     -.202476   -.1667239
                   4  |  -.0956512   .0068554   -13.95   0.000    -.1094205   -.0818818
                      |
              quarter |
                   2  |   .0002436   .0028571     0.09   0.932     -.005495    .0059823
                   3  |   .0066234   .0028772     2.30   0.026     .0008443    .0124026
                   4  |   .0103974   .0021266     4.89   0.000     .0061259    .0146689
                      |
                unemp |  -.0030637   .0023659    -1.29   0.201    -.0078158    .0016884
                _cons |   .4985641   .0625939     7.97   0.000     .3728405    .6242877
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc3 i.quarter unemp [aw = finalwt1] i
> f female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,280,703,237)

Linear regression                               Number of obs     =    154,778
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4164
                                                Root MSE          =     .36963

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0632864   .0100077    -6.32   0.000    -.0833874   -.0431853
             treat_st |  -.0602197   .0194559    -3.10   0.003     -.099298   -.0211414
treat_stblackrelwhite |   .0086005     .01581     0.54   0.589    -.0231549    .0403559
                      |
                state |
                  NH  |   .0458455   .0049045     9.35   0.000     .0359944    .0556965
                  VT  |  -.0067591    .002569    -2.63   0.011    -.0119192    -.001599
                  MA  |   .1383884   .0086137    16.07   0.000     .1210873    .1556894
                  RI  |   .1404022   .0093053    15.09   0.000      .121712    .1590924
                  CT  |   .1688099   .0087345    19.33   0.000     .1512661    .1863536
                  NY  |   .1248391   .0079111    15.78   0.000     .1089492    .1407291
                  NJ  |   .2141793    .008641    24.79   0.000     .1968234    .2315353
                  PA  |   .0366166   .0072104     5.08   0.000      .022134    .0510992
                  OH  |   .0177738   .0073567     2.42   0.019     .0029975      .03255
                  IN  |  -.0032397   .0071627    -0.45   0.653    -.0176263    .0111469
                  IL  |   .0375151   .0074235     5.05   0.000     .0226045    .0524257
                  MI  |   .0899601   .0084162    10.69   0.000     .0730555    .1068646
                  WI  |   .0430882   .0062018     6.95   0.000     .0306314    .0555449
                  MN  |   .0906063   .0071373    12.69   0.000     .0762707    .1049419
                  IA  |      .0412   .0185724     2.22   0.031     .0038963    .0785038
                  MO  |   -.045035   .0075368    -5.98   0.000     -.060173   -.0298969
                  ND  |   .0015255   .0189059     0.08   0.936    -.0364482    .0394991
                  SD  |  -.0436826   .0181433    -2.41   0.020    -.0801245   -.0072407
                  NE  |  -.0438833   .0177358    -2.47   0.017    -.0795067   -.0082599
                  KS  |   .0010183   .0178682     0.06   0.955    -.0348711    .0369077
                  DE  |   .1397481   .0063883    21.88   0.000     .1269168    .1525794
                  MD  |   .1706139   .0093771    18.19   0.000     .1517793    .1894484
                  DC  |   .1899372   .0112552    16.88   0.000     .1673305     .212544
                  VA  |    .144686   .0188077     7.69   0.000     .1069096    .1824624
                  WV  |  -.0590987   .0036125   -16.36   0.000    -.0663546   -.0518428
                  NC  |   .0484389   .0191306     2.53   0.015     .0100139    .0868639
                  SC  |   -.034258   .0196129    -1.75   0.087    -.0736518    .0051357
                  GA  |   .0540593   .0195721     2.76   0.008     .0147476    .0933711
                  FL  |   .0506144   .0194012     2.61   0.012      .011646    .0895828
                  KY  |  -.0379291   .0063501    -5.97   0.000    -.0506836   -.0251745
                  TN  |   .0203223   .0189847     1.07   0.290    -.0178096    .0584542
                  AL  |  -.0520916   .0189404    -2.75   0.008    -.0901345   -.0140488
                  MS  |  -.0675807   .0201187    -3.36   0.002    -.1079904    -.027171
                  AR  |  -.0629183   .0192227    -3.27   0.002    -.1015282   -.0243084
                  LA  |  -.0153365    .019678    -0.78   0.439     -.054861    .0241879
                  OK  |  -.1013256    .009595   -10.56   0.000    -.1205977   -.0820535
                  TX  |   .0490648   .0190579     2.57   0.013      .010786    .0873436
                  MT  |  -.0748268   .0029598   -25.28   0.000    -.0807718   -.0688817
                  ID  |  -.0651955   .0029632   -22.00   0.000    -.0711471   -.0592438
                  WY  |   .0964248   .0196162     4.92   0.000     .0570245     .135825
                  CO  |   .0078873   .0089625     0.88   0.383    -.0101145    .0258891
                  NM  |  -.0591274   .0050922   -11.61   0.000    -.0693553   -.0488994
                  AZ  |   .0566005   .0202788     2.79   0.007     .0158694    .0973317
                  UT  |   .0000479   .0194213     0.00   0.998     -.038961    .0390567
                  NV  |   .1548374   .0222011     6.97   0.000     .1102451    .1994296
                  WA  |   .0925602   .0084749    10.92   0.000     .0755379    .1095825
                  OR  |    .021331   .0071747     2.97   0.005     .0069201    .0357419
                  CA  |   .1948584   .0084217    23.14   0.000     .1779428     .211774
                  AK  |   .2338339   .0050285    46.50   0.000      .223734    .2439339
                  HI  |   .0800949   .0072247    11.09   0.000     .0655837    .0946061
                      |
                 year |
                1990  |  -.0007997   .0053296    -0.15   0.881    -.0115046    .0099051
                1991  |  -.0065391   .0079884    -0.82   0.417    -.0225844    .0095061
                1992  |   .0046172   .0107155     0.43   0.668    -.0169056      .02614
                1993  |   .0137767    .009086     1.52   0.136     -.004473    .0320264
                1996  |    .020034   .0083593     2.40   0.020     .0032439     .036824
                1997  |    .021393   .0068146     3.14   0.003     .0077056    .0350804
                1998  |   .0400459   .0066539     6.02   0.000     .0266811    .0534107
                1999  |   .0437886   .0062335     7.02   0.000     .0312681     .056309
                2000  |   .0357913   .0077247     4.63   0.000     .0202758    .0513067
                2001  |   .0508995    .007198     7.07   0.000     .0364418    .0653571
                2002  |   .0611257   .0068401     8.94   0.000     .0473871    .0748644
                2003  |    .049295   .0062304     7.91   0.000     .0367808    .0618092
                2004  |   .0420868   .0081368     5.17   0.000     .0257435    .0584301
                2005  |   .0370429     .00867     4.27   0.000     .0196287    .0544571
                2006  |   .0368405   .0082409     4.47   0.000     .0202881    .0533929
                2007  |   .0308957   .0083019     3.72   0.001     .0142208    .0475706
                2008  |   .0262098   .0122644     2.14   0.038      .001576    .0508435
                2009  |   .0563114   .0144979     3.88   0.000     .0271915    .0854314
                2010  |   .0639987   .0146458     4.37   0.000     .0345817    .0934156
                2011  |   .0389631   .0132576     2.94   0.005     .0123344    .0655919
                2012  |   .0100589   .0118786     0.85   0.401    -.0137999    .0339177
                2013  |   .0221697   .0107266     2.07   0.044     .0006247    .0437147
                2014  |    .007222   .0176206     0.41   0.684      -.02817     .042614
                2015  |   .0201847   .0129387     1.56   0.125    -.0058034    .0461728
                2016  |   .0295892   .0082177     3.60   0.001     .0130834    .0460949
                2017  |   .0122924   .0124858     0.98   0.330    -.0127862    .0373709
                2018  |   .0131058   .0106889     1.23   0.226    -.0083636    .0345751
                2019  |   .0196009   .0090251     2.17   0.035     .0014734    .0377283
                      |
                 nind |
                   2  |   .1442209   .0524353     2.75   0.008     .0389014    .2495404
                   3  |   .0052382   .0460828     0.11   0.910    -.0873219    .0977982
                   4  |  -.2514414    .061796    -4.07   0.000    -.3755622   -.1273205
                   5  |   .1354473   .0483788     2.80   0.007     .0382756    .2326191
                   6  |  -.0368398   .0537865    -0.68   0.497    -.1448732    .0711936
                   7  |  -.1062191   .0517155    -2.05   0.045    -.2100927   -.0023454
                   8  |  -.0754764    .060777    -1.24   0.220    -.1975506    .0465977
                   9  |  -.2283632   .0533898    -4.28   0.000    -.3355998   -.1211266
                  10  |  -.1624536   .0665016    -2.44   0.018     -.296026   -.0288811
                  11  |   .0128132   .0533065     0.24   0.811    -.0942561    .1198825
                      |
                 educ |   .1037148   .0053375    19.43   0.000     .0929941    .1144356
                exper |   .0522757   .0034469    15.17   0.000     .0453523    .0591991
               exper2 |  -.0018573   .0002701    -6.88   0.000    -.0023998   -.0013148
               exper3 |   .0000343   9.31e-06     3.68   0.001     .0000156     .000053
               exper4 |  -2.45e-07   1.04e-07    -2.36   0.022    -4.54e-07   -3.65e-08
                 edex |  -.0004892   .0001225    -3.99   0.000    -.0007352   -.0002432
                      |
                ee_cl |
                   2  |  -.0534873    .013209    -4.05   0.000    -.0800183   -.0269562
                   3  |  -.1018154   .0172538    -5.90   0.000    -.1364707   -.0671601
                   4  |  -.1643749   .0312055    -5.27   0.000     -.227053   -.1016968
                   5  |  -.0719515   .0208362    -3.45   0.001    -.1138022   -.0301008
                   6  |  -.0816056   .0167702    -4.87   0.000    -.1152895   -.0479218
                   7  |  -.1144256   .0212121    -5.39   0.000    -.1570313   -.0718198
                   8  |  -.1602352   .0336824    -4.76   0.000    -.2278883    -.092582
                   9  |  -.0441487   .0163688    -2.70   0.010    -.0770264    -.011271
                  10  |  -.0974435   .0223899    -4.35   0.000     -.142415   -.0524721
                  11  |  -.1235312   .0231393    -5.34   0.000    -.1700079   -.0770546
                  12  |  -.1360312   .0299909    -4.54   0.000    -.1962698   -.0757926
                  13  |  -.0006463   .0201669    -0.03   0.975    -.0411527    .0398601
                  14  |  -.0898172   .0208682    -4.30   0.000    -.1317322   -.0479021
                  15  |  -.0910243   .0245609    -3.71   0.001    -.1403563   -.0416923
                  16  |  -.1046182    .030466    -3.43   0.001     -.165811   -.0434254
                      |
                 marr |   .0073325   .0035456     2.07   0.044     .0002109     .014454
                partt |  -.0520039   .0076456    -6.80   0.000    -.0673606   -.0366473
               public |   .0038772   .0147127     0.26   0.793    -.0256742    .0334285
                 cmsa |   .1243436   .0094569    13.15   0.000      .105349    .1433383
                      |
                nocc3 |
                   2  |  -.2101602   .0073721   -28.51   0.000    -.2249676   -.1953528
                   3  |   -.281734   .0150066   -18.77   0.000    -.3118755   -.2515924
                   4  |  -.1919214   .0095818   -20.03   0.000    -.2111671   -.1726758
                      |
              quarter |
                   2  |    .004768   .0029318     1.63   0.110    -.0011208    .0106568
                   3  |   .0144911   .0027229     5.32   0.000     .0090221    .0199602
                   4  |   .0190538   .0027438     6.94   0.000     .0135427     .024565
                      |
                unemp |  -.0016353   .0015355    -1.07   0.292    -.0047195    .0014488
                _cons |   .1584152   .0546404     2.90   0.006     .0486667    .2681637
---------------------------------------------------------------------------------------

. 
. ** RIF-DiD with nocc3
. qui tab state,   gen(dumstate)

. qui tab year,    gen(dumyear)

. qui tab nind,    gen(dumnind)

. qui tab ee_cl,   gen(dumee_cl)

. qui tab nocc3,   gen(dumnocc3)

. qui tab quarter, gen(dumquarter)

. 
. ** note collinearity from dummy variable trap ?
. ** with quarter fe 
. forvalues qt = 20(30)80{
  2.         di "men at `qt' quantile"
  3.         rifreg lwage3 blackrelwhite treat_st treat_stblackrelwhite dumstate* dumyear* dumni
> nd* educ exper exper2 exper3 exper4 edex dumee_cl* marr partt public cmsa dumnocc3* dumquarter
> * unemp if female == 0 [w = finalwt1], q(`qt') bootstrap reps(200)
  4.         
.         di "women at `qt' quantile"
  5.         rifreg lwage3 blackrelwhite treat_st treat_stblackrelwhite dumstate* dumyear* dumni
> nd* educ exper exper2 exper3 exper4 edex dumee_cl* marr partt public cmsa dumnocc3* dumquarter
> * unemp if female == 1 [w = finalwt1], q(`qt') bootstrap reps(200)
  6.         
.         di "men not covered by union at `qt' quantile"
  7.         rifreg lwage3 blackrelwhite treat_st treat_stblackrelwhite dumstate* dumyear* dumni
> nd* educ exper exper2 exper3 exper4 edex dumee_cl* marr partt public cmsa dumnocc3* dumquarter
> * unemp if female == 0 & covered == 0 [w = finalwt1], q(`qt') bootstrap reps(200)
  8.         
.         di "women not covered by union at `qt' quantile"
  9.         rifreg lwage3 blackrelwhite treat_st treat_stblackrelwhite dumstate* dumyear* dumni
> nd* educ exper exper2 exper3 exper4 edex dumee_cl* marr partt public cmsa dumnocc3* dumquarter
> * unemp if female == 1 & covered == 0 [w = finalwt1], q(`qt') bootstrap reps(200)
 10.         
.         di "men covered by union at `qt' quantile"
 11.         rifreg lwage3 blackrelwhite treat_st treat_stblackrelwhite dumstate* dumyear* dumni
> nd* educ exper exper2 exper3 exper4 edex dumee_cl* marr partt public cmsa dumnocc3* dumquarter
> * unemp if female == 0 & covered == 1 [w = finalwt1], q(`qt') bootstrap reps(200)
 12. 
.         di "women covered by union at `qt' quantile"
 13.         rifreg lwage3 blackrelwhite treat_st treat_stblackrelwhite dumstate* dumyear* dumni
> nd* educ exper exper2 exper3 exper4 edex dumee_cl* marr partt public cmsa dumnocc3* dumquarter
> * unemp if female == 1 & covered == 1 [w = finalwt1], q(`qt') bootstrap reps(200)             
>  
 14. }
men at 20 quantile
(analytic weights assumed)
note: dumstate51 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter4 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs = 1069714
-------------+------------------------------           F(123,1069590) = 4175.84
       Model |  311592.222   123   2533.2701           Prob > F      =  0.0000
    Residual |  564969.169 1069590  .528210968         R-squared     =  0.3555
-------------+------------------------------           Adj R-squared =  0.3554
       Total |  876561.392 1069713  .819436047         Root MSE      =  .72678
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1637152   .0046265   -35.39   0.000    -.1727829   -.1546475
             treat_st |  -.0175212    .006208    -2.82   0.005    -.0296886   -.0053537
treat_stblackrelwhite |   -.121184   .0065342   -18.55   0.000    -.1339907   -.1083772
            dumstate1 |  -.0986648    .044124    -2.24   0.025    -.1851464   -.0121833
            dumstate2 |  -.0085799   .0443661    -0.19   0.847     -.095536    .0783762
            dumstate3 |  -.0312304   .0442438    -0.71   0.480    -.1179467    .0554859
            dumstate4 |  -.0249337   .0433195    -0.58   0.565    -.1098385     .059971
            dumstate5 |  -.0719236   .0440013    -1.63   0.102    -.1581647    .0143176
            dumstate6 |  -.0369131   .0433915    -0.85   0.395     -.121959    .0481328
            dumstate7 |  -.0920057   .0433736    -2.12   0.034    -.1770165   -.0069948
            dumstate8 |  -.0483517   .0437122    -1.11   0.269    -.1340262    .0373228
            dumstate9 |  -.1305278   .0439238    -2.97   0.003     -.216617   -.0444386
           dumstate10 |  -.1550271   .0437276    -3.55   0.000    -.2407318   -.0693225
           dumstate11 |  -.1121394   .0431797    -2.60   0.009    -.1967702   -.0275085
           dumstate12 |  -.0942213   .0432404    -2.18   0.029     -.178971   -.0094715
           dumstate13 |  -.1175284   .0429681    -2.74   0.006    -.2017444   -.0333124
           dumstate14 |  -.0808864   .0433286    -1.87   0.062     -.165809    .0040361
           dumstate15 |  -.0620023   .0436557    -1.42   0.156     -.147566    .0235614
           dumstate16 |  -.0863311   .0432913    -1.99   0.046    -.1711806   -.0014816
           dumstate17 |   -.183292   .0433571    -4.23   0.000    -.2682704   -.0983135
           dumstate18 |  -.1196918   .0441138    -2.71   0.007    -.2061534   -.0332303
           dumstate19 |  -.1912518     .04335    -4.41   0.000    -.2762163   -.1062872
           dumstate20 |  -.1821368    .044132    -4.13   0.000    -.2686341   -.0956395
           dumstate21 |  -.1784181   .0430834    -4.14   0.000    -.2628601   -.0939762
           dumstate22 |  -.0824526   .0441717    -1.87   0.062    -.1690275    .0041224
           dumstate23 |  -.0610566   .0439737    -1.39   0.165    -.1472435    .0251303
           dumstate24 |   -.024121   .0436441    -0.55   0.580     -.109662      .06142
           dumstate25 |  -.0822395    .043488    -1.89   0.059    -.1674745    .0029956
           dumstate26 |  -.2766028   .0447842    -6.18   0.000    -.3643783   -.1888274
           dumstate27 |  -.1553515   .0437758    -3.55   0.000    -.2411506   -.0695524
           dumstate28 |  -.1422036   .0440209    -3.23   0.001     -.228483   -.0559242
           dumstate29 |  -.0862148   .0429098    -2.01   0.045    -.1703165   -.0021131
           dumstate30 |  -.1709475   .0432117    -3.96   0.000    -.2556409    -.086254
           dumstate31 |   -.207835   .0439582    -4.73   0.000    -.2939915   -.1216785
           dumstate32 |  -.2189106    .043018    -5.09   0.000    -.3032245   -.1345967
           dumstate33 |  -.2068194   .0439526    -4.71   0.000     -.292965   -.1206739
           dumstate34 |  -.2447868   .0437001    -5.60   0.000    -.3304375    -.159136
           dumstate35 |  -.3067931   .0442714    -6.93   0.000    -.3935635   -.2200227
           dumstate36 |  -.1594371   .0445121    -3.58   0.000    -.2466793    -.072195
           dumstate37 |  -.2528856   .0436159    -5.80   0.000    -.3383713   -.1673999
           dumstate38 |   -.120824   .0425541    -2.84   0.005    -.2042285   -.0374194
           dumstate39 |  -.1666583   .0448939    -3.71   0.000    -.2546488   -.0786677
           dumstate40 |  -.1695776   .0442226    -3.83   0.000    -.2562523   -.0829028
           dumstate41 |   .0211893   .0436768     0.49   0.628    -.0644158    .1067943
           dumstate42 |  -.0965551   .0438907    -2.20   0.028    -.1825795   -.0105308
           dumstate43 |  -.2106838   .0448976    -4.69   0.000    -.2986815   -.1226861
           dumstate44 |  -.1322109    .043781    -3.02   0.003    -.2180202   -.0464015
           dumstate45 |  -.1452567   .0431879    -3.36   0.001    -.2299036   -.0606099
           dumstate46 |  -.0086839   .0435989    -0.20   0.842    -.0941362    .0767684
           dumstate47 |  -.0358482   .0435807    -0.82   0.411    -.1212649    .0495685
           dumstate48 |  -.0951522   .0431194    -2.21   0.027    -.1796647   -.0106397
           dumstate49 |  -.0362153   .0434225    -0.83   0.404     -.121322    .0488914
           dumstate50 |   .0745706   .0434149     1.72   0.086     -.010521    .1596623
           dumstate51 |          0   .0431396     0.00   1.000    -.0845521    .0845521
             dumyear1 |  -.0784577   .0242898    -3.23   0.001    -.1260649   -.0308505
             dumyear2 |  -.0674987   .0241263    -2.80   0.005    -.1147854    -.020212
             dumyear3 |  -.0967939   .0244677    -3.96   0.000    -.1447498    -.048838
             dumyear4 |  -.1055592   .0245399    -4.30   0.000    -.1536567   -.0574618
             dumyear5 |  -.1412433   .0245933    -5.74   0.000    -.1894452   -.0930413
             dumyear6 |  -.1328044   .0249544    -5.32   0.000    -.1817142   -.0838945
             dumyear7 |  -.1085562   .0242864    -4.47   0.000    -.1561568   -.0609556
             dumyear8 |  -.0828878   .0246598    -3.36   0.001    -.1312202   -.0345554
             dumyear9 |  -.0470119   .0248269    -1.89   0.058    -.0956717     .001648
            dumyear10 |  -.0502744   .0250707    -2.01   0.045    -.0994122   -.0011367
            dumyear11 |  -.0264449   .0244534    -1.08   0.280    -.0743728     .021483
            dumyear12 |  -.0059192   .0246726    -0.24   0.810    -.0542767    .0424382
            dumyear13 |  -.0048078   .0243086    -0.20   0.843    -.0524518    .0428361
            dumyear14 |  -.0056421   .0247429    -0.23   0.820    -.0541374    .0428533
            dumyear15 |  -.0660286   .0244739    -2.70   0.007    -.1139967   -.0180605
            dumyear16 |  -.0662589   .0247745    -2.67   0.007    -.1148162   -.0177017
            dumyear17 |  -.0505657   .0248523    -2.03   0.042    -.0992754   -.0018561
            dumyear18 |  -.0610609   .0252178    -2.42   0.015    -.1104869   -.0116349
            dumyear19 |  -.0323334   .0253386    -1.28   0.202    -.0819962    .0173294
            dumyear20 |  -.0448891   .0246723    -1.82   0.069    -.0932459    .0034677
            dumyear21 |  -.0664718   .0248167    -2.68   0.007    -.1151117   -.0178319
            dumyear22 |  -.0944138   .0253617    -3.72   0.000    -.1441218   -.0447058
            dumyear23 |  -.0987636   .0241498    -4.09   0.000    -.1460964   -.0514307
            dumyear24 |  -.0881721   .0245155    -3.60   0.000    -.1362217   -.0401225
            dumyear25 |  -.0741574   .0262963    -2.82   0.005    -.1256973   -.0226176
            dumyear26 |  -.0775593   .0247319    -3.14   0.002    -.1260331   -.0290856
            dumyear27 |  -.0579544   .0252748    -2.29   0.022    -.1074922   -.0084167
            dumyear28 |  -.0412167   .0243237    -1.69   0.090    -.0888904     .006457
            dumyear29 |          0   .0242037     0.00   1.000    -.0474385    .0474385
             dumnind1 |   .0392721   .0201506     1.95   0.051    -.0002224    .0787667
             dumnind2 |   .3457801   .0208393    16.59   0.000     .3049358    .3866245
             dumnind3 |   .2885698   .0205953    14.01   0.000     .2482037    .3289358
             dumnind4 |   .0093697   .0200234     0.47   0.640    -.0298755    .0486149
             dumnind5 |    .294086   .0204988    14.35   0.000      .253909    .3342629
             dumnind6 |   .2316584   .0207983    11.14   0.000     .1908945    .2724224
             dumnind7 |   .1203095   .0203477     5.91   0.000     .0804287    .1601903
             dumnind8 |   .0966373   .0207801     4.65   0.000     .0559089    .1373656
             dumnind9 |   .0893725    .020662     4.33   0.000     .0488757    .1298692
            dumnind10 |          0   .0203338     0.00   1.000    -.0398535    .0398535
            dumnind11 |   .3168322   .0204695    15.48   0.000     .2767127    .3569517
                 educ |   .0548656   .0019346    28.36   0.000     .0510738    .0586573
                exper |   .1367603   .0018019    75.90   0.000     .1332286     .140292
               exper2 |  -.0067871   .0001435   -47.30   0.000    -.0070684   -.0065059
               exper3 |   .0001687   4.79e-06    35.24   0.000     .0001593    .0001781
               exper4 |  -1.54e-06   5.26e-08   -29.34   0.000    -1.65e-06   -1.44e-06
                 edex |  -.0013352    .000075   -17.80   0.000    -.0014822   -.0011881
            dumee_cl1 |  -.0288402   .0218068    -1.32   0.186    -.0715808    .0139004
            dumee_cl2 |    .052957   .0205098     2.58   0.010     .0127585    .0931556
            dumee_cl3 |    .213275   .0200156    10.66   0.000     .1740452    .2525049
            dumee_cl4 |   .4627993   .0205304    22.54   0.000     .4225604    .5030382
            dumee_cl5 |  -.1197393   .0228111    -5.25   0.000    -.1644484   -.0750303
            dumee_cl6 |   .1757662   .0196277     8.96   0.000     .1372966    .2142358
            dumee_cl7 |   .2937602   .0201161    14.60   0.000     .2543333    .3331872
            dumee_cl8 |   .2576773   .0208604    12.35   0.000     .2167916     .298563
            dumee_cl9 |  -.0381291   .0218156    -1.75   0.081    -.0808869    .0046287
           dumee_cl10 |   .2217889   .0192567    11.52   0.000     .1840464    .2595314
           dumee_cl11 |   .3020651   .0193957    15.57   0.000     .2640502    .3400799
           dumee_cl12 |   .2521207   .0207248    12.17   0.000     .2115008    .2927407
           dumee_cl13 |          0   .0188904     0.00   1.000    -.0370245    .0370245
           dumee_cl14 |   .2209192   .0191362    11.54   0.000     .1834128    .2584256
           dumee_cl15 |   .2804203    .019917    14.08   0.000     .2413837    .3194569
           dumee_cl16 |   .2748794   .0209059    13.15   0.000     .2339044    .3158543
                 marr |   .1515995   .0018913    80.16   0.000     .1478926    .1553065
                partt |  -.5578094   .0053474  -104.31   0.000    -.5682902   -.5473286
               public |   .0670658   .0032583    20.58   0.000     .0606796    .0734519
                 cmsa |   .1579857   .0023958    65.94   0.000     .1532901    .1626814
            dumnocc31 |   .1326018   .0902763     1.47   0.142    -.0443366    .3095403
            dumnocc32 |          0   .0904876     0.00   1.000    -.1773526    .1773526
            dumnocc33 |  -.1804489    .090814    -1.99   0.047    -.3584413   -.0024566
            dumnocc34 |   .0307435   .0903983     0.34   0.734     -.146434    .2079211
          dumquarter1 |  -.0033087   .0053096    -0.62   0.533    -.0137153    .0070979
          dumquarter2 |  -.0026841   .0052587    -0.51   0.610    -.0129909    .0076228
          dumquarter3 |          0   .0052433     0.00   1.000    -.0102766    .0102766
          dumquarter4 |   .0101938   .0054302     1.88   0.060    -.0004491    .0208368
                unemp |  -.0053784   .0010649    -5.05   0.000    -.0074656   -.0032912
                _cons |  -.4217258   .1106216    -3.81   0.000    -.6385404   -.2049112
---------------------------------------------------------------------------------------
women at 20 quantile
(analytic weights assumed)
note: dumstate51 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind2 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc34 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs = 1080778
-------------+------------------------------           F(123,1080654) = 3238.77
       Model |  159631.255   123  1297.81508           Prob > F      =  0.0000
    Residual |  348571.376 1080654  .322555949         R-squared     =  0.3141
-------------+------------------------------           Adj R-squared =  0.3140
       Total |  508202.631 1080777  .470219695         Root MSE      =  .56794
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0543377    .003204   -16.96   0.000    -.0606173    -.048058
             treat_st |  -.0023602   .0052413    -0.45   0.652     -.012633    .0079125
treat_stblackrelwhite |  -.0933248   .0040885   -22.83   0.000    -.1013381   -.0853114
            dumstate1 |  -.0125623   .0183745    -0.68   0.494    -.0485756    .0234511
            dumstate2 |   .0149124   .0181773     0.82   0.412    -.0207144    .0505393
            dumstate3 |   .0394811   .0181234     2.18   0.029     .0039598    .0750024
            dumstate4 |  -.0094519    .017652    -0.54   0.592    -.0440491    .0251454
            dumstate5 |  -.0628706    .018098    -3.47   0.001    -.0983422   -.0273991
            dumstate6 |  -.0293382   .0181468    -1.62   0.106    -.0649054     .006229
            dumstate7 |  -.0962536   .0174955    -5.50   0.000    -.1305442   -.0619631
            dumstate8 |  -.0647901   .0178014    -3.64   0.000    -.0996802   -.0298999
            dumstate9 |  -.1360839    .017652    -7.71   0.000    -.1706812   -.1014866
           dumstate10 |  -.1601472   .0174135    -9.20   0.000    -.1942771   -.1260173
           dumstate11 |  -.1465344   .0182753    -8.02   0.000    -.1823534   -.1107154
           dumstate12 |  -.1213714   .0178746    -6.79   0.000    -.1564049   -.0863378
           dumstate13 |  -.1270063   .0178108    -7.13   0.000    -.1619149   -.0920976
           dumstate14 |  -.0663272   .0184042    -3.60   0.000    -.1023988   -.0302557
           dumstate15 |  -.0308842    .017616    -1.75   0.080    -.0654111    .0036426
           dumstate16 |  -.1129427   .0194513    -5.81   0.000    -.1510667   -.0748187
           dumstate17 |  -.1840364    .018153   -10.14   0.000    -.2196156   -.1484572
           dumstate18 |  -.1562366   .0194728    -8.02   0.000    -.1944026   -.1180706
           dumstate19 |   -.161418   .0192667    -8.38   0.000    -.1991802   -.1236558
           dumstate20 |  -.1657921   .0191876    -8.64   0.000    -.2033992   -.1281849
           dumstate21 |  -.1839517   .0187279    -9.82   0.000    -.2206578   -.1472457
           dumstate22 |  -.0200384   .0177913    -1.13   0.260    -.0549087    .0148318
           dumstate23 |  -.0830166   .0184988    -4.49   0.000    -.1192736   -.0467595
           dumstate24 |  -.0659162   .0182579    -3.61   0.000     -.101701   -.0301313
           dumstate25 |  -.1231981   .0186102    -6.62   0.000    -.1596736   -.0867226
           dumstate26 |  -.3270294   .0193721   -16.88   0.000    -.3649981   -.2890608
           dumstate27 |  -.1496391   .0191863    -7.80   0.000    -.1872436   -.1120346
           dumstate28 |  -.1920191   .0188224   -10.20   0.000    -.2289103   -.1551279
           dumstate29 |  -.1364377   .0186051    -7.33   0.000     -.172903   -.0999723
           dumstate30 |  -.1448515   .0190287    -7.61   0.000     -.182147   -.1075559
           dumstate31 |  -.2050926   .0183924   -11.15   0.000    -.2411411    -.169044
           dumstate32 |  -.2048051   .0189063   -10.83   0.000    -.2418609   -.1677493
           dumstate33 |  -.2632488   .0197768   -13.31   0.000    -.3020108   -.2244869
           dumstate34 |  -.2905984    .019178   -15.15   0.000    -.3281867   -.2530102
           dumstate35 |  -.2863768   .0190883   -15.00   0.000    -.3237892   -.2489644
           dumstate36 |  -.2711814   .0199811   -13.57   0.000    -.3103436   -.2320191
           dumstate37 |  -.2635231   .0187445   -14.06   0.000    -.3002617   -.2267845
           dumstate38 |  -.1652906   .0185966    -8.89   0.000    -.2017394   -.1288418
           dumstate39 |  -.1373131   .0181459    -7.57   0.000    -.1728785   -.1017476
           dumstate40 |  -.1596617   .0187553    -8.51   0.000    -.1964214    -.122902
           dumstate41 |  -.0937878   .0188463    -4.98   0.000     -.130726   -.0568497
           dumstate42 |  -.0965486   .0183682    -5.26   0.000    -.1325496   -.0605476
           dumstate43 |  -.2026095   .0192148   -10.54   0.000    -.2402699   -.1649492
           dumstate44 |  -.1095436   .0190172    -5.76   0.000    -.1468167   -.0722706
           dumstate45 |  -.1423594   .0186809    -7.62   0.000    -.1789732   -.1057455
           dumstate46 |  -.0208654   .0189012    -1.10   0.270    -.0579112    .0161804
           dumstate47 |  -.0231011   .0173752    -1.33   0.184     -.057156    .0109537
           dumstate48 |  -.0627073   .0182229    -3.44   0.001    -.0984235   -.0269911
           dumstate49 |  -.0514748   .0177014    -2.91   0.004     -.086169   -.0167807
           dumstate50 |   .0892677   .0175532     5.09   0.000      .054864    .1236713
           dumstate51 |          0   .0183897     0.00   1.000    -.0360432    .0360432
             dumyear1 |  -.0770228   .0053745   -14.33   0.000    -.0875566    -.066489
             dumyear2 |  -.0769964   .0054774   -14.06   0.000    -.0877319    -.066261
             dumyear3 |   -.055069   .0053798   -10.24   0.000    -.0656132   -.0445248
             dumyear4 |   -.086816   .0049893   -17.40   0.000    -.0965949   -.0770371
             dumyear5 |  -.0969136   .0052007   -18.63   0.000    -.1071068   -.0867205
             dumyear6 |  -.0855605    .005851   -14.62   0.000    -.0970282   -.0740928
             dumyear7 |  -.0639642   .0056178   -11.39   0.000    -.0749749   -.0529535
             dumyear8 |  -.0622701   .0053746   -11.59   0.000    -.0728042    -.051736
             dumyear9 |  -.0273317   .0053135    -5.14   0.000     -.037746   -.0169175
            dumyear10 |   .0047904   .0057386     0.83   0.404    -.0064571     .016038
            dumyear11 |  -.0016714   .0055492    -0.30   0.763    -.0125477    .0092049
            dumyear12 |   .0203111   .0053803     3.78   0.000     .0097659    .0308563
            dumyear13 |   .0413002   .0189274     2.18   0.029     .0042032    .0783973
            dumyear14 |   .0044262   .0055577     0.80   0.426    -.0064666    .0153191
            dumyear15 |  -.0065721   .0054442    -1.21   0.227    -.0172426    .0040984
            dumyear16 |   -.016493   .0062272    -2.65   0.008    -.0286981    -.004288
            dumyear17 |  -.0246641   .0079413    -3.11   0.002    -.0402288   -.0090993
            dumyear18 |  -.0208914   .0051664    -4.04   0.000    -.0310173   -.0107656
            dumyear19 |   .0005936   .0053686     0.11   0.912    -.0099287    .0111159
            dumyear20 |          0   .0046701     0.00   1.000    -.0091532    .0091532
            dumyear21 |  -.0249565   .0059352    -4.20   0.000    -.0365893   -.0133237
            dumyear22 |  -.0337989   .0053872    -6.27   0.000    -.0443577   -.0232401
            dumyear23 |  -.0780983   .0057772   -13.52   0.000    -.0894214   -.0667751
            dumyear24 |  -.0830522   .0059482   -13.96   0.000    -.0947105    -.071394
            dumyear25 |  -.0674793   .0057547   -11.73   0.000    -.0787583   -.0562003
            dumyear26 |  -.0447156   .0057706    -7.75   0.000    -.0560257   -.0334055
            dumyear27 |  -.0223071   .0057419    -3.88   0.000     -.033561   -.0110532
            dumyear28 |   .0017398   .0059065     0.29   0.768    -.0098367    .0133163
            dumyear29 |     .00228   .0045951     0.50   0.620    -.0067262    .0112862
             dumnind1 |  -.1549941   .0781081    -1.98   0.047    -.3080834   -.0019049
             dumnind2 |          0   .0782275     0.00   1.000    -.1533233    .1533233
             dumnind3 |   .0003174   .0781039     0.00   0.997    -.1527635    .1533984
             dumnind4 |  -.2974917   .0781673    -3.81   0.000    -.4506968   -.1442865
             dumnind5 |   .0013173   .0783219     0.02   0.987    -.1521911    .1548256
             dumnind6 |  -.0106983    .078164    -0.14   0.891    -.1638972    .1425005
             dumnind7 |  -.0964148   .0783238    -1.23   0.218    -.2499268    .0570973
             dumnind8 |  -.0706399     .07812    -0.90   0.366    -.2237525    .0824726
             dumnind9 |  -.1784485   .0781764    -2.28   0.022    -.3316716   -.0252254
            dumnind10 |  -.2393106   .0779615    -3.07   0.002    -.3921126   -.0865087
            dumnind11 |  -.0313624   .0781723    -0.40   0.688    -.1845775    .1218527
                 educ |   .0502442   .0013799    36.41   0.000     .0475396    .0529488
                exper |   .0982796   .0015176    64.76   0.000     .0953052     .101254
               exper2 |  -.0051134   .0001068   -47.89   0.000    -.0053227   -.0049041
               exper3 |   .0001348   3.66e-06    36.79   0.000     .0001276     .000142
               exper4 |  -1.26e-06   4.11e-08   -30.66   0.000    -1.34e-06   -1.18e-06
                 edex |  -.0012684   .0000571   -22.22   0.000    -.0013803   -.0011566
            dumee_cl1 |          0   .0150843     0.00   1.000    -.0295647    .0295647
            dumee_cl2 |   .1478069    .014335    10.31   0.000     .1197107    .1759031
            dumee_cl3 |     .27705   .0142225    19.48   0.000     .2491744    .3049255
            dumee_cl4 |   .3800796   .0145699    26.09   0.000     .3515231    .4086361
            dumee_cl5 |  -.0805757   .0173127    -4.65   0.000     -.114508   -.0466434
            dumee_cl6 |   .1973549   .0140101    14.09   0.000     .1698957    .2248142
            dumee_cl7 |   .2959962   .0140711    21.04   0.000     .2684173    .3235751
            dumee_cl8 |    .263118   .0144106    18.26   0.000     .2348738    .2913623
            dumee_cl9 |  -.0128917   .0161337    -0.80   0.424    -.0445133    .0187299
           dumee_cl10 |   .2280994   .0135958    16.78   0.000     .2014521    .2547467
           dumee_cl11 |   .3052205   .0136363    22.38   0.000     .2784937    .3319473
           dumee_cl12 |   .2908292   .0144527    20.12   0.000     .2625023     .319156
           dumee_cl13 |  -.0188127   .0148888    -1.26   0.206    -.0479942    .0103689
           dumee_cl14 |   .2211216    .013753    16.08   0.000     .1941661     .248077
           dumee_cl15 |   .2963204   .0139457    21.25   0.000     .2689873    .3236535
           dumee_cl16 |   .3116378   .0145686    21.39   0.000      .283084    .3401917
                 marr |   .0464027   .0014263    32.53   0.000     .0436073    .0491982
                partt |  -.2642608   .0023323  -113.30   0.000     -.268832   -.2596896
               public |   .0456333   .0023799    19.17   0.000     .0409687    .0502978
                 cmsa |   .1731786   .0021035    82.33   0.000     .1690557    .1773014
            dumnocc31 |   .1530679   .0390752     3.92   0.000     .0764818     .229654
            dumnocc32 |   .0730278   .0391878     1.86   0.062     -.003779    .1498345
            dumnocc33 |  -.0783599   .0392505    -2.00   0.046    -.1552896   -.0014302
            dumnocc34 |          0   .0394048     0.00   1.000    -.0772321    .0772321
          dumquarter1 |  -.0141331   .0034628    -4.08   0.000    -.0209202   -.0073461
          dumquarter2 |  -.0040831    .003416    -1.20   0.232    -.0107783    .0026121
          dumquarter3 |          0   .0032873     0.00   1.000    -.0064431    .0064431
          dumquarter4 |    .005671   .0033104     1.71   0.087    -.0008173    .0121593
                unemp |  -.0028184   .0007052    -4.00   0.000    -.0042005   -.0014362
                _cons |  -.0506069   .0926724    -0.55   0.585    -.2322417     .131028
---------------------------------------------------------------------------------------
men not covered by union at 20 quantile
(analytic weights assumed)
note: dumstate51 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter4 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  878887
-------------+------------------------------           F(123,878763) = 3370.52
       Model |  220170.082   123  1790.00067           Prob > F      =  0.0000
    Residual |   398891.18 878763  .453923504          R-squared     =  0.3557
-------------+------------------------------           Adj R-squared =  0.3556
       Total |  619061.262 878886  .704370376          Root MSE      =  .67374
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1728477   .0056776   -30.44   0.000    -.1839756   -.1617198
             treat_st |  -.0045979   .0058609    -0.78   0.433     -.016085    .0068892
treat_stblackrelwhite |  -.0831499   .0071581   -11.62   0.000    -.0971796   -.0691203
            dumstate1 |  -.0243245   .0251225    -0.97   0.333    -.0735638    .0249149
            dumstate2 |   .0563007   .0251902     2.24   0.025     .0069288    .1056727
            dumstate3 |   .0439472    .025943     1.69   0.090    -.0069001    .0947946
            dumstate4 |   .0338704   .0248497     1.36   0.173    -.0148342     .082575
            dumstate5 |  -.0065378   .0247606    -0.26   0.792    -.0550678    .0419922
            dumstate6 |   .0192213   .0250986     0.77   0.444     -.029971    .0684136
            dumstate7 |  -.0527393    .024736    -2.13   0.033     -.101221   -.0042575
            dumstate8 |  -3.85e-06   .0249031    -0.00   1.000     -.048813    .0488053
            dumstate9 |  -.0739944   .0252947    -2.93   0.003    -.1235712   -.0244177
           dumstate10 |  -.1072935   .0248107    -4.32   0.000    -.1559217   -.0586652
           dumstate11 |  -.0543454   .0243763    -2.23   0.026    -.1021222   -.0065686
           dumstate12 |  -.0528156   .0251057    -2.10   0.035    -.1020219   -.0036093
           dumstate13 |  -.0759824   .0245895    -3.09   0.002    -.1241771   -.0277877
           dumstate14 |  -.0241455   .0242274    -1.00   0.319    -.0716304    .0233393
           dumstate15 |  -.0122985    .024466    -0.50   0.615    -.0602511    .0356541
           dumstate16 |   -.042177    .025878    -1.63   0.103    -.0928971    .0085431
           dumstate17 |  -.1226021   .0254732    -4.81   0.000    -.1725288   -.0726754
           dumstate18 |  -.0541441   .0264945    -2.04   0.041    -.1060723   -.0022158
           dumstate19 |  -.1106814   .0254261    -4.35   0.000    -.1605157   -.0608471
           dumstate20 |  -.1149017   .0247983    -4.63   0.000    -.1635055   -.0662978
           dumstate21 |  -.1203354    .025323    -4.75   0.000    -.1699676   -.0707031
           dumstate22 |          0   .0265553     0.00   1.000    -.0520475    .0520475
           dumstate23 |  -.0019112   .0252714    -0.08   0.940    -.0514423      .04762
           dumstate24 |    .041568   .0255302     1.63   0.103    -.0084703    .0916063
           dumstate25 |  -.0231333   .0242225    -0.96   0.340    -.0706087    .0243421
           dumstate26 |  -.2298269    .026075    -8.81   0.000     -.280933   -.1787209
           dumstate27 |  -.0710958   .0255955    -2.78   0.005    -.1212621   -.0209295
           dumstate28 |  -.0558623   .0257377    -2.17   0.030    -.1063074   -.0054173
           dumstate29 |  -.0207605   .0248612    -0.84   0.404    -.0694875    .0279665
           dumstate30 |  -.0934996   .0246806    -3.79   0.000    -.1418728   -.0451265
           dumstate31 |  -.1370868   .0254515    -5.39   0.000    -.1869709   -.0872026
           dumstate32 |   -.142637   .0249479    -5.72   0.000    -.1915341   -.0937399
           dumstate33 |  -.1419614   .0263115    -5.40   0.000     -.193531   -.0903918
           dumstate34 |  -.1519512   .0266017    -5.71   0.000    -.2040896   -.0998129
           dumstate35 |  -.2070474   .0256959    -8.06   0.000    -.2574104   -.1566843
           dumstate36 |   -.096426   .0269677    -3.58   0.000    -.1492818   -.0435703
           dumstate37 |  -.1696141   .0247305    -6.86   0.000     -.218085   -.1211431
           dumstate38 |   -.060927   .0248287    -2.45   0.014    -.1095905   -.0122635
           dumstate39 |  -.1112387   .0263977    -4.21   0.000    -.1629774   -.0595001
           dumstate40 |    -.09142   .0262368    -3.48   0.000    -.1428432   -.0399968
           dumstate41 |   .0683365   .0256696     2.66   0.008     .0180249    .1186482
           dumstate42 |  -.0265579   .0253003    -1.05   0.294    -.0761455    .0230298
           dumstate43 |  -.1246942   .0260926    -4.78   0.000    -.1758349   -.0735535
           dumstate44 |  -.0629844   .0253592    -2.48   0.013    -.1126877   -.0132812
           dumstate45 |  -.0823676   .0246176    -3.35   0.001    -.1306173    -.034118
           dumstate46 |   .0247591   .0249608     0.99   0.321    -.0241632    .0736814
           dumstate47 |   .0176887   .0249843     0.71   0.479    -.0312797    .0666571
           dumstate48 |  -.0380551   .0256305    -1.48   0.138      -.08829    .0121797
           dumstate49 |   .0130722   .0247977     0.53   0.598    -.0355304    .0616749
           dumstate50 |   .1494522   .0263394     5.67   0.000     .0978279    .2010766
           dumstate51 |   .0437948   .0252933     1.73   0.083    -.0057792    .0933688
             dumyear1 |  -.0525237   .0182748    -2.87   0.004    -.0883416   -.0167058
             dumyear2 |  -.0539648   .0202189    -2.67   0.008    -.0935931   -.0143365
             dumyear3 |  -.0668566   .0184038    -3.63   0.000    -.1029273   -.0307858
             dumyear4 |  -.0661093    .018019    -3.67   0.000    -.1014259   -.0307928
             dumyear5 |  -.1094904   .0189733    -5.77   0.000    -.1466775   -.0723033
             dumyear6 |  -.0904999   .0183554    -4.93   0.000    -.1264758    -.054524
             dumyear7 |  -.0588214   .0187163    -3.14   0.002    -.0955048   -.0221381
             dumyear8 |  -.0647612   .0182751    -3.54   0.000    -.1005797   -.0289427
             dumyear9 |  -.0206458   .0186137    -1.11   0.267    -.0571281    .0158364
            dumyear10 |  -.0119087    .019198    -0.62   0.535    -.0495361    .0257186
            dumyear11 |   .0131945   .0183556     0.72   0.472    -.0227819    .0491709
            dumyear12 |   .0365132   .0189397     1.93   0.054    -.0006079    .0736344
            dumyear13 |   .0230568   .0192733     1.20   0.232    -.0147182    .0608318
            dumyear14 |    .016378   .0185337     0.88   0.377    -.0199474    .0527034
            dumyear15 |   .0024419   .0188115     0.13   0.897    -.0344281    .0393118
            dumyear16 |  -.0518937   .0237526    -2.18   0.029     -.098448   -.0053393
            dumyear17 |  -.0385512   .0190931    -2.02   0.043    -.0759731   -.0011294
            dumyear18 |  -.0294793    .018822    -1.57   0.117    -.0663698    .0074112
            dumyear19 |   .0107429   .0182383     0.59   0.556    -.0250036    .0464893
            dumyear20 |          0    .018312     0.00   1.000    -.0358909    .0358909
            dumyear21 |  -.0320049   .0184225    -1.74   0.082    -.0681124    .0041027
            dumyear22 |  -.0304809   .0192035    -1.59   0.112    -.0681191    .0071573
            dumyear23 |  -.0501716   .0189375    -2.65   0.008    -.0872886   -.0130547
            dumyear24 |  -.0451573   .0186513    -2.42   0.015    -.0817133   -.0086014
            dumyear25 |  -.0329584   .0185497    -1.78   0.076    -.0693152    .0033985
            dumyear26 |  -.0098839   .0189639    -0.52   0.602    -.0470526    .0272847
            dumyear27 |   -.031751   .0188344    -1.69   0.092    -.0686658    .0051639
            dumyear28 |   .0045961   .0193187     0.24   0.812     -.033268    .0424601
            dumyear29 |    .034945   .0186613     1.87   0.061    -.0016306    .0715206
             dumnind1 |  -.2471583   .1242338    -1.99   0.047    -.4906525   -.0036642
             dumnind2 |   .0361829   .1243058     0.29   0.771    -.2074524    .2798181
             dumnind3 |  -.0260242   .1244133    -0.21   0.834    -.2698701    .2178216
             dumnind4 |  -.2500115   .1245458    -2.01   0.045    -.4941171   -.0059058
             dumnind5 |  -.0447455   .1245338    -0.36   0.719    -.2888277    .1993367
             dumnind6 |  -.0673244   .1241964    -0.54   0.588    -.3107452    .1760965
             dumnind7 |  -.1562404   .1244833    -1.26   0.209    -.4002235    .0877426
             dumnind8 |  -.1651382   .1249609    -1.32   0.186    -.4100574     .079781
             dumnind9 |  -.2084164   .1241703    -1.68   0.093     -.451786    .0349532
            dumnind10 |  -.2646734   .1240892    -2.13   0.033    -.5078841   -.0214627
            dumnind11 |          0   .1237543     0.00   1.000    -.2425543    .2425543
                 educ |   .0469436    .001907    24.62   0.000      .043206    .0506811
                exper |   .1242907   .0019387    64.11   0.000     .1204909    .1280906
               exper2 |  -.0063962   .0001316   -48.60   0.000    -.0066541   -.0061383
               exper3 |   .0001612   4.50e-06    35.82   0.000     .0001524      .00017
               exper4 |  -1.48e-06   5.10e-08   -28.99   0.000    -1.58e-06   -1.38e-06
                 edex |  -.0011849   .0000733   -16.16   0.000    -.0013286   -.0010412
            dumee_cl1 |          0   .0150645     0.00   1.000    -.0295259    .0295259
            dumee_cl2 |   .1109475   .0151829     7.31   0.000     .0811895    .1407055
            dumee_cl3 |   .2576995    .015879    16.23   0.000     .2265772    .2888218
            dumee_cl4 |   .4714444   .0178686    26.38   0.000     .4364225    .5064663
            dumee_cl5 |  -.0332339    .018617    -1.79   0.074    -.0697226    .0032547
            dumee_cl6 |   .2088287   .0154894    13.48   0.000     .1784699    .2391875
            dumee_cl7 |   .3169124   .0156283    20.28   0.000     .2862814    .3475434
            dumee_cl8 |   .2791392     .01729    16.14   0.000     .2452514    .3130269
            dumee_cl9 |   .0216868   .0173844     1.25   0.212    -.0123861    .0557596
           dumee_cl10 |   .2525761   .0160574    15.73   0.000     .2211042    .2840481
           dumee_cl11 |   .3353459   .0154364    21.72   0.000     .3050911    .3656008
           dumee_cl12 |   .2867963    .017297    16.58   0.000     .2528947    .3206979
           dumee_cl13 |   .0210917   .0182027     1.16   0.247     -.014585    .0567684
           dumee_cl14 |   .2479058   .0165548    14.97   0.000      .215459    .2803526
           dumee_cl15 |   .3085878   .0164139    18.80   0.000     .2764171    .3407586
           dumee_cl16 |   .3133241   .0175865    17.82   0.000     .2788553     .347793
                 marr |   .1381677   .0020918    66.05   0.000     .1340678    .1422676
                partt |  -.5232377   .0054603   -95.83   0.000    -.5339397   -.5125357
               public |   .0174544   .0043688     4.00   0.000     .0088917    .0260172
                 cmsa |   .1409149   .0023853    59.08   0.000     .1362398    .1455899
            dumnocc31 |   .1110823   .0932696     1.19   0.234     -.071723    .2938875
            dumnocc32 |          0   .0933551     0.00   1.000    -.1829729    .1829729
            dumnocc33 |  -.1869262   .0936141    -2.00   0.046    -.3704068   -.0034456
            dumnocc34 |   .0138477   .0932041     0.15   0.882    -.1688293    .1965247
          dumquarter1 |  -.0148668    .006355    -2.34   0.019    -.0273224   -.0024112
          dumquarter2 |  -.0122503   .0063415    -1.93   0.053    -.0246794    .0001788
          dumquarter3 |  -.0116297   .0061571    -1.89   0.059    -.0236974     .000438
          dumquarter4 |          0   .0062824     0.00   1.000    -.0123134    .0123134
                unemp |  -.0070467   .0009942    -7.09   0.000    -.0089952   -.0050981
                _cons |  -.0434969   .1645954    -0.26   0.792    -.3660983    .2791045
---------------------------------------------------------------------------------------
women not covered by union at 20 quantile
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear20 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl5 dropped because of collinearity
note: dumnocc33 dropped because of collinearity
note: dumquarter2 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  924344
-------------+------------------------------           F(123,924220) = 2621.63
       Model |   116161.04   123  944.398698           Prob > F      =  0.0000
    Residual |  265730.593 924220  .287518765          R-squared     =  0.3042
-------------+------------------------------           Adj R-squared =  0.3041
       Total |  381891.633 924343  .413149267          Root MSE      =  .53621
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0636846   .0036608   -17.40   0.000    -.0708596   -.0565096
             treat_st |   .0033035    .005104     0.65   0.517    -.0067002    .0133071
treat_stblackrelwhite |  -.0752766   .0049323   -15.26   0.000    -.0849437   -.0656095
            dumstate1 |   .0104275   .0149452     0.70   0.485    -.0188645    .0397195
            dumstate2 |   .0426832   .0151927     2.81   0.005      .012906    .0724605
            dumstate3 |   .0739608   .0150658     4.91   0.000     .0444323    .1034893
            dumstate4 |   .0145087   .0141111     1.03   0.304    -.0131486    .0421659
            dumstate5 |  -.0416172   .0145443    -2.86   0.004    -.0701235    -.013111
            dumstate6 |  -.0067008   .0144194    -0.46   0.642    -.0349623    .0215607
            dumstate7 |  -.0803129   .0145099    -5.54   0.000    -.1087519   -.0518739
            dumstate8 |   -.042991   .0143309    -3.00   0.003     -.071079    -.014903
            dumstate9 |  -.1153006   .0142599    -8.09   0.000    -.1432496   -.0873516
           dumstate10 |  -.1387434   .0143286    -9.68   0.000     -.166827   -.1106598
           dumstate11 |  -.1164366   .0150948    -7.71   0.000     -.146022   -.0868512
           dumstate12 |  -.0996783   .0145585    -6.85   0.000    -.1282125   -.0711441
           dumstate13 |  -.1161299   .0141244    -8.22   0.000    -.1438133   -.0884466
           dumstate14 |  -.0477951   .0150327    -3.18   0.001    -.0772586   -.0183316
           dumstate15 |  -.0205571   .0148984    -1.38   0.168    -.0497575    .0086434
           dumstate16 |  -.0944466   .0162342    -5.82   0.000     -.126265   -.0626282
           dumstate17 |  -.1500519   .0149445   -10.04   0.000    -.1793426   -.1207612
           dumstate18 |  -.1258435   .0167003    -7.54   0.000    -.1585754   -.0931115
           dumstate19 |  -.1187274   .0158218    -7.50   0.000    -.1497377   -.0877172
           dumstate20 |  -.1400222   .0160677    -8.71   0.000    -.1715143     -.10853
           dumstate21 |  -.1544766   .0156887    -9.85   0.000     -.185226   -.1237273
           dumstate22 |          0   .0154456     0.00   1.000    -.0302728    .0302728
           dumstate23 |  -.0620876   .0154666    -4.01   0.000    -.0924017   -.0317736
           dumstate24 |  -.0488623    .014492    -3.37   0.001    -.0772662   -.0204584
           dumstate25 |  -.1007978   .0158275    -6.37   0.000    -.1318192   -.0697764
           dumstate26 |  -.3117376   .0160156   -19.46   0.000    -.3431277   -.2803474
           dumstate27 |  -.1150432   .0153243    -7.51   0.000    -.1450783   -.0850082
           dumstate28 |  -.1517125    .015689    -9.67   0.000    -.1824624   -.1209627
           dumstate29 |  -.1100204   .0156513    -7.03   0.000    -.1406963   -.0793444
           dumstate30 |  -.1210726   .0154443    -7.84   0.000     -.151343   -.0908022
           dumstate31 |  -.1686591   .0152974   -11.03   0.000    -.1986415   -.1386766
           dumstate32 |  -.1742739    .015407   -11.31   0.000    -.2044711   -.1440767
           dumstate33 |  -.2315428    .016227   -14.27   0.000    -.2633472   -.1997383
           dumstate34 |    -.25197   .0156876   -16.06   0.000    -.2827171   -.2212228
           dumstate35 |  -.2435614   .0160864   -15.14   0.000    -.2750901   -.2120326
           dumstate36 |  -.2381167   .0159671   -14.91   0.000    -.2694117   -.2068216
           dumstate37 |  -.2299539   .0155901   -14.75   0.000      -.26051   -.1993978
           dumstate38 |  -.1403724   .0154872    -9.06   0.000    -.1707268    -.110018
           dumstate39 |  -.1117853   .0155859    -7.17   0.000    -.1423331   -.0812375
           dumstate40 |  -.1279234   .0145587    -8.79   0.000     -.156458   -.0993888
           dumstate41 |   -.065243    .016074    -4.06   0.000    -.0967474   -.0337386
           dumstate42 |  -.0732094   .0145584    -5.03   0.000    -.1017434   -.0446754
           dumstate43 |  -.1655129   .0161159   -10.27   0.000    -.1970995   -.1339263
           dumstate44 |  -.0850185   .0158103    -5.38   0.000    -.1160063   -.0540308
           dumstate45 |  -.1127069   .0159563    -7.06   0.000    -.1439808   -.0814331
           dumstate46 |   -.025095   .0161408    -1.55   0.120    -.0567304    .0065404
           dumstate47 |  -.0114983   .0148244    -0.78   0.438    -.0405536     .017557
           dumstate48 |   -.038737   .0149444    -2.59   0.010    -.0680276   -.0094464
           dumstate49 |  -.0334366   .0140959    -2.37   0.018     -.061064   -.0058091
           dumstate50 |   .1118134   .0148827     7.51   0.000     .0826439     .140983
           dumstate51 |   .0137766   .0146063     0.94   0.346    -.0148513    .0424044
             dumyear1 |  -.0846639    .014384    -5.89   0.000     -.112856   -.0564717
             dumyear2 |  -.0682495   .0141031    -4.84   0.000    -.0958911   -.0406079
             dumyear3 |   -.064018   .0140231    -4.57   0.000    -.0915028   -.0365331
             dumyear4 |  -.0605596   .0141176    -4.29   0.000    -.0882295   -.0328897
             dumyear5 |  -.0950149   .0140514    -6.76   0.000    -.1225551   -.0674747
             dumyear6 |  -.0970885   .0139607    -6.95   0.000     -.124451    -.069726
             dumyear7 |  -.0698321   .0146568    -4.76   0.000    -.0985589   -.0411053
             dumyear8 |  -.0293021   .0146689    -2.00   0.046    -.0580527   -.0005515
             dumyear9 |   .0147009   .0229683     0.64   0.522    -.0303161     .059718
            dumyear10 |   .0014641   .0142918     0.10   0.918    -.0265474    .0294756
            dumyear11 |   .0170731    .013907     1.23   0.220    -.0101842    .0443303
            dumyear12 |   .0152661   .0138912     1.10   0.272    -.0119603    .0424924
            dumyear13 |   .0356645   .0146081     2.44   0.015     .0070332    .0642959
            dumyear14 |     .03631   .0144373     2.52   0.012     .0080135    .0646066
            dumyear15 |  -.0109567   .0145557    -0.75   0.452    -.0394853    .0175719
            dumyear16 |  -.0005409   .0143164    -0.04   0.970    -.0286005    .0275187
            dumyear17 |   .0001079   .0141698     0.01   0.994    -.0276646    .0278803
            dumyear18 |  -.0212809   .0142796    -1.49   0.136    -.0492685    .0067067
            dumyear19 |    .001269   .0170901     0.07   0.941    -.0322271    .0347651
            dumyear20 |          0   .0136047     0.00   1.000    -.0266647    .0266647
            dumyear21 |  -.0165551   .0139365    -1.19   0.235    -.0438702    .0107599
            dumyear22 |  -.0405104   .0144279    -2.81   0.005    -.0687885   -.0122323
            dumyear23 |  -.0266643   .0140249    -1.90   0.057    -.0541527    .0008241
            dumyear24 |  -.0260494    .013979    -1.86   0.062    -.0534478    .0013489
            dumyear25 |  -.0146539   .0140746    -1.04   0.298    -.0422396    .0129319
            dumyear26 |  -.0449939   .0142903    -3.15   0.002    -.0730024   -.0169854
            dumyear27 |  -.0150571   .0143997    -1.05   0.296    -.0432801    .0131658
            dumyear28 |  -.0006217   .0146901    -0.04   0.966    -.0294139    .0281705
            dumyear29 |   .0252738   .0140902     1.79   0.073    -.0023424    .0528901
             dumnind1 |          0    .063447     0.00   1.000     -.124354     .124354
             dumnind2 |   .1268421   .0635298     2.00   0.046     .0023258    .2513584
             dumnind3 |   .1243992     .06323     1.97   0.049     .0004705     .248328
             dumnind4 |  -.1341399   .0634682    -2.11   0.035    -.2585354   -.0097444
             dumnind5 |   .1062188   .0636915     1.67   0.095    -.0186144     .231052
             dumnind6 |   .1189019   .0635797     1.87   0.061    -.0057121     .243516
             dumnind7 |   .0453446    .063359     0.72   0.474    -.0788369    .1695261
             dumnind8 |   .0704898    .063331     1.11   0.266    -.0536368    .1946164
             dumnind9 |  -.0467023   .0631644    -0.74   0.460    -.1705023    .0770978
            dumnind10 |  -.0794202   .0634433    -1.25   0.211     -.203767    .0449266
            dumnind11 |   .1172991   .0631784     1.86   0.063    -.0065285    .2411267
                 educ |   .0478579   .0013533    35.36   0.000     .0452054    .0505104
                exper |   .0913483   .0013787    66.26   0.000     .0886461    .0940505
               exper2 |  -.0047836   .0001035   -46.23   0.000    -.0049864   -.0045808
               exper3 |   .0001273   3.65e-06    34.87   0.000     .0001201    .0001344
               exper4 |  -1.20e-06   4.17e-08   -28.67   0.000    -1.28e-06   -1.11e-06
                 edex |  -.0012376   .0000558   -22.16   0.000    -.0013471   -.0011282
            dumee_cl1 |   .0223387   .0225369     0.99   0.322    -.0218329    .0665102
            dumee_cl2 |   .1780902   .0218811     8.14   0.000     .1352039    .2209765
            dumee_cl3 |   .2974264   .0215533    13.80   0.000     .2551826    .3396702
            dumee_cl4 |   .3658854   .0218565    16.74   0.000     .3230473    .4087235
            dumee_cl5 |  -.0345885    .020088    -1.72   0.085    -.0739603    .0047833
            dumee_cl6 |   .2153116   .0218504     9.85   0.000     .1724855    .2581376
            dumee_cl7 |   .3030583   .0212133    14.29   0.000      .261481    .3446356
            dumee_cl8 |    .259829   .0216004    12.03   0.000     .2174928    .3021651
            dumee_cl9 |    .017337   .0217005     0.80   0.424    -.0251952    .0598692
           dumee_cl10 |   .2412645    .020944    11.52   0.000     .2002149    .2823141
           dumee_cl11 |   .3098411   .0212728    14.57   0.000     .2681473     .351535
           dumee_cl12 |   .2895571   .0213278    13.58   0.000     .2477554    .3313588
           dumee_cl13 |          0   .0221968     0.00   1.000    -.0435049    .0435049
           dumee_cl14 |   .2286074   .0210344    10.87   0.000     .1873807     .269834
           dumee_cl15 |   .3017545   .0211727    14.25   0.000     .2602566    .3432523
           dumee_cl16 |   .3086834   .0213871    14.43   0.000     .2667653    .3506014
                 marr |   .0466179   .0013956    33.40   0.000     .0438826    .0493531
                partt |  -.2422125   .0023857  -101.52   0.000    -.2468885   -.2375365
               public |   .0166268   .0025587     6.50   0.000     .0116118    .0216417
                 cmsa |   .1641874   .0022572    72.74   0.000     .1597634    .1686114
            dumnocc31 |   .1474126   .0295444     4.99   0.000     .0895067    .2053185
            dumnocc32 |   .0824004   .0296879     2.78   0.006     .0242132    .1405877
            dumnocc33 |  -.0587544   .0296508    -1.98   0.048    -.1168689   -.0006399
            dumnocc34 |          0   .0293025     0.00   1.000     -.057432     .057432
          dumquarter1 |  -.0149563   .0040812    -3.66   0.000    -.0229552   -.0069574
          dumquarter2 |  -.0042736   .0042151    -1.01   0.311    -.0125351    .0039879
          dumquarter3 |          0   .0038931     0.00   1.000    -.0076303    .0076303
          dumquarter4 |   .0064956   .0040129     1.62   0.106    -.0013695    .0143607
                unemp |   -.002763   .0007944    -3.48   0.001      -.00432   -.0012061
                _cons |  -.1744378   .0750359    -2.32   0.020    -.3215057   -.0273699
---------------------------------------------------------------------------------------
men covered by union at 20 quantile
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind6 dropped because of collinearity
note: dumee_cl13 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter2 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  189324
-------------+------------------------------           F(123,189200) =  368.11
       Model |  18427.5192   123  149.817229           Prob > F      =  0.0000
    Residual |  64687.5425 189200   .34190033          R-squared     =  0.2217
-------------+------------------------------           Adj R-squared =  0.2212
       Total |  83115.0617 189323  .439011962          Root MSE      =  .58472
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1842612   .0067091   -27.46   0.000    -.1974109   -.1711115
             treat_st |  -.0426246   .0142494    -2.99   0.003    -.0705531   -.0146961
treat_stblackrelwhite |  -.0659826   .0124741    -5.29   0.000    -.0904314   -.0415337
            dumstate1 |   .0012671    .047472     0.03   0.979    -.0917768     .094311
            dumstate2 |   .0061957   .0469232     0.13   0.895    -.0857727     .098164
            dumstate3 |  -.0614396   .0482915    -1.27   0.203    -.1560899    .0332107
            dumstate4 |   .0675557   .0455325     1.48   0.138    -.0216868    .1567983
            dumstate5 |   -.004576   .0461175    -0.10   0.921    -.0949652    .0858132
            dumstate6 |   .1142065   .0459319     2.49   0.013      .024181     .204232
            dumstate7 |   .0310371   .0450245     0.69   0.491    -.0572098    .1192839
            dumstate8 |   .0893238   .0451655     1.98   0.048     .0008004    .1778472
            dumstate9 |  -.0397257   .0456545    -0.87   0.384    -.1292075    .0497561
           dumstate10 |  -.0195586   .0454061    -0.43   0.667    -.1085535    .0694362
           dumstate11 |   -.024189   .0456752    -0.53   0.596    -.1137113    .0653333
           dumstate12 |   .0272294   .0449398     0.61   0.545    -.0608515    .1153103
           dumstate13 |   .0530358   .0445572     1.19   0.234    -.0342952    .1403669
           dumstate14 |   .0286111   .0449697     0.64   0.525    -.0595285    .1167508
           dumstate15 |   .0612364   .0445501     1.37   0.169    -.0260807    .1485534
           dumstate16 |   .0013037   .0461884     0.03   0.977    -.0892245    .0918319
           dumstate17 |  -.0167716   .0466748    -0.36   0.719    -.1082531      .07471
           dumstate18 |  -.0139107   .0468238    -0.30   0.766    -.1056843    .0778629
           dumstate19 |  -.1349719   .0510828    -2.64   0.008    -.2350929   -.0348509
           dumstate20 |  -.0692552   .0467497    -1.48   0.139    -.1608836    .0223731
           dumstate21 |   .0215956   .0460987     0.47   0.639    -.0687567    .1119479
           dumstate22 |          0   .0444181     0.00   1.000    -.0870585    .0870585
           dumstate23 |   .0666677   .0469876     1.42   0.156    -.0254268    .1587623
           dumstate24 |   .0399028    .047291     0.84   0.399    -.0527865     .132592
           dumstate25 |   .1034597    .045466     2.28   0.023     .0143475    .1925719
           dumstate26 |  -.0624852   .0495247    -1.26   0.207    -.1595524     .034582
           dumstate27 |  -.0368441   .0480098    -0.77   0.443    -.1309421    .0572539
           dumstate28 |  -.0593396   .0516213    -1.15   0.250    -.1605163     .041837
           dumstate29 |   .0329651   .0464585     0.71   0.478    -.0580924    .1240227
           dumstate30 |  -.0454812   .0447564    -1.02   0.310    -.1332028    .0422403
           dumstate31 |  -.0962953   .0445447    -2.16   0.031    -.1836018   -.0089887
           dumstate32 |  -.0703864   .0472299    -1.49   0.136    -.1629559     .022183
           dumstate33 |  -.0527762   .0478045    -1.10   0.270    -.1464719    .0409195
           dumstate34 |  -.1279847   .0481562    -2.66   0.008    -.2223698   -.0335996
           dumstate35 |  -.1364448   .0486626    -2.80   0.005    -.2318224   -.0410673
           dumstate36 |   .0431651   .0494599     0.87   0.383     -.053775    .1401053
           dumstate37 |    -.10933   .0474323    -2.30   0.021    -.2022962   -.0163638
           dumstate38 |   .0322674   .0462077     0.70   0.485    -.0582985    .1228334
           dumstate39 |   -.065461   .0475457    -1.38   0.169    -.1586495    .0277274
           dumstate40 |  -.0700952   .0485879    -1.44   0.149    -.1653263    .0251359
           dumstate41 |   .1349828    .046116     2.93   0.003     .0445966    .2253691
           dumstate42 |  -.0497273   .0473734    -1.05   0.294    -.1425781    .0431234
           dumstate43 |  -.1064824   .0528044    -2.02   0.044    -.2099777   -.0029871
           dumstate44 |  -.0127615   .0490074    -0.26   0.795    -.1088149     .083292
           dumstate45 |  -.0232497   .0486105    -0.48   0.632    -.1185252    .0720258
           dumstate46 |   .1043318   .0455424     2.29   0.022     .0150699    .1935938
           dumstate47 |   .0848829    .045169     1.88   0.060    -.0036472    .1734131
           dumstate48 |   .0086633   .0453832     0.19   0.849    -.0802868    .0976134
           dumstate49 |   .0995654   .0447162     2.23   0.026     .0119228     .187208
           dumstate50 |   .1365528   .0450201     3.03   0.002     .0483145     .224791
           dumstate51 |   .0364673   .0482003     0.76   0.449    -.0580043    .1309388
             dumyear1 |   .0155875   .0133577     1.17   0.243    -.0105933    .0417683
             dumyear2 |   .0063427   .0130666     0.49   0.627    -.0192675    .0319528
             dumyear3 |  -.0595219   .0131702    -4.52   0.000    -.0853352   -.0337086
             dumyear4 |  -.0337969   .0133864    -2.52   0.012    -.0600339   -.0075599
             dumyear5 |  -.0518919   .0131796    -3.94   0.000    -.0777236   -.0260602
             dumyear6 |  -.0331752   .0133231    -2.49   0.013    -.0592883   -.0070622
             dumyear7 |    -.00633   .0145266    -0.44   0.663    -.0348017    .0221417
             dumyear8 |  -.0018679   .0136226    -0.14   0.891    -.0285679     .024832
             dumyear9 |   .0187022   .0145811     1.28   0.200    -.0098764    .0472807
            dumyear10 |   .0121633   .0143669     0.85   0.397    -.0159955    .0403221
            dumyear11 |  -.0085732   .0150091    -0.57   0.568    -.0379906    .0208442
            dumyear12 |   .0147393   .0131981     1.12   0.264    -.0111286    .0406072
            dumyear13 |    .023353   .0145647     1.60   0.109    -.0051936    .0518995
            dumyear14 |   .0118684    .015185     0.78   0.434    -.0178938    .0416306
            dumyear15 |   .0150397   .0150421     1.00   0.317    -.0144424    .0445219
            dumyear16 |   .0110623   .0159902     0.69   0.489    -.0202781    .0424028
            dumyear17 |    .010281   .0148333     0.69   0.488    -.0187919    .0393538
            dumyear18 |  -.0042933   .0149603    -0.29   0.774    -.0336152    .0250286
            dumyear19 |   .0015414      .0165     0.09   0.926    -.0307982     .033881
            dumyear20 |   .0037553   .0148293     0.25   0.800    -.0253098    .0328204
            dumyear21 |  -.0236208   .0162766    -1.45   0.147    -.0555225     .008281
            dumyear22 |  -.0395502   .0164116    -2.41   0.016    -.0717166   -.0073838
            dumyear23 |  -.0275527   .0160148    -1.72   0.085    -.0589413    .0038359
            dumyear24 |  -.0125551   .0169207    -0.74   0.458    -.0457192    .0206091
            dumyear25 |  -.0250355   .0172018    -1.46   0.146    -.0587507    .0086797
            dumyear26 |  -.0218098   .0164124    -1.33   0.184    -.0539777    .0103581
            dumyear27 |  -.0149527   .0167002    -0.90   0.371    -.0476847    .0177794
            dumyear28 |  -.0018708   .0167665    -0.11   0.911    -.0347328    .0309911
            dumyear29 |          0   .0121949     0.00   1.000    -.0239017    .0239017
             dumnind1 |   .1805798     .09023     2.00   0.045     .0037312    .3574284
             dumnind2 |   .1833119   .0898316     2.04   0.041     .0072441    .3593797
             dumnind3 |   .0353827    .089479     0.40   0.693    -.1399941    .2107594
             dumnind4 |  -.1753855   .0902492    -1.94   0.052    -.3522719    .0015009
             dumnind5 |   .1620614   .0899015     1.80   0.071    -.0141434    .3382663
             dumnind6 |          0   .0913164     0.00   1.000     -.178978     .178978
             dumnind7 |  -.0467718   .0896321    -0.52   0.602    -.2224485    .1289049
             dumnind8 |  -.1714555   .0901882    -1.90   0.057    -.3482223    .0053114
             dumnind9 |  -.0972837   .0906078    -1.07   0.283    -.2748728    .0803054
            dumnind10 |  -.1729371   .0919427    -1.88   0.060    -.3531426    .0072684
            dumnind11 |   .1675555    .089848     1.86   0.062    -.0085445    .3436554
                 educ |   .0850242    .004654    18.27   0.000     .0759024     .094146
                exper |   .1158516   .0044056    26.30   0.000     .1072167    .1244865
               exper2 |   -.004613   .0002937   -15.71   0.000    -.0051887   -.0040374
               exper3 |   .0001039   9.36e-06    11.10   0.000     .0000855    .0001222
               exper4 |  -9.14e-07   1.00e-07    -9.10   0.000    -1.11e-06   -7.17e-07
                 edex |  -.0014345   .0001497    -9.58   0.000    -.0017279   -.0011412
            dumee_cl1 |          0    .044513     0.00   1.000    -.0872444    .0872444
            dumee_cl2 |  -.0226005   .0453774    -0.50   0.618    -.1115391    .0663381
            dumee_cl3 |   .0330036   .0454518     0.73   0.468    -.0560809    .1220881
            dumee_cl4 |   .0369968   .0487798     0.76   0.448    -.0586105    .1326041
            dumee_cl5 |  -.1422894    .050747    -2.80   0.005    -.2417522   -.0428265
            dumee_cl6 |   -.000216   .0449067    -0.00   0.996    -.0882321    .0878002
            dumee_cl7 |   .0417412   .0453936     0.92   0.358    -.0472292    .1307117
            dumee_cl8 |  -.0500947    .048121    -1.04   0.298    -.1444107    .0442213
            dumee_cl9 |  -.1242831   .0471999    -2.63   0.008    -.2167937   -.0317724
           dumee_cl10 |   .0059552   .0448548     0.13   0.894    -.0819592    .0938695
           dumee_cl11 |   .0285305   .0460376     0.62   0.535    -.0617021     .118763
           dumee_cl12 |  -.0649178   .0481255    -1.35   0.177    -.1592427    .0294071
           dumee_cl13 |  -.0789106    .046572    -1.69   0.090    -.1701906    .0123694
           dumee_cl14 |  -.0046426   .0464844    -0.10   0.920    -.0957509    .0864658
           dumee_cl15 |   .0088136   .0462727     0.19   0.849    -.0818797    .0995069
           dumee_cl16 |  -.0508009   .0478511    -1.06   0.288    -.1445879    .0429861
                 marr |   .0827898   .0037518    22.07   0.000     .0754362    .0901433
                partt |  -.3182137   .0103581   -30.72   0.000    -.3385152   -.2979121
               public |    .019065   .0052968     3.60   0.000     .0086835    .0294465
                 cmsa |   .1236987   .0045226    27.35   0.000     .1148345    .1325628
            dumnocc31 |     .14154   .0493279     2.87   0.004     .0448586    .2382215
            dumnocc32 |          0   .0490065     0.00   1.000    -.0960515    .0960515
            dumnocc33 |  -.0971339   .0487485    -1.99   0.046    -.1926798    -.001588
            dumnocc34 |   .0801094   .0493289     1.62   0.104     -.016574    .1767928
          dumquarter1 |  -.0092564   .0063676    -1.45   0.146    -.0217367    .0032239
          dumquarter2 |  -.0081484   .0062431    -1.31   0.192    -.0203848     .004088
          dumquarter3 |          0   .0054036     0.00   1.000     -.010591     .010591
          dumquarter4 |   .0079749   .0055041     1.45   0.147     -.002813    .0187628
                unemp |  -.0008474   .0019095    -0.44   0.657      -.00459    .0028952
                _cons |  -.3990113   .1377577    -2.90   0.004    -.6690131   -.1290095
---------------------------------------------------------------------------------------
women covered by union at 20 quantile
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind2 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc34 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  154778
-------------+------------------------------           F(123,154654) =  365.45
       Model |    19448.11   123  158.114715           Prob > F      =  0.0000
    Residual |  53513.6536 154654  .346021788          R-squared     =  0.2666
-------------+------------------------------           Adj R-squared =  0.2660
       Total |  72961.7636 154777  .471399262          Root MSE      =  .58824
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0523007   .0061648    -8.48   0.000    -.0643835   -.0402179
             treat_st |    .005792   .0153014     0.38   0.705    -.0241984    .0357823
treat_stblackrelwhite |  -.0777901   .0112144    -6.94   0.000    -.0997701   -.0558102
            dumstate1 |  -.0431958     .03067    -1.41   0.159    -.1033082    .0169167
            dumstate2 |  -.0080301   .0299884    -0.27   0.789    -.0668068    .0507466
            dumstate3 |  -.0382586   .0319032    -1.20   0.230    -.1007881     .024271
            dumstate4 |   .0271796   .0282958     0.96   0.337    -.0282796    .0826389
            dumstate5 |   .0243164   .0300402     0.81   0.418    -.0345617    .0831945
            dumstate6 |   .0381153   .0299065     1.27   0.202    -.0205008    .0967314
            dumstate7 |  -.0367442   .0292168    -1.26   0.209    -.0940085    .0205201
            dumstate8 |   .0085083   .0299757     0.28   0.777    -.0502434      .06726
            dumstate9 |  -.0831272   .0292656    -2.84   0.005    -.1404871   -.0257673
           dumstate10 |  -.0635604   .0292915    -2.17   0.030    -.1209711   -.0061497
           dumstate11 |  -.0937839   .0312942    -3.00   0.003    -.1551199    -.032448
           dumstate12 |  -.0838446   .0294185    -2.85   0.004    -.1415043    -.026185
           dumstate13 |  -.0269716   .0297394    -0.91   0.364    -.0852603    .0313171
           dumstate14 |  -.0299434   .0295102    -1.01   0.310    -.0877827    .0278959
           dumstate15 |   .0407034    .028714     1.42   0.156    -.0155754    .0969822
           dumstate16 |  -.0664152   .0320707    -2.07   0.038     -.129273   -.0035573
           dumstate17 |  -.1292076   .0321727    -4.02   0.000    -.1922655   -.0661497
           dumstate18 |  -.1274233   .0352293    -3.62   0.000    -.1964721   -.0583746
           dumstate19 |  -.1733828   .0369693    -4.69   0.000    -.2458418   -.1009238
           dumstate20 |  -.1926355   .0328048    -5.87   0.000    -.2569322   -.1283387
           dumstate21 |  -.0693561   .0343183    -2.02   0.043    -.1366193   -.0020928
           dumstate22 |  -.0028887   .0311745    -0.09   0.926      -.06399    .0582126
           dumstate23 |   .0120376    .030247     0.40   0.691    -.0472459    .0713212
           dumstate24 |   .0288778   .0304428     0.95   0.343    -.0307894     .088545
           dumstate25 |  -.0319119   .0324098    -0.98   0.325    -.0954345    .0316107
           dumstate26 |  -.1860371   .0339965    -5.47   0.000    -.2526695   -.1194047
           dumstate27 |  -.0665361   .0346046    -1.92   0.055    -.1343603    .0012882
           dumstate28 |  -.1687984   .0369714    -4.57   0.000    -.2412615   -.0963352
           dumstate29 |  -.0707675   .0334547    -2.12   0.034     -.136338   -.0051969
           dumstate30 |  -.0849021   .0326612    -2.60   0.009    -.1489173   -.0208868
           dumstate31 |  -.1558435   .0317442    -4.91   0.000    -.2180616   -.0936254
           dumstate32 |  -.1013706   .0340249    -2.98   0.003    -.1680587   -.0346825
           dumstate33 |   -.189345    .034894    -5.43   0.000    -.2577365   -.1209534
           dumstate34 |  -.2333369    .038088    -6.13   0.000    -.3079886   -.1586852
           dumstate35 |  -.2416141   .0349843    -6.91   0.000    -.3101827   -.1730455
           dumstate36 |  -.1990471    .036611    -5.44   0.000     -.270804   -.1272903
           dumstate37 |  -.1927476   .0332551    -5.80   0.000    -.2579268   -.1275683
           dumstate38 |  -.0615927   .0315248    -1.95   0.051    -.1233806    .0001952
           dumstate39 |  -.2518232   .0310111    -8.12   0.000    -.3126042   -.1910421
           dumstate40 |  -.1374339   .0322468    -4.26   0.000    -.2006369   -.0742309
           dumstate41 |          0   .0313043     0.00   1.000    -.0613557    .0613557
           dumstate42 |  -.0319521   .0345362    -0.93   0.355    -.0996423    .0357381
           dumstate43 |   -.079056   .0346137    -2.28   0.022    -.1468981   -.0112139
           dumstate44 |  -.0706334   .0379828    -1.86   0.063    -.1450788     .003812
           dumstate45 |  -.1254255   .0362598    -3.46   0.001    -.1964939   -.0543571
           dumstate46 |   .1017789   .0347611     2.93   0.003     .0336479      .16991
           dumstate47 |   .0456861   .0288112     1.59   0.113    -.0107834    .1021555
           dumstate48 |  -.0700895   .0300802    -2.33   0.020     -.129046    -.011133
           dumstate49 |   .0554776   .0290246     1.91   0.056    -.0014099    .1123651
           dumstate50 |   .1570241   .0296812     5.29   0.000     .0988495    .2151987
           dumstate51 |   .0344201   .0345378     1.00   0.319    -.0332733    .1021135
             dumyear1 |   .0215283   .0317309     0.68   0.497    -.0406636    .0837202
             dumyear2 |   .0275345    .027751     0.99   0.321    -.0268568    .0819258
             dumyear3 |    .004593   .0280378     0.16   0.870    -.0503606    .0595466
             dumyear4 |   .0129331   .0279964     0.46   0.644    -.0419393    .0678055
             dumyear5 |   .0206795   .0279308     0.74   0.459    -.0340642    .0754233
             dumyear6 |   .0153955   .0273666     0.56   0.574    -.0382425    .0690335
             dumyear7 |    .015283   .0284815     0.54   0.592    -.0405402    .0711062
             dumyear8 |   .0496956   .0275942     1.80   0.072    -.0043884    .1037796
             dumyear9 |   .0296165   .0280626     1.06   0.291    -.0253857    .0846187
            dumyear10 |   .0237998   .0272134     0.87   0.382    -.0295379    .0771375
            dumyear11 |   .0459748   .0272912     1.68   0.092    -.0075154     .099465
            dumyear12 |   .0616193   .0263865     2.34   0.020     .0099024    .1133363
            dumyear13 |   .0509921   .0272251     1.87   0.061    -.0023686    .1043527
            dumyear14 |    .050503   .0269244     1.88   0.061    -.0022682    .1032742
            dumyear15 |   .0373679   .0272241     1.37   0.170    -.0159909    .0907266
            dumyear16 |   .0419076   .0273517     1.53   0.125    -.0117011    .0955163
            dumyear17 |   .0064493   .0285051     0.23   0.821    -.0494202    .0623187
            dumyear18 |    .010587   .0273811     0.39   0.699    -.0430793    .0642533
            dumyear19 |   .0439274   .0278308     1.58   0.114    -.0106205    .0984753
            dumyear20 |   .0465791   .0274186     1.70   0.089    -.0071608     .100319
            dumyear21 |   .0215324   .0288678     0.75   0.456     -.035048    .0781128
            dumyear22 |  -.0023781   .0289823    -0.08   0.935    -.0591827    .0544266
            dumyear23 |  -.0049648   .0288198    -0.17   0.863     -.061451    .0515214
            dumyear24 |   .0047685   .0284822     0.17   0.867     -.051056    .0605931
            dumyear25 |  -.0068005   .0287144    -0.24   0.813    -.0630801    .0494792
            dumyear26 |   .0105449   .0278794     0.38   0.705    -.0440982    .0651881
            dumyear27 |  -.0111844   .0293812    -0.38   0.703    -.0687709     .046402
            dumyear28 |  -.0154758    .028336    -0.55   0.585    -.0710138    .0400622
            dumyear29 |          0   .0251626     0.00   1.000    -.0493182    .0493182
             dumnind1 |  -.1541236   .0848844    -1.82   0.069    -.3204952     .012248
             dumnind2 |          0   .0873801     0.00   1.000    -.1712632    .1712632
             dumnind3 |  -.1611851    .091385    -1.76   0.078    -.3402978    .0179276
             dumnind4 |   -.491467   .0909111    -5.41   0.000     -.669651    -.313283
             dumnind5 |   .0047429   .0897655     0.05   0.958    -.1711956    .1806813
             dumnind6 |  -.1845686   .0921024    -2.00   0.045    -.3650874   -.0040498
             dumnind7 |  -.2966176   .0912635    -3.25   0.001    -.4754921   -.1177431
             dumnind8 |  -.2539926   .0903078    -2.81   0.005     -.430994   -.0769911
             dumnind9 |  -.3933934   .0901066    -4.37   0.000    -.5700005   -.2167863
            dumnind10 |  -.4292058   .0960359    -4.47   0.000    -.6174343   -.2409774
            dumnind11 |  -.1312008   .0900796    -1.46   0.145    -.3077549    .0453534
                 educ |   .0846123   .0038074    22.22   0.000     .0771499    .0920746
                exper |   .0888473    .004409    20.15   0.000     .0802058    .0974888
               exper2 |  -.0039345   .0003177   -12.38   0.000    -.0045573   -.0033117
               exper3 |   .0000982    .000011     8.96   0.000     .0000767    .0001197
               exper4 |  -9.12e-07   1.25e-07    -7.30   0.000    -1.16e-06   -6.67e-07
                 edex |  -.0013735   .0001466    -9.37   0.000    -.0016609   -.0010862
            dumee_cl1 |          0   .0402717     0.00   1.000    -.0789318    .0789318
            dumee_cl2 |  -.0036772   .0365439    -0.10   0.920    -.0753025     .067948
            dumee_cl3 |   .1131831    .038143     2.97   0.003     .0384235    .1879426
            dumee_cl4 |   .2624944   .0355454     7.38   0.000     .1928261    .3321627
            dumee_cl5 |  -.1165705   .0455959    -2.56   0.011    -.2059375   -.0272034
            dumee_cl6 |   .0977621   .0334985     2.92   0.004     .0321057    .1634184
            dumee_cl7 |   .1870665   .0331598     5.64   0.000     .1220739    .2520591
            dumee_cl8 |    .199878   .0335252     5.96   0.000     .1341692    .2655868
            dumee_cl9 |  -.0250751   .0376529    -0.67   0.505     -.098874    .0487238
           dumee_cl10 |   .1235226   .0307741     4.01   0.000     .0632061    .1838391
           dumee_cl11 |   .1949648   .0303684     6.42   0.000     .1354435    .2544862
           dumee_cl12 |   .2205821   .0331203     6.66   0.000     .1556669    .2854972
           dumee_cl13 |   .0280935   .0298885     0.94   0.347    -.0304873    .0866743
           dumee_cl14 |   .1460584   .0296093     4.93   0.000     .0880248     .204092
           dumee_cl15 |   .2218586   .0319134     6.95   0.000     .1593091    .2844082
           dumee_cl16 |   .2579578   .0337478     7.64   0.000     .1918127    .3241028
                 marr |   .0098201   .0040394     2.43   0.015     .0019029    .0177372
                partt |    -.20541   .0064842   -31.68   0.000    -.2181188   -.1927011
               public |   .0611271   .0053485    11.43   0.000     .0506442    .0716101
                 cmsa |   .1317792   .0051511    25.58   0.000     .1216832    .1418753
            dumnocc31 |   .3900395   .0954738     4.09   0.000     .2029129    .5771662
            dumnocc32 |   .2387881     .09533     2.50   0.012     .0519433     .425633
            dumnocc33 |          0   .0949165     0.00   1.000    -.1860344    .1860344
            dumnocc34 |   .1903384   .0958797     1.99   0.047     .0024162    .3782605
          dumquarter1 |  -.0161889   .0053979    -3.00   0.003    -.0267687   -.0056091
          dumquarter2 |  -.0089783   .0050847    -1.77   0.077    -.0189443    .0009877
          dumquarter3 |  -.0049436   .0045862    -1.08   0.281    -.0139324    .0040453
          dumquarter4 |          0   .0042228     0.00   1.000    -.0082765    .0082765
                unemp |  -.0012814   .0020836    -0.61   0.539    -.0053651    .0028023
                _cons |   -.426876   .1581518    -2.70   0.007    -.7368503   -.1169016
---------------------------------------------------------------------------------------
men at 50 quantile
(analytic weights assumed)
note: dumstate51 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter4 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs = 1069714
-------------+------------------------------           F(123,1069590) = 7871.99
       Model |  228809.655   123   1860.2411           Prob > F      =  0.0000
    Residual |  420293.415 1069590  .392948153         R-squared     =  0.3525
-------------+------------------------------           Adj R-squared =  0.3524
       Total |   649103.07 1069713  .606801142         Root MSE      =  .62686
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1794816   .0036347   -49.38   0.000    -.1866055   -.1723577
             treat_st |  -.0474252   .0058628    -8.09   0.000    -.0589162   -.0359343
treat_stblackrelwhite |   -.026419   .0052192    -5.06   0.000    -.0366485   -.0161894
            dumstate1 |  -.1375966   .0443181    -3.10   0.002    -.2244586   -.0507346
            dumstate2 |  -.0393331   .0440184    -0.89   0.372    -.1256076    .0469414
            dumstate3 |  -.1410673   .0439583    -3.21   0.001     -.227224   -.0549106
            dumstate4 |  -.0032746   .0438943    -0.07   0.941    -.0893061    .0827568
            dumstate5 |  -.0959642   .0440442    -2.18   0.029    -.1822894    -.009639
            dumstate6 |   .0406982   .0439799     0.93   0.355    -.0455009    .1268974
            dumstate7 |  -.0194997   .0437084    -0.45   0.656    -.1051667    .0661674
            dumstate8 |   .0552072    .043702     1.26   0.206    -.0304473    .1408617
            dumstate9 |  -.1167099   .0439604    -2.65   0.008    -.2028707    -.030549
           dumstate10 |  -.1375003   .0435936    -3.15   0.002    -.2229423   -.0520584
           dumstate11 |  -.1233887   .0440801    -2.80   0.005    -.2097841   -.0369932
           dumstate12 |  -.0275437   .0436273    -0.63   0.528    -.1130518    .0579644
           dumstate13 |  -.0466475   .0437003    -1.07   0.286    -.1322987    .0390037
           dumstate14 |  -.0988754   .0436672    -2.26   0.024    -.1844615   -.0132892
           dumstate15 |  -.0525123   .0439386    -1.20   0.232    -.1386305    .0336058
           dumstate16 |  -.1285171   .0447997    -2.87   0.004     -.216323   -.0407113
           dumstate17 |   -.139627    .044245    -3.16   0.002    -.2263456   -.0529083
           dumstate18 |  -.0906728   .0447927    -2.02   0.043     -.178465   -.0028806
           dumstate19 |  -.2120055   .0446047    -4.75   0.000    -.2994292   -.1245819
           dumstate20 |  -.1849101   .0447663    -4.13   0.000    -.2726505   -.0971697
           dumstate21 |  -.1320266   .0445738    -2.96   0.003    -.2193897   -.0446636
           dumstate22 |  -.0852161   .0431999    -1.97   0.049    -.1698864   -.0005458
           dumstate23 |   .0032357   .0435946     0.07   0.941    -.0822081    .0886796
           dumstate24 |   .0210155   .0437959     0.48   0.631    -.0648229    .1068539
           dumstate25 |  -.0134836   .0443655    -0.30   0.761    -.1004385    .0734712
           dumstate26 |  -.1281336   .0448857    -2.85   0.004    -.2161079   -.0401592
           dumstate27 |  -.1394991   .0445221    -3.13   0.002    -.2267609   -.0522372
           dumstate28 |  -.1459765    .044913    -3.25   0.001    -.2340044   -.0579486
           dumstate29 |  -.0598383   .0440113    -1.36   0.174     -.146099    .0264224
           dumstate30 |  -.1561883   .0438922    -3.56   0.000    -.2422155    -.070161
           dumstate31 |  -.1753029   .0443319    -3.95   0.000    -.2621918   -.0884139
           dumstate32 |  -.1787248   .0448314    -3.99   0.000    -.2665929   -.0908567
           dumstate33 |  -.1224825   .0451073    -2.72   0.007    -.2108913   -.0340737
           dumstate34 |   -.161217   .0443307    -3.64   0.000    -.2481036   -.0743305
           dumstate35 |  -.2384644   .0451274    -5.28   0.000    -.3269125   -.1500162
           dumstate36 |  -.0855657   .0445045    -1.92   0.055    -.1727929    .0016616
           dumstate37 |  -.1958286   .0440171    -4.45   0.000    -.2821006   -.1095565
           dumstate38 |  -.0669853   .0443087    -1.51   0.131    -.1538288    .0198583
           dumstate39 |  -.1559048   .0439023    -3.55   0.000    -.2419519   -.0698577
           dumstate40 |  -.1764437   .0444447    -3.97   0.000    -.2635539   -.0893335
           dumstate41 |   .1186238   .0445242     2.66   0.008     .0313578    .2058898
           dumstate42 |  -.0910291   .0438101    -2.08   0.038    -.1768955   -.0051627
           dumstate43 |  -.1512972   .0438837    -3.45   0.001    -.2373077   -.0652867
           dumstate44 |  -.0948123   .0441265    -2.15   0.032    -.1812989   -.0083258
           dumstate45 |  -.1240799   .0448219    -2.77   0.006    -.2119292   -.0362305
           dumstate46 |   .0022175   .0445321     0.05   0.960     -.085064    .0894989
           dumstate47 |  -.0038011   .0437472    -0.09   0.931    -.0895442     .081942
           dumstate48 |  -.0934267   .0436472    -2.14   0.032    -.1789737   -.0078796
           dumstate49 |   .0483618   .0439723     1.10   0.271    -.0378224     .134546
           dumstate50 |   .1688932   .0440585     3.83   0.000       .08254    .2552463
           dumstate51 |          0   .0442379     0.00   1.000    -.0867047    .0867047
             dumyear1 |  -.0141872   .0072038    -1.97   0.049    -.0283063    -.000068
             dumyear2 |  -.0250741   .0070204    -3.57   0.000    -.0388338   -.0113143
             dumyear3 |  -.0439106   .0069767    -6.29   0.000    -.0575848   -.0302365
             dumyear4 |  -.0617267   .0072428    -8.52   0.000    -.0759223   -.0475312
             dumyear5 |  -.0607662   .0071261    -8.53   0.000    -.0747332   -.0467991
             dumyear6 |  -.0765214   .0103596    -7.39   0.000    -.0968258   -.0562169
             dumyear7 |  -.0625996   .0080054    -7.82   0.000      -.07829   -.0469092
             dumyear8 |  -.0492463   .0077208    -6.38   0.000    -.0643789   -.0341137
             dumyear9 |  -.0227441   .0078705    -2.89   0.004      -.03817   -.0073182
            dumyear10 |  -.0229647   .0084933    -2.70   0.007    -.0396112   -.0063182
            dumyear11 |  -.0067173   .0078964    -0.85   0.395    -.0221941    .0087594
            dumyear12 |  -.0074607   .0075344    -0.99   0.322    -.0222278    .0073065
            dumyear13 |   .0000549   .0081378     0.01   0.995    -.0158949    .0160046
            dumyear14 |  -.0077523   .0074852    -1.04   0.300     -.022423    .0069185
            dumyear15 |  -.0258956   .0078095    -3.32   0.001     -.041202   -.0105892
            dumyear16 |  -.0233284   .0078509    -2.97   0.003    -.0387159    -.007941
            dumyear17 |  -.0270111   .0085444    -3.16   0.002     -.043758   -.0102643
            dumyear18 |  -.0147584   .0082338    -1.79   0.073    -.0308963    .0013795
            dumyear19 |   .0125796   .0081463     1.54   0.123    -.0033867     .028546
            dumyear20 |  -.0094763    .006831    -1.39   0.165    -.0228648    .0039121
            dumyear21 |  -.0538241   .0082991    -6.49   0.000    -.0700901   -.0375581
            dumyear22 |  -.0455531   .0076852    -5.93   0.000    -.0606159   -.0304904
            dumyear23 |  -.0531126   .0073564    -7.22   0.000    -.0675309   -.0386942
            dumyear24 |  -.0528997    .007544    -7.01   0.000    -.0676857   -.0381137
            dumyear25 |  -.0383308   .0083768    -4.58   0.000    -.0547491   -.0219125
            dumyear26 |  -.0284579   .0084019    -3.39   0.001    -.0449253   -.0119905
            dumyear27 |  -.0242797   .0076455    -3.18   0.001    -.0392646   -.0092948
            dumyear28 |  -.0147859   .0084103    -1.76   0.079    -.0312698     .001698
            dumyear29 |          0   .0076582     0.00   1.000    -.0150097    .0150097
             dumnind1 |   .1947064   .0974775     2.00   0.046     .0036538     .385759
             dumnind2 |   .3187061   .0977257     3.26   0.001      .127167    .5102453
             dumnind3 |   .2632529   .0975453     2.70   0.007     .0720674    .4544385
             dumnind4 |   .0665284   .0976549     0.68   0.496    -.1248719    .2579287
             dumnind5 |   .3266637   .0974576     3.35   0.001     .1356502    .5176773
             dumnind6 |   .2437935   .0973362     2.50   0.012     .0530179    .4345691
             dumnind7 |    .134219   .0978155     1.37   0.170    -.0574961    .3259341
             dumnind8 |   .0328818    .097285     0.34   0.735    -.1577935    .2235572
             dumnind9 |  -.0369815   .0973963    -0.38   0.704     -.227875    .1539119
            dumnind10 |          0   .0977043     0.00   1.000    -.1914972    .1914972
            dumnind11 |   .2838182   .0972523     2.92   0.004     .0932069    .4744294
                 educ |   .0597264   .0016351    36.53   0.000     .0565217    .0629311
                exper |   .0256131   .0012448    20.58   0.000     .0231733     .028053
               exper2 |   .0009535   .0001022     9.33   0.000     .0007532    .0011538
               exper3 |  -.0000504   3.57e-06   -14.13   0.000    -.0000574   -.0000434
               exper4 |   5.40e-07   3.99e-08    13.54   0.000     4.62e-07    6.18e-07
                 edex |  -.0005556   .0000579    -9.60   0.000     -.000669   -.0004421
            dumee_cl1 |   .2501559   .1248935     2.00   0.045     .0053687     .494943
            dumee_cl2 |     .05005   .1250486     0.40   0.689     -.195041    .2951409
            dumee_cl3 |   .0543289   .1257526     0.43   0.666    -.1921419    .3007998
            dumee_cl4 |   .2202925   .1256965     1.75   0.080    -.0260685    .4666534
            dumee_cl5 |  -.0603865   .1241768    -0.49   0.627    -.3037689    .1829959
            dumee_cl6 |   .0447917   .1243394     0.36   0.719    -.1989094    .2884927
            dumee_cl7 |   .1564031   .1254968     1.25   0.213    -.0895664    .4023726
            dumee_cl8 |   .2907336   .1254432     2.32   0.020     .0448692     .536598
            dumee_cl9 |  -.1081412   .1256897    -0.86   0.390    -.3544888    .1382064
           dumee_cl10 |   .0541144   .1252776     0.43   0.666    -.1914255    .2996542
           dumee_cl11 |   .1748747   .1255816     1.39   0.164     -.071261    .4210103
           dumee_cl12 |   .2177198   .1255101     1.73   0.083    -.0282759    .4637154
           dumee_cl13 |          0   .1259838     0.00   1.000     -.246924     .246924
           dumee_cl14 |   .1007847   .1260522     0.80   0.424    -.1462734    .3478428
           dumee_cl15 |   .1810455     .12644     1.43   0.152    -.0667726    .4288636
           dumee_cl16 |   .2113019     .12579     1.68   0.093    -.0352423    .4578461
                 marr |   .1537413   .0018334    83.86   0.000      .150148    .1573347
                partt |  -.1817266   .0023252   -78.15   0.000     -.186284   -.1771692
               public |   .0534406   .0030344    17.61   0.000     .0474933    .0593878
                 cmsa |   .1895701   .0019895    95.29   0.000     .1856708    .1934695
            dumnocc31 |   .2462416   .0481593     5.11   0.000      .151851    .3406322
            dumnocc32 |          0   .0479868     0.00   1.000    -.0940525    .0940525
            dumnocc33 |  -.0955071   .0479266    -1.99   0.046    -.1894416   -.0015726
            dumnocc34 |  -.0391831    .048272    -0.81   0.417    -.1337945    .0554284
          dumquarter1 |  -.0021485   .0051947    -0.41   0.679    -.0123299    .0080328
          dumquarter2 |  -.0018377   .0051602    -0.36   0.722    -.0119514     .008276
          dumquarter3 |          0   .0048976     0.00   1.000    -.0095991    .0095991
          dumquarter4 |   .0093963   .0049036     1.92   0.055    -.0002146    .0190072
                unemp |  -.0056741   .0009195    -6.17   0.000    -.0074763    -.003872
                _cons |   .2880189   .1729847     1.66   0.096    -.0510252     .627063
---------------------------------------------------------------------------------------
women at 50 quantile
(analytic weights assumed)
note: dumstate51 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind2 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc34 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs = 1080778
-------------+------------------------------           F(123,1080654) = 7968.80
       Model |  221765.748   123  1802.97356           Prob > F      =  0.0000
    Residual |  377521.174 1080654  .349345095         R-squared     =  0.3700
-------------+------------------------------           Adj R-squared =  0.3700
       Total |  599286.922 1080777  .554496369         Root MSE      =  .59105
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0836788   .0029099   -28.76   0.000     -.089382   -.0779755
             treat_st |  -.0273713    .005309    -5.16   0.000    -.0377767   -.0169658
treat_stblackrelwhite |   -.054754   .0036615   -14.95   0.000    -.0619305   -.0475775
            dumstate1 |  -.1066292   .0209871    -5.08   0.000    -.1477632   -.0654951
            dumstate2 |  -.0158265   .0205812    -0.77   0.442    -.0561649    .0245118
            dumstate3 |  -.0332368   .0211642    -1.57   0.116    -.0747179    .0082443
            dumstate4 |   .0230165   .0205029     1.12   0.262    -.0171685    .0632016
            dumstate5 |   -.069425   .0211416    -3.28   0.001    -.1108617   -.0279882
            dumstate6 |   .0376736   .0211939     1.78   0.075    -.0038657     .079213
            dumstate7 |  -.0231239   .0205047    -1.13   0.259    -.0633125    .0170647
            dumstate8 |   .0384318   .0209479     1.83   0.067    -.0026253    .0794889
            dumstate9 |  -.1108515   .0207716    -5.34   0.000    -.1515631   -.0701398
           dumstate10 |  -.1342276   .0208312    -6.44   0.000     -.175056   -.0933991
           dumstate11 |  -.1649667   .0212865    -7.75   0.000    -.2066875   -.1232458
           dumstate12 |  -.0734073   .0206121    -3.56   0.000    -.1138062   -.0330083
           dumstate13 |  -.0940964   .0212493    -4.43   0.000    -.1357444   -.0524484
           dumstate14 |  -.0944532     .02104    -4.49   0.000    -.1356909   -.0532156
           dumstate15 |  -.0174175   .0212359    -0.82   0.412    -.0590392    .0242042
           dumstate16 |  -.1120591   .0218147    -5.14   0.000    -.1548153    -.069303
           dumstate17 |  -.1649705   .0208939    -7.90   0.000    -.2059218   -.1240192
           dumstate18 |  -.1552128    .021693    -7.15   0.000    -.1977304   -.1126952
           dumstate19 |  -.1954215   .0222738    -8.77   0.000    -.2390774   -.1517657
           dumstate20 |  -.1716126   .0217973    -7.87   0.000    -.2143345   -.1288906
           dumstate21 |  -.1593746   .0215639    -7.39   0.000    -.2016392     -.11711
           dumstate22 |  -.0333739   .0213397    -1.56   0.118     -.075199    .0084513
           dumstate23 |   .0085921   .0210588     0.41   0.683    -.0326825    .0498668
           dumstate24 |   .0324471   .0207818     1.56   0.118    -.0082845    .0731787
           dumstate25 |  -.0355127   .0213465    -1.66   0.096    -.0773511    .0063257
           dumstate26 |  -.2273864   .0215749   -10.54   0.000    -.2696725   -.1851003
           dumstate27 |  -.1324464   .0218457    -6.06   0.000    -.1752632   -.0896296
           dumstate28 |  -.1646866   .0222354    -7.41   0.000    -.2082672    -.121106
           dumstate29 |  -.0719342   .0218521    -3.29   0.001    -.1147636   -.0291048
           dumstate30 |  -.1211801   .0212655    -5.70   0.000    -.1628597   -.0795005
           dumstate31 |  -.1730934   .0203852    -8.49   0.000    -.2130477   -.1331391
           dumstate32 |  -.1766437   .0211853    -8.34   0.000    -.2181662   -.1351212
           dumstate33 |  -.1684991   .0216375    -7.79   0.000    -.2109079   -.1260903
           dumstate34 |  -.1865465   .0216971    -8.60   0.000    -.2290722   -.1440209
           dumstate35 |  -.2104291   .0217719    -9.67   0.000    -.2531014   -.1677569
           dumstate36 |   -.177887   .0217063    -8.20   0.000    -.2204306   -.1353435
           dumstate37 |  -.2335221   .0214527   -10.89   0.000    -.2755686   -.1914755
           dumstate38 |  -.0739758    .021449    -3.45   0.001    -.1160152   -.0319364
           dumstate39 |  -.1856689   .0213988    -8.68   0.000    -.2276098   -.1437279
           dumstate40 |  -.1697793    .020325    -8.35   0.000    -.2096157   -.1299429
           dumstate41 |  -.0843569   .0224245    -3.76   0.000    -.1283081   -.0404057
           dumstate42 |  -.0723258   .0209395    -3.45   0.001    -.1133664   -.0312852
           dumstate43 |  -.1817154     .02176    -8.35   0.000    -.2243642   -.1390665
           dumstate44 |  -.0703745   .0233054    -3.02   0.003    -.1160523   -.0246967
           dumstate45 |  -.1539049    .021454    -7.17   0.000     -.195954   -.1118557
           dumstate46 |  -.0157349   .0229209    -0.69   0.492     -.060659    .0291892
           dumstate47 |  -.0095752   .0218502    -0.44   0.661    -.0524009    .0332505
           dumstate48 |  -.0923112    .021855    -4.22   0.000    -.1351464   -.0494761
           dumstate49 |   .0423317   .0203932     2.08   0.038     .0023616    .0823017
           dumstate50 |   .1444625    .020509     7.04   0.000     .1042656    .1846594
           dumstate51 |          0   .0214424     0.00   1.000    -.0420263    .0420263
             dumyear1 |  -.0384136   .0145686    -2.64   0.008    -.0669675   -.0098597
             dumyear2 |  -.0567249   .0142663    -3.98   0.000    -.0846863   -.0287634
             dumyear3 |  -.0455516   .0145316    -3.13   0.002     -.074033   -.0170701
             dumyear4 |  -.0222654   .0146244    -1.52   0.128    -.0509287     .006398
             dumyear5 |  -.0723734   .0288782    -2.51   0.012    -.1289736   -.0157732
             dumyear6 |  -.0526003   .0143424    -3.67   0.000    -.0807109   -.0244897
             dumyear7 |  -.0492764   .0143213    -3.44   0.001    -.0773456   -.0212073
             dumyear8 |  -.0257944   .0145352    -1.77   0.076     -.054283    .0026941
             dumyear9 |  -.0114676   .0151935    -0.75   0.450    -.0412464    .0183112
            dumyear10 |   .0145533   .0148987     0.98   0.329    -.0146477    .0437543
            dumyear11 |    .012554   .0148088     0.85   0.397    -.0164708    .0415787
            dumyear12 |   .0428078    .014801     2.89   0.004     .0137983    .0718173
            dumyear13 |   .0399318   .0140855     2.83   0.005     .0123248    .0675389
            dumyear14 |   .0280156    .015009     1.87   0.062    -.0014015    .0574327
            dumyear15 |    .013821   .0145084     0.95   0.341     -.014615     .042257
            dumyear16 |   .0250744   .0142969     1.75   0.079    -.0029471    .0530959
            dumyear17 |   .0206196   .0147521     1.40   0.162     -.008294    .0495332
            dumyear18 |   .0125117   .0138529     0.90   0.366    -.0146395     .039663
            dumyear19 |   .0308482   .0145386     2.12   0.034     .0023531    .0593433
            dumyear20 |          0   .0146036     0.00   1.000    -.0286226    .0286226
            dumyear21 |  -.0117666   .0146088    -0.81   0.421    -.0403993    .0168662
            dumyear22 |  -.0248609   .0152726    -1.63   0.104    -.0547947    .0050728
            dumyear23 |  -.0251481   .0145674    -1.73   0.084    -.0536998    .0034035
            dumyear24 |  -.0334865   .0148976    -2.25   0.025    -.0626853   -.0042878
            dumyear25 |  -.0215272   .0144459    -1.49   0.136    -.0498406    .0067862
            dumyear26 |  -.0029319    .015183    -0.19   0.847    -.0326901    .0268263
            dumyear27 |   .0035697    .014119     0.25   0.800     -.024103    .0312425
            dumyear28 |   .0000642    .015027     0.00   0.997    -.0293883    .0295167
            dumyear29 |   .0260695   .0145515     1.79   0.073     -.002451    .0545899
             dumnind1 |  -.1461083   .0739428    -1.98   0.048    -.2910337    -.001183
             dumnind2 |          0   .0733291     0.00   1.000    -.1437226    .1437226
             dumnind3 |   -.005068   .0737083    -0.07   0.945    -.1495338    .1393977
             dumnind4 |  -.2427415   .0739203    -3.28   0.001    -.3876229   -.0978602
             dumnind5 |   .0746079    .073652     1.01   0.311    -.0697476    .2189634
             dumnind6 |  -.0234422   .0740614    -0.32   0.752       -.1686    .1217156
             dumnind7 |  -.1231114   .0738714    -1.67   0.096    -.2678968    .0216741
             dumnind8 |  -.1338334   .0739404    -1.81   0.070    -.2787541    .0110873
             dumnind9 |  -.2960223   .0733848    -4.03   0.000     -.439854   -.1521907
            dumnind10 |  -.2274679   .0741415    -3.07   0.002    -.3727828    -.082153
            dumnind11 |  -.0288066   .0732251    -0.39   0.694    -.1723254    .1147122
                 educ |   .0838594   .0013832    60.63   0.000     .0811483    .0865704
                exper |   .0540839   .0011622    46.54   0.000     .0518061    .0563618
               exper2 |  -.0015548   .0000921   -16.88   0.000    -.0017353   -.0013743
               exper3 |   .0000235   3.36e-06     6.99   0.000     .0000169    .0000301
               exper4 |  -1.29e-07   3.84e-08    -3.35   0.001    -2.04e-07   -5.34e-08
                 edex |  -.0008559   .0000536   -15.97   0.000    -.0009609   -.0007509
            dumee_cl1 |          0    .157262     0.00   1.000    -.3082281    .3082281
            dumee_cl2 |  -.2593135   .1569561    -1.65   0.099    -.5669421    .0483151
            dumee_cl3 |  -.2646189    .156879    -1.69   0.092    -.5720964    .0428586
            dumee_cl4 |  -.1213894   .1568159    -0.77   0.439    -.4287433    .1859645
            dumee_cl5 |  -.3072534   .1554877    -1.98   0.048    -.6120041   -.0025028
            dumee_cl6 |  -.2809324   .1564903    -1.80   0.073     -.587648    .0257833
            dumee_cl7 |   -.192808   .1565075    -1.23   0.218    -.4995574    .1139414
            dumee_cl8 |  -.1100096   .1567145    -0.70   0.483    -.4171647    .1971454
            dumee_cl9 |  -.3350598   .1550702    -2.16   0.031    -.6389921   -.0311274
           dumee_cl10 |  -.2798171   .1559897    -1.79   0.073    -.5855516    .0259173
           dumee_cl11 |  -.1797604   .1559288    -1.15   0.249    -.4853756    .1258547
           dumee_cl12 |  -.1461372   .1563873    -0.93   0.350    -.4526511    .1603766
           dumee_cl13 |  -.3135646   .1553426    -2.02   0.044    -.6180309   -.0090984
           dumee_cl14 |  -.2486458   .1559648    -1.59   0.111    -.5543315      .05704
           dumee_cl15 |  -.1419943   .1560848    -0.91   0.363    -.4479153    .1639267
           dumee_cl16 |  -.1275814   .1566591    -0.81   0.415     -.434628    .1794652
                 marr |   .0298706   .0015113    19.77   0.000     .0269085    .0328326
                partt |  -.1889251   .0019015   -99.36   0.000    -.1926519   -.1851983
               public |   .0831199   .0026446    31.43   0.000     .0779365    .0883032
                 cmsa |   .1824449    .001812   100.68   0.000     .1788933    .1859964
            dumnocc31 |     .39188   .0037676   104.01   0.000     .3844955    .3992644
            dumnocc32 |   .0953023   .0032589    29.24   0.000      .088915    .1016896
            dumnocc33 |   -.003711   .0028498    -1.30   0.193    -.0092964    .0018745
            dumnocc34 |          0   .0030202     0.00   1.000    -.0059195    .0059195
          dumquarter1 |  -.0154137   .0025893    -5.95   0.000    -.0204886   -.0103388
          dumquarter2 |  -.0080211   .0026775    -3.00   0.003    -.0132689   -.0027734
          dumquarter3 |          0   .0022888     0.00   1.000    -.0044859    .0044859
          dumquarter4 |   .0016206   .0023519     0.69   0.491    -.0029891    .0062303
                unemp |  -.0005956   .0007367    -0.81   0.419    -.0020396    .0008484
                _cons |   .2733192   .1661014     1.65   0.100    -.0522339    .5988723
---------------------------------------------------------------------------------------
men not covered by union at 50 quantile
(analytic weights assumed)
note: dumstate51 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter4 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  878887
-------------+------------------------------           F(123,878763) = 7623.18
       Model |  230582.346   123  1874.65322           Prob > F      =  0.0000
    Residual |  368298.203 878763  .419109821          R-squared     =  0.3850
-------------+------------------------------           Adj R-squared =  0.3849
       Total |   598880.55 878886  .681408681          Root MSE      =  .64739
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.2085745   .0041579   -50.16   0.000    -.2167238   -.2004251
             treat_st |   -.029387   .0062167    -4.73   0.000    -.0415715   -.0172025
treat_stblackrelwhite |    -.01308   .0053023    -2.47   0.014    -.0234724   -.0026876
            dumstate1 |  -.0824861   .0376794    -2.19   0.029    -.1563364   -.0086358
            dumstate2 |   .0507086   .0375837     1.35   0.177    -.0229542    .1243714
            dumstate3 |  -.0476783   .0382022    -1.25   0.212    -.1225534    .0271967
            dumstate4 |   .0648052   .0371862     1.74   0.081    -.0080785    .1376889
            dumstate5 |  -.0264449   .0384988    -0.69   0.492    -.1019012    .0490114
            dumstate6 |   .0978021   .0374513     2.61   0.009     .0243989    .1712053
            dumstate7 |   .0093892    .037279     0.25   0.801    -.0636765    .0824548
            dumstate8 |   .0986076   .0378271     2.61   0.009     .0244678    .1727474
            dumstate9 |  -.0586613   .0374176    -1.57   0.117    -.1319986    .0146759
           dumstate10 |   -.082189   .0375673    -2.19   0.029    -.1558197   -.0085584
           dumstate11 |   -.068073   .0372934    -1.83   0.068    -.1411668    .0050207
           dumstate12 |   .0175585   .0373584     0.47   0.638    -.0556627    .0907798
           dumstate13 |  -.0264652   .0376307    -0.70   0.482      -.10022    .0472896
           dumstate14 |   -.027886   .0376931    -0.74   0.459    -.1017631    .0459911
           dumstate15 |  -.0031327   .0371755    -0.08   0.933    -.0759954    .0697301
           dumstate16 |  -.0641539   .0379264    -1.69   0.091    -.1384884    .0101807
           dumstate17 |  -.0963423   .0373909    -2.58   0.010    -.1696272   -.0230575
           dumstate18 |  -.0207646   .0382697    -0.54   0.587     -.095772    .0542428
           dumstate19 |  -.1464707   .0375924    -3.90   0.000    -.2201506   -.0727908
           dumstate20 |  -.1229784   .0371688    -3.31   0.001     -.195828   -.0501288
           dumstate21 |  -.0815812   .0377819    -2.16   0.031    -.1556324     -.00753
           dumstate22 |          0   .0381904     0.00   1.000     -.074852     .074852
           dumstate23 |   .0846252    .037323     2.27   0.023     .0114735     .157777
           dumstate24 |   .1125125   .0378576     2.97   0.003     .0383129    .1867122
           dumstate25 |   .0633657   .0378199     1.68   0.094      -.01076    .1374914
           dumstate26 |   -.089341   .0375575    -2.38   0.017    -.1629525   -.0157294
           dumstate27 |  -.0545577   .0377793    -1.44   0.149    -.1286039    .0194886
           dumstate28 |  -.0539428   .0387383    -1.39   0.164    -.1298687    .0219831
           dumstate29 |   .0157177   .0373947     0.42   0.674    -.0575748    .0890101
           dumstate30 |  -.0902861   .0372864    -2.42   0.015    -.1633662    -.017206
           dumstate31 |  -.1076639   .0379237    -2.84   0.005    -.1819932   -.0333347
           dumstate32 |  -.1134932   .0371264    -3.06   0.002    -.1862597   -.0407268
           dumstate33 |  -.0628764   .0375404    -1.67   0.094    -.1364543    .0107015
           dumstate34 |  -.0734034   .0380998    -1.93   0.054    -.1480778     .001271
           dumstate35 |  -.1670402   .0379024    -4.41   0.000    -.2413277   -.0927527
           dumstate36 |  -.0122599   .0385992    -0.32   0.751     -.087913    .0633932
           dumstate37 |  -.1171575   .0376487    -3.11   0.002    -.1909478   -.0433673
           dumstate38 |   .0049421   .0372548     0.13   0.894    -.0680761    .0779603
           dumstate39 |   -.077327   .0385544    -2.01   0.045    -.1528923   -.0017618
           dumstate40 |  -.0912423   .0379077    -2.41   0.016    -.1655401   -.0169444
           dumstate41 |   .1996983   .0375674     5.32   0.000     .1260674    .2733293
           dumstate42 |   .0039617   .0377002     0.11   0.916    -.0699295    .0778528
           dumstate43 |  -.0609607   .0390254    -1.56   0.118    -.1374491    .0155277
           dumstate44 |  -.0205832   .0376581    -0.55   0.585    -.0943919    .0532254
           dumstate45 |  -.0544692   .0374701    -1.45   0.146    -.1279093    .0189709
           dumstate46 |   .0481996   .0372706     1.29   0.196    -.0248495    .1212487
           dumstate47 |   .0489762   .0374749     1.31   0.191    -.0244734    .1224258
           dumstate48 |  -.0355585   .0380303    -0.94   0.350    -.1100968    .0389797
           dumstate49 |   .0988714   .0375673     2.63   0.008     .0252407     .172502
           dumstate50 |   .2403715   .0379897     6.33   0.000     .1659129    .3148301
           dumstate51 |   .0689078   .0379799     1.81   0.070    -.0055316    .1433473
             dumyear1 |   -.041818   .0086569    -4.83   0.000    -.0587852   -.0248508
             dumyear2 |  -.0370077   .0131185    -2.82   0.005    -.0627195   -.0112958
             dumyear3 |  -.0593997   .0086433    -6.87   0.000    -.0763403   -.0424591
             dumyear4 |  -.0549939   .0089192    -6.17   0.000    -.0724754   -.0375125
             dumyear5 |  -.0790864   .0090646    -8.72   0.000    -.0968527   -.0613201
             dumyear6 |  -.1055221   .0090566   -11.65   0.000    -.1232726   -.0877715
             dumyear7 |  -.0954704   .0088228   -10.82   0.000    -.1127628   -.0781781
             dumyear8 |   -.056846   .0095726    -5.94   0.000     -.075608   -.0380841
             dumyear9 |  -.0423655   .0092489    -4.58   0.000    -.0604931   -.0242379
            dumyear10 |  -.0282886    .008942    -3.16   0.002    -.0458146   -.0107626
            dumyear11 |   .0012337   .0094943     0.13   0.897    -.0173748    .0198423
            dumyear12 |  -.0133225   .0092955    -1.43   0.152    -.0315413    .0048963
            dumyear13 |  -.0096203   .0094151    -1.02   0.307    -.0280736    .0088329
            dumyear14 |  -.0053213    .008896    -0.60   0.550    -.0227572    .0121147
            dumyear15 |  -.0205903   .0087493    -2.35   0.019    -.0377386   -.0034419
            dumyear16 |  -.0178854   .0091164    -1.96   0.050    -.0357533   -.0000175
            dumyear17 |  -.0290444   .0092943    -3.12   0.002    -.0472609    -.010828
            dumyear18 |   -.029896   .0089134    -3.35   0.001    -.0473661    -.012426
            dumyear19 |    .001293   .0092325     0.14   0.889    -.0168024    .0193883
            dumyear20 |          0   .0085101     0.00   1.000    -.0166795    .0166795
            dumyear21 |  -.0259424   .0089559    -2.90   0.004    -.0434957   -.0083892
            dumyear22 |  -.0439204   .0092625    -4.74   0.000    -.0620746   -.0257662
            dumyear23 |  -.0540284    .008752    -6.17   0.000     -.071182   -.0368748
            dumyear24 |  -.0462884   .0094431    -4.90   0.000    -.0647966   -.0277803
            dumyear25 |  -.0268366   .0094786    -2.83   0.005    -.0454144   -.0082588
            dumyear26 |  -.0406221   .0091968    -4.42   0.000    -.0586474   -.0225967
            dumyear27 |  -.0287857   .0092276    -3.12   0.002    -.0468714      -.0107
            dumyear28 |  -.0130039   .0098859    -1.32   0.188    -.0323799    .0063721
            dumyear29 |   .0111999   .0086251     1.30   0.194    -.0057049    .0281048
             dumnind1 |  -.0702519   .0354243    -1.98   0.047    -.1396823   -.0008216
             dumnind2 |   .0218437   .0356667     0.61   0.540    -.0480618    .0917493
             dumnind3 |   .0175199   .0353456     0.50   0.620    -.0517563     .086796
             dumnind4 |  -.1771694   .0355509    -4.98   0.000     -.246848   -.1074909
             dumnind5 |  -.0073523   .0356991    -0.21   0.837    -.0773213    .0626168
             dumnind6 |   .0012275   .0358415     0.03   0.973    -.0690206    .0714757
             dumnind7 |  -.1142911   .0353728    -3.23   0.001    -.1836206   -.0449616
             dumnind8 |    -.20817   .0355625    -5.85   0.000    -.2778714   -.1384687
             dumnind9 |  -.2969166   .0353985    -8.39   0.000    -.3662965   -.2275367
            dumnind10 |  -.2474465   .0355198    -6.97   0.000     -.317064   -.1778289
            dumnind11 |          0   .0353177     0.00   1.000    -.0692216    .0692216
                 educ |   .0527117   .0016647    31.66   0.000     .0494489    .0559745
                exper |   .0284067   .0012704    22.36   0.000     .0259167    .0308968
               exper2 |   .0007449   .0001075     6.93   0.000     .0005341    .0009556
               exper3 |   -.000048   3.90e-06   -12.33   0.000    -.0000557   -.0000404
               exper4 |   5.50e-07   4.46e-08    12.34   0.000     4.63e-07    6.38e-07
                 edex |   -.000515   .0000622    -8.28   0.000    -.0006369   -.0003932
            dumee_cl1 |          0   .1262144     0.00   1.000     -.247376     .247376
            dumee_cl2 |  -.1888819   .1267328    -1.49   0.136    -.4372739    .0595101
            dumee_cl3 |  -.1756152   .1273178    -1.38   0.168    -.4251538    .0739234
            dumee_cl4 |   .0584151   .1282312     0.46   0.649    -.1929138    .3097439
            dumee_cl5 |  -.2995397   .1268969    -2.36   0.018    -.5482535   -.0508259
            dumee_cl6 |  -.1881533    .126835    -1.48   0.138    -.4367457     .060439
            dumee_cl7 |  -.0604795   .1273696    -0.47   0.635    -.3101197    .1891608
            dumee_cl8 |   .1144748   .1274533     0.90   0.369    -.1353293     .364279
            dumee_cl9 |  -.3333702    .126874    -2.63   0.009    -.5820391   -.0847013
           dumee_cl10 |    -.17298   .1273045    -1.36   0.174    -.4224927    .0765327
           dumee_cl11 |  -.0281167   .1274574    -0.22   0.825    -.2779289    .2216956
           dumee_cl12 |    .042748   .1269913     0.34   0.736    -.2061507    .2916466
           dumee_cl13 |  -.2542712   .1278668    -1.99   0.047    -.5048859   -.0036566
           dumee_cl14 |  -.1186955   .1270355    -0.93   0.350    -.3676809    .1302899
           dumee_cl15 |  -.0078861   .1272139    -0.06   0.951     -.257221    .2414488
           dumee_cl16 |   .0428841   .1264842     0.34   0.735    -.2050207    .2907889
                 marr |   .1702053   .0018247    93.28   0.000      .166629    .1737816
                partt |  -.1991286   .0028177   -70.67   0.000    -.2046513   -.1936059
               public |   .0074579    .003796     1.96   0.049     .0000178    .0148979
                 cmsa |    .184011   .0023697    77.65   0.000     .1793665    .1886555
            dumnocc31 |   .2732241   .0717196     3.81   0.000     .1326561    .4137921
            dumnocc32 |          0    .071445     0.00   1.000    -.1400298    .1400298
            dumnocc33 |  -.1426068   .0714597    -2.00   0.046    -.2826655   -.0025481
            dumnocc34 |  -.0897813   .0718988    -1.25   0.212    -.2307005     .051138
          dumquarter1 |  -.0137475   .0065002    -2.11   0.034    -.0264876   -.0010074
          dumquarter2 |  -.0127711   .0067168    -1.90   0.057    -.0259357    .0003935
          dumquarter3 |  -.0119931   .0062766    -1.91   0.056    -.0242949    .0003088
          dumquarter4 |          0    .006122     0.00   1.000    -.0119989    .0119989
                unemp |  -.0058404   .0009942    -5.87   0.000    -.0077891   -.0038917
                _cons |   .7723772   .1632661     4.73   0.000      .452381    1.092373
---------------------------------------------------------------------------------------
women not covered by union at 50 quantile
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear20 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl5 dropped because of collinearity
note: dumnocc33 dropped because of collinearity
note: dumquarter2 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  924344
-------------+------------------------------           F(123,924220) = 6802.97
       Model |  189613.762   123   1541.5753           Prob > F      =  0.0000
    Residual |  323785.059 924220  .350333318          R-squared     =  0.3693
-------------+------------------------------           Adj R-squared =  0.3692
       Total |  513398.821 924343  .555420251          Root MSE      =  .59189
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1146777   .0035222   -32.56   0.000    -.1215812   -.1077742
             treat_st |  -.0194236   .0060267    -3.22   0.001    -.0312356   -.0076115
treat_stblackrelwhite |  -.0352031   .0048255    -7.30   0.000     -.044661   -.0257452
            dumstate1 |  -.0574643   .0331206    -1.74   0.083    -.1223795    .0074509
            dumstate2 |   .0507041   .0336435     1.51   0.132     -.015236    .1166442
            dumstate3 |   .0334045   .0339373     0.98   0.325    -.0331114    .0999203
            dumstate4 |   .0674458   .0338906     1.99   0.047     .0010214    .1338702
            dumstate5 |  -.0388582   .0336717    -1.15   0.248    -.1048537    .0271373
            dumstate6 |   .0806872   .0338533     2.38   0.017      .014336    .1470385
            dumstate7 |  -.0001373   .0333577    -0.00   0.997    -.0655173    .0652427
            dumstate8 |   .0745132   .0335837     2.22   0.027     .0086902    .1403361
            dumstate9 |  -.0704224   .0329619    -2.14   0.033    -.1350266   -.0058182
           dumstate10 |  -.0954187   .0333122    -2.86   0.004    -.1607095   -.0301279
           dumstate11 |  -.1174919   .0336687    -3.49   0.000    -.1834814   -.0515024
           dumstate12 |   -.028499   .0329267    -0.87   0.387    -.0930342    .0360362
           dumstate13 |  -.0778135   .0333538    -2.33   0.020    -.1431859   -.0124412
           dumstate14 |  -.0510374   .0336527    -1.52   0.129    -.1169955    .0149207
           dumstate15 |    .023032   .0334449     0.69   0.491     -.042519    .0885829
           dumstate16 |  -.0741917   .0338388    -2.19   0.028    -.1405146   -.0078687
           dumstate17 |  -.1113924   .0335853    -3.32   0.001    -.1772185   -.0455662
           dumstate18 |  -.1061865   .0346834    -3.06   0.002    -.1741647   -.0382083
           dumstate19 |  -.1387954   .0339553    -4.09   0.000    -.2053465   -.0722442
           dumstate20 |  -.1261836   .0334988    -3.77   0.000      -.19184   -.0605271
           dumstate21 |  -.1127513   .0338928    -3.33   0.001      -.17918   -.0463227
           dumstate22 |          0   .0331648     0.00   1.000    -.0650018    .0650018
           dumstate23 |   .0533289   .0337729     1.58   0.114    -.0128648    .1195227
           dumstate24 |   .0878587   .0330028     2.66   0.008     .0231743    .1525431
           dumstate25 |   .0120708   .0332553     0.36   0.717    -.0531085    .0772501
           dumstate26 |  -.1971853   .0349771    -5.64   0.000    -.2657391   -.1286314
           dumstate27 |  -.0746035   .0335847    -2.22   0.026    -.1404283   -.0087786
           dumstate28 |  -.0994287   .0344478    -2.89   0.004    -.1669453   -.0319121
           dumstate29 |  -.0176577   .0337175    -0.52   0.600    -.0837428    .0484275
           dumstate30 |  -.0796095     .03391    -2.35   0.019     -.146072   -.0131471
           dumstate31 |  -.1189907   .0337897    -3.52   0.000    -.1852174    -.052764
           dumstate32 |  -.1297543   .0345342    -3.76   0.000    -.1974401   -.0620684
           dumstate33 |  -.1299947   .0345132    -3.77   0.000    -.1976395   -.0623499
           dumstate34 |  -.1345443   .0339718    -3.96   0.000    -.2011279   -.0679606
           dumstate35 |   -.163521   .0348892    -4.69   0.000    -.2319027   -.0951394
           dumstate36 |  -.1404107   .0339612    -4.13   0.000    -.2069736   -.0738479
           dumstate37 |  -.1825204   .0329944    -5.53   0.000    -.2471882   -.1178525
           dumstate38 |  -.0292948   .0337639    -0.87   0.386    -.0954709    .0368813
           dumstate39 |  -.1251005   .0337814    -3.70   0.000    -.1913108   -.0588901
           dumstate40 |  -.1090853   .0334032    -3.27   0.001    -.1745544   -.0436162
           dumstate41 |   -.024369   .0335497    -0.73   0.468    -.0901254    .0413873
           dumstate42 |  -.0169527   .0337368    -0.50   0.615    -.0830757    .0491703
           dumstate43 |  -.1335716    .035383    -3.78   0.000    -.2029211   -.0642222
           dumstate44 |  -.0208255   .0349771    -0.60   0.552    -.0893793    .0477284
           dumstate45 |  -.1050892   .0344849    -3.05   0.002    -.1726785   -.0374998
           dumstate46 |   .0160763   .0341905     0.47   0.638    -.0509359    .0830885
           dumstate47 |   .0278966   .0337251     0.83   0.408    -.0382035    .0939966
           dumstate48 |  -.0534025   .0345048    -1.55   0.122    -.1210308    .0142257
           dumstate49 |   .0731847   .0339646     2.15   0.031     .0066152    .1397542
           dumstate50 |   .1792213   .0339922     5.27   0.000     .1125978    .2458448
           dumstate51 |   .0602416   .0335848     1.79   0.073    -.0055835    .1260667
             dumyear1 |  -.0708074   .0150982    -4.69   0.000    -.1003994   -.0412155
             dumyear2 |  -.0758649    .014964    -5.07   0.000    -.1051939    -.046536
             dumyear3 |  -.0724208   .0150897    -4.80   0.000    -.1019961   -.0428456
             dumyear4 |  -.0637465   .0145898    -4.37   0.000    -.0923421   -.0351509
             dumyear5 |  -.0636966   .0148976    -4.28   0.000    -.0928954   -.0344978
             dumyear6 |  -.0959897   .0152296    -6.30   0.000    -.1258393   -.0661401
             dumyear7 |  -.0827191   .0161223    -5.13   0.000    -.1143184   -.0511199
             dumyear8 |  -.0517968    .015418    -3.36   0.001    -.0820157    -.021578
             dumyear9 |  -.0175546   .0152402    -1.15   0.249    -.0474249    .0123157
            dumyear10 |    -.01627   .0153767    -1.06   0.290    -.0464078    .0138678
            dumyear11 |  -.0062651   .0146501    -0.43   0.669    -.0349788    .0224485
            dumyear12 |   .0257461   .0151446     1.70   0.089    -.0039369    .0554291
            dumyear13 |   .0152213   .0148879     1.02   0.307    -.0139585     .044401
            dumyear14 |   .0249863    .015228     1.64   0.101    -.0048602    .0548327
            dumyear15 |   -.000189   .0148872    -0.01   0.990    -.0293674    .0289894
            dumyear16 |  -.0013934   .0146692    -0.09   0.924    -.0301446    .0273578
            dumyear17 |   .0002625   .0155754     0.02   0.987    -.0302648    .0307898
            dumyear18 |  -.0107694    .014929    -0.72   0.471    -.0400297    .0184909
            dumyear19 |   .0022964   .0150814     0.15   0.879    -.0272626    .0318554
            dumyear20 |          0   .0144678     0.00   1.000    -.0283564    .0283564
            dumyear21 |  -.0174693   .0147544    -1.18   0.236    -.0463873    .0114487
            dumyear22 |  -.0545404   .0167238    -3.26   0.001    -.0873185   -.0217624
            dumyear23 |   -.048851   .0151075    -3.23   0.001    -.0784613   -.0192408
            dumyear24 |  -.0568455    .014996    -3.79   0.000    -.0862372   -.0274538
            dumyear25 |  -.0419791   .0153292    -2.74   0.006    -.0720239   -.0119343
            dumyear26 |  -.0270587   .0155505    -1.74   0.082    -.0575372    .0034197
            dumyear27 |  -.0150315   .0146951    -1.02   0.306    -.0438334    .0137704
            dumyear28 |  -.0011007   .0158651    -0.07   0.945    -.0321958    .0299944
            dumyear29 |    .027959   .0147521     1.90   0.058    -.0009547    .0568726
             dumnind1 |          0   .0705302     0.00   1.000    -.1382369    .1382369
             dumnind2 |   .1402567   .0707751     1.98   0.048     .0015399    .2789735
             dumnind3 |   .1404525   .0702476     2.00   0.046     .0027695    .2781355
             dumnind4 |  -.1072498   .0702311    -1.53   0.127    -.2449004    .0304009
             dumnind5 |   .1361847   .0702929     1.94   0.053     -.001587    .2739565
             dumnind6 |    .129841    .069894     1.86   0.063    -.0071489    .2668308
             dumnind7 |   .0232361   .0704194     0.33   0.741    -.1147837    .1612558
             dumnind8 |   .0128786   .0702987     0.18   0.855    -.1249044    .1506617
             dumnind9 |  -.1583434   .0702843    -2.25   0.024    -.2960983   -.0205885
            dumnind10 |  -.0837902   .0705807    -1.19   0.235     -.222126    .0545457
            dumnind11 |     .13737   .0701602     1.96   0.050    -.0001416    .2748817
                 educ |   .0751968    .001568    47.96   0.000     .0721234    .0782701
                exper |    .056529   .0013192    42.85   0.000     .0539434    .0591145
               exper2 |  -.0017248   .0001107   -15.58   0.000    -.0019417   -.0015079
               exper3 |   .0000281   3.88e-06     7.25   0.000     .0000205    .0000357
               exper4 |  -1.69e-07   4.29e-08    -3.95   0.000    -2.53e-07   -8.53e-08
                 edex |   -.000884   .0000565   -15.63   0.000    -.0009948   -.0007731
            dumee_cl1 |   .3232506   .0135665    23.83   0.000     .2966606    .3498405
            dumee_cl2 |   .0917394   .0134651     6.81   0.000     .0653482    .1181305
            dumee_cl3 |   .1077442   .0134658     8.00   0.000     .0813517    .1341367
            dumee_cl4 |   .2789994   .0149045    18.72   0.000      .249787    .3082118
            dumee_cl5 |   .0173548   .0118756     1.46   0.144    -.0059209    .0406305
            dumee_cl6 |   .0768123   .0122265     6.28   0.000     .0528487    .1007758
            dumee_cl7 |   .1836745    .012541    14.65   0.000     .1590946    .2082544
            dumee_cl8 |   .2686196   .0141195    19.02   0.000     .2409458    .2962933
            dumee_cl9 |   -.013478   .0127518    -1.06   0.291     -.038471     .011515
           dumee_cl10 |   .0760716   .0111804     6.80   0.000     .0541584    .0979848
           dumee_cl11 |   .1945578   .0120336    16.17   0.000     .1709723    .2181433
           dumee_cl12 |    .227951   .0133538    17.07   0.000     .2017779     .254124
           dumee_cl13 |          0   .0115946     0.00   1.000     -.022725     .022725
           dumee_cl14 |   .1041878   .0120459     8.65   0.000     .0805783    .1277973
           dumee_cl15 |    .226714   .0126804    17.88   0.000     .2018608    .2515672
           dumee_cl16 |    .245104    .014028    17.47   0.000     .2176096    .2725984
                 marr |   .0378891   .0015844    23.91   0.000     .0347837    .0409945
                partt |   -.200646   .0020432   -98.20   0.000    -.2046506   -.1966415
               public |   .0152054   .0032842     4.63   0.000     .0087685    .0216423
                 cmsa |   .1903341   .0019237    98.94   0.000     .1865637    .1941045
            dumnocc31 |   .4374925    .020162    21.70   0.000     .3979757    .4770093
            dumnocc32 |   .1510906    .019952     7.57   0.000     .1119853     .190196
            dumnocc33 |   .0394189   .0198304     1.99   0.047      .000552    .0782859
            dumnocc34 |          0   .0198968     0.00   1.000    -.0389971    .0389971
          dumquarter1 |  -.0153566   .0031225    -4.92   0.000    -.0214766   -.0092366
          dumquarter2 |  -.0072256   .0030669    -2.36   0.018    -.0132366   -.0012145
          dumquarter3 |          0   .0029313     0.00   1.000    -.0057453    .0057453
          dumquarter4 |   .0025725   .0027666     0.93   0.352      -.00285     .007995
                unemp |   .0003664   .0008401     0.44   0.663    -.0012802     .002013
                _cons |  -.2146577   .0861926    -2.49   0.013    -.3835924    -.045723
---------------------------------------------------------------------------------------
men covered by union at 50 quantile
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind6 dropped because of collinearity
note: dumee_cl13 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter2 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  189324
-------------+------------------------------           F(123,189200) =  575.70
       Model |   10203.893   123  82.9584794           Prob > F      =  0.0000
    Residual |  36459.2425 189200  .192702128          R-squared     =  0.2187
-------------+------------------------------           Adj R-squared =  0.2182
       Total |  46663.1355 189323  .246473675          Root MSE      =  .43898
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1248848   .0045016   -27.74   0.000    -.1337078   -.1160619
             treat_st |  -.0588873   .0107229    -5.49   0.000     -.079904   -.0378706
treat_stblackrelwhite |  -.0191426   .0077259    -2.48   0.013    -.0342851       -.004
            dumstate1 |  -.0943321   .0409811    -2.30   0.021    -.1746541     -.01401
            dumstate2 |  -.0362238   .0403839    -0.90   0.370    -.1153753    .0429276
            dumstate3 |  -.1059091   .0415573    -2.55   0.011    -.1873604   -.0244578
            dumstate4 |   .0166197   .0400823     0.41   0.678    -.0619407      .09518
            dumstate5 |  -.0458284   .0403278    -1.14   0.256      -.12487    .0332131
            dumstate6 |   .0792552   .0418681     1.89   0.058    -.0028053    .1613157
            dumstate7 |   .0227469   .0396067     0.57   0.566    -.0548813    .1003751
            dumstate8 |   .0842936    .040697     2.07   0.038     .0045283    .1640588
            dumstate9 |  -.0853863   .0393871    -2.17   0.030    -.1625841   -.0081884
           dumstate10 |  -.0783611   .0400115    -1.96   0.050    -.1567827    .0000605
           dumstate11 |  -.0473804   .0396768    -1.19   0.232    -.1251461    .0303853
           dumstate12 |   .0136026    .039667     0.34   0.732    -.0641437     .091349
           dumstate13 |   .0411971   .0398914     1.03   0.302    -.0369892    .1193834
           dumstate14 |  -.0664474   .0401208    -1.66   0.098    -.1450832    .0121885
           dumstate15 |  -.0116718   .0398217    -0.29   0.769    -.0897213    .0663777
           dumstate16 |  -.0718483   .0409722    -1.75   0.080    -.1521528    .0084563
           dumstate17 |  -.0305266   .0406989    -0.75   0.453    -.1102956    .0492423
           dumstate18 |  -.0288133   .0423962    -0.68   0.497    -.1119087    .0542822
           dumstate19 |   -.081145    .043307    -1.87   0.061    -.1660257    .0037358
           dumstate20 |  -.0974551   .0415294    -2.35   0.019    -.1788517   -.0160585
           dumstate21 |   .0071647    .042692     0.17   0.867    -.0765106    .0908399
           dumstate22 |          0    .041361     0.00   1.000    -.0810665    .0810665
           dumstate23 |   .0357774   .0390899     0.92   0.360    -.0408378    .1123927
           dumstate24 |   .0302635   .0412223     0.73   0.463    -.0505312    .1110583
           dumstate25 |   .0676113   .0412523     1.64   0.101    -.0132423    .1484648
           dumstate26 |  -.0562026   .0403211    -1.39   0.163     -.135231    .0228259
           dumstate27 |  -.0242769   .0428344    -0.57   0.571    -.1082313    .0596775
           dumstate28 |  -.0694846   .0436624    -1.59   0.112     -.155062    .0160927
           dumstate29 |  -.0054461   .0421135    -0.13   0.897    -.0879876    .0770954
           dumstate30 |  -.0261244   .0407509    -0.64   0.521    -.1059952    .0537463
           dumstate31 |  -.1006244   .0400258    -2.51   0.012     -.179074   -.0221747
           dumstate32 |  -.0504181   .0417789    -1.21   0.228    -.1323038    .0314675
           dumstate33 |  -.0300967   .0427928    -0.70   0.482    -.1139696    .0537762
           dumstate34 |  -.0679867   .0419058    -1.62   0.105    -.1501211    .0141478
           dumstate35 |   -.070975   .0418545    -1.70   0.090    -.1530089    .0110589
           dumstate36 |  -.0264041    .043904    -0.60   0.548    -.1124548    .0596466
           dumstate37 |  -.1216069   .0414973    -2.93   0.003    -.2029407   -.0402731
           dumstate38 |   .0038653   .0410553     0.09   0.925    -.0766022    .0843327
           dumstate39 |  -.1343217   .0406394    -3.31   0.001    -.2139741   -.0546694
           dumstate40 |  -.0860862    .041008    -2.10   0.036     -.166461   -.0057115
           dumstate41 |   .1633166   .0427943     3.82   0.000     .0794407    .2471925
           dumstate42 |  -.0636787   .0397897    -1.60   0.110    -.1416655    .0143082
           dumstate43 |  -.1241616   .0450584    -2.76   0.006     -.212475   -.0358483
           dumstate44 |  -.0228119   .0431019    -0.53   0.597    -.1072906    .0616667
           dumstate45 |  -.0793166   .0424656    -1.87   0.062    -.1625481     .003915
           dumstate46 |    .066421   .0422077     1.57   0.116    -.0163051    .1491471
           dumstate47 |   .0287264   .0396328     0.72   0.469     -.048953    .1064058
           dumstate48 |  -.0438855   .0398892    -1.10   0.271    -.1220674    .0342965
           dumstate49 |   .0830374   .0394027     2.11   0.035     .0058091    .1602658
           dumstate50 |   .1771014   .0400498     4.42   0.000     .0986047    .2555982
           dumstate51 |  -.0244915   .0433904    -0.56   0.572    -.1095356    .0605526
             dumyear1 |  -.0351855   .0105539    -3.33   0.001    -.0558709      -.0145
             dumyear2 |  -.0391726   .0128505    -3.05   0.002    -.0643593   -.0139858
             dumyear3 |  -.0542433   .0099696    -5.44   0.000    -.0737835   -.0347031
             dumyear4 |  -.0752989   .0145904    -5.16   0.000    -.1038957    -.046702
             dumyear5 |  -.0577505   .0107451    -5.37   0.000    -.0788105   -.0366904
             dumyear6 |  -.0386103   .0108543    -3.56   0.000    -.0598845   -.0173362
             dumyear7 |  -.0353188   .0108376    -3.26   0.001    -.0565603   -.0140774
             dumyear8 |  -.0298403   .0119898    -2.49   0.013      -.05334   -.0063407
             dumyear9 |  -.0232236   .0120981    -1.92   0.055    -.0469357    .0004884
            dumyear10 |  -.0200721   .0119661    -1.68   0.093    -.0435254    .0033811
            dumyear11 |  -.0085445   .0114112    -0.75   0.454    -.0309102    .0138213
            dumyear12 |  -.0193855   .0111458    -1.74   0.082     -.041231    .0024599
            dumyear13 |   .0074638   .0115417     0.65   0.518    -.0151577    .0300854
            dumyear14 |  -.0220963   .0113226    -1.95   0.051    -.0442883    .0000956
            dumyear15 |  -.0097442   .0116672    -0.84   0.404    -.0326116    .0131232
            dumyear16 |  -.0081401   .0114456    -0.71   0.477    -.0305733    .0142931
            dumyear17 |  -.0226602   .0116643    -1.94   0.052    -.0455219    .0002016
            dumyear18 |  -.0267981   .0119849    -2.24   0.025    -.0502882   -.0033079
            dumyear19 |   .0007706   .0109975     0.07   0.944    -.0207842    .0223254
            dumyear20 |  -.0046526   .0092654    -0.50   0.616    -.0228127    .0135074
            dumyear21 |  -.0252649   .0120779    -2.09   0.036    -.0489374   -.0015925
            dumyear22 |  -.0292318   .0120148    -2.43   0.015    -.0527805    -.005683
            dumyear23 |  -.0398153   .0112748    -3.53   0.000    -.0619137   -.0177168
            dumyear24 |   -.042398   .0116847    -3.63   0.000    -.0652998   -.0194963
            dumyear25 |  -.0402708   .0117905    -3.42   0.001      -.06338   -.0171616
            dumyear26 |  -.0452735    .012303    -3.68   0.000    -.0693871     -.02116
            dumyear27 |  -.0121629   .0123897    -0.98   0.326    -.0364464    .0121206
            dumyear28 |  -.0081643   .0132773    -0.61   0.539    -.0341874    .0178589
            dumyear29 |          0   .0104886     0.00   1.000    -.0205575    .0205575
             dumnind1 |   .1391024   .0702473     1.98   0.048     .0014193    .2767854
             dumnind2 |   .2320804   .0701476     3.31   0.001     .0945928     .369568
             dumnind3 |     .02086   .0704036     0.30   0.767    -.1171294    .1588495
             dumnind4 |  -.1078829   .0710572    -1.52   0.129    -.2471534    .0313875
             dumnind5 |   .1739083   .0709627     2.45   0.014      .034823    .3129936
             dumnind6 |          0   .0696434     0.00   1.000    -.1364995    .1364995
             dumnind7 |   .0183576   .0703996     0.26   0.794    -.1196239     .156339
             dumnind8 |  -.0891658   .0710428    -1.26   0.209    -.2284081    .0500764
             dumnind9 |  -.0712668   .0707125    -1.01   0.314    -.2098616    .0673279
            dumnind10 |  -.0835916   .0698032    -1.20   0.231    -.2204043    .0532212
            dumnind11 |   .1820826   .0706933     2.58   0.010     .0435255    .3206398
                 educ |   .0657856    .003334    19.73   0.000     .0592511    .0723202
                exper |   .0304162   .0024707    12.31   0.000     .0255736    .0352587
               exper2 |  -5.42e-06   .0001691    -0.03   0.974    -.0003368    .0003259
               exper3 |  -.0000164   5.57e-06    -2.95   0.003    -.0000274   -5.54e-06
               exper4 |   2.04e-07   6.02e-08     3.38   0.001     8.57e-08    3.22e-07
                 edex |  -.0005657   .0001075    -5.26   0.000    -.0007765    -.000355
            dumee_cl1 |          0   .0828648     0.00   1.000     -.162413     .162413
            dumee_cl2 |  -.1355075   .0837502    -1.62   0.106    -.2996559     .028641
            dumee_cl3 |  -.1724777   .0835056    -2.07   0.039    -.3361467   -.0088087
            dumee_cl4 |  -.2455765   .0855406    -2.87   0.004     -.413234   -.0779189
            dumee_cl5 |  -.1878682    .083034    -2.26   0.024    -.3506128   -.0251235
            dumee_cl6 |  -.1566268   .0827106    -1.89   0.058    -.3187375     .005484
            dumee_cl7 |  -.1303769   .0836541    -1.56   0.119    -.2943369    .0335831
            dumee_cl8 |  -.1847772   .0847799    -2.18   0.029    -.3509437   -.0186107
            dumee_cl9 |  -.1935182    .083872    -2.31   0.021    -.3579053   -.0291311
           dumee_cl10 |  -.1687792   .0831683    -2.03   0.042    -.3317872   -.0057712
           dumee_cl11 |  -.1429131   .0830271    -1.72   0.085    -.3056443    .0198181
           dumee_cl12 |  -.1769422   .0834357    -2.12   0.034    -.3404742   -.0134103
           dumee_cl13 |  -.1578929    .083589    -1.89   0.059    -.3217253    .0059395
           dumee_cl14 |  -.1687722   .0832065    -2.03   0.043     -.331855   -.0056895
           dumee_cl15 |  -.1382151   .0830113    -1.67   0.096    -.3009153    .0244852
           dumee_cl16 |  -.1604417   .0836449    -1.92   0.055    -.3243838    .0035005
                 marr |   .0597517   .0028199    21.19   0.000     .0542248    .0652787
                partt |  -.0722174   .0057319   -12.60   0.000    -.0834518   -.0609831
               public |   -.072269   .0043022   -16.80   0.000    -.0807012   -.0638369
                 cmsa |   .1219976   .0033459    36.46   0.000     .1154397    .1285555
            dumnocc31 |   .1769273   .0054924    32.21   0.000     .1661622    .1876923
            dumnocc32 |          0   .0050657     0.00   1.000    -.0099286    .0099286
            dumnocc33 |   .0054345   .0043825     1.24   0.215    -.0031552    .0140241
            dumnocc34 |   .0691569   .0052554    13.16   0.000     .0588564    .0794573
          dumquarter1 |  -.0041474   .0042462    -0.98   0.329    -.0124699    .0041751
          dumquarter2 |  -.0033216   .0043734    -0.76   0.448    -.0118933    .0052501
          dumquarter3 |          0   .0037837     0.00   1.000    -.0074161    .0074161
          dumquarter4 |   .0051086    .003613     1.41   0.157    -.0019728      .01219
                unemp |  -.0003615   .0013142    -0.28   0.783    -.0029373    .0022144
                _cons |   .8103714   .1234548     6.56   0.000      .568403     1.05234
---------------------------------------------------------------------------------------
women covered by union at 50 quantile
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind2 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc34 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  154778
-------------+------------------------------           F(123,154654) =  790.87
       Model |  17116.2688   123  139.156657           Prob > F      =  0.0000
    Residual |   36246.628 154654  .234372393          R-squared     =  0.3208
-------------+------------------------------           Adj R-squared =  0.3202
       Total |  53362.8968 154777  .344772782          Root MSE      =  .48412
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0584583   .0049173   -11.89   0.000     -.068096   -.0488205
             treat_st |  -.0719681   .0124001    -5.80   0.000     -.096272   -.0476641
treat_stblackrelwhite |   .0155585    .009237     1.68   0.092    -.0025459    .0336629
            dumstate1 |  -.1339546   .0397099    -3.37   0.001    -.2117851    -.056124
            dumstate2 |  -.0632177    .040196    -1.57   0.116    -.1420011    .0155657
            dumstate3 |  -.1140891    .040363    -2.83   0.005    -.1931997   -.0349785
            dumstate4 |    .034524    .039422     0.88   0.381    -.0427422    .1117902
            dumstate5 |   .0172531   .0402838     0.43   0.668    -.0617022    .0962085
            dumstate6 |   .0901191    .039074     2.31   0.021     .0135348    .1667034
            dumstate7 |   .0057799   .0384395     0.15   0.880    -.0695607    .0811205
            dumstate8 |   .0963319   .0386513     2.49   0.013     .0205763    .1720876
            dumstate9 |  -.0620866   .0390565    -1.59   0.112    -.1386366    .0144634
           dumstate10 |  -.0816163   .0384293    -2.12   0.034    -.1569371   -.0062956
           dumstate11 |  -.1252758   .0407651    -3.07   0.002    -.2051745    -.045377
           dumstate12 |  -.0767388   .0389527    -1.97   0.049    -.1530853   -.0003922
           dumstate13 |   .0012763   .0384671     0.03   0.974    -.0741184     .076671
           dumstate14 |  -.0898169   .0390851    -2.30   0.022    -.1664228    -.013211
           dumstate15 |  -.0280526     .03857    -0.73   0.467     -.103649    .0475439
           dumstate16 |  -.0889795   .0410571    -2.17   0.030    -.1694505   -.0085086
           dumstate17 |  -.1472901    .039307    -3.75   0.000     -.224331   -.0702491
           dumstate18 |  -.1410517   .0430744    -3.27   0.001    -.2254767   -.0566268
           dumstate19 |  -.1977333   .0421465    -4.69   0.000    -.2803396    -.115127
           dumstate20 |  -.1750966   .0400297    -4.37   0.000    -.2535539   -.0966392
           dumstate21 |  -.1207889   .0399271    -3.03   0.002    -.1990452   -.0425325
           dumstate22 |    .064072   .0396373     1.62   0.106    -.0136163    .1417603
           dumstate23 |   .0476359   .0401844     1.19   0.236    -.0311248    .1263965
           dumstate24 |   .0488495   .0394203     1.24   0.215    -.0284135    .1261124
           dumstate25 |   .0642013   .0416932     1.54   0.124    -.0175165    .1459192
           dumstate26 |  -.1541505   .0394492    -3.91   0.000      -.23147   -.0768309
           dumstate27 |  -.0662575   .0433851    -1.53   0.127    -.1512914    .0187763
           dumstate28 |  -.1249584   .0440711    -2.84   0.005    -.2113369     -.03858
           dumstate29 |  -.0255706   .0422411    -0.61   0.545    -.1083622    .0572211
           dumstate30 |  -.0499027   .0411227    -1.21   0.225    -.1305023    .0306969
           dumstate31 |  -.1305545   .0385501    -3.39   0.001    -.2061119   -.0549971
           dumstate32 |   -.093959   .0436996    -2.15   0.032    -.1796092   -.0083087
           dumstate33 |  -.0981794   .0426601    -2.30   0.021    -.1817924   -.0145665
           dumstate34 |  -.1659288   .0463143    -3.58   0.000    -.2567039   -.0751537
           dumstate35 |  -.1651538   .0427003    -3.87   0.000    -.2488454   -.0814622
           dumstate36 |  -.1211878   .0445003    -2.72   0.006    -.2084074   -.0339681
           dumstate37 |  -.2445361   .0432412    -5.66   0.000     -.329288   -.1597843
           dumstate38 |  -.0412623   .0403543    -1.02   0.307    -.1203558    .0378313
           dumstate39 |  -.1872835   .0375847    -4.98   0.000    -.2609488   -.1136183
           dumstate40 |  -.1827876   .0413295    -4.42   0.000    -.2637926   -.1017826
           dumstate41 |          0   .0397946     0.00   1.000    -.0779966    .0779966
           dumstate42 |  -.1050935   .0417495    -2.52   0.012    -.1869215   -.0232654
           dumstate43 |  -.1647299   .0422392    -3.90   0.000    -.2475178    -.081942
           dumstate44 |  -.0717447   .0436761    -1.64   0.100    -.1573488    .0138595
           dumstate45 |  -.1096376   .0432387    -2.54   0.011    -.1943845   -.0248907
           dumstate46 |   .0121306   .0418712     0.29   0.772    -.0699361    .0941972
           dumstate47 |  -.0471704   .0386524    -1.22   0.222    -.1229283    .0285875
           dumstate48 |   -.099878   .0392992    -2.54   0.011    -.1769037   -.0228524
           dumstate49 |   .0791282   .0384983     2.06   0.040     .0036723    .1545842
           dumstate50 |   .1410473   .0403386     3.50   0.000     .0619845    .2201101
           dumstate51 |  -.0605824   .0423078    -1.43   0.152    -.1435048      .02234
             dumyear1 |   .0141962    .034425     0.41   0.680    -.0532761    .0816686
             dumyear2 |   .0185878      .0331     0.56   0.574    -.0462875     .083463
             dumyear3 |    .008162   .0337987     0.24   0.809    -.0580828    .0744068
             dumyear4 |  -.0067281    .033258    -0.20   0.840     -.071913    .0584569
             dumyear5 |   .0054351   .0327081     0.17   0.868    -.0586722    .0695424
             dumyear6 |   .0276978   .0337844     0.82   0.412    -.0385189    .0939145
             dumyear7 |   .0257406   .0338998     0.76   0.448    -.0407024    .0921836
             dumyear8 |   .0584323   .0336668     1.74   0.083    -.0075539    .1244185
             dumyear9 |   .0362923     .03414     1.06   0.288    -.0306214    .1032059
            dumyear10 |   .0410892   .0329911     1.25   0.213    -.0235726     .105751
            dumyear11 |    .057243   .0331367     1.73   0.084    -.0077044    .1221903
            dumyear12 |   .0685963   .0340016     2.02   0.044     .0019539    .1352387
            dumyear13 |   .0531451   .0334204     1.59   0.112    -.0123583    .1186485
            dumyear14 |   .0490619   .0332979     1.47   0.141    -.0162014    .1143252
            dumyear15 |    .039374   .0340892     1.16   0.248    -.0274401     .106188
            dumyear16 |   .0385023   .0343654     1.12   0.263    -.0288532    .1058577
            dumyear17 |   .0455177   .0329348     1.38   0.167    -.0190338    .1100693
            dumyear18 |   .0305169   .0335609     0.91   0.363    -.0352618    .0962955
            dumyear19 |   .0535919   .0344118     1.56   0.119    -.0138546    .1210384
            dumyear20 |   .0609776   .0341607     1.79   0.074    -.0059766    .1279318
            dumyear21 |   .0344696   .0360839     0.96   0.339    -.0362542    .1051934
            dumyear22 |   .0061588   .0333047     0.18   0.853    -.0591177    .0714354
            dumyear23 |   .0318814   .0337895     0.94   0.345    -.0343453    .0981082
            dumyear24 |   .0060216   .0354781     0.17   0.865    -.0635148    .0755581
            dumyear25 |   .0196368   .0334941     0.59   0.558     -.046011    .0852845
            dumyear26 |   .0251445   .0339579     0.74   0.459    -.0414123    .0917014
            dumyear27 |   .0005716   .0346637     0.02   0.987    -.0673685    .0685118
            dumyear28 |   .0071546   .0341413     0.21   0.834    -.0597615    .0740708
            dumyear29 |          0   .0324954     0.00   1.000    -.0636903    .0636903
             dumnind1 |  -.1139063   .0680757    -1.67   0.094    -.2473333    .0195207
             dumnind2 |          0   .0650263     0.00   1.000    -.1274502    .1274502
             dumnind3 |  -.1506046   .0663003    -2.27   0.023    -.2805518   -.0206574
             dumnind4 |   -.371135   .0660945    -5.62   0.000    -.5006788   -.2415912
             dumnind5 |   .0704848   .0659267     1.07   0.285    -.0587302    .1996997
             dumnind6 |  -.2427394   .0666727    -3.64   0.000    -.3734165   -.1120623
             dumnind7 |  -.2632289   .0668825    -3.94   0.000    -.3943172   -.1321407
             dumnind8 |  -.2632297    .065903    -3.99   0.000    -.3923982   -.1340612
             dumnind9 |  -.4296082   .0661816    -6.49   0.000    -.5593227   -.2998936
            dumnind10 |  -.3344042     .06648    -5.03   0.000    -.4647037   -.2041048
            dumnind11 |  -.1642676   .0666137    -2.47   0.014    -.2948291    -.033706
                 educ |   .1280121   .0034555    37.05   0.000     .1212394    .1347848
                exper |   .0515142   .0030049    17.14   0.000     .0456246    .0574037
               exper2 |  -.0012088   .0002382    -5.07   0.000    -.0016757   -.0007419
               exper3 |   .0000159   8.30e-06     1.91   0.056    -4.14e-07    .0000321
               exper4 |  -8.09e-08   9.33e-08    -0.87   0.386    -2.64e-07    1.02e-07
                 edex |   -.000984   .0001207    -8.15   0.000    -.0012207   -.0007474
            dumee_cl1 |          0   .1514953     0.00   1.000    -.2969277    .2969277
            dumee_cl2 |  -.3021828   .1514793    -1.99   0.046    -.5990792   -.0052864
            dumee_cl3 |  -.4110162    .149603    -2.75   0.006    -.7042351   -.1177974
            dumee_cl4 |  -.5458808   .1507036    -3.62   0.000    -.8412567   -.2505049
            dumee_cl5 |  -.2695917   .1512148    -1.78   0.075    -.5659697    .0267863
            dumee_cl6 |  -.3842979   .1503155    -2.56   0.011    -.6789131   -.0896826
            dumee_cl7 |  -.4314456    .150763    -2.86   0.004    -.7269379   -.1359534
            dumee_cl8 |  -.4961924   .1506943    -3.29   0.001    -.7915501   -.2008346
            dumee_cl9 |  -.3145878   .1510924    -2.08   0.037    -.6107258   -.0184498
           dumee_cl10 |  -.4232986   .1500577    -2.82   0.005    -.7174086   -.1291887
           dumee_cl11 |  -.4516036   .1502365    -3.01   0.003     -.746064   -.1571432
           dumee_cl12 |  -.4792132   .1506941    -3.18   0.001    -.7745705   -.1838558
           dumee_cl13 |  -.2998887   .1506001    -1.99   0.046    -.5950618   -.0047156
           dumee_cl14 |  -.4205609   .1505307    -2.79   0.005     -.715598   -.1255239
           dumee_cl15 |  -.4075052    .150791    -2.70   0.007    -.7030524   -.1119581
           dumee_cl16 |  -.4370878   .1515951    -2.88   0.004    -.7342111   -.1399645
                 marr |   .0059444   .0028836     2.06   0.039     .0002926    .0115961
                partt |  -.0689603   .0043455   -15.87   0.000    -.0774774   -.0604432
               public |   .0179227   .0042297     4.24   0.000     .0096326    .0262129
                 cmsa |   .1258479   .0041599    30.25   0.000     .1176946    .1340013
            dumnocc31 |   .3094088   .0306908    10.08   0.000     .2492555     .369562
            dumnocc32 |   .0484772   .0303017     1.60   0.110    -.0109136     .107868
            dumnocc33 |          0   .0304036     0.00   1.000    -.0595905    .0595905
            dumnocc34 |   .0583977   .0301734     1.94   0.053    -.0007416     .117537
          dumquarter1 |   -.018853   .0054873    -3.44   0.001     -.029608   -.0080979
          dumquarter2 |  -.0155286    .005854    -2.65   0.008    -.0270023   -.0040549
          dumquarter3 |    -.00078   .0050784    -0.15   0.878    -.0107334    .0091735
          dumquarter4 |          0   .0055718     0.00   1.000    -.0109206    .0109206
                unemp |  -.0003227   .0015688    -0.21   0.837    -.0033976    .0027522
                _cons |   .1515904   .1832063     0.83   0.408    -.2074902     .510671
---------------------------------------------------------------------------------------
men at 80 quantile
(analytic weights assumed)
note: dumstate51 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter4 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs = 1069714
-------------+------------------------------           F(123,1069590) = 2613.91
       Model |  239488.543   123  1947.06133           Prob > F      =  0.0000
    Residual |  589448.705 1069590  .551097809         R-squared     =  0.2889
-------------+------------------------------           Adj R-squared =  0.2888
       Total |  828937.248 1069713   .77491556         Root MSE      =  .74236
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1678243   .0035509   -47.26   0.000    -.1747839   -.1608647
             treat_st |   -.068051   .0059345   -11.47   0.000    -.0796825   -.0564196
treat_stblackrelwhite |   .0523029   .0047482    11.02   0.000     .0429966    .0616092
            dumstate1 |  -.1313038   .0197731    -6.64   0.000    -.1700584   -.0925492
            dumstate2 |  -.0360591   .0199585    -1.81   0.071    -.0751771    .0030589
            dumstate3 |   -.133887   .0189994    -7.05   0.000    -.1711251   -.0966488
            dumstate4 |   .0475853   .0199759     2.38   0.017     .0084332    .0867375
            dumstate5 |  -.0933989   .0196957    -4.74   0.000    -.1320018   -.0547959
            dumstate6 |   .0595354   .0197996     3.01   0.003     .0207289    .0983419
            dumstate7 |   .0662041   .0193115     3.43   0.001     .0283541     .104054
            dumstate8 |    .181227   .0196263     9.23   0.000     .1427601    .2196939
            dumstate9 |  -.0816726   .0192207    -4.25   0.000    -.1193446   -.0440006
           dumstate10 |  -.1239665   .0195542    -6.34   0.000    -.1622922   -.0856409
           dumstate11 |  -.1084051   .0191893    -5.65   0.000    -.1460155   -.0707947
           dumstate12 |   .0325997   .0197498     1.65   0.099    -.0061092    .0713086
           dumstate13 |  -.0218596   .0193037    -1.13   0.257    -.0596941     .015975
           dumstate14 |  -.1180162   .0187368    -6.30   0.000    -.1547397   -.0812927
           dumstate15 |   -.049071   .0196255    -2.50   0.012    -.0875363   -.0106058
           dumstate16 |  -.0954988   .0201158    -4.75   0.000    -.1349252   -.0560725
           dumstate17 |  -.1090064   .0196114    -5.56   0.000    -.1474442   -.0705687
           dumstate18 |  -.0671505   .0208111    -3.23   0.001    -.1079395   -.0263615
           dumstate19 |  -.1057941   .0200614    -5.27   0.000    -.1451137   -.0664746
           dumstate20 |  -.0998549   .0203477    -4.91   0.000    -.1397357   -.0599741
           dumstate21 |  -.0581955   .0201269    -2.89   0.004    -.0976437   -.0187474
           dumstate22 |  -.0319017     .01837    -1.74   0.082    -.0679063     .004103
           dumstate23 |   .0990715   .0194375     5.10   0.000     .0609747    .1371684
           dumstate24 |   .1789025   .0204041     8.77   0.000      .138911    .2188939
           dumstate25 |   .1202104   .0204199     5.89   0.000     .0801881    .1602327
           dumstate26 |  -.0656123   .0195905    -3.35   0.001     -.104009   -.0272156
           dumstate27 |  -.0367746   .0204658    -1.80   0.072     -.076887    .0033377
           dumstate28 |  -.0796774   .0204185    -3.90   0.000     -.119697   -.0396578
           dumstate29 |  -.0041774   .0201228    -0.21   0.836    -.0436174    .0352626
           dumstate30 |  -.0732854   .0206411    -3.55   0.000    -.1137413   -.0328294
           dumstate31 |  -.1207941   .0191077    -6.32   0.000    -.1582445   -.0833437
           dumstate32 |  -.0736124   .0207419    -3.55   0.000    -.1142658   -.0329589
           dumstate33 |  -.0372868    .020247    -1.84   0.066    -.0769702    .0023967
           dumstate34 |  -.0373009   .0206487    -1.81   0.071    -.0777717    .0031699
           dumstate35 |  -.0810006   .0206512    -3.92   0.000    -.1214763   -.0405248
           dumstate36 |  -.0016231   .0205526    -0.08   0.937    -.0419055    .0386593
           dumstate37 |  -.1149089   .0200318    -5.74   0.000    -.1541706   -.0756472
           dumstate38 |   .0338943   .0205769     1.65   0.100    -.0064357    .0742244
           dumstate39 |  -.1490535    .020119    -7.41   0.000     -.188486    -.109621
           dumstate40 |  -.1409922   .0197555    -7.14   0.000    -.1797123   -.1022721
           dumstate41 |    .069218   .0205573     3.37   0.001     .0289264    .1095096
           dumstate42 |  -.0562334     .01997    -2.82   0.005     -.095374   -.0170929
           dumstate43 |  -.0879022   .0218838    -4.02   0.000    -.1307938   -.0450106
           dumstate44 |   -.029633   .0215783    -1.37   0.170    -.0719257    .0126597
           dumstate45 |  -.0889958   .0206466    -4.31   0.000    -.1294624   -.0485293
           dumstate46 |   .0156367   .0212784     0.73   0.462    -.0260683    .0573418
           dumstate47 |   .0158564   .0199252     0.80   0.426    -.0231962     .054909
           dumstate48 |  -.0951748   .0201805    -4.72   0.000    -.1347279   -.0556217
           dumstate49 |   .1549907   .0194419     7.97   0.000     .1168852    .1930962
           dumstate50 |   .2286867   .0215256    10.62   0.000     .1864973    .2708761
           dumstate51 |          0   .0192248     0.00   1.000    -.0376799    .0376799
             dumyear1 |  -.1069731   .0134249    -7.97   0.000    -.1332856   -.0806607
             dumyear2 |  -.1149096   .0131606    -8.73   0.000    -.1407039   -.0891153
             dumyear3 |  -.1458694    .013373   -10.91   0.000      -.17208   -.1196588
             dumyear4 |   -.109061   .0135335    -8.06   0.000    -.1355862   -.0825358
             dumyear5 |  -.1163452   .0130377    -8.92   0.000    -.1418986   -.0907918
             dumyear6 |  -.1256605   .0134619    -9.33   0.000    -.1520455   -.0992756
             dumyear7 |  -.1190362   .0137808    -8.64   0.000    -.1460461   -.0920263
             dumyear8 |   -.117382   .0140281    -8.37   0.000    -.1448765   -.0898875
             dumyear9 |  -.0867523    .014071    -6.17   0.000    -.1143309   -.0591737
            dumyear10 |  -.0908922   .0139542    -6.51   0.000    -.1182419   -.0635425
            dumyear11 |   -.067729   .0151935    -4.46   0.000    -.0975077   -.0379503
            dumyear12 |  -.0425731   .0138813    -3.07   0.002      -.06978   -.0153661
            dumyear13 |    -.03339   .0139449    -2.39   0.017    -.0607216   -.0060583
            dumyear14 |  -.0448563   .0136445    -3.29   0.001    -.0715992   -.0181135
            dumyear15 |  -.0751204   .0139466    -5.39   0.000    -.1024552   -.0477856
            dumyear16 |  -.0799034   .0136086    -5.87   0.000    -.1065757    -.053231
            dumyear17 |  -.0628415   .0138823    -4.53   0.000    -.0900504   -.0356327
            dumyear18 |  -.0598636   .0138431    -4.32   0.000    -.0869957   -.0327315
            dumyear19 |  -.0169875   .0144245    -1.18   0.239     -.045259     .011284
            dumyear20 |  -.0248342   .0135116    -1.84   0.066    -.0513165    .0016481
            dumyear21 |  -.0295916   .0144789    -2.04   0.041    -.0579698   -.0012134
            dumyear22 |  -.0444449    .014094    -3.15   0.002    -.0720687    -.016821
            dumyear23 |  -.0487265   .0133428    -3.65   0.000    -.0748779    -.022575
            dumyear24 |  -.0572681   .0138044    -4.15   0.000    -.0843241    -.030212
            dumyear25 |  -.0402353   .0143742    -2.80   0.005    -.0684082   -.0120624
            dumyear26 |  -.0242146     .01336    -1.81   0.070    -.0503997    .0019704
            dumyear27 |  -.0318777   .0142784    -2.23   0.026    -.0598629   -.0038925
            dumyear28 |  -.0180303   .0158625    -1.14   0.256    -.0491203    .0130597
            dumyear29 |          0   .0141506     0.00   1.000    -.0277347    .0277347
             dumnind1 |   .2152757   .1076923     2.00   0.046     .0042023     .426349
             dumnind2 |   .2362848   .1079256     2.19   0.029     .0247544    .4478153
             dumnind3 |   .2084696   .1077416     1.93   0.053    -.0027003    .4196395
             dumnind4 |   .0802201   .1077903     0.74   0.457    -.1310452    .2914855
             dumnind5 |   .2111564   .1079627     1.96   0.050    -.0004468    .4227596
             dumnind6 |   .2958686   .1080329     2.74   0.006     .0841278    .5076094
             dumnind7 |   .1485347   .1078423     1.38   0.168    -.0628325    .3599019
             dumnind8 |   .0127156   .1071216     0.12   0.906    -.1972392    .2226704
             dumnind9 |  -.1833494   .1076954    -1.70   0.089    -.3944288    .0277299
            dumnind10 |          0   .1082933     0.00   1.000    -.2122512    .2122512
            dumnind11 |   .2379838   .1075924     2.21   0.027     .0271063    .4488613
                 educ |   .0969297   .0022907    42.31   0.000       .09244    .1014193
                exper |  -.0066147   .0013643    -4.85   0.000    -.0092886   -.0039408
               exper2 |   .0028882   .0001044    27.65   0.000     .0026835    .0030929
               exper3 |  -.0001077   3.78e-06   -28.49   0.000    -.0001151   -.0001003
               exper4 |   1.14e-06   4.23e-08    26.97   0.000     1.06e-06    1.22e-06
                 edex |  -.0000825   .0000765    -1.08   0.281    -.0002325    .0000675
            dumee_cl1 |   .2595175   .1299012     2.00   0.046     .0049157    .5141194
            dumee_cl2 |   .0311914   .1299912     0.24   0.810    -.2235869    .2859697
            dumee_cl3 |  -.1167122   .1302279    -0.90   0.370    -.3719546    .1385301
            dumee_cl4 |  -.2994176   .1303251    -2.30   0.022    -.5548504   -.0439847
            dumee_cl5 |    .037591   .1307113     0.29   0.774    -.2185988    .2937808
            dumee_cl6 |  -.1341652   .1302491    -1.03   0.303    -.3894491    .1211187
            dumee_cl7 |   -.218993   .1300241    -1.68   0.092    -.4738358    .0358498
            dumee_cl8 |   .0064039   .1303616     0.05   0.961    -.2491005    .2619083
            dumee_cl9 |  -.0774599   .1306771    -0.59   0.553    -.3335826    .1786629
           dumee_cl10 |  -.2270171   .1304194    -1.74   0.082    -.4826347    .0286004
           dumee_cl11 |  -.2226017   .1302601    -1.71   0.087     -.477907    .0327037
           dumee_cl12 |   .0551886   .1304547     0.42   0.672    -.2004981    .3108754
           dumee_cl13 |          0   .1304122     0.00   1.000    -.2556034    .2556034
           dumee_cl14 |  -.1961209   .1308824    -1.50   0.134    -.4526459    .0604042
           dumee_cl15 |  -.1729469   .1306125    -1.32   0.185    -.4289429    .0830491
           dumee_cl16 |   .0405915   .1300772     0.31   0.755    -.2143555    .2955385
                 marr |   .1291815   .0020451    63.17   0.000     .1251733    .1331897
                partt |  -.0181015   .0024519    -7.38   0.000    -.0229072   -.0132959
               public |  -.0790088   .0038636   -20.45   0.000    -.0865813   -.0714362
                 cmsa |   .1468164   .0020908    70.22   0.000     .1427186    .1509143
            dumnocc31 |   .2932566   .0084197    34.83   0.000     .2767543    .3097588
            dumnocc32 |          0   .0079386     0.00   1.000    -.0155594    .0155594
            dumnocc33 |  -.0157209   .0079969    -1.97   0.049    -.0313946   -.0000473
            dumnocc34 |  -.0679167   .0082774    -8.21   0.000    -.0841401   -.0516934
          dumquarter1 |  -.0056526    .004684    -1.21   0.228    -.0148332     .003528
          dumquarter2 |  -.0038717   .0049884    -0.78   0.438    -.0136489    .0059055
          dumquarter3 |          0   .0045964     0.00   1.000    -.0090088    .0090088
          dumquarter4 |   .0079368   .0045884     1.73   0.084    -.0010563      .01693
                unemp |   -.007826   .0010415    -7.51   0.000    -.0098673   -.0057847
                _cons |    .690684   .1739396     3.97   0.000     .3497683      1.0316
---------------------------------------------------------------------------------------
women at 80 quantile
(analytic weights assumed)
note: dumstate51 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind2 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc34 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs = 1080778
-------------+------------------------------           F(123,1080654) = 2510.35
       Model |  229680.456   123  1867.32078           Prob > F      =  0.0000
    Residual |   593800.67 1080654  .549482693         R-squared     =  0.2789
-------------+------------------------------           Adj R-squared =  0.2788
       Total |  823481.126 1080777  .761934354         Root MSE      =  .74127
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0937544   .0035863   -26.14   0.000    -.1007835   -.0867253
             treat_st |  -.0699215    .005949   -11.75   0.000    -.0815814   -.0582616
treat_stblackrelwhite |   .0130547   .0044032     2.96   0.003     .0044247    .0216848
            dumstate1 |  -.1153769   .0161889    -7.13   0.000    -.1471067   -.0836472
            dumstate2 |  -.0446018   .0168805    -2.64   0.008    -.0776869   -.0115167
            dumstate3 |  -.1120273   .0155658    -7.20   0.000    -.1425357   -.0815188
            dumstate4 |   .0704354   .0166075     4.24   0.000     .0378853    .1029854
            dumstate5 |  -.0305502   .0162003    -1.89   0.059    -.0623023    .0012018
            dumstate6 |   .1003319   .0167031     6.01   0.000     .0675943    .1330695
            dumstate7 |   .0636853    .015532     4.10   0.000     .0332432    .0941274
            dumstate8 |    .166107   .0163772    10.14   0.000     .1340082    .1982058
            dumstate9 |  -.0779002   .0159185    -4.89   0.000    -.1090999   -.0467006
           dumstate10 |  -.1206074   .0155599    -7.75   0.000    -.1511043   -.0901106
           dumstate11 |  -.1281439   .0158016    -8.11   0.000    -.1591145   -.0971732
           dumstate12 |  -.0296729   .0157175    -1.89   0.059    -.0604787    .0011329
           dumstate13 |  -.0429336   .0162682    -2.64   0.008    -.0748187   -.0110485
           dumstate14 |  -.1051682   .0158761    -6.62   0.000    -.1362848   -.0740517
           dumstate15 |  -.0323291   .0163599    -1.98   0.048    -.0643939   -.0002643
           dumstate16 |  -.1014526   .0168911    -6.01   0.000    -.1345586   -.0683467
           dumstate17 |   -.147794   .0162466    -9.10   0.000    -.1796368   -.1159512
           dumstate18 |  -.1153346   .0165853    -6.95   0.000    -.1478413   -.0828279
           dumstate19 |  -.1347394   .0160192    -8.41   0.000    -.1661365   -.1033422
           dumstate20 |  -.1072929   .0162187    -6.62   0.000    -.1390811   -.0755047
           dumstate21 |  -.1001622   .0166953    -6.00   0.000    -.1328844     -.06744
           dumstate22 |  -.0130153   .0154956    -0.84   0.401    -.0433862    .0173556
           dumstate23 |   .1349058   .0167547     8.05   0.000     .1020673    .1677444
           dumstate24 |   .2034715   .0164056    12.40   0.000     .1713172    .2356259
           dumstate25 |   .0761201   .0167681     4.54   0.000     .0432552    .1089849
           dumstate26 |   -.142925   .0160978    -8.88   0.000    -.1744762   -.1113738
           dumstate27 |    -.07125   .0161395    -4.41   0.000    -.1028829   -.0396172
           dumstate28 |  -.1192574   .0166789    -7.15   0.000    -.1519475   -.0865673
           dumstate29 |  -.0227529   .0163388    -1.39   0.164    -.0547764    .0092707
           dumstate30 |  -.0698255   .0163631    -4.27   0.000    -.1018967   -.0377543
           dumstate31 |  -.1327805    .016226    -8.18   0.000     -.164583   -.1009781
           dumstate32 |   -.097862   .0168497    -5.81   0.000    -.1308868   -.0648372
           dumstate33 |  -.0947955   .0168718    -5.62   0.000    -.1278637   -.0617273
           dumstate34 |  -.0918847   .0166633    -5.51   0.000    -.1245442   -.0592253
           dumstate35 |  -.1059563   .0160206    -6.61   0.000    -.1373561   -.0745566
           dumstate36 |  -.0729873   .0177203    -4.12   0.000    -.1077186    -.038256
           dumstate37 |  -.1756874   .0160585   -10.94   0.000    -.2071615   -.1442134
           dumstate38 |  -.0157818   .0163161    -0.97   0.333    -.0477608    .0161971
           dumstate39 |  -.1617621   .0155709   -10.39   0.000    -.1922805   -.1312436
           dumstate40 |  -.1430424   .0158213    -9.04   0.000    -.1740515   -.1120332
           dumstate41 |  -.0467625   .0163958    -2.85   0.004    -.0788977   -.0146273
           dumstate42 |  -.0728279   .0161691    -4.50   0.000    -.1045188    -.041137
           dumstate43 |  -.1425879   .0175277    -8.14   0.000    -.1769415   -.1082342
           dumstate44 |  -.0285147   .0167432    -1.70   0.089    -.0613307    .0043013
           dumstate45 |   -.090425   .0160159    -5.65   0.000    -.1218156   -.0590344
           dumstate46 |   .0128598   .0166987     0.77   0.441    -.0198691    .0455887
           dumstate47 |  -.0073067   .0159178    -0.46   0.646     -.038505    .0238916
           dumstate48 |  -.0844908   .0164725    -5.13   0.000    -.1167765   -.0522052
           dumstate49 |    .144104   .0162515     8.87   0.000     .1122515    .1759564
           dumstate50 |   .1378507   .0177941     7.75   0.000      .102975    .1727265
           dumstate51 |          0   .0139692     0.00   1.000    -.0273792    .0273792
             dumyear1 |  -.1043089   .0133378    -7.82   0.000    -.1304505   -.0781673
             dumyear2 |  -.1234316   .0131472    -9.39   0.000    -.1491996   -.0976635
             dumyear3 |  -.1075382   .0128939    -8.34   0.000    -.1328098   -.0822665
             dumyear4 |   -.069354   .0130156    -5.33   0.000    -.0948641    -.043844
             dumyear5 |  -.0621532   .0137844    -4.51   0.000    -.0891701   -.0351364
             dumyear6 |  -.0813941   .0134022    -6.07   0.000    -.1076619   -.0551262
             dumyear7 |    -.07201   .0133506    -5.39   0.000    -.0981767   -.0458433
             dumyear8 |  -.0489772   .0141783    -3.45   0.001    -.0767662   -.0211882
             dumyear9 |  -.0286329   .0154754    -1.85   0.064    -.0589642    .0016984
            dumyear10 |  -.0259859    .013397    -1.94   0.052    -.0522435    .0002718
            dumyear11 |  -.0250641   .0135599    -1.85   0.065    -.0516411    .0015129
            dumyear12 |  -.0022435   .0130701    -0.17   0.864    -.0278605    .0233734
            dumyear13 |   .0044972   .0139254     0.32   0.747    -.0227962    .0317906
            dumyear14 |  -.0008856   .0135556    -0.07   0.948    -.0274541    .0256828
            dumyear15 |    .003294   .0135786     0.24   0.808    -.0233196    .0299075
            dumyear16 |  -.0066782    .013655    -0.49   0.625    -.0334417    .0200852
            dumyear17 |   .0039619   .0132007     0.30   0.764     -.021911    .0298349
            dumyear18 |  -.0020546   .0135382    -0.15   0.879     -.028589    .0244799
            dumyear19 |   .0144828   .0141968     1.02   0.308    -.0133424     .042308
            dumyear20 |          0   .0130256     0.00   1.000    -.0255298    .0255298
            dumyear21 |  -.0025942   .0139629    -0.19   0.853    -.0299609    .0247725
            dumyear22 |  -.0268506    .013772    -1.95   0.051    -.0538432    .0001421
            dumyear23 |   -.016999   .0134993    -1.26   0.208    -.0434572    .0094591
            dumyear24 |  -.0186572   .0134962    -1.38   0.167    -.0451093    .0077949
            dumyear25 |  -.0049437   .0131027    -0.38   0.706    -.0306245    .0207372
            dumyear26 |   .0078963   .0137102     0.58   0.565    -.0189753    .0347679
            dumyear27 |   .0141402   .0137182     1.03   0.303    -.0127469    .0410274
            dumyear28 |   .0008334   .0139966     0.06   0.953    -.0265996    .0282663
            dumyear29 |   .0217072   .0129018     1.68   0.092    -.0035799    .0469943
             dumnind1 |   .0187402   .0135035     1.39   0.165    -.0077263    .0452067
             dumnind2 |          0   .0112737     0.00   1.000     -.022096     .022096
             dumnind3 |   .0933646   .0127846     7.30   0.000     .0683071    .1184221
             dumnind4 |  -.0712555   .0125235    -5.69   0.000    -.0958011   -.0467099
             dumnind5 |   .1277104   .0134363     9.50   0.000     .1013757     .154045
             dumnind6 |    .068045   .0130706     5.21   0.000     .0424271     .093663
             dumnind7 |  -.0053753   .0125689    -0.43   0.669    -.0300099    .0192592
             dumnind8 |  -.0387094   .0127776    -3.03   0.002    -.0637531   -.0136658
             dumnind9 |  -.3134443    .012958   -24.19   0.000    -.3388415   -.2880471
            dumnind10 |  -.1083081   .0127373    -8.50   0.000    -.1332727   -.0833435
            dumnind11 |   .0486209   .0140082     3.47   0.001     .0211654    .0760765
                 educ |    .141124   .0024387    57.87   0.000     .1363441    .1459038
                exper |   .0157248   .0013847    11.36   0.000     .0130107    .0184388
               exper2 |     .00095   .0001079     8.80   0.000     .0007385    .0011616
               exper3 |  -.0000573   4.18e-06   -13.70   0.000    -.0000655   -.0000491
               exper4 |   7.24e-07   4.89e-08    14.81   0.000     6.29e-07    8.20e-07
                 edex |  -.0000118    .000083    -0.14   0.887    -.0001744    .0001509
            dumee_cl1 |          0    .086142     0.00   1.000    -.1688353    .1688353
            dumee_cl2 |  -.3354007    .086669    -3.87   0.000    -.5052691   -.1655323
            dumee_cl3 |  -.5195035   .0868852    -5.98   0.000    -.6897956   -.3492114
            dumee_cl4 |  -.7234654   .0873939    -8.28   0.000    -.8947544   -.5521764
            dumee_cl5 |   -.209962   .0862633    -2.43   0.015    -.3790351   -.0408888
            dumee_cl6 |  -.4933473   .0862491    -5.72   0.000    -.6623925    -.324302
            dumee_cl7 |   -.603894   .0856369    -7.05   0.000    -.7717393   -.4360486
            dumee_cl8 |  -.4801936   .0858757    -5.59   0.000     -.648507   -.3118802
            dumee_cl9 |  -.2657692   .0863333    -3.08   0.002    -.4349796   -.0965589
           dumee_cl10 |   -.537804   .0859382    -6.26   0.000    -.7062399    -.369368
           dumee_cl11 |  -.5926378   .0858498    -6.90   0.000    -.7609005   -.4243751
           dumee_cl12 |   -.500789   .0857592    -5.84   0.000    -.6688742   -.3327038
           dumee_cl13 |  -.1716919   .0868321    -1.98   0.048    -.3418799   -.0015039
           dumee_cl14 |   -.505221   .0866637    -5.83   0.000     -.675079    -.335363
           dumee_cl15 |  -.5324735   .0861439    -6.18   0.000    -.7013126   -.3636344
           dumee_cl16 |  -.4926808   .0853413    -5.77   0.000    -.6599469   -.3254147
                 marr |    .030049   .0017573    17.10   0.000     .0266047    .0334932
                partt |  -.0365961   .0018891   -19.37   0.000    -.0402988   -.0328935
               public |   .0265318   .0033621     7.89   0.000     .0199423    .0331213
                 cmsa |    .140109   .0018964    73.88   0.000     .1363921    .1438259
            dumnocc31 |   .3668616   .0087522    41.92   0.000     .3497076    .3840155
            dumnocc32 |  -.0089872   .0086624    -1.04   0.300    -.0259651    .0079908
            dumnocc33 |   .0172254   .0085935     2.00   0.045     .0003824    .0340684
            dumnocc34 |          0   .0087738     0.00   1.000    -.0171963    .0171963
          dumquarter1 |  -.0217448    .003678    -5.91   0.000    -.0289536    -.014536
          dumquarter2 |  -.0139528   .0037705    -3.70   0.000    -.0213429   -.0065627
          dumquarter3 |          0   .0030716     0.00   1.000    -.0060202    .0060202
          dumquarter4 |  -.0005076   .0036542    -0.14   0.890    -.0076697    .0066545
                unemp |  -.0018705    .001017    -1.84   0.066    -.0038638    .0001228
                _cons |   .3079242   .0914464     3.37   0.001     .1286924     .487156
---------------------------------------------------------------------------------------
men not covered by union at 80 quantile
(analytic weights assumed)
note: dumstate51 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter4 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  878887
-------------+------------------------------           F(123,878763) = 2399.17
       Model |  275441.269   123  2239.35991           Prob > F      =  0.0000
    Residual |  583088.641 878763  .663533445          R-squared     =  0.3208
-------------+------------------------------           Adj R-squared =  0.3207
       Total |   858529.91 878886   .97683876          Root MSE      =  .81458
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1854215   .0044865   -41.33   0.000    -.1942149   -.1766281
             treat_st |  -.0675448    .007139    -9.46   0.000     -.081537   -.0535525
treat_stblackrelwhite |   .0655175   .0055084    11.89   0.000     .0547213    .0763137
            dumstate1 |  -.0750203   .0262814    -2.85   0.004     -.126531   -.0235097
            dumstate2 |   .0153088   .0265034     0.58   0.564     -.036637    .0672546
            dumstate3 |  -.0804566   .0254573    -3.16   0.002     -.130352   -.0305612
            dumstate4 |   .1081551   .0258179     4.19   0.000     .0575529    .1587573
            dumstate5 |  -.0569245   .0257918    -2.21   0.027    -.1074755   -.0063735
            dumstate6 |   .1040728   .0270273     3.85   0.000     .0511001    .1570455
            dumstate7 |   .0876355   .0255405     3.43   0.001      .037577    .1376939
            dumstate8 |   .2153659   .0268726     8.01   0.000     .1626966    .2680352
            dumstate9 |  -.0355733   .0260535    -1.37   0.172    -.0866373    .0154906
           dumstate10 |  -.0832715    .025791    -3.23   0.001    -.1338209    -.032722
           dumstate11 |  -.0753175   .0263049    -2.86   0.004    -.1268743   -.0237608
           dumstate12 |   .0587805   .0258895     2.27   0.023      .008038     .109523
           dumstate13 |   .0208657   .0254567     0.82   0.412    -.0290286    .0707601
           dumstate14 |  -.0784116   .0258199    -3.04   0.002    -.1290178   -.0278055
           dumstate15 |  -.0070038   .0264336    -0.26   0.791    -.0588128    .0448052
           dumstate16 |  -.0571182   .0271667    -2.10   0.036    -.1103641   -.0038723
           dumstate17 |  -.0810579   .0266709    -3.04   0.002     -.133332   -.0287839
           dumstate18 |  -.0254785   .0277847    -0.92   0.359    -.0799355    .0289785
           dumstate19 |  -.0736833   .0274525    -2.68   0.007    -.1274893   -.0198772
           dumstate20 |  -.0553271    .027862    -1.99   0.047    -.1099358   -.0007185
           dumstate21 |  -.0161157   .0269809    -0.60   0.550    -.0689973    .0367659
           dumstate22 |          0   .0269645     0.00   1.000    -.0528495    .0528495
           dumstate23 |   .1704602   .0272237     6.26   0.000     .1171025    .2238178
           dumstate24 |   .2607309   .0266326     9.79   0.000     .2085319    .3129299
           dumstate25 |   .1822138   .0273238     6.67   0.000     .1286602    .2357675
           dumstate26 |  -.0180955   .0264018    -0.69   0.493    -.0698422    .0336513
           dumstate27 |   .0075476   .0267159     0.28   0.778    -.0448147    .0599098
           dumstate28 |  -.0323496   .0275924    -1.17   0.241    -.0864297    .0217305
           dumstate29 |   .0421841   .0272227     1.55   0.121    -.0111714    .0955397
           dumstate30 |  -.0328097   .0263843    -1.24   0.214     -.084522    .0189027
           dumstate31 |  -.0815262   .0263739    -3.09   0.002    -.1332182   -.0298341
           dumstate32 |  -.0305106   .0277203    -1.10   0.271    -.0848414    .0238203
           dumstate33 |   .0143384   .0282191     0.51   0.611    -.0409702    .0696469
           dumstate34 |   .0089734   .0271831     0.33   0.741    -.0443046    .0622513
           dumstate35 |  -.0401851   .0267057    -1.50   0.132    -.0925274    .0121573
           dumstate36 |   .0514382   .0274958     1.87   0.061    -.0024527    .1053291
           dumstate37 |   -.072332   .0262515    -2.76   0.006     -.123784   -.0208799
           dumstate38 |   .0910596   .0271935     3.35   0.001     .0377612    .1443579
           dumstate39 |  -.1055407   .0263298    -4.01   0.000    -.1571462   -.0539352
           dumstate40 |  -.0930618   .0270497    -3.44   0.001    -.1460784   -.0400453
           dumstate41 |   .1078674   .0279868     3.85   0.000     .0530141    .1627206
           dumstate42 |   .0018972   .0264274     0.07   0.943    -.0498996     .053694
           dumstate43 |   -.035523   .0273921    -1.30   0.195    -.0892106    .0181647
           dumstate44 |   .0145477   .0279632     0.52   0.603    -.0402594    .0693547
           dumstate45 |  -.0428022   .0273163    -1.57   0.117    -.0963411    .0107368
           dumstate46 |   .0408452   .0272663     1.50   0.134    -.0125958    .0942862
           dumstate47 |   .0688171   .0272402     2.53   0.012     .0154271     .122207
           dumstate48 |  -.0516926   .0271344    -1.91   0.057    -.1048751    .0014899
           dumstate49 |   .1968822   .0258207     7.62   0.000     .1462744      .24749
           dumstate50 |   .2331797   .0281688     8.28   0.000     .1779698    .2883897
           dumstate51 |   .0428983   .0255447     1.68   0.093    -.0071685    .0929651
             dumyear1 |   -.084307   .0167511    -5.03   0.000    -.1171386   -.0514754
             dumyear2 |  -.0876318   .0171836    -5.10   0.000     -.121311   -.0539526
             dumyear3 |   -.120296   .0167233    -7.19   0.000    -.1530731    -.087519
             dumyear4 |  -.0783131   .0170773    -4.59   0.000    -.1117839   -.0448422
             dumyear5 |  -.0918473   .0172212    -5.33   0.000    -.1256004   -.0580943
             dumyear6 |  -.1166667   .0168876    -6.91   0.000    -.1497659   -.0835675
             dumyear7 |  -.1315268   .0195642    -6.72   0.000    -.1698719   -.0931817
             dumyear8 |  -.1035699      .0171    -6.06   0.000    -.1370854   -.0700545
             dumyear9 |  -.0711455   .0196096    -3.63   0.000    -.1095798   -.0327113
            dumyear10 |   -.073353   .0184587    -3.97   0.000    -.1095315   -.0371745
            dumyear11 |  -.0430844   .0184657    -2.33   0.020    -.0792765   -.0068923
            dumyear12 |  -.0262856    .018171    -1.45   0.148    -.0619001    .0093289
            dumyear13 |  -.0132335   .0174331    -0.76   0.448    -.0474019    .0209348
            dumyear14 |  -.0221999   .0177619    -1.25   0.211    -.0570126    .0126129
            dumyear15 |   -.053952   .0174623    -3.09   0.002    -.0881777   -.0197264
            dumyear16 |  -.0585425   .0174618    -3.35   0.001     -.092767    -.024318
            dumyear17 |  -.0420125   .0175626    -2.39   0.017    -.0764346   -.0075903
            dumyear18 |   -.035596   .0173202    -2.06   0.040     -.069543    -.001649
            dumyear19 |   .0053519   .0173274     0.31   0.757    -.0286092     .039313
            dumyear20 |          0   .0165866     0.00   1.000    -.0325093    .0325093
            dumyear21 |   -.024414    .017366    -1.41   0.160    -.0584507    .0096227
            dumyear22 |  -.0178163   .0165021    -1.08   0.280    -.0501598    .0145272
            dumyear23 |  -.0242838   .0169945    -1.43   0.153    -.0575924    .0090248
            dumyear24 |  -.0408429   .0174487    -2.34   0.019    -.0750418   -.0066439
            dumyear25 |  -.0186347   .0180412    -1.03   0.302    -.0539948    .0167254
            dumyear26 |  -.0013267   .0181485    -0.07   0.942    -.0368972    .0342439
            dumyear27 |  -.0150411   .0180841    -0.83   0.406    -.0504854    .0204032
            dumyear28 |  -.0089118   .0183334    -0.49   0.627    -.0448446    .0270211
            dumyear29 |   .0283396   .0173608     1.63   0.103    -.0056869    .0623661
             dumnind1 |   .0729013   .0369069     1.98   0.048      .000565    .1452376
             dumnind2 |  -.0009168   .0375739    -0.02   0.981    -.0745604    .0727269
             dumnind3 |   .0712037   .0372256     1.91   0.056    -.0017572    .1441646
             dumnind4 |  -.0787656   .0374206    -2.10   0.035    -.1521088   -.0054224
             dumnind5 |   .0419718   .0379456     1.11   0.269    -.0324004     .116344
             dumnind6 |   .1502052   .0373072     4.03   0.000     .0770843    .2233261
             dumnind7 |  -.0127364   .0373896    -0.34   0.733    -.0860187     .060546
             dumnind8 |  -.1637637   .0379031    -4.32   0.000    -.2380525   -.0894749
             dumnind9 |  -.4194274   .0373302   -11.24   0.000    -.4925933   -.3462615
            dumnind10 |  -.1808077   .0381085    -4.74   0.000    -.2554991   -.1061163
            dumnind11 |          0    .037329     0.00   1.000    -.0731636    .0731636
                 educ |   .1072572   .0028405    37.76   0.000       .10169    .1128245
                exper |  -.0104856   .0017254    -6.08   0.000    -.0138674   -.0071039
               exper2 |   .0034478    .000122    28.27   0.000     .0032087    .0036868
               exper3 |  -.0001285   4.55e-06   -28.26   0.000    -.0001374   -.0001196
               exper4 |   1.37e-06   5.21e-08    26.26   0.000     1.27e-06    1.47e-06
                 edex |   -.000015   .0000971    -0.15   0.877    -.0002053    .0001753
            dumee_cl1 |          0   .1451172     0.00   1.000    -.2844249    .2844249
            dumee_cl2 |  -.2558241    .144686    -1.77   0.077    -.5394039    .0277557
            dumee_cl3 |  -.4313668   .1445569    -2.98   0.003    -.7146935   -.1480402
            dumee_cl4 |  -.6442227   .1440565    -4.47   0.000    -.9265687   -.3618767
            dumee_cl5 |  -.2405772   .1449723    -1.66   0.097     -.524718    .0435636
            dumee_cl6 |  -.4661152   .1446398    -3.22   0.001    -.7496044    -.182626
            dumee_cl7 |  -.5871979   .1448192    -4.05   0.000    -.8710388    -.303357
            dumee_cl8 |  -.2790036    .144821    -1.93   0.054    -.5628479    .0048406
            dumee_cl9 |  -.3708755   .1449271    -2.56   0.010    -.6549278   -.0868232
           dumee_cl10 |  -.5798924   .1447063    -4.01   0.000    -.8635119    -.296273
           dumee_cl11 |  -.5863633   .1447876    -4.05   0.000    -.8701421   -.3025844
           dumee_cl12 |  -.2279193   .1452844    -1.57   0.117    -.5126719    .0568334
           dumee_cl13 |  -.2873878   .1429752    -2.01   0.044    -.5676144   -.0071613
           dumee_cl14 |  -.5378497    .143988    -3.74   0.000    -.8200613   -.2556381
           dumee_cl15 |  -.5141143   .1438939    -3.57   0.000    -.7961416    -.232087
           dumee_cl16 |  -.2515326   .1450984    -1.73   0.083    -.5359208    .0328555
                 marr |   .1484163   .0022494    65.98   0.000     .1440076    .1528251
                partt |  -.0272364   .0027624    -9.86   0.000    -.0326506   -.0218222
               public |  -.0354919   .0048057    -7.39   0.000    -.0449109    -.026073
                 cmsa |   .1499823   .0022535    66.55   0.000     .1455655    .1543992
            dumnocc31 |   .3192318   .0293044    10.89   0.000     .2617962    .3766673
            dumnocc32 |          0   .0292245     0.00   1.000    -.0572791    .0572791
            dumnocc33 |  -.0581694   .0291055    -2.00   0.046    -.1152152   -.0011237
            dumnocc34 |  -.1261458   .0289537    -4.36   0.000    -.1828942   -.0693975
          dumquarter1 |  -.0141256   .0050605    -2.79   0.005     -.024044   -.0042072
          dumquarter2 |  -.0122394   .0049457    -2.47   0.013    -.0219328   -.0025459
          dumquarter3 |  -.0082863   .0046704    -1.77   0.076    -.0174401    .0008676
          dumquarter4 |          0   .0046188     0.00   1.000    -.0090527    .0090527
                unemp |  -.0095223   .0012933    -7.36   0.000    -.0120572   -.0069874
                _cons |   .9606208   .1571105     6.11   0.000     .6526894    1.268552
---------------------------------------------------------------------------------------
women not covered by union at 80 quantile
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear20 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl5 dropped because of collinearity
note: dumnocc33 dropped because of collinearity
note: dumquarter2 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  924344
-------------+------------------------------           F(123,924220) = 2228.17
       Model |  225562.651   123  1833.84269           Prob > F      =  0.0000
    Residual |  559137.447 924220  .604983064          R-squared     =  0.2875
-------------+------------------------------           Adj R-squared =  0.2874
       Total |  784700.098 924343  .848927399          Root MSE      =  .77781
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1157619   .0040408   -28.65   0.000    -.1236817   -.1078421
             treat_st |  -.0617241   .0072009    -8.57   0.000    -.0758377   -.0476105
treat_stblackrelwhite |   .0147563   .0048216     3.06   0.002     .0053063    .0242064
            dumstate1 |  -.0829032   .0217924    -3.80   0.000    -.1256156   -.0401908
            dumstate2 |  -.0137364   .0220379    -0.62   0.533      -.05693    .0294571
            dumstate3 |  -.0659266   .0220511    -2.99   0.003     -.109146   -.0227071
            dumstate4 |   .0890521   .0225108     3.96   0.000     .0449317    .1331726
            dumstate5 |  -.0586164    .022611    -2.59   0.010    -.1029331   -.0142996
            dumstate6 |   .1039923   .0233475     4.45   0.000     .0582321    .1497526
            dumstate7 |   .0547842   .0222145     2.47   0.014     .0112446    .0983238
            dumstate8 |   .1689115   .0215815     7.83   0.000     .1266126    .2112105
            dumstate9 |  -.0617228   .0216179    -2.86   0.004    -.1040931   -.0193526
           dumstate10 |  -.1069725   .0215383    -4.97   0.000    -.1491869   -.0647581
           dumstate11 |  -.1085095   .0217237    -4.99   0.000    -.1510871   -.0659318
           dumstate12 |  -.0008292   .0217142    -0.04   0.970    -.0433884      .04173
           dumstate13 |  -.0490203   .0222386    -2.20   0.028    -.0926073   -.0054333
           dumstate14 |  -.0838915   .0208944    -4.02   0.000    -.1248438   -.0429392
           dumstate15 |  -.0146859   .0221929    -0.66   0.508    -.0581832    .0288114
           dumstate16 |  -.0821577   .0222006    -3.70   0.000    -.1256703   -.0386452
           dumstate17 |  -.1181461   .0223977    -5.27   0.000    -.1620448   -.0742474
           dumstate18 |  -.1006861   .0219465    -4.59   0.000    -.1437005   -.0576716
           dumstate19 |  -.1202541   .0220928    -5.44   0.000    -.1635552   -.0769531
           dumstate20 |  -.0762839   .0216351    -3.53   0.000    -.1186878   -.0338799
           dumstate21 |  -.0709235   .0211978    -3.35   0.001    -.1124705   -.0293766
           dumstate22 |          0    .020215     0.00   1.000    -.0396207    .0396207
           dumstate23 |    .170622   .0234435     7.28   0.000     .1246734    .2165706
           dumstate24 |   .2554475   .0224262    11.39   0.000     .2114929    .2994021
           dumstate25 |   .1097874    .022335     4.92   0.000     .0660115    .1535633
           dumstate26 |   -.118535   .0222792    -5.32   0.000    -.1622016   -.0748685
           dumstate27 |  -.0472098   .0220199    -2.14   0.032     -.090368   -.0040516
           dumstate28 |   -.092364    .021895    -4.22   0.000    -.1352776   -.0494505
           dumstate29 |   .0107286    .022954     0.47   0.640    -.0342605    .0557178
           dumstate30 |  -.0520894   .0223394    -2.33   0.020    -.0958739    -.008305
           dumstate31 |  -.1087982   .0219166    -4.96   0.000    -.1517541   -.0658424
           dumstate32 |   -.081575   .0224343    -3.64   0.000    -.1255454   -.0376045
           dumstate33 |  -.0561817    .022945    -2.45   0.014    -.1011532   -.0112102
           dumstate34 |  -.0637829   .0230707    -2.76   0.006    -.1090006   -.0185652
           dumstate35 |  -.0836347   .0230062    -3.64   0.000    -.1287261   -.0385432
           dumstate36 |  -.0489501    .023028    -2.13   0.034    -.0940843    -.003816
           dumstate37 |  -.1400153   .0224342    -6.24   0.000    -.1839856   -.0960451
           dumstate38 |   .0214997   .0217849     0.99   0.324     -.021198    .0641974
           dumstate39 |  -.1278048   .0218137    -5.86   0.000    -.1705589   -.0850507
           dumstate40 |  -.1113936   .0215111    -5.18   0.000    -.1535546   -.0692326
           dumstate41 |  -.0160559   .0232358    -0.69   0.490    -.0615973    .0294856
           dumstate42 |  -.0340725   .0225082    -1.51   0.130    -.0781878    .0100429
           dumstate43 |  -.0996861   .0241495    -4.13   0.000    -.1470184   -.0523538
           dumstate44 |  -.0010344   .0231447    -0.04   0.964    -.0463973    .0443285
           dumstate45 |  -.0698415   .0230508    -3.03   0.002    -.1150204   -.0246627
           dumstate46 |   .0355855    .023268     1.53   0.126    -.0100191    .0811901
           dumstate47 |   .0153457   .0218258     0.70   0.482    -.0274321    .0581235
           dumstate48 |    -.06079   .0220796    -2.75   0.006    -.1040652   -.0175148
           dumstate49 |   .1586564   .0216068     7.34   0.000     .1163077     .201005
           dumstate50 |   .1288064   .0225193     5.72   0.000     .0846692    .1729435
           dumstate51 |   .0317184   .0214604     1.48   0.139    -.0103432    .0737801
             dumyear1 |   -.108828   .0222359    -4.89   0.000    -.1524097   -.0652463
             dumyear2 |  -.1172052   .0212236    -5.52   0.000    -.1588028   -.0756076
             dumyear3 |  -.1268739   .0216125    -5.87   0.000    -.1692336   -.0845142
             dumyear4 |  -.0769871   .0216221    -3.56   0.000    -.1193658   -.0346085
             dumyear5 |    -.08625   .0215871    -4.00   0.000      -.12856   -.0439401
             dumyear6 |  -.0998167   .0212669    -4.69   0.000     -.141499   -.0581344
             dumyear7 |  -.0967549   .0214864    -4.50   0.000    -.1388676   -.0546421
             dumyear8 |  -.0665941   .0219819    -3.03   0.002    -.1096779   -.0235103
             dumyear9 |  -.0526837   .0216116    -2.44   0.015    -.0950418   -.0103256
            dumyear10 |  -.0231889   .0215508    -1.08   0.282    -.0654278      .01905
            dumyear11 |  -.0283457   .0218452    -1.30   0.194    -.0711614    .0144701
            dumyear12 |    .003062   .0215611     0.14   0.887    -.0391971     .045321
            dumyear13 |  -.0060065   .0215569    -0.28   0.781    -.0482573    .0362444
            dumyear14 |   .0034873   .0211603     0.16   0.869    -.0379862    .0449609
            dumyear15 |  -.0047161   .0220927    -0.21   0.831     -.048017    .0385848
            dumyear16 |   -.003512   .0217929    -0.16   0.872    -.0462254    .0392014
            dumyear17 |   -.002798   .0218579    -0.13   0.898    -.0456387    .0400427
            dumyear18 |   .0007658   .0216463     0.04   0.972    -.0416602    .0431918
            dumyear19 |   .0166822   .0208506     0.80   0.424    -.0241843    .0575486
            dumyear20 |          0    .021538     0.00   1.000    -.0422138    .0422138
            dumyear21 |   .0023438   .0223984     0.10   0.917    -.0415564     .046244
            dumyear22 |  -.0275701    .021488    -1.28   0.199    -.0696858    .0145456
            dumyear23 |  -.0237416   .0223696    -1.06   0.289    -.0675854    .0201021
            dumyear24 |  -.0188048   .0222128    -0.85   0.397    -.0623412    .0247316
            dumyear25 |  -.0074864   .0219919    -0.34   0.734    -.0505898     .035617
            dumyear26 |  -.0046116   .0219124    -0.21   0.833    -.0475593     .038336
            dumyear27 |   .0088795   .0225999     0.39   0.694    -.0354157    .0531746
            dumyear28 |   .0206722   .0221468     0.93   0.351    -.0227348    .0640791
            dumyear29 |    .043491    .022236     1.96   0.050    -.0000908    .0870729
             dumnind1 |          0   .0201266     0.00   1.000    -.0394475    .0394475
             dumnind2 |  -.0334387   .0197849    -1.69   0.091    -.0722163     .005339
             dumnind3 |   .0913455   .0205288     4.45   0.000     .0511097    .1315812
             dumnind4 |  -.0968015   .0199704    -4.85   0.000    -.1359429   -.0576602
             dumnind5 |    .085174   .0208746     4.08   0.000     .0442604    .1260877
             dumnind6 |   .0658247   .0200713     3.28   0.001     .0264857    .1051637
             dumnind7 |  -.0167453   .0204524    -0.82   0.413    -.0568313    .0233407
             dumnind8 |  -.0577083   .0200116    -2.88   0.004    -.0969304   -.0184862
             dumnind9 |   -.380037   .0202485   -18.77   0.000    -.4197235   -.3403506
            dumnind10 |  -.1319225   .0201897    -6.53   0.000    -.1714937   -.0923513
            dumnind11 |    .038579   .0217511     1.77   0.076    -.0040525    .0812105
                 educ |   .1392476   .0026238    53.07   0.000     .1341051    .1443902
                exper |   .0216682   .0017466    12.41   0.000     .0182449    .0250914
               exper2 |   .0008752   .0001352     6.48   0.000     .0006103      .00114
               exper3 |  -.0000562   4.93e-06   -11.39   0.000    -.0000658   -.0000465
               exper4 |   7.17e-07   5.54e-08    12.93   0.000     6.08e-07    8.26e-07
                 edex |  -.0003125   .0000879    -3.56   0.000    -.0004847   -.0001402
            dumee_cl1 |   .2272962   .0123883    18.35   0.000     .2030155    .2515769
            dumee_cl2 |  -.1196344   .0113376   -10.55   0.000    -.1418558   -.0974131
            dumee_cl3 |  -.2947045   .0118617   -24.85   0.000    -.3179531    -.271456
            dumee_cl4 |   -.448073   .0161847   -27.69   0.000    -.4797944   -.4163516
            dumee_cl5 |  -.0106312   .0091448    -1.16   0.245    -.0285547    .0072923
            dumee_cl6 |  -.2832131   .0100697   -28.13   0.000    -.3029495   -.2634768
            dumee_cl7 |  -.3706578   .0113498   -32.66   0.000    -.3929031   -.3484125
            dumee_cl8 |  -.1666332    .014706   -11.33   0.000    -.1954564   -.1378099
            dumee_cl9 |   -.078683   .0106337    -7.40   0.000    -.0995247   -.0578412
           dumee_cl10 |   -.328053   .0097731   -33.57   0.000    -.3472079   -.3088981
           dumee_cl11 |  -.3494769   .0111432   -31.36   0.000    -.3713172   -.3276367
           dumee_cl12 |  -.2132038   .0144963   -14.71   0.000     -.241616   -.1847916
           dumee_cl13 |          0   .0110498     0.00   1.000    -.0216572    .0216572
           dumee_cl14 |  -.2960315   .0102057   -29.01   0.000    -.3160344   -.2760286
           dumee_cl15 |  -.2883756   .0110862   -26.01   0.000    -.3101042    -.266647
           dumee_cl16 |   -.215396   .0144657   -14.89   0.000    -.2437484   -.1870437
                 marr |   .0378521   .0022656    16.71   0.000     .0334116    .0422926
                partt |  -.0510839   .0022619   -22.58   0.000    -.0555172   -.0466506
               public |  -.0097882   .0045437    -2.15   0.031    -.0186937   -.0008827
                 cmsa |   .1443015   .0022473    64.21   0.000     .1398969    .1487062
            dumnocc31 |   .4580696   .0282286    16.23   0.000     .4027426    .5133967
            dumnocc32 |   .0409835   .0282731     1.45   0.147    -.0144308    .0963979
            dumnocc33 |   .0557229   .0279223     2.00   0.046     .0009962    .1104496
            dumnocc34 |          0   .0281485     0.00   1.000    -.0551701    .0551701
          dumquarter1 |   -.022089   .0045141    -4.89   0.000    -.0309364   -.0132415
          dumquarter2 |  -.0131332   .0042338    -3.10   0.002    -.0214313   -.0048351
          dumquarter3 |          0   .0040189     0.00   1.000    -.0078769    .0078769
          dumquarter4 |   .0004646   .0039761     0.12   0.907    -.0073283    .0082576
                unemp |  -.0024766   .0011366    -2.18   0.029    -.0047043   -.0002489
                _cons |     .01405      .0605     0.23   0.816    -.1045279    .1326279
---------------------------------------------------------------------------------------
men covered by union at 80 quantile
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind6 dropped because of collinearity
note: dumee_cl13 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter2 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  189324
-------------+------------------------------           F(123,189200) =  265.80
       Model |  11177.7185   123  90.8757603           Prob > F      =  0.0000
    Residual |   50749.877 189200  .268234022          R-squared     =  0.1805
-------------+------------------------------           Adj R-squared =  0.1800
       Total |  61927.5955 189323  .327100223          Root MSE      =  .51791
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1151494   .0048846   -23.57   0.000     -.124723   -.1055757
             treat_st |   -.073986   .0109504    -6.76   0.000    -.0954485   -.0525236
treat_stblackrelwhite |    .034075   .0081476     4.18   0.000     .0181059    .0500442
            dumstate1 |  -.1415078   .0564765    -2.51   0.012    -.2522003   -.0308152
            dumstate2 |  -.0858903   .0577866    -1.49   0.137    -.1991506      .02737
            dumstate3 |  -.1638708   .0579049    -2.83   0.005     -.277363   -.0503786
            dumstate4 |  -.0151392   .0576316    -0.26   0.793    -.1280956    .0978173
            dumstate5 |  -.0845366   .0581072    -1.45   0.146    -.1984253     .029352
            dumstate6 |   .0394528   .0575849     0.69   0.493    -.0734122    .1523179
            dumstate7 |   .0492135   .0563715     0.87   0.383    -.0612733    .1597003
            dumstate8 |   .1390616   .0576233     2.41   0.016     .0261213    .2520019
            dumstate9 |  -.1063449   .0566785    -1.88   0.061    -.2174335    .0047436
           dumstate10 |  -.1326446   .0570683    -2.32   0.020    -.2444971    -.020792
           dumstate11 |   -.100338   .0566409    -1.77   0.076    -.2113529    .0106768
           dumstate12 |   .0052419   .0566574     0.09   0.926    -.1058053    .1162892
           dumstate13 |  -.0455275   .0568204    -0.80   0.423    -.1568942    .0658392
           dumstate14 |  -.1253759   .0567625    -2.21   0.027    -.2366291   -.0141227
           dumstate15 |  -.0769301   .0577122    -1.33   0.183    -.1900447    .0361844
           dumstate16 |  -.0976194   .0556435    -1.75   0.079    -.2066793    .0114406
           dumstate17 |  -.1012167   .0567128    -1.78   0.074    -.2123724     .009939
           dumstate18 |    -.08198   .0550004    -1.49   0.136    -.1897794    .0258195
           dumstate19 |  -.0712396   .0570062    -1.25   0.211    -.1829705    .0404912
           dumstate20 |  -.1136664   .0561973    -2.02   0.043    -.2238119    -.003521
           dumstate21 |  -.0645364   .0552069    -1.17   0.242    -.1727406    .0436677
           dumstate22 |          0   .0557513     0.00   1.000    -.1092713    .1092713
           dumstate23 |   .0201628   .0568543     0.35   0.723    -.0912702    .1315958
           dumstate24 |    .061886   .0585948     1.06   0.291    -.0529583    .1767304
           dumstate25 |   .0787915   .0567347     1.39   0.165    -.0324071    .1899902
           dumstate26 |  -.0967938   .0574307    -1.69   0.092    -.2093565     .015769
           dumstate27 |  -.0313053   .0570401    -0.55   0.583    -.1431026    .0804919
           dumstate28 |  -.1083208   .0562245    -1.93   0.054    -.2185195    .0018778
           dumstate29 |  -.0217889   .0559631    -0.39   0.697    -.1314753    .0878975
           dumstate30 |  -.0428181   .0559232    -0.77   0.444    -.1524262      .06679
           dumstate31 |  -.1229639   .0567648    -2.17   0.030    -.2342215   -.0117063
           dumstate32 |  -.0746253   .0559915    -1.33   0.183    -.1843674    .0351168
           dumstate33 |  -.0555489   .0549023    -1.01   0.312    -.1631561    .0520583
           dumstate34 |  -.0409671   .0572669    -0.72   0.474     -.153209    .0712747
           dumstate35 |  -.0498958   .0564507    -0.88   0.377    -.1605378    .0607463
           dumstate36 |  -.0345325   .0570754    -0.61   0.545    -.1463988    .0773339
           dumstate37 |  -.1205342   .0561716    -2.15   0.032    -.2306293   -.0104391
           dumstate38 |  -.0249239   .0563677    -0.44   0.658    -.1354033    .0855555
           dumstate39 |  -.1566639    .056882    -2.75   0.006    -.2681512   -.0451766
           dumstate40 |  -.1613277   .0567036    -2.85   0.004    -.2724654   -.0501899
           dumstate41 |   .1193916   .0569958     2.09   0.036     .0076812     .231102
           dumstate42 |  -.1126292   .0585298    -1.92   0.054    -.2273463    .0020879
           dumstate43 |  -.1508982   .0598531    -2.52   0.012     -.268209   -.0335875
           dumstate44 |  -.0158151   .0574423    -0.28   0.783    -.1284005    .0967704
           dumstate45 |  -.1248849   .0554085    -2.25   0.024    -.2334841   -.0162856
           dumstate46 |   .0292373   .0560797     0.52   0.602    -.0806776    .1391522
           dumstate47 |  -.0155722   .0572023    -0.27   0.785    -.1276874    .0965429
           dumstate48 |  -.1107701   .0562221    -1.97   0.049    -.2209641   -.0005762
           dumstate49 |   .1184355   .0567781     2.09   0.037     .0071518    .2297192
           dumstate50 |    .232919   .0574063     4.06   0.000      .120404     .345434
           dumstate51 |  -.0039838   .0566032    -0.07   0.944    -.1149247    .1069571
             dumyear1 |   -.105227   .0155101    -6.78   0.000    -.1356264   -.0748277
             dumyear2 |   -.119056   .0156842    -7.59   0.000    -.1497966   -.0883154
             dumyear3 |  -.1447592   .0156129    -9.27   0.000    -.1753601   -.1141582
             dumyear4 |  -.1258249   .0148208    -8.49   0.000    -.1548733   -.0967765
             dumyear5 |  -.1159181   .0158378    -7.32   0.000    -.1469597   -.0848764
             dumyear6 |  -.0911504   .0162946    -5.59   0.000    -.1230874   -.0592134
             dumyear7 |   -.086369   .0160617    -5.38   0.000    -.1178495   -.0548885
             dumyear8 |  -.0992637   .0169923    -5.84   0.000    -.1325682   -.0659591
             dumyear9 |  -.0686063   .0169737    -4.04   0.000    -.1018744   -.0353382
            dumyear10 |  -.0776566   .0165347    -4.70   0.000    -.1100642   -.0452491
            dumyear11 |  -.0734467   .0170162    -4.32   0.000    -.1067981   -.0400953
            dumyear12 |  -.0599731   .0158904    -3.77   0.000    -.0911179   -.0288284
            dumyear13 |  -.0379609    .017024    -2.23   0.026    -.0713277   -.0045942
            dumyear14 |  -.0380815   .0168947    -2.25   0.024    -.0711948   -.0049683
            dumyear15 |  -.0344633   .0210471    -1.64   0.102    -.0757152    .0067886
            dumyear16 |  -.0415266   .0174583    -2.38   0.017    -.0757443   -.0073088
            dumyear17 |  -.0512987   .0169468    -3.03   0.002    -.0845141   -.0180833
            dumyear18 |  -.0591165   .0173226    -3.41   0.001    -.0930685   -.0251646
            dumyear19 |  -.0245047   .0180711    -1.36   0.175    -.0599237    .0109142
            dumyear20 |  -.0159009    .014954    -1.06   0.288    -.0452104    .0134086
            dumyear21 |  -.0147453   .0175553    -0.84   0.401    -.0491533    .0196627
            dumyear22 |  -.0366598   .0170417    -2.15   0.031    -.0700611   -.0032585
            dumyear23 |  -.0344286   .0173513    -1.98   0.047    -.0684368   -.0004204
            dumyear24 |  -.0152668   .0180173    -0.85   0.397    -.0505803    .0200468
            dumyear25 |  -.0270711   .0186451    -1.45   0.147    -.0636151     .009473
            dumyear26 |  -.0122799   .0179484    -0.68   0.494    -.0474584    .0228986
            dumyear27 |   .0043267   .0184857     0.23   0.815    -.0319048    .0405582
            dumyear28 |  -.0057932   .0172238    -0.34   0.737    -.0395515     .027965
            dumyear29 |          0   .0145313     0.00   1.000    -.0284811    .0284811
             dumnind1 |  -.0147977   .0140007    -1.06   0.291    -.0422388    .0126433
             dumnind2 |    .192056   .0152044    12.63   0.000     .1622557    .2218564
             dumnind3 |  -.0275157   .0143438    -1.92   0.055    -.0556293    .0005978
             dumnind4 |  -.1250368   .0152409    -8.20   0.000    -.1549087   -.0951649
             dumnind5 |    .055845   .0150567     3.71   0.000     .0263342    .0853559
             dumnind6 |          0   .0144568     0.00   1.000     -.028335     .028335
             dumnind7 |  -.0023846   .0169299    -0.14   0.888    -.0355669    .0307977
             dumnind8 |  -.0975511   .0171103    -5.70   0.000    -.1310868   -.0640154
             dumnind9 |  -.1077166   .0161056    -6.69   0.000    -.1392832   -.0761499
            dumnind10 |  -.0740755   .0181471    -4.08   0.000    -.1096434   -.0385076
            dumnind11 |   .1367031   .0163237     8.37   0.000     .1047091    .1686971
                 educ |   .0631583   .0042188    14.97   0.000     .0548896    .0714269
                exper |   .0077778   .0028851     2.70   0.007     .0021231    .0134325
               exper2 |   .0008544   .0001841     4.64   0.000     .0004935    .0012152
               exper3 |  -.0000377   6.30e-06    -5.99   0.000    -.0000501   -.0000254
               exper4 |   4.09e-07   7.03e-08     5.82   0.000     2.71e-07    5.46e-07
                 edex |  -.0000813   .0001334    -0.61   0.542    -.0003427    .0001801
            dumee_cl1 |          0   .0637296     0.00   1.000    -.1249085    .1249085
            dumee_cl2 |  -.1277712   .0631955    -2.02   0.043    -.2516328   -.0039095
            dumee_cl3 |  -.2024689   .0641793    -3.15   0.002    -.3282589   -.0766789
            dumee_cl4 |  -.3325822   .0662861    -5.02   0.000    -.4625014    -.202663
            dumee_cl5 |   -.109247   .0633076    -1.73   0.084    -.2333285    .0148345
            dumee_cl6 |  -.1716026   .0631681    -2.72   0.007    -.2954106   -.0477947
            dumee_cl7 |   -.193682   .0639923    -3.03   0.002    -.3191055   -.0682585
            dumee_cl8 |  -.2269484   .0652491    -3.48   0.001     -.354835   -.0990618
            dumee_cl9 |  -.1632125   .0637469    -2.56   0.010    -.2881549   -.0382702
           dumee_cl10 |   -.218169   .0634392    -3.44   0.001    -.3425084   -.0938296
           dumee_cl11 |  -.2079496   .0646228    -3.22   0.001    -.3346089   -.0812904
           dumee_cl12 |  -.1569945   .0656899    -2.39   0.017    -.2857452   -.0282438
           dumee_cl13 |  -.1212581   .0638917    -1.90   0.058    -.2464844    .0039681
           dumee_cl14 |  -.2212605   .0638164    -3.47   0.001     -.346339   -.0961819
           dumee_cl15 |  -.2051598   .0640929    -3.20   0.001    -.3307803   -.0795393
           dumee_cl16 |  -.1467155   .0655151    -2.24   0.025    -.2751236   -.0183074
                 marr |   .0530069   .0031467    16.85   0.000     .0468395    .0591744
                partt |    .059434   .0076599     7.76   0.000     .0444208    .0744472
               public |  -.1095836   .0045831   -23.91   0.000    -.1185664   -.1006009
                 cmsa |   .1077154   .0035742    30.14   0.000     .1007102    .1147207
            dumnocc31 |   .2462575   .0481103     5.12   0.000     .1519624    .3405525
            dumnocc32 |          0   .0488459     0.00   1.000    -.0957369    .0957369
            dumnocc33 |   .0961623   .0482199     1.99   0.046     .0016524    .1906722
            dumnocc34 |   .0954762   .0486573     1.96   0.050     .0001092    .1908433
          dumquarter1 |  -.0044968   .0057504    -0.78   0.434    -.0157674    .0067738
          dumquarter2 |  -.0060636   .0057494    -1.05   0.292    -.0173322    .0052051
          dumquarter3 |          0   .0047759     0.00   1.000    -.0093606    .0093606
          dumquarter4 |   .0082172   .0053307     1.54   0.123    -.0022309    .0186654
                unemp |  -.0038194   .0017761    -2.15   0.032    -.0073004   -.0003383
                _cons |   1.423306   .1097221    12.97   0.000     1.208253    1.638359
---------------------------------------------------------------------------------------
women covered by union at 80 quantile
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear29 dropped because of collinearity
note: dumnind2 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc34 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
Bootstrap rifreg (200)
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200


      Source |       SS       df       MS              Number of obs =  154778
-------------+------------------------------           F(123,154654) =  294.26
       Model |  17406.7002   123  141.517888           Prob > F      =  0.0000
    Residual |  55799.7976 154654  .360804102          R-squared     =  0.2378
-------------+------------------------------           Adj R-squared =  0.2372
       Total |  73206.4977 154777  .472980467          Root MSE      =  .60067
---------------------------------------------------------------------------------------
                      |              Bootstrap
               rif_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0754499    .006418   -11.76   0.000    -.0880291   -.0628707
             treat_st |  -.1154268   .0144232    -8.00   0.000     -.143696   -.0871577
treat_stblackrelwhite |   .0818378   .0100941     8.11   0.000     .0620535    .1016221
            dumstate1 |  -.1583885    .042474    -3.73   0.000    -.2416367   -.0751404
            dumstate2 |  -.0862233   .0414529    -2.08   0.038    -.1674701   -.0049764
            dumstate3 |  -.1888065   .0408477    -4.62   0.000    -.2688672   -.1087458
            dumstate4 |    .083379   .0417964     1.99   0.046     .0014589    .1652991
            dumstate5 |   .1215635   .0411345     2.96   0.003     .0409406    .2021863
            dumstate6 |   .1176311   .0414034     2.84   0.004     .0364814    .1987808
            dumstate7 |   .0950955   .0398851     2.38   0.017     .0169216    .1732695
            dumstate8 |   .2166811   .0418811     5.17   0.000      .134595    .2987671
            dumstate9 |  -.0311781   .0407059    -0.77   0.444    -.1109608    .0486046
           dumstate10 |  -.0885166   .0400598    -2.21   0.027    -.1670331   -.0100002
           dumstate11 |  -.1037925   .0413309    -2.51   0.012    -.1848003   -.0227847
           dumstate12 |  -.0374417   .0404366    -0.93   0.354    -.1166966    .0418132
           dumstate13 |   -.001935   .0400622    -0.05   0.961    -.0804561     .076586
           dumstate14 |  -.0820176   .0404379    -2.03   0.043    -.1612751   -.0027601
           dumstate15 |  -.0364891   .0408462    -0.89   0.372    -.1165468    .0435685
           dumstate16 |  -.0733688   .0408534    -1.80   0.073    -.1534407     .006703
           dumstate17 |  -.1616188   .0398505    -4.06   0.000     -.239725   -.0835126
           dumstate18 |  -.0813259   .0426402    -1.91   0.056    -.1648997     .002248
           dumstate19 |  -.1021395   .0419539    -2.43   0.015    -.1843683   -.0199107
           dumstate20 |  -.1379013   .0418313    -3.30   0.001    -.2198898   -.0559127
           dumstate21 |  -.1193917   .0412712    -2.89   0.004    -.2002824    -.038501
           dumstate22 |   .0576009    .036862     1.56   0.118    -.0146479    .1298498
           dumstate23 |   .1346621    .041423     3.25   0.001     .0534738    .2158504
           dumstate24 |   .1551858   .0405293     3.83   0.000     .0757493    .2346223
           dumstate25 |   .0959437   .0442519     2.17   0.030     .0092109    .1826766
           dumstate26 |  -.1119512   .0443419    -2.52   0.012    -.1988604    -.025042
           dumstate27 |  -.0307313   .0451444    -0.68   0.496    -.1192133    .0577507
           dumstate28 |  -.1029227   .0454185    -2.27   0.023     -.191942   -.0139034
           dumstate29 |  -.0585768   .0411871    -1.42   0.155    -.1393027    .0221491
           dumstate30 |  -.0423435   .0417035    -1.02   0.310    -.1240815    .0393945
           dumstate31 |  -.1256113   .0412809    -3.04   0.002    -.2065209   -.0447017
           dumstate32 |  -.0670654   .0431843    -1.55   0.120    -.1517057    .0175749
           dumstate33 |  -.1348326   .0437005    -3.09   0.002    -.2204848   -.0491805
           dumstate34 |  -.0906251   .0435843    -2.08   0.038    -.1760496   -.0052007
           dumstate35 |  -.0795318   .0442191    -1.80   0.072    -.1662004    .0071367
           dumstate36 |  -.0362237    .045671    -0.79   0.428    -.1257379    .0532904
           dumstate37 |   -.198317   .0433119    -4.58   0.000    -.2832073   -.1134266
           dumstate38 |  -.0531316   .0424575    -1.25   0.211    -.1363474    .0300842
           dumstate39 |  -.1531756   .0400013    -3.83   0.000    -.2315773   -.0747738
           dumstate40 |   -.189802   .0438736    -4.33   0.000    -.2757934   -.1038107
           dumstate41 |          0   .0387354     0.00   1.000    -.0759207    .0759207
           dumstate42 |   -.130776   .0407375    -3.21   0.001    -.2106206   -.0509314
           dumstate43 |  -.2105501   .0457151    -4.61   0.000    -.3001507   -.1209494
           dumstate44 |  -.0344483   .0446025    -0.77   0.440    -.1218683    .0529716
           dumstate45 |  -.0887848   .0438532    -2.02   0.043    -.1747363   -.0028334
           dumstate46 |   .0473269    .043165     1.10   0.273    -.0372755    .1319294
           dumstate47 |  -.0240628   .0414756    -0.58   0.562    -.1053542    .0572285
           dumstate48 |  -.0933527   .0403018    -2.32   0.021    -.1723433   -.0143621
           dumstate49 |    .153421   .0407596     3.76   0.000      .073533    .2333091
           dumstate50 |   .1546693   .0426638     3.63   0.000     .0710491    .2382894
           dumstate51 |  -.0290327   .0465844    -0.62   0.533    -.1203371    .0622717
             dumyear1 |  -.0621927   .0224286    -2.77   0.006    -.1061522   -.0182332
             dumyear2 |  -.0709937   .0225533    -3.15   0.002    -.1151978   -.0267897
             dumyear3 |  -.0630655   .0215965    -2.92   0.003    -.1053942   -.0207368
             dumyear4 |  -.0347394   .0217221    -1.60   0.110    -.0773142    .0078354
             dumyear5 |  -.0186344   .0220403    -0.85   0.398     -.061833    .0245642
             dumyear6 |  -.0096173   .0222561    -0.43   0.666    -.0532388    .0340041
             dumyear7 |  -.0004614   .0226961    -0.02   0.984    -.0449453    .0440225
             dumyear8 |   .0011672   .0237848     0.05   0.961    -.0454505    .0477849
             dumyear9 |   .0280232   .0243647     1.15   0.250    -.0197311    .0757775
            dumyear10 |  -.0042411    .023029    -0.18   0.854    -.0493774    .0408951
            dumyear11 |   .0214439   .0230531     0.93   0.352    -.0237398    .0666275
            dumyear12 |   .0177869   .0238714     0.75   0.456    -.0290007    .0645744
            dumyear13 |   .0205268   .0216111     0.95   0.342    -.0218305     .062884
            dumyear14 |  -.0015216   .0229367    -0.07   0.947    -.0464771    .0434339
            dumyear15 |   .0103876   .0239239     0.43   0.664    -.0365028     .057278
            dumyear16 |   .0113646   .0243288     0.47   0.640    -.0363193    .0590486
            dumyear17 |  -.0088757   .0236192    -0.38   0.707    -.0551687    .0374174
            dumyear18 |  -.0063149   .0230518    -0.27   0.784     -.051496    .0388661
            dumyear19 |   .0286738   .0253118     1.13   0.257    -.0209367    .0782843
            dumyear20 |   .0373468   .0220723     1.69   0.091    -.0059144    .0806081
            dumyear21 |   .0086922   .0244663     0.36   0.722    -.0392612    .0566457
            dumyear22 |  -.0079097   .0229621    -0.34   0.730    -.0529149    .0370955
            dumyear23 |   .0014807   .0228241     0.06   0.948    -.0432541    .0462155
            dumyear24 |  -.0300286   .0241259    -1.24   0.213    -.0773148    .0172577
            dumyear25 |   .0004686   .0244953     0.02   0.985    -.0475416    .0484789
            dumyear26 |   .0101839   .0229598     0.44   0.657    -.0348168    .0551846
            dumyear27 |   -.011555   .0230424    -0.50   0.616    -.0567177    .0336077
            dumyear28 |  -.0000471   .0262025    -0.00   0.999    -.0514034    .0513092
            dumyear29 |          0     .02245     0.00   1.000    -.0440015    .0440015
             dumnind1 |  -.1863667   .1041762    -1.79   0.074    -.3905499    .0178166
             dumnind2 |          0   .1043109     0.00   1.000    -.2044472    .2044472
             dumnind3 |  -.1612188   .1044471    -1.54   0.123     -.365933    .0434954
             dumnind4 |  -.2992195   .1040021    -2.88   0.004    -.5030615   -.0953775
             dumnind5 |  -.1064296   .1039658    -1.02   0.306    -.3102003    .0973411
             dumnind6 |  -.1885339   .1039411    -1.81   0.070    -.3922564    .0151886
             dumnind7 |  -.2279693    .104732    -2.18   0.030    -.4332418   -.0226967
             dumnind8 |  -.1791171   .1038618    -1.72   0.085    -.3826841    .0244499
             dumnind9 |  -.3572052   .1043424    -3.42   0.001    -.5617142   -.1526963
            dumnind10 |  -.2383716   .1039382    -2.29   0.022    -.4420883   -.0346549
            dumnind11 |  -.1107005   .1044454    -1.06   0.289    -.3154114    .0940104
                 educ |   .1072024   .0049078    21.84   0.000     .0975832    .1168216
                exper |    .003869   .0041405     0.93   0.350    -.0042464    .0119843
               exper2 |   .0005224   .0002678     1.95   0.051    -2.50e-06    .0010474
               exper3 |  -.0000393   9.19e-06    -4.28   0.000    -.0000573   -.0000213
               exper4 |   5.32e-07   1.01e-07     5.26   0.000     3.34e-07    7.30e-07
                 edex |   .0008599   .0001865     4.61   0.000     .0004944    .0012254
            dumee_cl1 |          0   .0220349     0.00   1.000     -.043188     .043188
            dumee_cl2 |  -.2104578   .0219201    -9.60   0.000    -.2534208   -.1674948
            dumee_cl3 |  -.3743016   .0232599   -16.09   0.000    -.4198905   -.3287128
            dumee_cl4 |  -.5961271   .0296273   -20.12   0.000    -.6541961   -.5380581
            dumee_cl5 |  -.1112105   .0235308    -4.73   0.000    -.1573303   -.0650907
            dumee_cl6 |  -.3267862   .0216724   -15.08   0.000    -.3692636   -.2843087
            dumee_cl7 |  -.4424605    .022313   -19.83   0.000    -.4861936   -.3987275
            dumee_cl8 |  -.5192856   .0273142   -19.01   0.000    -.5728208   -.4657504
            dumee_cl9 |  -.1262592   .0233274    -5.41   0.000    -.1719804   -.0805379
           dumee_cl10 |   -.355658   .0220555   -16.13   0.000    -.3988864   -.3124297
           dumee_cl11 |  -.4474181   .0230956   -19.37   0.000    -.4926849   -.4021512
           dumee_cl12 |  -.4862111   .0273745   -17.76   0.000    -.5398646   -.4325575
           dumee_cl13 |  -.0173557   .0247519    -0.70   0.483    -.0658689    .0311575
           dumee_cl14 |  -.3361442   .0221742   -15.16   0.000    -.3796052   -.2926832
           dumee_cl15 |  -.4132161   .0249482   -16.56   0.000    -.4621141    -.364318
           dumee_cl16 |  -.4579559   .0279335   -16.39   0.000    -.5127049   -.4032068
                 marr |   .0063235   .0040515     1.56   0.119    -.0016174    .0142644
                partt |   .0730418   .0058386    12.51   0.000     .0615983    .0844854
               public |  -.0496209   .0052853    -9.39   0.000      -.05998   -.0392618
                 cmsa |   .1366197     .00433    31.55   0.000     .1281329    .1451065
            dumnocc31 |   .2136336   .0236548     9.03   0.000     .1672706    .2599966
            dumnocc32 |  -.0592355   .0243454    -2.43   0.015     -.106952   -.0115189
            dumnocc33 |          0   .0241227     0.00   1.000      -.04728      .04728
            dumnocc34 |   .0480106   .0249891     1.92   0.055    -.0009674    .0969887
          dumquarter1 |   -.020769   .0075274    -2.76   0.006    -.0355226   -.0060155
          dumquarter2 |  -.0170012   .0072365    -2.35   0.019    -.0311847   -.0028177
          dumquarter3 |   -.008135   .0066131    -1.23   0.219    -.0210965    .0048265
          dumquarter4 |          0   .0069181     0.00   1.000    -.0135593    .0135593
                unemp |  -.0018928   .0020182    -0.94   0.348    -.0058485    .0020628
                _cons |    .973958    .130103     7.49   0.000     .7189588    1.228957
---------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/rifdid.log
  log type:  text
 closed on:   9 Mar 2021, 17:00:27
------------------------------------------------------------------------------------------------
