------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 opened on:   8 Mar 2021, 22:54:27

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2
> 004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extende
> d to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
(2,109 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,113 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,737 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,612 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** NOTE in current draft we have not dropped <83, self empl + w/o pay
. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,451,221 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc
>  cmsa partt public marr hisprace hispracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_mo
> rg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,237,006  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,524 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472759 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786904 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,175 real changes made, 324,175 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,799 real changes made, 266,799 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,175 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,20
> 13(28 effective; signed Dec2012) Mar1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,201
> 7(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 
> 87, 47, 83, 72, 82) //incl Idaho which changed in 1985 and Texas which had since 47 but bolste
> red in 93
(1,149,231 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,267 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 
> 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,231 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,836 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 
> 88, 63, 64, 57, 87, 47, 83, 72)
(1,106,040 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,836 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,106,040 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,106,040 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would ne
> ed to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,175 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,799 missing values generated)

. 
. ** BLACK-WHITE
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper expe
> r2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 0, vce(cluster state) 
(sum of wgt is 9,210,046,331)

Linear regression                               Number of obs     =  1,068,211
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2229
                                                Root MSE          =     .33515

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0593572   .0076526     7.76   0.000     .0439866    .0747279
             treat_st |   -.029863   .0103791    -2.88   0.006      -.05071   -.0090161
treat_stblackrelwhite |  -.0608236   .0080984    -7.51   0.000    -.0770899   -.0445574
                      |
                state |
                  NH  |   -.045436   .0036268   -12.53   0.000    -.0527207   -.0381513
                  VT  |  -.0472442    .001742   -27.12   0.000    -.0507432   -.0437452
                  MA  |  -.0018218   .0050617    -0.36   0.720    -.0119885     .008345
                  RI  |   .0073419   .0048698     1.51   0.138    -.0024393    .0171231
                  CT  |   .0002611   .0048381     0.05   0.957    -.0094565    .0099787
                  NY  |   .0893658   .0043153    20.71   0.000     .0806983    .0980334
                  NJ  |   .0362687   .0053031     6.84   0.000     .0256171    .0469203
                  PA  |   .0157792   .0037593     4.20   0.000     .0082284    .0233301
                  OH  |   .0057584   .0037786     1.52   0.134    -.0018311    .0133479
                  IN  |  -.0111845   .0039152    -2.86   0.006    -.0190484   -.0033206
                  IL  |   .0349656   .0045818     7.63   0.000     .0257627    .0441685
                  MI  |   .0505652   .0050692     9.98   0.000     .0403834    .0607469
                  WI  |  -.0045763   .0033402    -1.37   0.177    -.0112852    .0021326
                  MN  |   .0139878   .0042546     3.29   0.002     .0054421    .0225335
                  IA  |   .0039742   .0103619     0.38   0.703    -.0168383    .0247868
                  MO  |   -.016768    .003724    -4.50   0.000    -.0242479    -.009288
                  ND  |  -.0566833   .0102598    -5.52   0.000    -.0772906   -.0360759
                  SD  |  -.0787401   .0102835    -7.66   0.000    -.0993951   -.0580851
                  NE  |  -.0333495   .0106081    -3.14   0.003    -.0546564   -.0120426
                  KS  |  -.0374007   .0107193    -3.49   0.001    -.0589311   -.0158703
                  DE  |  -.0586829    .002206   -26.60   0.000    -.0631138   -.0542519
                  MD  |  -.0561336    .005518   -10.17   0.000    -.0672168   -.0450504
                  DC  |  -.0577352   .0071149    -8.11   0.000    -.0720259   -.0434445
                  VA  |  -.0875842   .0108684    -8.06   0.000    -.1094141   -.0657543
                  WV  |  -.0172252   .0034404    -5.01   0.000    -.0241355    -.010315
                  NC  |  -.1164843   .0110234   -10.57   0.000    -.1386254   -.0943432
                  SC  |  -.1258254   .0111929   -11.24   0.000     -.148307   -.1033439
                  GA  |  -.0804695   .0114386    -7.03   0.000    -.1034445   -.0574945
                  FL  |  -.0630864   .0116711    -5.41   0.000    -.0865286   -.0396443
                  KY  |  -.0488399   .0030736   -15.89   0.000    -.0550134   -.0426663
                  TN  |  -.0645225   .0111441    -5.79   0.000    -.0869061   -.0421389
                  AL  |  -.0410136   .0111615    -3.67   0.001    -.0634322   -.0185951
                  MS  |  -.0953305   .0112626    -8.46   0.000    -.1179521   -.0727088
                  AR  |  -.0937647   .0109484    -8.56   0.000    -.1157552   -.0717742
                  LA  |   -.073823   .0115566    -6.39   0.000    -.0970351    -.050611
                  OK  |  -.0880938   .0065723   -13.40   0.000    -.1012946    -.074893
                  TX  |  -.0728144   .0116391    -6.26   0.000    -.0961921   -.0494366
                  MT  |  -.0042688   .0022293    -1.91   0.061    -.0087465    .0002088
                  ID  |  -.0928746   .0021873   -42.46   0.000    -.0972679   -.0884814
                  WY  |  -.0586399   .0107948    -5.43   0.000     -.080322   -.0369579
                  CO  |  -.0642765   .0052591   -12.22   0.000    -.0748396   -.0537134
                  NM  |  -.1082819   .0040687   -26.61   0.000    -.1164541   -.1001097
                  AZ  |  -.0694766   .0117364    -5.92   0.000    -.0930498   -.0459033
                  UT  |   -.070364   .0114132    -6.17   0.000    -.0932882   -.0474399
                  NV  |   .0379653   .0117986     3.22   0.002     .0142672    .0616634
                  WA  |   .0450275   .0044539    10.11   0.000     .0360816    .0539735
                  OR  |   .0087533   .0042949     2.04   0.047     .0001268    .0173798
                  CA  |   .0245202    .005617     4.37   0.000     .0132381    .0358022
                  AK  |   .0351769   .0055906     6.29   0.000     .0239479    .0464059
                  HI  |   .0173782   .0039939     4.35   0.000     .0093562    .0254001
                      |
                 year |
                1990  |  -.0056694   .0025436    -2.23   0.030    -.0107783   -.0005605
                1991  |  -.0064478   .0033669    -1.92   0.061    -.0132104    .0003148
                1992  |  -.0109169   .0039186    -2.79   0.008    -.0187877   -.0030462
                1993  |  -.0132849   .0040496    -3.28   0.002    -.0214188   -.0051511
                1996  |  -.0276053   .0036618    -7.54   0.000    -.0349603   -.0202503
                1997  |  -.0295523   .0041519    -7.12   0.000    -.0378916   -.0212129
                1998  |  -.0347541    .004327    -8.03   0.000    -.0434452   -.0260631
                1999  |  -.0353657   .0039565    -8.94   0.000    -.0433127   -.0274187
                2000  |    -.04031   .0044306    -9.10   0.000    -.0492091   -.0314109
                2001  |  -.0420722   .0047821    -8.80   0.000    -.0516773   -.0324672
                2002  |  -.0411805   .0055662    -7.40   0.000    -.0523605   -.0300005
                2003  |  -.0477256   .0046079   -10.36   0.000    -.0569809   -.0384704
                2004  |  -.0521719   .0050496   -10.33   0.000    -.0623143   -.0420295
                2005  |  -.0605272   .0053759   -11.26   0.000    -.0713249   -.0497295
                2006  |  -.0635213   .0061079   -10.40   0.000    -.0757894   -.0512533
                2007  |  -.0624102   .0059584   -10.47   0.000    -.0743779   -.0504424
                2008  |   -.052555   .0058097    -9.05   0.000    -.0642241   -.0408858
                2009  |  -.0491558    .007412    -6.63   0.000    -.0640433   -.0342683
                2010  |  -.0520613   .0081532    -6.39   0.000    -.0684373   -.0356852
                2011  |  -.0576022   .0069322    -8.31   0.000    -.0715259   -.0436785
                2012  |  -.0564704   .0072635    -7.77   0.000    -.0710595   -.0418813
                2013  |  -.0578161   .0057126   -10.12   0.000    -.0692902    -.046342
                2014  |  -.0606503   .0055898   -10.85   0.000    -.0718778   -.0494229
                2015  |  -.0630117   .0057059   -11.04   0.000    -.0744723    -.051551
                2016  |  -.0635942   .0057709   -11.02   0.000    -.0751853    -.052003
                2017  |  -.0576077   .0051556   -11.17   0.000     -.067963   -.0472524
                2018  |   -.060031   .0045163   -13.29   0.000    -.0691022   -.0509597
                2019  |  -.0645344   .0058097   -11.11   0.000    -.0762035   -.0528653
                      |
                 nind |
                   2  |   .0954497   .0162426     5.88   0.000     .0628254    .1280739
                   3  |   .0902961   .0109653     8.23   0.000     .0682717    .1123206
                   4  |   .0105667   .0082991     1.27   0.209    -.0061027     .027236
                   5  |    .176988   .0086543    20.45   0.000     .1596053    .1943707
                   6  |   .0003316   .0079366     0.04   0.967    -.0156097    .0162728
                   7  |   -.002297   .0069298    -0.33   0.742    -.0162159    .0116219
                   8  |   .0124674   .0124073     1.00   0.320    -.0124535    .0373882
                   9  |   .1178426   .0142386     8.28   0.000     .0892436    .1464416
                  10  |   .0034018   .0136251     0.25   0.804     -.023965    .0307687
                  11  |   .0780217    .016307     4.78   0.000     .0452681    .1107753
                      |
                 educ |   .0067958   .0013752     4.94   0.000     .0040337    .0095579
                exper |   .0068761   .0011526     5.97   0.000     .0045611    .0091911
               exper2 |  -.0000642   .0000621    -1.03   0.306    -.0001888    .0000604
               exper3 |   1.84e-06   2.04e-06     0.90   0.372    -2.26e-06    5.95e-06
               exper4 |  -4.63e-08   2.30e-08    -2.01   0.050    -9.26e-08   -2.73e-11
                 edex |  -.0001792   .0000417    -4.30   0.000     -.000263   -.0000954
                      |
                ee_cl |
                   2  |  -.0159371   .0047591    -3.35   0.002    -.0254959   -.0063782
                   3  |  -.0070344   .0053136    -1.32   0.192    -.0177071    .0036382
                   4  |  -.0182135   .0082211    -2.22   0.031    -.0347261   -.0017009
                   5  |  -.0699195   .0081464    -8.58   0.000     -.086282    -.053557
                   6  |  -.0028993   .0041634    -0.70   0.489    -.0112618    .0054633
                   7  |   .0160489   .0060338     2.66   0.010     .0039298     .028168
                   8  |  -.0282839   .0101504    -2.79   0.008    -.0486715   -.0078963
                   9  |  -.0612017   .0067846    -9.02   0.000     -.074829   -.0475744
                  10  |   .0129189    .005943     2.17   0.034      .000982    .0248558
                  11  |   .0155166   .0075245     2.06   0.044     .0004031      .03063
                  12  |  -.0400487   .0120694    -3.32   0.002    -.0642908   -.0158067
                  13  |   .0010562   .0075264     0.14   0.889     -.014061    .0161734
                  14  |   .0271747   .0066127     4.11   0.000     .0138928    .0404567
                  15  |   .0078939   .0082958     0.95   0.346    -.0087687    .0245564
                  16  |  -.0478316   .0130632    -3.66   0.001    -.0740698   -.0215935
                      |
                 marr |   .0172914   .0015945    10.84   0.000     .0140888    .0204939
                partt |  -.0585481   .0060755    -9.64   0.000    -.0707511   -.0463452
               public |   .2666382   .0254005    10.50   0.000     .2156198    .3176567
                 cmsa |    .043596   .0049357     8.83   0.000     .0336824    .0535096
                      |
                nocc2 |
                   2  |   .0519187   .0030309    17.13   0.000     .0458309    .0580064
                   3  |   .0326781   .0048352     6.76   0.000     .0229664    .0423898
                   4  |   .1657892   .0108284    15.31   0.000     .1440396    .1875387
                   5  |   .1500175   .0165298     9.08   0.000     .1168164    .1832186
                   6  |   .1366807   .0066844    20.45   0.000     .1232547    .1501066
                   7  |    .071006   .0047409    14.98   0.000     .0614836    .0805284
                   8  |   .0689279   .0070356     9.80   0.000     .0547965    .0830593
                   9  |   .1661511   .0107415    15.47   0.000     .1445763     .187726
                  10  |   .1944974   .0136781    14.22   0.000     .1670242    .2219706
                  11  |   .2097433   .0148113    14.16   0.000     .1799939    .2394928
                  12  |   .2078092   .0163327    12.72   0.000     .1750039    .2406144
                      |
                unemp |  -.0016321   .0014286    -1.14   0.259    -.0045014    .0012373
                      |
              quarter |
                   2  |  -.0029449   .0014887    -1.98   0.053    -.0059351    .0000453
                   3  |  -.0033826   .0013184    -2.57   0.013    -.0060306   -.0007345
                   4  |  -.0041262   .0009508    -4.34   0.000    -.0060359   -.0022164
                      |
                _cons |  -.1565474   .0331071    -4.73   0.000    -.2230449   -.0900499
---------------------------------------------------------------------------------------

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper expe
> r2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 1, vce(cluster state)
(sum of wgt is 9,012,992,923)

Linear regression                               Number of obs     =  1,079,122
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2720
                                                Root MSE          =     .29792

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0795126   .0115393     6.89   0.000     .0563353      .10269
             treat_st |  -.0220897    .011362    -1.94   0.058     -.044911    .0007316
treat_stblackrelwhite |  -.0645833   .0122901    -5.25   0.000    -.0892687   -.0398979
                      |
                state |
                  NH  |  -.0154131   .0015238   -10.12   0.000    -.0184736   -.0123525
                  VT  |  -.0063045   .0010525    -5.99   0.000    -.0084186   -.0041905
                  MA  |     .01507    .003091     4.88   0.000     .0088615    .0212784
                  RI  |   .0340663    .002834    12.02   0.000     .0283741    .0397586
                  CT  |   .0252293   .0028839     8.75   0.000     .0194367    .0310219
                  NY  |   .0954976   .0030203    31.62   0.000     .0894311    .1015641
                  NJ  |   .0335231   .0030372    11.04   0.000     .0274228    .0396234
                  PA  |    .008779   .0027571     3.18   0.002     .0032413    .0143168
                  OH  |  -.0047521   .0023879    -1.99   0.052    -.0095484    .0000442
                  IN  |  -.0430751   .0033318   -12.93   0.000    -.0497672    -.036383
                  IL  |   .0003774   .0030954     0.12   0.903    -.0058398    .0065947
                  MI  |   .0451864   .0034655    13.04   0.000     .0382258     .052147
                  WI  |   -.002636   .0026083    -1.01   0.317     -.007875     .002603
                  MN  |   .0361962   .0022795    15.88   0.000     .0316176    .0407748
                  IA  |  -.0028923   .0111674    -0.26   0.797    -.0253228    .0195382
                  MO  |  -.0521384   .0025526   -20.43   0.000    -.0572654   -.0470114
                  ND  |   -.042459   .0111574    -3.81   0.000    -.0648694   -.0200487
                  SD  |  -.0545284    .011192    -4.87   0.000    -.0770082   -.0320486
                  NE  |  -.0220814   .0110757    -1.99   0.052    -.0443276    .0001648
                  KS  |  -.0565323   .0111535    -5.07   0.000    -.0789348   -.0341298
                  DE  |  -.0309186   .0029716   -10.40   0.000    -.0368874   -.0249499
                  MD  |  -.0427865   .0057718    -7.41   0.000    -.0543796   -.0311934
                  DC  |  -.0638065   .0065673    -9.72   0.000    -.0769974   -.0506156
                  VA  |  -.0773111   .0111513    -6.93   0.000    -.0997091   -.0549131
                  WV  |  -.0270509    .002391   -11.31   0.000    -.0318535   -.0222484
                  NC  |  -.1016958   .0116042    -8.76   0.000    -.1250036    -.078388
                  SC  |  -.1084938   .0116388    -9.32   0.000    -.1318711   -.0851166
                  GA  |  -.0864804   .0116426    -7.43   0.000    -.1098652   -.0630956
                  FL  |  -.0374368   .0114755    -3.26   0.002     -.060486   -.0143875
                  KY  |  -.0580795   .0020046   -28.97   0.000    -.0621058   -.0540531
                  TN  |  -.0667688   .0115596    -5.78   0.000     -.089987   -.0435506
                  AL  |  -.0353771   .0116135    -3.05   0.004    -.0587035   -.0120507
                  MS  |  -.0946941   .0118308    -8.00   0.000     -.118457   -.0709312
                  AR  |  -.0808936    .011455    -7.06   0.000    -.1039017   -.0578856
                  LA  |   -.066371    .011525    -5.76   0.000    -.0895197   -.0432223
                  OK  |  -.0688815   .0063454   -10.86   0.000    -.0816267   -.0561364
                  TX  |  -.0726572   .0114292    -6.36   0.000    -.0956134   -.0497009
                  MT  |   .0076881   .0018127     4.24   0.000     .0040473     .011329
                  ID  |   -.074229    .001204   -61.65   0.000    -.0766473   -.0718108
                  WY  |  -.0899908   .0116766    -7.71   0.000     -.113444   -.0665375
                  CO  |  -.0471943   .0028389   -16.62   0.000    -.0528964   -.0414922
                  NM  |  -.0770794   .0029224   -26.38   0.000    -.0829493   -.0712095
                  AZ  |  -.0528368   .0114724    -4.61   0.000    -.0758799   -.0297938
                  UT  |   -.053865   .0110833    -4.86   0.000    -.0761265   -.0316035
                  NV  |   .0467437   .0115631     4.04   0.000     .0235186    .0699689
                  WA  |   .0612127   .0024525    24.96   0.000     .0562866    .0661387
                  OR  |   .0451624    .002405    18.78   0.000     .0403318    .0499929
                  CA  |   .0447725   .0028727    15.59   0.000     .0390025    .0505424
                  AK  |   .0663307   .0034571    19.19   0.000     .0593869    .0732746
                  HI  |   .0502528   .0021279    23.62   0.000     .0459788    .0545268
                      |
                 year |
                1990  |  -.0020777   .0017204    -1.21   0.233    -.0055333    .0013778
                1991  |  -.0025869   .0026024    -0.99   0.325    -.0078141    .0026402
                1992  |   .0012945   .0023687     0.55   0.587    -.0034632    .0060521
                1993  |   .0006976   .0026115     0.27   0.790    -.0045477     .005943
                1996  |  -.0019479   .0025688    -0.76   0.452    -.0071074    .0032117
                1997  |   -.006212   .0024226    -2.56   0.013     -.011078    -.001346
                1998  |  -.0095023   .0029799    -3.19   0.002    -.0154876    -.003517
                1999  |  -.0122012   .0027919    -4.37   0.000     -.017809   -.0065934
                2000  |  -.0100358    .002468    -4.07   0.000    -.0149929   -.0050788
                2001  |  -.0092787   .0024195    -3.83   0.000    -.0141384   -.0044189
                2002  |  -.0092795   .0036175    -2.57   0.013    -.0165453   -.0020136
                2003  |  -.0155533   .0030418    -5.11   0.000     -.021663   -.0094436
                2004  |  -.0189762   .0032951    -5.76   0.000    -.0255945   -.0123578
                2005  |  -.0207469   .0033957    -6.11   0.000    -.0275674   -.0139264
                2006  |  -.0230554   .0032215    -7.16   0.000    -.0295259   -.0165849
                2007  |   -.022561   .0044628    -5.06   0.000    -.0315249   -.0135972
                2008  |  -.0200401   .0045048    -4.45   0.000    -.0290882   -.0109919
                2009  |  -.0160921   .0057692    -2.79   0.007    -.0276798   -.0045044
                2010  |  -.0188526   .0057375    -3.29   0.002    -.0303767   -.0073285
                2011  |  -.0180892    .005504    -3.29   0.002    -.0291444    -.007034
                2012  |  -.0233761   .0051235    -4.56   0.000    -.0336669   -.0130853
                2013  |  -.0200459   .0050749    -3.95   0.000    -.0302391   -.0098527
                2014  |   -.024516   .0046263    -5.30   0.000    -.0338082   -.0152238
                2015  |  -.0240349   .0049262    -4.88   0.000    -.0339293   -.0141404
                2016  |  -.0216665   .0044547    -4.86   0.000     -.030614   -.0127191
                2017  |  -.0276985   .0048939    -5.66   0.000    -.0375282   -.0178688
                2018  |  -.0303941   .0037882    -8.02   0.000    -.0380029   -.0227852
                2019  |  -.0297438   .0053475    -5.56   0.000    -.0404845   -.0190031
                      |
                 nind |
                   2  |   .0348923   .0104659     3.33   0.002      .013871    .0559137
                   3  |   .0511131   .0109559     4.67   0.000     .0291076    .0731186
                   4  |   .0410798   .0098109     4.19   0.000     .0213739    .0607856
                   5  |   .1722478   .0099128    17.38   0.000     .1523373    .1921583
                   6  |   .0144294   .0091199     1.58   0.120    -.0038884    .0327472
                   7  |    .005526   .0089834     0.62   0.541    -.0125177    .0235696
                   8  |   .0223964   .0115703     1.94   0.059    -.0008433    .0456361
                   9  |   .1415129   .0170665     8.29   0.000     .1072338     .175792
                  10  |   .0083425   .0099661     0.84   0.407    -.0116749    .0283599
                  11  |   .0075254   .0157642     0.48   0.635     -.024138    .0391887
                      |
                 educ |   .0146559   .0020463     7.16   0.000     .0105459     .018766
                exper |   .0083821   .0013655     6.14   0.000     .0056393    .0111248
               exper2 |  -.0003097   .0000704    -4.40   0.000     -.000451   -.0001684
               exper3 |   7.07e-06   2.31e-06     3.06   0.004     2.44e-06    .0000117
               exper4 |  -6.58e-08   2.50e-08    -2.64   0.011    -1.16e-07   -1.57e-08
                 edex |  -.0001227   .0000474    -2.59   0.013    -.0002179   -.0000274
                      |
                ee_cl |
                   2  |  -.0354618   .0043265    -8.20   0.000    -.0441518   -.0267718
                   3  |  -.0631052   .0065588    -9.62   0.000     -.076279   -.0499313
                   4  |  -.0940407   .0130542    -7.20   0.000    -.1202609   -.0678205
                   5  |  -.0379386   .0059021    -6.43   0.000    -.0497932    -.026084
                   6  |  -.0427021   .0053202    -8.03   0.000     -.053388   -.0320162
                   7  |  -.0630926    .007483    -8.43   0.000    -.0781228   -.0480625
                   8  |  -.0864508   .0126968    -6.81   0.000    -.1119531   -.0609485
                   9  |  -.0266039    .005897    -4.51   0.000    -.0384484   -.0147595
                  10  |  -.0448989   .0065361    -6.87   0.000    -.0580269   -.0317708
                  11  |  -.0631229   .0083598    -7.55   0.000    -.0799141   -.0463318
                  12  |  -.0779592    .012185    -6.40   0.000    -.1024334   -.0534849
                  13  |  -.0032821   .0069092    -0.48   0.637    -.0171596    .0105954
                  14  |  -.0373918   .0072512    -5.16   0.000    -.0519563   -.0228272
                  15  |  -.0575829   .0093356    -6.17   0.000    -.0763341   -.0388318
                  16  |  -.0715199   .0128975    -5.55   0.000    -.0974253   -.0456145
                      |
                 marr |  -.0006041   .0010131    -0.60   0.554     -.002639    .0014308
                partt |   -.055899   .0049522   -11.29   0.000    -.0658458   -.0459523
               public |   .2847696   .0282514    10.08   0.000      .228025    .3415142
                 cmsa |   .0233282   .0028526     8.18   0.000     .0175987    .0290578
                      |
                nocc2 |
                   2  |   .0225622   .0020656    10.92   0.000     .0184133    .0267111
                   3  |   .0314157   .0066898     4.70   0.000     .0179789    .0448525
                   4  |    .152143   .0072865    20.88   0.000     .1375076    .1667783
                   5  |   .1365469   .0157978     8.64   0.000     .1048161    .1682777
                   6  |   .0640473   .0053767    11.91   0.000     .0532479    .0748467
                   7  |   .0837037    .008001    10.46   0.000     .0676333    .0997741
                   8  |   .0566663   .0032567    17.40   0.000      .050125    .0632076
                   9  |   .0971278   .0091497    10.62   0.000       .07875    .1155056
                  10  |   .1812995    .015108    12.00   0.000     .1509541    .2116449
                  11  |   .2109371   .0157944    13.36   0.000     .1792132    .2426611
                  12  |   .1705673   .0179775     9.49   0.000     .1344585    .2066762
                      |
                unemp |  -.0008411   .0009045    -0.93   0.357    -.0026578    .0009757
                      |
              quarter |
                   2  |  -.0010107   .0010138    -1.00   0.324     -.003047    .0010256
                   3  |   .0001292   .0008256     0.16   0.876     -.001529    .0017875
                   4  |  -.0032242   .0011072    -2.91   0.005    -.0054479   -.0010004
                      |
                _cons |  -.2136592   .0354087    -6.03   0.000    -.2847797   -.1425387
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 0, vce(cluster state) 
(sum of wgt is 9,221,094,079)

Linear regression                               Number of obs     =  1,069,714
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5103
                                                Root MSE          =     .41762

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1439074   .0064644   -22.26   0.000    -.1568916   -.1309232
             treat_st |  -.0392681   .0187574    -2.09   0.041    -.0769434   -.0015927
treat_stblackrelwhite |  -.0222117   .0088452    -2.51   0.015    -.0399777   -.0044456
                      |
                state |
                  NH  |   .0801031   .0048482    16.52   0.000     .0703652     .089841
                  VT  |   .0192434   .0019078    10.09   0.000     .0154115    .0230753
                  MA  |   .1166676   .0086894    13.43   0.000     .0992144    .1341208
                  RI  |   .0350931   .0087546     4.01   0.000      .017509    .0526772
                  CT  |   .1303763   .0086023    15.16   0.000      .113098    .1476546
                  NY  |   .1013149   .0080823    12.54   0.000     .0850811    .1175487
                  NJ  |   .1711065   .0091724    18.65   0.000     .1526832    .1895298
                  PA  |   .0112969    .006676     1.69   0.097    -.0021122     .024706
                  OH  |  -.0157519     .00646    -2.44   0.018    -.0287271   -.0027766
                  IN  |   .0060355   .0054266     1.11   0.271    -.0048641    .0169352
                  IL  |   .0844512   .0073184    11.54   0.000     .0697518    .0991506
                  MI  |    .053668   .0072321     7.42   0.000     .0391418    .0681942
                  WI  |   .0178891   .0050918     3.51   0.001      .007662    .0281163
                  MN  |   .0607482   .0070049     8.67   0.000     .0466786    .0748179
                  IA  |   .0151923   .0173418     0.88   0.385    -.0196398    .0500244
                  MO  |  -.0209824     .00627    -3.35   0.002     -.033576   -.0083888
                  ND  |   .0217975   .0181008     1.20   0.234    -.0145589     .058154
                  SD  |  -.0464474   .0173059    -2.68   0.010    -.0812074   -.0116874
                  NE  |  -.0334031   .0170522    -1.96   0.056    -.0676533    .0008472
                  KS  |  -.0054093   .0177948    -0.30   0.762    -.0411511    .0303325
                  DE  |   .0505161   .0023766    21.26   0.000     .0457425    .0552898
                  MD  |   .1212763   .0092455    13.12   0.000     .1027062    .1398463
                  DC  |   .1798824   .0114082    15.77   0.000     .1569683    .2027965
                  VA  |   .1159896    .018076     6.42   0.000     .0796828    .1522965
                  WV  |  -.0356269   .0045508    -7.83   0.000    -.0447675   -.0264862
                  NC  |   .0088701   .0187084     0.47   0.637    -.0287067    .0464469
                  SC  |  -.0091889   .0191742    -0.48   0.634    -.0477014    .0293237
                  GA  |   .0579506   .0192625     3.01   0.004     .0192608    .0966404
                  FL  |  -.0096773    .019844    -0.49   0.628    -.0495352    .0301807
                  KY  |  -.0390467   .0046796    -8.34   0.000     -.048446   -.0296475
                  TN  |  -.0278881   .0188002    -1.48   0.144    -.0656495    .0098733
                  AL  |  -.0028157   .0192142    -0.15   0.884    -.0414086    .0357773
                  MS  |  -.0252496   .0203881    -1.24   0.221    -.0662004    .0157012
                  AR  |  -.0713261   .0190858    -3.74   0.000    -.1096611   -.0329911
                  LA  |   .0253327   .0199205     1.27   0.209    -.0146787    .0653441
                  OK  |  -.0595461   .0105445    -5.65   0.000    -.0807254   -.0383668
                  TX  |   .0614329   .0194303     3.16   0.003     .0224059    .1004598
                  MT  |  -.0352456   .0014443   -24.40   0.000    -.0381465   -.0323447
                  ID  |  -.0402199   .0034896   -11.53   0.000    -.0472289   -.0332109
                  WY  |   .1591807   .0198291     8.03   0.000     .1193527    .1990086
                  CO  |   .0293314   .0086113     3.41   0.001      .012035    .0466278
                  NM  |  -.0330246    .005821    -5.67   0.000    -.0447164   -.0213328
                  AZ  |   .0334621    .019717     1.70   0.096    -.0061407    .0730648
                  UT  |  -.0013035   .0183124    -0.07   0.944     -.038085     .035478
                  NV  |   .1143252   .0202782     5.64   0.000     .0735953    .1550552
                  WA  |    .100658   .0076892    13.09   0.000     .0852138    .1161022
                  OR  |   .0297251   .0070684     4.21   0.000     .0155277    .0439224
                  CA  |   .1659659   .0092506    17.94   0.000     .1473854    .1845463
                  AK  |   .2492856   .0066032    37.75   0.000     .2360227    .2625486
                  HI  |   .1070505   .0067955    15.75   0.000     .0934013    .1206997
                      |
                 year |
                1990  |  -.0110928   .0027298    -4.06   0.000    -.0165759   -.0056097
                1991  |  -.0184006   .0046087    -3.99   0.000    -.0276575   -.0091437
                1992  |   -.015235   .0053207    -2.86   0.006    -.0259219   -.0045481
                1993  |  -.0265714   .0042099    -6.31   0.000    -.0350273   -.0181155
                1996  |  -.0373421   .0049187    -7.59   0.000    -.0472215   -.0274626
                1997  |    -.02426   .0046657    -5.20   0.000    -.0336313   -.0148886
                1998  |  -.0040305   .0040097    -1.01   0.320    -.0120843    .0040234
                1999  |   .0168678    .005252     3.21   0.002     .0063188    .0274168
                2000  |   .0235112   .0053814     4.37   0.000     .0127023    .0343201
                2001  |   .0426999   .0054341     7.86   0.000     .0317852    .0536145
                2002  |   .0556444    .005533    10.06   0.000      .044531    .0667578
                2003  |   .0472959   .0058818     8.04   0.000     .0354821    .0591098
                2004  |   .0367779   .0052678     6.98   0.000     .0261973    .0473585
                2005  |   .0206274   .0057532     3.59   0.001     .0090717     .032183
                2006  |   .0146546   .0059928     2.45   0.018     .0026176    .0266916
                2007  |    .015304   .0071984     2.13   0.038     .0008457    .0297624
                2008  |   .0168204   .0070612     2.38   0.021     .0026375    .0310033
                2009  |   .0495344   .0106596     4.65   0.000      .028124    .0709448
                2010  |   .0427952   .0091614     4.67   0.000      .024394    .0611963
                2011  |   .0160032   .0089835     1.78   0.081    -.0020406     .034047
                2012  |    .009176   .0100243     0.92   0.364    -.0109583    .0293104
                2013  |   .0034472   .0094244     0.37   0.716    -.0154823    .0223767
                2014  |  -.0053773   .0085661    -0.63   0.533    -.0225827    .0118281
                2015  |   .0103581   .0066777     1.55   0.127    -.0030544    .0237706
                2016  |    .022655   .0071391     3.17   0.003     .0083157    .0369942
                2017  |   .0259095   .0079885     3.24   0.002     .0098641    .0419548
                2018  |   .0326602   .0079383     4.11   0.000     .0167156    .0486048
                2019  |   .0513758   .0080769     6.36   0.000     .0351529    .0675988
                      |
                 nind |
                   2  |   .0846839   .0264099     3.21   0.002      .031638    .1377298
                   3  |   .1049133   .0220647     4.75   0.000     .0605951    .1492316
                   4  |  -.0791648   .0237708    -3.33   0.002    -.1269099   -.0314196
                   5  |   .1437776   .0231884     6.20   0.000     .0972024    .1903527
                   6  |   .0988624    .025836     3.83   0.000     .0469693    .1507555
                   7  |   .0022042   .0250416     0.09   0.930    -.0480934    .0525018
                   8  |  -.0561568   .0249608    -2.25   0.029     -.106292   -.0060216
                   9  |  -.0623918   .0275128    -2.27   0.028    -.1176529   -.0071308
                  10  |  -.0951721   .0260218    -3.66   0.001    -.1474384   -.0429058
                  11  |   .1180724   .0257685     4.58   0.000     .0663149    .1698299
                      |
                 educ |   .0679089   .0016902    40.18   0.000      .064514    .0713038
                exper |   .0458134   .0017766    25.79   0.000     .0422449    .0493819
               exper2 |  -.0009628   .0000956   -10.07   0.000    -.0011549   -.0007708
               exper3 |   5.18e-06   2.79e-06     1.86   0.069    -4.27e-07    .0000108
               exper4 |   2.95e-08   2.96e-08     1.00   0.324    -3.00e-08    8.90e-08
                 edex |  -.0004558   .0000618    -7.37   0.000      -.00058   -.0003316
                      |
                ee_cl |
                   2  |  -.0592306   .0045438   -13.04   0.000     -.068357   -.0501041
                   3  |  -.0680095   .0060604   -11.22   0.000    -.0801822   -.0558368
                   4  |  -.0266878   .0107283    -2.49   0.016    -.0482362   -.0051394
                   5  |  -.1341916   .0056835   -23.61   0.000    -.1456071    -.122776
                   6  |  -.0851677   .0054407   -15.65   0.000    -.0960956   -.0742397
                   7  |  -.0611861   .0067688    -9.04   0.000    -.0747816   -.0475906
                   8  |     .02785   .0115826     2.40   0.020     .0045857    .0511143
                   9  |  -.1528884   .0072799   -21.00   0.000    -.1675105   -.1382664
                  10  |   -.096699   .0077179   -12.53   0.000    -.1122009   -.0811972
                  11  |  -.0580712   .0081796    -7.10   0.000    -.0745003    -.041642
                  12  |   .0305175   .0116818     2.61   0.012      .007054    .0539811
                  13  |  -.0776357   .0124257    -6.25   0.000    -.1025935    -.052678
                  14  |  -.0756546    .009451    -8.00   0.000    -.0946375   -.0566716
                  15  |  -.0480091   .0094084    -5.10   0.000    -.0669065   -.0291118
                  16  |   .0293497   .0127106     2.31   0.025     .0038196    .0548797
                      |
                 marr |   .1234935   .0023323    52.95   0.000      .118809     .128178
                partt |  -.2093288   .0061458   -34.06   0.000     -.221673   -.1969846
               public |   .0158943   .0074068     2.15   0.037     .0010173    .0307712
                 cmsa |   .1453261   .0089311    16.27   0.000     .1273875    .1632647
                      |
                nocc2 |
                   2  |  -.1399688   .0035652   -39.26   0.000    -.1471297    -.132808
                   3  |  -.0389471   .0059551    -6.54   0.000    -.0509082   -.0269859
                   4  |  -.2919426   .0094018   -31.05   0.000    -.3108266   -.2730586
                   5  |  -.0780544   .0068769   -11.35   0.000    -.0918671   -.0642417
                   6  |  -.3673036   .0062225   -59.03   0.000     -.379802   -.3548053
                   7  |  -.2298279   .0052512   -43.77   0.000    -.2403753   -.2192806
                   8  |  -.1005421   .0107615    -9.34   0.000    -.1221572    -.078927
                   9  |  -.3880131   .0035636  -108.88   0.000    -.3951707   -.3808555
                  10  |  -.3269132   .0049762   -65.69   0.000    -.3369083   -.3169181
                  11  |  -.2229972   .0054992   -40.55   0.000    -.2340426   -.2119518
                  12  |  -.3765145   .0054827   -68.67   0.000    -.3875269   -.3655021
                      |
                unemp |  -.0058895   .0020034    -2.94   0.005    -.0099136   -.0018655
                      |
              quarter |
                   2  |   .0032966    .001888     1.75   0.087    -.0004956    .0070888
                   3  |   .0048734   .0018778     2.60   0.012     .0011017    .0086451
                   4  |   .0140552   .0014945     9.40   0.000     .0110534     .017057
                      |
                _cons |   .6550849    .033325    19.66   0.000     .5881497      .72202
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 1, vce(cluster state)
(sum of wgt is 9,024,398,313)

Linear regression                               Number of obs     =  1,080,778
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5037
                                                Root MSE          =     .39284

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0660719   .0065618   -10.07   0.000    -.0792517    -.052892
             treat_st |   -.031955   .0086559    -3.69   0.001    -.0493409    -.014569
treat_stblackrelwhite |   -.039853   .0080114    -4.97   0.000    -.0559443   -.0237616
                      |
                state |
                  NH  |   .0543443   .0037435    14.52   0.000     .0468252    .0618634
                  VT  |   .0336417   .0016273    20.67   0.000     .0303732    .0369101
                  MA  |   .0997363    .007973    12.51   0.000     .0837222    .1157505
                  RI  |   .0262765   .0079228     3.32   0.002     .0103631    .0421899
                  CT  |   .1111403     .00792    14.03   0.000     .0952325    .1270481
                  NY  |   .0660578   .0073982     8.93   0.000     .0511981    .0809176
                  NJ  |   .1289581    .008482    15.20   0.000     .1119215    .1459947
                  PA  |  -.0300623   .0063226    -4.75   0.000    -.0427616   -.0173629
                  OH  |  -.0612926   .0060807   -10.08   0.000     -.073506   -.0490793
                  IN  |   -.064901   .0045392   -14.30   0.000    -.0740183   -.0557837
                  IL  |   .0038883   .0069271     0.56   0.577    -.0100253    .0178018
                  MI  |  -.0131941   .0064295    -2.05   0.045    -.0261082   -.0002801
                  WI  |  -.0131612   .0044926    -2.93   0.005    -.0221848   -.0041377
                  MN  |    .045467   .0059306     7.67   0.000     .0335549     .057379
                  IA  |  -.0306663   .0080318    -3.82   0.000    -.0467987   -.0145339
                  MO  |   -.082247   .0058627   -14.03   0.000    -.0940226   -.0704713
                  ND  |  -.0582239   .0085959    -6.77   0.000    -.0754892   -.0409586
                  SD  |   -.079051   .0083051    -9.52   0.000    -.0957322   -.0623697
                  NE  |  -.0694641   .0082132    -8.46   0.000    -.0859608   -.0529674
                  KS  |  -.0649969   .0083746    -7.76   0.000    -.0818177   -.0481761
                  DE  |   .0483384   .0026052    18.55   0.000     .0431056    .0535712
                  MD  |   .0945141   .0089964    10.51   0.000     .0764443    .1125839
                  DC  |   .1521084   .0115449    13.18   0.000     .1289198     .175297
                  VA  |   .0533065   .0093682     5.69   0.000       .03449     .072123
                  WV  |  -.1437765   .0027452   -52.37   0.000    -.1492903   -.1382627
                  NC  |  -.0323164    .008798    -3.67   0.001    -.0499877   -.0146451
                  SC  |  -.0727076   .0090515    -8.03   0.000    -.0908882    -.054527
                  GA  |  -.0036405   .0095299    -0.38   0.704    -.0227818    .0155009
                  FL  |  -.0327876   .0102818    -3.19   0.002    -.0534391   -.0121361
                  KY  |  -.0891503   .0040024   -22.27   0.000    -.0971894   -.0811113
                  TN  |  -.0751196   .0090374    -8.31   0.000    -.0932717   -.0569676
                  AL  |  -.0879092   .0090346    -9.73   0.000    -.1060556   -.0697627
                  MS  |  -.1109493   .0092484   -12.00   0.000    -.1295252   -.0923734
                  AR  |  -.1139346   .0085533   -13.32   0.000    -.1311144   -.0967547
                  LA  |  -.0937816   .0099688    -9.41   0.000    -.1138045   -.0737587
                  OK  |  -.1362788   .0063047   -21.62   0.000    -.1489423   -.1236154
                  TX  |  -.0044617   .0098907    -0.45   0.654    -.0243277    .0154042
                  MT  |   -.078448   .0008913   -88.01   0.000    -.0802383   -.0766576
                  ID  |  -.0756155   .0029851   -25.33   0.000    -.0816113   -.0696196
                  WY  |   .0007278   .0085865     0.08   0.933    -.0165187    .0179744
                  CO  |  -.0072187   .0079043    -0.91   0.365    -.0230949    .0086575
                  NM  |   -.095945   .0049704   -19.30   0.000    -.1059284   -.0859616
                  AZ  |   .0054433   .0101668     0.54   0.595    -.0149774     .025864
                  UT  |  -.0515348   .0094549    -5.45   0.000    -.0705257    -.032544
                  NV  |   .0689827   .0105405     6.54   0.000     .0478114    .0901539
                  WA  |   .0594355   .0070942     8.38   0.000     .0451864    .0736847
                  OR  |  -.0031022   .0065677    -0.47   0.639    -.0162938    .0100894
                  CA  |   .1280656   .0085807    14.92   0.000     .1108308    .1453003
                  AK  |   .1855062   .0050541    36.70   0.000     .1753547    .1956576
                  HI  |   .0692756   .0059875    11.57   0.000     .0572493    .0813019
                      |
                 year |
                1990  |  -.0056132   .0027749    -2.02   0.048    -.0111867   -.0000396
                1991  |   .0000364   .0031733     0.01   0.991    -.0063374    .0064103
                1992  |   .0200628   .0041148     4.88   0.000     .0117981    .0283275
                1993  |   .0162429    .003925     4.14   0.000     .0083593    .0241265
                1996  |   .0028924   .0041187     0.70   0.486    -.0053802    .0111649
                1997  |   .0144595   .0036515     3.96   0.000     .0071252    .0217937
                1998  |   .0421702   .0037983    11.10   0.000     .0345412    .0497993
                1999  |   .0584018   .0037565    15.55   0.000     .0508566    .0659469
                2000  |   .0708343   .0042096    16.83   0.000     .0623791    .0792894
                2001  |   .0838332   .0044585    18.80   0.000      .074878    .0927883
                2002  |   .0988457   .0047384    20.86   0.000     .0893283    .1083631
                2003  |   .1053112   .0046482    22.66   0.000     .0959749    .1146474
                2004  |   .0956263   .0047052    20.32   0.000     .0861755     .105077
                2005  |   .0851159   .0049992    17.03   0.000     .0750747    .0951572
                2006  |   .0797108   .0044351    17.97   0.000     .0708027    .0886188
                2007  |     .07955   .0053307    14.92   0.000      .068843     .090257
                2008  |   .0743991   .0062327    11.94   0.000     .0618804    .0869178
                2009  |   .0994671   .0072235    13.77   0.000     .0849582    .1139759
                2010  |   .0975187   .0066177    14.74   0.000     .0842266    .1108107
                2011  |   .0774762   .0055539    13.95   0.000     .0663209    .0886315
                2012  |    .058491    .005968     9.80   0.000      .046504     .070478
                2013  |   .0598087   .0063576     9.41   0.000     .0470392    .0725783
                2014  |   .0526102   .0057622     9.13   0.000     .0410365     .064184
                2015  |   .0663456   .0052182    12.71   0.000     .0558646    .0768266
                2016  |   .0776959   .0062652    12.40   0.000     .0651118    .0902799
                2017  |   .0850357   .0072966    11.65   0.000       .07038    .0996914
                2018  |   .0884989    .007238    12.23   0.000      .073961    .1030368
                2019  |   .0990084   .0067788    14.61   0.000     .0853928    .1126239
                      |
                 nind |
                   2  |   .0610507   .0407962     1.50   0.141    -.0208909    .1429922
                   3  |    .134568    .038221     3.52   0.001     .0577988    .2113371
                   4  |  -.0823094   .0387163    -2.13   0.038    -.1600733   -.0045455
                   5  |   .1580633   .0373934     4.23   0.000     .0829565      .23317
                   6  |   .0905195   .0390354     2.32   0.025     .0121145    .1689244
                   7  |   .0359353   .0404072     0.89   0.378     -.045225    .1170955
                   8  |  -.0174438   .0414453    -0.42   0.676     -.100689    .0658015
                   9  |   -.069018   .0446333    -1.55   0.128    -.1586667    .0206307
                  10  |  -.0795935    .039559    -2.01   0.050    -.1590502   -.0001369
                  11  |    .072813   .0412515     1.77   0.084    -.0100429     .155669
                      |
                 educ |   .0913878   .0023424    39.01   0.000      .086683    .0960927
                exper |   .0478558   .0021339    22.43   0.000     .0435698    .0521419
               exper2 |  -.0015734   .0000971   -16.21   0.000    -.0017683   -.0013784
               exper3 |   .0000245   2.73e-06     8.98   0.000      .000019      .00003
               exper4 |  -1.29e-07   2.77e-08    -4.66   0.000    -1.85e-07   -7.33e-08
                 edex |  -.0005239   .0000899    -5.82   0.000    -.0007045   -.0003432
                      |
                ee_cl |
                   2  |  -.1256819   .0051027   -24.63   0.000     -.135931   -.1154328
                   3  |   -.163817   .0077862   -21.04   0.000    -.1794561   -.1481779
                   4  |  -.1679818    .012515   -13.42   0.000     -.193119   -.1428446
                   5  |  -.1528247   .0081769   -18.69   0.000    -.1692485   -.1364009
                   6  |  -.1681661   .0087647   -19.19   0.000    -.1857705   -.1505617
                   7  |  -.1761349   .0101625   -17.33   0.000    -.1965469   -.1557228
                   8  |  -.1107173   .0131319    -8.43   0.000    -.1370934   -.0843412
                   9  |  -.1542824   .0100104   -15.41   0.000    -.1743888    -.134176
                  10  |  -.1757851   .0108909   -16.14   0.000    -.1976602     -.15391
                  11  |  -.1698472   .0112353   -15.12   0.000    -.1924139   -.1472805
                  12  |  -.1172923   .0118862    -9.87   0.000    -.1411665   -.0934181
                  13  |  -.1079473   .0146658    -7.36   0.000    -.1374043   -.0784902
                  14  |  -.1557606   .0115505   -13.49   0.000    -.1789605   -.1325606
                  15  |  -.1377676   .0118837   -11.59   0.000    -.1616368   -.1138985
                  16  |  -.1033863   .0123307    -8.38   0.000    -.1281533   -.0786193
                      |
                 marr |   .0337907   .0021997    15.36   0.000     .0293725    .0382089
                partt |   -.140478   .0033204   -42.31   0.000    -.1471473   -.1338088
               public |   .0603009   .0060001    10.05   0.000     .0482493    .0723526
                 cmsa |   .1527769   .0080262    19.03   0.000     .1366558    .1688981
                      |
                nocc2 |
                   2  |  -.1309596   .0030307   -43.21   0.000    -.1370469   -.1248723
                   3  |   -.038977   .0068564    -5.68   0.000    -.0527484   -.0252056
                   4  |   -.280067   .0066151   -42.34   0.000    -.2933539   -.2667802
                   5  |   .0508437   .0062129     8.18   0.000     .0383648    .0633226
                   6  |  -.3243066   .0043373   -74.77   0.000    -.3330184   -.3155949
                   7  |  -.3502164   .0042524   -82.36   0.000    -.3587576   -.3416752
                   8  |  -.1645009   .0077587   -21.20   0.000    -.1800848   -.1489171
                   9  |  -.4036711   .0051317   -78.66   0.000    -.4139785   -.3933637
                  10  |  -.4087434   .0090714   -45.06   0.000     -.426964   -.3905229
                  11  |  -.1647061   .0087143   -18.90   0.000    -.1822093   -.1472029
                  12  |  -.3812175   .0077199   -49.38   0.000    -.3967233   -.3657117
                      |
                unemp |   -.002187   .0013398    -1.63   0.109    -.0048781     .000504
                      |
              quarter |
                   2  |   .0086729   .0013333     6.50   0.000      .005995    .0113509
                   3  |   .0176772   .0016466    10.74   0.000     .0143699    .0209846
                   4  |   .0205389   .0011297    18.18   0.000     .0182697     .022808
                      |
                _cons |   .3415054   .0455981     7.49   0.000     .2499189     .433092
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 7,596,225,671)

Linear regression                               Number of obs     =    878,887
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5398
                                                Root MSE          =     .42013

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1590742   .0049947   -31.85   0.000    -.1691064   -.1490421
             treat_st |    -.02863    .014129    -2.03   0.048    -.0570089   -.0002511
treat_stblackrelwhite |  -.0032944   .0081203    -0.41   0.687    -.0196045    .0130157
                      |
                state |
                  NH  |   .0872614   .0044695    19.52   0.000     .0782841    .0962387
                  VT  |   .0321265   .0018607    17.27   0.000     .0283892    .0358637
                  MA  |   .1158715   .0085436    13.56   0.000     .0987111    .1330319
                  RI  |   .0306971   .0083291     3.69   0.001     .0139676    .0474266
                  CT  |   .1236874   .0084699    14.60   0.000      .106675    .1406998
                  NY  |   .0742292   .0080666     9.20   0.000      .058027    .0904313
                  NJ  |   .1542492   .0091116    16.93   0.000      .135948    .1725505
                  PA  |   .0032409   .0065229     0.50   0.621    -.0098607    .0163425
                  OH  |  -.0285596   .0063651    -4.49   0.000    -.0413442    -.015775
                  IN  |    -.00383    .005012    -0.76   0.448    -.0138968    .0062369
                  IL  |   .0638825    .007497     8.52   0.000     .0488242    .0789407
                  MI  |   .0257645   .0071883     3.58   0.001     .0113263    .0402026
                  WI  |   .0110605   .0047498     2.33   0.024     .0015204    .0206007
                  MN  |    .050289    .006681     7.53   0.000     .0368699    .0637081
                  IA  |   .0035819   .0127698     0.28   0.780    -.0220669    .0292308
                  MO  |  -.0353112   .0059599    -5.92   0.000     -.047282   -.0233404
                  ND  |   .0232177   .0133632     1.74   0.088     -.003623    .0500585
                  SD  |  -.0449295   .0126263    -3.56   0.001      -.07029   -.0195689
                  NE  |  -.0369075   .0124817    -2.96   0.005    -.0619778   -.0118372
                  KS  |   -.015751   .0131928    -1.19   0.238    -.0422494    .0107475
                  DE  |   .0567432   .0018617    30.48   0.000      .053004    .0604825
                  MD  |   .1286227   .0090006    14.29   0.000     .1105445    .1467009
                  DC  |   .1972971   .0120535    16.37   0.000      .173087    .2215073
                  VA  |    .118397   .0135375     8.75   0.000      .091206    .1455879
                  WV  |  -.0502001   .0037722   -13.31   0.000    -.0577768   -.0426233
                  NC  |   .0182726   .0141114     1.29   0.201    -.0100709    .0466161
                  SC  |   .0053427   .0145215     0.37   0.714    -.0238246    .0345101
                  GA  |    .059523   .0146564     4.06   0.000     .0300847    .0889613
                  FL  |   -.009183   .0151034    -0.61   0.546     -.039519     .021153
                  KY  |  -.0368574   .0043083    -8.56   0.000    -.0455108    -.028204
                  TN  |  -.0285812   .0142588    -2.00   0.050     -.057221    .0000585
                  AL  |   -.004443   .0145683    -0.30   0.762    -.0337043    .0248184
                  MS  |  -.0144732   .0156347    -0.93   0.359    -.0458764    .0169299
                  AR  |  -.0659657   .0142678    -4.62   0.000    -.0946235   -.0373079
                  LA  |   .0284375   .0151419     1.88   0.066    -.0019759    .0588508
                  OK  |  -.0509635   .0082696    -6.16   0.000    -.0675735   -.0343535
                  TX  |    .062946   .0147644     4.26   0.000     .0332908    .0926011
                  MT  |  -.0389692   .0013465   -28.94   0.000    -.0416737   -.0362647
                  ID  |  -.0306125    .003313    -9.24   0.000    -.0372668   -.0239581
                  WY  |   .1576337   .0148036    10.65   0.000     .1278999    .1873676
                  CO  |   .0408643   .0081585     5.01   0.000     .0244773    .0572512
                  NM  |   -.016959   .0054644    -3.10   0.003    -.0279345   -.0059836
                  AZ  |   .0324626   .0150293     2.16   0.036     .0022754    .0626497
                  UT  |  -.0005369   .0136016    -0.04   0.969    -.0278566    .0267828
                  NV  |    .090443   .0154216     5.86   0.000     .0594678    .1214183
                  WA  |   .0914311   .0076111    12.01   0.000     .0761437    .1067185
                  OR  |   .0239517   .0069013     3.47   0.001       .01009    .0378135
                  CA  |   .1553104   .0091835    16.91   0.000     .1368647     .173756
                  AK  |   .2432573   .0059472    40.90   0.000      .231312    .2552027
                  HI  |   .1077698   .0065199    16.53   0.000     .0946741    .1208655
                      |
                 year |
                1990  |  -.0079236   .0030675    -2.58   0.013    -.0140849   -.0017622
                1991  |  -.0138933   .0057394    -2.42   0.019    -.0254212   -.0023654
                1992  |  -.0101821   .0052854    -1.93   0.060    -.0207981     .000434
                1993  |  -.0225169    .004326    -5.21   0.000    -.0312058   -.0138279
                1996  |  -.0357176    .005707    -6.26   0.000    -.0471805   -.0242546
                1997  |  -.0213514   .0050044    -4.27   0.000    -.0314031   -.0112998
                1998  |   .0024479   .0045928     0.53   0.596    -.0067771    .0116728
                1999  |   .0263776   .0060035     4.39   0.000     .0143192     .038436
                2000  |   .0356336   .0059669     5.97   0.000     .0236487    .0476185
                2001  |   .0577409     .00594     9.72   0.000     .0458101    .0696717
                2002  |   .0717904   .0048295    14.87   0.000     .0620902    .0814906
                2003  |   .0613839   .0066675     9.21   0.000     .0479918    .0747761
                2004  |   .0514963   .0057957     8.89   0.000     .0398553    .0631374
                2005  |   .0353811   .0064268     5.51   0.000     .0224725    .0482898
                2006  |   .0294523   .0055838     5.27   0.000      .018237    .0406676
                2007  |   .0291118   .0067849     4.29   0.000      .015484    .0427397
                2008  |   .0319664   .0065384     4.89   0.000     .0188335    .0450992
                2009  |   .0675319   .0112325     6.01   0.000     .0449706    .0900931
                2010  |   .0580894   .0097477     5.96   0.000     .0385105    .0776683
                2011  |    .031031   .0094242     3.29   0.002      .012102      .04996
                2012  |   .0259079   .0100705     2.57   0.013     .0056808    .0461351
                2013  |   .0189121   .0092251     2.05   0.046     .0003829    .0374414
                2014  |     .00773   .0086079     0.90   0.373    -.0095595    .0250194
                2015  |   .0266865    .006544     4.08   0.000     .0135424    .0398306
                2016  |    .040558   .0070127     5.78   0.000     .0264727    .0546434
                2017  |   .0404447   .0081677     4.95   0.000     .0240394      .05685
                2018  |   .0485135   .0083363     5.82   0.000     .0317696    .0652575
                2019  |   .0688281   .0086837     7.93   0.000     .0513863    .0862698
                      |
                 nind |
                   2  |   .0471915   .0232795     2.03   0.048     .0004333    .0939498
                   3  |   .1004936    .021919     4.58   0.000     .0564681    .1445192
                   4  |  -.0676441   .0239429    -2.83   0.007    -.1157348   -.0195534
                   5  |   .0987306   .0234066     4.22   0.000      .051717    .1457441
                   6  |   .1016589   .0263316     3.86   0.000     .0487702    .1545475
                   7  |   .0063464   .0252609     0.25   0.803    -.0443915    .0570844
                   8  |  -.0451127   .0256239    -1.76   0.084    -.0965798    .0063543
                   9  |  -.0779358    .025654    -3.04   0.004    -.1294633   -.0264082
                  10  |  -.0894101    .025462    -3.51   0.001     -.140552   -.0382681
                  11  |    .087492   .0260995     3.35   0.002     .0350696    .1399145
                      |
                 educ |   .0648272   .0017764    36.49   0.000     .0612591    .0683953
                exper |   .0404874   .0017774    22.78   0.000     .0369174    .0440573
               exper2 |  -.0007203   .0000885    -8.14   0.000    -.0008979   -.0005426
               exper3 |  -2.54e-06   2.91e-06    -0.87   0.388    -8.38e-06    3.31e-06
               exper4 |   1.16e-07   3.32e-08     3.50   0.001     4.94e-08    1.83e-07
                 edex |  -.0003389   .0000769    -4.41   0.000    -.0004934   -.0001844
                      |
                ee_cl |
                   2  |  -.0634576   .0044744   -14.18   0.000    -.0724448   -.0544705
                   3  |  -.0757983   .0055291   -13.71   0.000    -.0869038   -.0646928
                   4  |  -.0266352   .0093219    -2.86   0.006    -.0453589   -.0079116
                   5  |  -.1251079   .0052716   -23.73   0.000    -.1356962   -.1145197
                   6  |  -.0980769   .0056267   -17.43   0.000    -.1093785   -.0867753
                   7  |  -.0788947   .0069469   -11.36   0.000    -.0928479   -.0649415
                   8  |   .0384444   .0100307     3.83   0.000     .0182972    .0585915
                   9  |  -.1497588    .006973   -21.48   0.000    -.1637644   -.1357532
                  10  |  -.1145855   .0078131   -14.67   0.000    -.1302785   -.0988924
                  11  |  -.0693193   .0080548    -8.61   0.000    -.0854979   -.0531407
                  12  |   .0409584   .0107608     3.81   0.000     .0193447    .0625721
                  13  |  -.0901396   .0129783    -6.95   0.000    -.1162072    -.064072
                  14  |  -.0875011   .0100769    -8.68   0.000    -.1077412   -.0672609
                  15  |  -.0509047   .0096362    -5.28   0.000    -.0702597   -.0315497
                  16  |   .0393768   .0119693     3.29   0.002     .0153357    .0634179
                      |
                 marr |   .1293591   .0025538    50.65   0.000     .1242296    .1344886
                partt |  -.2075154   .0047082   -44.08   0.000    -.2169722   -.1980587
               public |  -.0104838   .0060507    -1.73   0.089     -.022637    .0016695
                 cmsa |   .1386537   .0081616    16.99   0.000     .1222605    .1550468
                      |
                nocc2 |
                   2  |  -.1492256    .003819   -39.07   0.000    -.1568962    -.141555
                   3  |  -.0391201   .0063137    -6.20   0.000    -.0518014   -.0264387
                   4  |  -.3319357   .0073744   -45.01   0.000    -.3467476   -.3171238
                   5  |  -.0968594    .008357   -11.59   0.000    -.1136448   -.0800739
                   6  |  -.3919829   .0066197   -59.21   0.000    -.4052791   -.3786868
                   7  |  -.2479438   .0065347   -37.94   0.000    -.2610692   -.2348183
                   8  |  -.1115621   .0102423   -10.89   0.000    -.1321344   -.0909897
                   9  |  -.4345653   .0057646   -75.38   0.000    -.4461439   -.4229867
                  10  |  -.3739278   .0060607   -61.70   0.000    -.3861011   -.3617546
                  11  |  -.2747883   .0063367   -43.36   0.000    -.2875159   -.2620608
                  12  |  -.4361518   .0086946   -50.16   0.000    -.4536153   -.4186882
                      |
                unemp |  -.0063787   .0018941    -3.37   0.001    -.0101831   -.0025744
                      |
              quarter |
                   2  |   .0039968   .0018103     2.21   0.032     .0003607    .0076329
                   3  |   .0047999   .0018376     2.61   0.012      .001109    .0084908
                   4  |   .0154496   .0017223     8.97   0.000     .0119903    .0189089
                      |
                _cons |   .7313393   .0292678    24.99   0.000     .6725532    .7901255
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,732,289,686)

Linear regression                               Number of obs     =    924,344
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5063
                                                Root MSE          =     .39322

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0837595   .0069768   -12.01   0.000    -.0977728   -.0697462
             treat_st |  -.0256952   .0071917    -3.57   0.001    -.0401402   -.0112502
treat_stblackrelwhite |   -.028488   .0082706    -3.44   0.001    -.0450999   -.0118761
                      |
                state |
                  NH  |   .0564971   .0037264    15.16   0.000     .0490125    .0639817
                  VT  |   .0419202   .0018963    22.11   0.000     .0381114     .045729
                  MA  |   .0939845   .0080514    11.67   0.000     .0778129    .1101562
                  RI  |    .001082   .0080486     0.13   0.894     -.015084    .0172481
                  CT  |   .0989414   .0079499    12.45   0.000     .0829737    .1149092
                  NY  |   .0425512   .0075508     5.64   0.000     .0273849    .0577175
                  NJ  |   .1091805   .0086319    12.65   0.000     .0918428    .1265182
                  PA  |  -.0428039   .0063755    -6.71   0.000    -.0556094   -.0299984
                  OH  |  -.0733296   .0060842   -12.05   0.000    -.0855501    -.061109
                  IN  |  -.0694432   .0045138   -15.38   0.000    -.0785095   -.0603769
                  IL  |  -.0011291   .0070478    -0.16   0.873    -.0152851    .0130269
                  MI  |   -.040369   .0066385    -6.08   0.000    -.0537027   -.0270352
                  WI  |  -.0217516   .0044656    -4.87   0.000    -.0307209   -.0127822
                  MN  |   .0351584   .0060687     5.79   0.000     .0229692    .0473477
                  IA  |  -.0409668   .0069391    -5.90   0.000    -.0549044   -.0270292
                  MO  |  -.0815833   .0057354   -14.22   0.000    -.0931033   -.0700633
                  ND  |  -.0618153   .0076514    -8.08   0.000    -.0771836   -.0464469
                  SD  |  -.0786583   .0074253   -10.59   0.000    -.0935725   -.0637441
                  NE  |  -.0726241   .0074676    -9.73   0.000    -.0876231    -.057625
                  KS  |  -.0672071   .0073749    -9.11   0.000    -.0820199   -.0523943
                  DE  |   .0363792   .0025372    14.34   0.000     .0312831    .0414752
                  MD  |    .092455   .0088872    10.40   0.000     .0746046    .1103055
                  DC  |   .1614839   .0117392    13.76   0.000      .137905    .1850627
                  VA  |   .0528268   .0086922     6.08   0.000      .035368    .0702856
                  WV  |   -.153523   .0028707   -53.48   0.000     -.159289   -.1477569
                  NC  |  -.0270966   .0077907    -3.48   0.001    -.0427447   -.0114485
                  SC  |  -.0640822   .0079616    -8.05   0.000    -.0800736   -.0480909
                  GA  |   .0002273   .0085577     0.03   0.979    -.0169614     .017416
                  FL  |  -.0391897   .0093282    -4.20   0.000     -.057926   -.0204534
                  KY  |  -.0878096   .0040009   -21.95   0.000    -.0958457   -.0797735
                  TN  |  -.0782169   .0080444    -9.72   0.000    -.0943746   -.0620591
                  AL  |  -.0894664   .0079434   -11.26   0.000    -.1054212   -.0735115
                  MS  |  -.1034914   .0080211   -12.90   0.000    -.1196024   -.0873805
                  AR  |  -.1106039   .0073223   -15.10   0.000    -.1253112   -.0958965
                  LA  |  -.0952509   .0088829   -10.72   0.000    -.1130927   -.0774091
                  OK  |  -.1328515   .0060789   -21.85   0.000    -.1450613   -.1206417
                  TX  |  -.0026262   .0089685    -0.29   0.771      -.02064    .0153876
                  MT  |  -.0755981   .0011141   -67.86   0.000    -.0778358   -.0733604
                  ID  |    -.06995   .0029763   -23.50   0.000    -.0759282   -.0639719
                  WY  |   .0028948   .0074726     0.39   0.700    -.0121143     .017904
                  CO  |  -.0018456   .0078563    -0.23   0.815    -.0176255    .0139343
                  NM  |  -.0873774    .004881   -17.90   0.000    -.0971811   -.0775736
                  AZ  |   .0038566   .0092236     0.42   0.678    -.0146695    .0223828
                  UT  |  -.0531547   .0085032    -6.25   0.000    -.0702339   -.0360755
                  NV  |     .05102   .0095128     5.36   0.000     .0319129    .0701272
                  WA  |   .0527251   .0073916     7.13   0.000     .0378787    .0675716
                  OR  |   -.008121   .0068641    -1.18   0.242     -.021908    .0056659
                  CA  |   .1131382   .0089021    12.71   0.000     .0952577    .1310186
                  AK  |   .1732626   .0053673    32.28   0.000     .1624821    .1840431
                  HI  |   .0682721   .0063196    10.80   0.000     .0555787    .0809654
                      |
                 year |
                1990  |  -.0061957   .0025412    -2.44   0.018    -.0112999   -.0010915
                1991  |   .0017906   .0035174     0.51   0.613    -.0052743    .0088555
                1992  |   .0226727   .0047511     4.77   0.000     .0131298    .0322155
                1993  |   .0167257   .0042733     3.91   0.000     .0081425    .0253088
                1996  |  -.0002806   .0040148    -0.07   0.945    -.0083446    .0077833
                1997  |   .0137274   .0039992     3.43   0.001     .0056948    .0217601
                1998  |   .0440768   .0042521    10.37   0.000     .0355362    .0526174
                1999  |   .0634358   .0045179    14.04   0.000     .0543613    .0725104
                2000  |   .0779016    .004813    16.19   0.000     .0682345    .0875687
                2001  |   .0907924   .0055426    16.38   0.000     .0796597    .1019251
                2002  |   .1068266   .0051768    20.64   0.000     .0964287    .1172245
                2003  |   .1168561   .0055588    21.02   0.000      .105691    .1280211
                2004  |   .1068803   .0056336    18.97   0.000     .0955648    .1181957
                2005  |   .0956557   .0059895    15.97   0.000     .0836256    .1076859
                2006  |   .0900991   .0050746    17.75   0.000     .0799064    .1002918
                2007  |   .0914954     .00555    16.49   0.000     .0803479    .1026428
                2008  |    .085791   .0066981    12.81   0.000     .0723375    .0992445
                2009  |   .1103476   .0083077    13.28   0.000     .0936611    .1270341
                2010  |    .107723   .0073795    14.60   0.000     .0929008    .1225452
                2011  |   .0880656   .0064188    13.72   0.000     .0751731     .100958
                2012  |   .0713646   .0062385    11.44   0.000     .0588343    .0838949
                2013  |   .0706622   .0066378    10.65   0.000     .0573298    .0839946
                2014  |   .0655553   .0065212    10.05   0.000     .0524571    .0786536
                2015  |    .078242   .0055792    14.02   0.000     .0670358    .0894483
                2016  |   .0903538   .0070482    12.82   0.000     .0761971    .1045105
                2017  |   .1015271   .0077919    13.03   0.000     .0858765    .1171777
                2018  |   .1057652   .0083864    12.61   0.000     .0889208    .1226097
                2019  |   .1168205   .0081124    14.40   0.000     .1005262    .1331148
                      |
                 nind |
                   2  |   .0516197   .0397209     1.30   0.200     -.028162    .1314014
                   3  |   .1267784    .037712     3.36   0.001     .0510316    .2025252
                   4  |  -.0831365   .0378717    -2.20   0.033    -.1592041    -.007069
                   5  |   .1114209   .0373002     2.99   0.004     .0365012    .1863406
                   6  |   .0889615   .0387306     2.30   0.026     .0111689    .1667542
                   7  |   .0376377   .0401721     0.94   0.353    -.0430503    .1183257
                   8  |  -.0137294   .0408994    -0.34   0.739    -.0958783    .0684195
                   9  |  -.0858015   .0425647    -2.02   0.049    -.1712952   -.0003077
                  10  |  -.0770626   .0387565    -1.99   0.052    -.1549074    .0007822
                  11  |    .089062   .0428037     2.08   0.043     .0030882    .1750357
                      |
                 educ |   .0868607   .0019071    45.55   0.000     .0830302    .0906913
                exper |   .0471709   .0022066    21.38   0.000     .0427389    .0516029
               exper2 |  -.0015156    .000096   -15.78   0.000    -.0017085   -.0013227
               exper3 |   .0000232   2.88e-06     8.07   0.000     .0000174     .000029
               exper4 |  -1.16e-07   3.01e-08    -3.86   0.000    -1.77e-07   -5.59e-08
                 edex |  -.0005876   .0000985    -5.97   0.000    -.0007854   -.0003898
                      |
                ee_cl |
                   2  |  -.1201089   .0044915   -26.74   0.000    -.1291304   -.1110875
                   3  |  -.1515259    .006245   -24.26   0.000    -.1640694   -.1389824
                   4  |  -.1439053   .0103383   -13.92   0.000    -.1646703   -.1231403
                   5  |  -.1499575   .0082462   -18.19   0.000    -.1665204   -.1333946
                   6  |  -.1626831   .0078212   -20.80   0.000    -.1783924   -.1469738
                   7  |  -.1622382   .0084128   -19.28   0.000    -.1791358   -.1453406
                   8  |   -.074473   .0102257    -7.28   0.000     -.095012   -.0539341
                   9  |  -.1598781   .0106398   -15.03   0.000    -.1812488   -.1385074
                  10  |  -.1702637   .0100672   -16.91   0.000    -.1904843    -.150043
                  11  |  -.1530058   .0091713   -16.68   0.000    -.1714269   -.1345846
                  12  |   -.089911   .0092449    -9.73   0.000      -.10848   -.0713421
                  13  |  -.1252878   .0157595    -7.95   0.000    -.1569417   -.0936339
                  14  |  -.1514484   .0111438   -13.59   0.000    -.1738314   -.1290654
                  15  |  -.1220164   .0101581   -12.01   0.000    -.1424196   -.1016133
                  16  |  -.0820288   .0109669    -7.48   0.000    -.1040564   -.0600012
                      |
                 marr |   .0386877    .002399    16.13   0.000     .0338692    .0435061
                partt |   -.138376   .0028871   -47.93   0.000    -.1441749    -.132577
               public |   .0149807   .0056959     2.63   0.011     .0035402    .0264213
                 cmsa |   .1527607   .0078599    19.44   0.000     .1369736    .1685478
                      |
                nocc2 |
                   2  |  -.1382683   .0031969   -43.25   0.000    -.1446894   -.1318472
                   3  |  -.0375044   .0070549    -5.32   0.000    -.0516745   -.0233343
                   4  |  -.3261186   .0044986   -72.49   0.000    -.3351542   -.3170829
                   5  |   .0305865   .0062793     4.87   0.000     .0179743    .0431988
                   6  |  -.3378327   .0046969   -71.93   0.000    -.3472667   -.3283987
                   7  |  -.3674186   .0046023   -79.83   0.000    -.3766626   -.3581746
                   8  |  -.1761865   .0076532   -23.02   0.000    -.1915585   -.1608146
                   9  |  -.4259335   .0057356   -74.26   0.000    -.4374537   -.4144133
                  10  |   -.450244   .0086282   -52.18   0.000    -.4675743   -.4329137
                  11  |  -.2352704   .0073063   -32.20   0.000    -.2499455   -.2205954
                  12  |  -.4248981   .0094038   -45.18   0.000    -.4437863     -.40601
                      |
                unemp |  -.0023861   .0015608    -1.53   0.133    -.0055212    .0007489
                      |
              quarter |
                   2  |   .0094634   .0014597     6.48   0.000     .0065315    .0123954
                   3  |   .0182034   .0018218     9.99   0.000     .0145441    .0218627
                   4  |   .0217182   .0011623    18.69   0.000     .0193836    .0240528
                      |
                _cons |   .4113105   .0422185     9.74   0.000     .3265121    .4961089
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,613,820,660)

Linear regression                               Number of obs     =    189,324
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3404
                                                Root MSE          =     .36128

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.140079   .0122767   -11.41   0.000    -.1647375   -.1154205
             treat_st |  -.0567935   .0319759    -1.78   0.082     -.121019    .0074321
treat_stblackrelwhite |  -.0147781   .0147232    -1.00   0.320    -.0443506    .0147943
                      |
                state |
                  NH  |   .0364749   .0060276     6.05   0.000     .0243681    .0485818
                  VT  |  -.0216227   .0034279    -6.31   0.000    -.0285077   -.0147376
                  MA  |   .0928756    .009797     9.48   0.000     .0731977    .1125535
                  RI  |   .0345355   .0102297     3.38   0.001     .0139885    .0550824
                  CT  |   .1396052   .0094194    14.82   0.000     .1206857    .1585247
                  NY  |   .1100441   .0079414    13.86   0.000     .0940933    .1259949
                  NJ  |   .1798651   .0092863    19.37   0.000      .161213    .1985173
                  PA  |   .0028232   .0066808     0.42   0.674    -.0105955    .0162419
                  OH  |   .0024001   .0062504     0.38   0.703    -.0101543    .0149544
                  IN  |   .0228799   .0058049     3.94   0.000     .0112203    .0345394
                  IL  |   .0875876   .0066536    13.16   0.000     .0742234    .1009518
                  MI  |   .0884859   .0067538    13.10   0.000     .0749204    .1020514
                  WI  |   .0223757   .0057065     3.92   0.000     .0109139    .0338375
                  MN  |   .0601267   .0080214     7.50   0.000     .0440152    .0762381
                  IA  |   .0279133   .0297922     0.94   0.353     -.031926    .0877526
                  MO  |   .0206401   .0067976     3.04   0.004     .0069867    .0342936
                  ND  |   .0395342    .030616     1.29   0.203    -.0219599    .1010284
                  SD  |  -.0057437      .0296    -0.19   0.847     -.065197    .0537096
                  NE  |  -.0140552   .0283748    -0.50   0.623    -.0710475    .0429372
                  KS  |   .0595519   .0292649     2.03   0.047     .0007717    .1183321
                  DE  |   .0569957   .0045761    12.46   0.000     .0478043    .0661871
                  MD  |   .1203007   .0090317    13.32   0.000       .10216    .1384414
                  DC  |   .1327465   .0087309    15.20   0.000     .1152099     .150283
                  VA  |   .1573559   .0296476     5.31   0.000      .097807    .2169048
                  WV  |  -.0011228   .0072605    -0.15   0.878    -.0157059    .0134604
                  NC  |   .0516299   .0314544     1.64   0.107    -.0115482     .114808
                  SC  |   .0062244   .0325741     0.19   0.849    -.0592027    .0716514
                  GA  |   .0965625   .0317347     3.04   0.004     .0328216    .1603034
                  FL  |   .0361099   .0324506     1.11   0.271    -.0290691    .1012889
                  KY  |  -.0245334   .0056203    -4.37   0.000    -.0358222   -.0132446
                  TN  |    .014233   .0312252     0.46   0.650    -.0484846    .0769507
                  AL  |   .0186111   .0319327     0.58   0.563    -.0455275    .0827498
                  MS  |  -.0061927   .0338129    -0.18   0.855    -.0741079    .0617225
                  AR  |  -.0097384   .0323164    -0.30   0.764    -.0746478    .0551709
                  LA  |   .0619373   .0320805     1.93   0.059    -.0024983     .126373
                  OK  |  -.0420001   .0139614    -3.01   0.004    -.0700424   -.0139579
                  TX  |   .0865916   .0315217     2.75   0.008     .0232784    .1499049
                  MT  |  -.0426498   .0035297   -12.08   0.000    -.0497394   -.0355603
                  ID  |  -.0172707   .0030504    -5.66   0.000    -.0233976   -.0111438
                  WY  |   .1904178   .0329169     5.78   0.000     .1243023    .2565333
                  CO  |   .0064867   .0088622     0.73   0.468    -.0113135     .024287
                  NM  |  -.0397439   .0073657    -5.40   0.000    -.0545383   -.0249494
                  AZ  |    .077616   .0324153     2.39   0.020      .012508     .142724
                  UT  |    .011624   .0298677     0.39   0.699     -.048367    .0716151
                  NV  |   .1476191    .034194     4.32   0.000     .0789384    .2162998
                  WA  |   .1029177   .0075937    13.55   0.000     .0876652    .1181702
                  OR  |   .0293041   .0073944     3.96   0.000      .014452    .0441562
                  CA  |   .1786811   .0096464    18.52   0.000     .1593057    .1980565
                  AK  |   .2404418   .0076028    31.63   0.000     .2251711    .2557124
                  HI  |   .0881195   .0088655     9.94   0.000     .0703127    .1059263
                      |
                 year |
                1990  |  -.0174419   .0048968    -3.56   0.001    -.0272773   -.0076064
                1991  |   -.026751   .0061578    -4.34   0.000    -.0391194   -.0143827
                1992  |  -.0237939   .0074485    -3.19   0.002    -.0387546   -.0088331
                1993  |  -.0268128   .0068808    -3.90   0.000    -.0406333   -.0129924
                1996  |   -.014391    .005932    -2.43   0.019    -.0263057   -.0024762
                1997  |  -.0066705   .0066276    -1.01   0.319    -.0199825    .0066414
                1998  |   .0030774   .0066184     0.46   0.644    -.0102161    .0163709
                1999  |   .0133231   .0066418     2.01   0.050    -.0000173    .0266635
                2000  |   .0100564   .0058938     1.71   0.094    -.0017817    .0218945
                2001  |   .0169083    .006708     2.52   0.015     .0034349    .0303817
                2002  |   .0283679   .0086574     3.28   0.002     .0109791    .0457568
                2003  |   .0370165   .0081937     4.52   0.000     .0205591    .0534739
                2004  |   .0276502   .0063245     4.37   0.000     .0149471    .0403533
                2005  |   .0228734   .0079438     2.88   0.006     .0069179     .038829
                2006  |    .018497   .0105306     1.76   0.085    -.0026544    .0396485
                2007  |   .0229401   .0123693     1.85   0.070    -.0019044    .0477845
                2008  |   .0097746    .007339     1.33   0.189    -.0049662    .0245154
                2009  |   .0307169   .0117277     2.62   0.012     .0071611    .0542726
                2010  |   .0406275   .0116471     3.49   0.001     .0172337    .0640214
                2011  |   .0194338   .0119237     1.63   0.109    -.0045157    .0433833
                2012  |   .0023451    .012141     0.19   0.848    -.0220408    .0267309
                2013  |   .0034068   .0104074     0.33   0.745    -.0174971    .0243107
                2014  |   .0090437   .0112953     0.80   0.427    -.0136437     .031731
                2015  |   .0104486   .0096028     1.09   0.282    -.0088391    .0297364
                2016  |   .0107873   .0104201     1.04   0.306    -.0101421    .0317167
                2017  |   .0268721   .0096357     2.79   0.007     .0075183     .046226
                2018  |   .0267597   .0097756     2.74   0.009     .0071249    .0463945
                2019  |   .0398739   .0106866     3.73   0.000     .0184093    .0613384
                      |
                 nind |
                   2  |   .0688919   .0246849     2.79   0.007     .0193109     .118473
                   3  |  -.0527928   .0228922    -2.31   0.025    -.0987731   -.0068125
                   4  |  -.2259039   .0267521    -8.44   0.000     -.279637   -.1721707
                   5  |   .0696969   .0227672     3.06   0.004     .0239677    .1154261
                   6  |  -.0814202   .0256482    -3.17   0.003     -.132936   -.0299043
                   7  |  -.0950627   .0233948    -4.06   0.000    -.1420525   -.0480729
                   8  |  -.1941308   .0245324    -7.91   0.000    -.2434057   -.1448559
                   9  |  -.1464822   .0252826    -5.79   0.000    -.1972638   -.0957007
                  10  |  -.1635607   .0425371    -3.85   0.000    -.2489989   -.0781225
                  11  |   .0807782   .0246787     3.27   0.002     .0312095    .1303469
                      |
                 educ |   .0723881   .0040705    17.78   0.000     .0642121     .080564
                exper |   .0715937   .0024775    28.90   0.000     .0666175    .0765699
               exper2 |  -.0025658   .0001686   -15.22   0.000    -.0029044   -.0022273
               exper3 |   .0000515   4.79e-06    10.74   0.000     .0000418    .0000611
               exper4 |  -4.18e-07   4.67e-08    -8.95   0.000    -5.12e-07   -3.24e-07
                 edex |  -.0007842    .000105    -7.47   0.000     -.000995   -.0005733
                      |
                ee_cl |
                   2  |   .0706289   .0168771     4.18   0.000     .0367303    .1045274
                   3  |   .0569137   .0183334     3.10   0.003       .02009    .0937374
                   4  |   .0129445   .0257364     0.50   0.617    -.0387485    .0646376
                   5  |   .0124337   .0211063     0.59   0.558    -.0299595    .0548268
                   6  |   .0457152    .016094     2.84   0.006     .0133895    .0780409
                   7  |   .0537276   .0207093     2.59   0.012     .0121318    .0953234
                   8  |   .0139161   .0237829     0.59   0.561    -.0338533    .0616855
                   9  |   .0071247   .0225231     0.32   0.753    -.0381144    .0523637
                  10  |   .0308812   .0189043     1.63   0.109    -.0070891    .0688515
                  11  |   .0435997   .0205383     2.12   0.039     .0023473    .0848521
                  12  |   .0577427   .0236639     2.44   0.018     .0102124     .105273
                  13  |   .0428275   .0207997     2.06   0.045     .0010501    .0846049
                  14  |   .0221202   .0199272     1.11   0.272    -.0179048    .0621453
                  15  |   .0385763   .0215898     1.79   0.080    -.0047881    .0819407
                  16  |   .0748152   .0220048     3.40   0.001     .0306172    .1190132
                      |
                 marr |   .0638375   .0027413    23.29   0.000     .0583314    .0693436
                partt |   -.094559   .0176365    -5.36   0.000    -.1299829   -.0591352
               public |  -.0522619    .008272    -6.32   0.000    -.0688767   -.0356472
                 cmsa |   .1106656   .0109233    10.13   0.000     .0887255    .1326057
                      |
                nocc2 |
                   2  |  -.0359411   .0104649    -3.43   0.001    -.0569605   -.0149217
                   3  |  -.0198954   .0117902    -1.69   0.098    -.0435767    .0037859
                   4  |  -.0700795   .0137678    -5.09   0.000    -.0977329    -.042426
                   5  |   .0089148   .0173266     0.51   0.609    -.0258866    .0437162
                   6  |  -.2391256    .009689   -24.68   0.000    -.2585865   -.2196647
                   7  |  -.1918418   .0105072   -18.26   0.000    -.2129461   -.1707375
                   8  |  -.0855753   .0268707    -3.18   0.002    -.1395467   -.0316039
                   9  |  -.2188977   .0098912   -22.13   0.000    -.2387648   -.1990306
                  10  |  -.1423746   .0064108   -22.21   0.000    -.1552511   -.1294981
                  11  |  -.0668971   .0079457    -8.42   0.000    -.0828565   -.0509378
                  12  |  -.1870231   .0071291   -26.23   0.000    -.2013423   -.1727038
                      |
                unemp |  -.0030176   .0023135    -1.30   0.198    -.0076644    .0016292
                      |
              quarter |
                   2  |   .0010108    .002849     0.35   0.724    -.0047116    .0067331
                   3  |   .0076115   .0028498     2.67   0.010     .0018875    .0133354
                   4  |   .0110209   .0020359     5.41   0.000     .0069317      .01511
                      |
                _cons |    .530839   .0572357     9.27   0.000     .4158777    .6458003
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,280,703,237)

Linear regression                               Number of obs     =    154,778
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4296
                                                Root MSE          =     .36543

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0555036   .0099949    -5.55   0.000     -.075579   -.0354282
             treat_st |  -.0599582   .0191589    -3.13   0.003    -.0984399   -.0214765
treat_stblackrelwhite |   .0001848    .015602     0.01   0.991    -.0311527    .0315223
                      |
                state |
                  NH  |   .0461962   .0050539     9.14   0.000     .0360453    .0563472
                  VT  |  -.0082204   .0024753    -3.32   0.002    -.0131922   -.0032485
                  MA  |   .1316755   .0088239    14.92   0.000     .1139522    .1493988
                  RI  |   .1390665   .0095375    14.58   0.000     .1199098    .1582232
                  CT  |   .1701256    .008952    19.00   0.000      .152145    .1881061
                  NY  |   .1244656   .0077714    16.02   0.000     .1088563    .1400749
                  NJ  |   .2138991   .0087856    24.35   0.000     .1962526    .2315456
                  PA  |   .0374341   .0073184     5.12   0.000     .0227347    .0521334
                  OH  |   .0169939   .0073693     2.31   0.025     .0021924    .0317955
                  IN  |   .0003344   .0070289     0.05   0.962    -.0137835    .0144523
                  IL  |   .0384737   .0074078     5.19   0.000     .0235946    .0533528
                  MI  |    .088668   .0083828    10.58   0.000     .0718306    .1055054
                  WI  |    .042667   .0061494     6.94   0.000     .0303155    .0550185
                  MN  |   .0847636   .0073251    11.57   0.000     .0700507    .0994764
                  IA  |   .0412156   .0180636     2.28   0.027     .0049338    .0774973
                  MO  |  -.0437075   .0076013    -5.75   0.000    -.0589752   -.0284398
                  ND  |   .0049936   .0185329     0.27   0.789    -.0322307     .042218
                  SD  |  -.0432327   .0176788    -2.45   0.018    -.0787415   -.0077239
                  NE  |  -.0402962   .0171353    -2.35   0.023    -.0747135   -.0058789
                  KS  |   .0032238   .0173448     0.19   0.853    -.0316144    .0380619
                  DE  |    .140992   .0062451    22.58   0.000     .1284484    .1535357
                  MD  |   .1637476   .0092356    17.73   0.000     .1451973    .1822979
                  DC  |   .1856435   .0108752    17.07   0.000     .1637999     .207487
                  VA  |   .1432968   .0181887     7.88   0.000     .1067637    .1798298
                  WV  |  -.0595069   .0038006   -15.66   0.000    -.0671406   -.0518732
                  NC  |   .0499297   .0185944     2.69   0.010     .0125817    .0872777
                  SC  |  -.0297397   .0191151    -1.56   0.126    -.0681334    .0086541
                  GA  |   .0563933   .0190507     2.96   0.005     .0181287    .0946578
                  FL  |   .0483614   .0190332     2.54   0.014      .010132    .0865908
                  KY  |  -.0379525   .0063434    -5.98   0.000    -.0506935   -.0252114
                  TN  |   .0246574   .0184286     1.34   0.187    -.0123575    .0616723
                  AL  |  -.0510365   .0184596    -2.76   0.008    -.0881137   -.0139594
                  MS  |  -.0694954   .0197026    -3.53   0.001    -.1090693   -.0299216
                  AR  |  -.0629415   .0188416    -3.34   0.002     -.100786   -.0250971
                  LA  |  -.0153523   .0193394    -0.79   0.431    -.0541966    .0234921
                  OK  |  -.0987557   .0093368   -10.58   0.000    -.1175092   -.0800021
                  TX  |   .0523924   .0186836     2.80   0.007     .0148653    .0899195
                  MT  |  -.0809134   .0029109   -27.80   0.000    -.0867601   -.0750667
                  ID  |  -.0651578   .0030079   -21.66   0.000    -.0711994   -.0591163
                  WY  |   .0935015   .0192845     4.85   0.000     .0547673    .1322356
                  CO  |   .0047222    .009092     0.52   0.606    -.0135396    .0229841
                  NM  |  -.0656382   .0052716   -12.45   0.000    -.0762266   -.0550499
                  AZ  |   .0586739   .0199026     2.95   0.005     .0186983    .0986495
                  UT  |   .0017418   .0189238     0.09   0.927    -.0362676    .0397513
                  NV  |   .1498011    .022104     6.78   0.000      .105404    .1941983
                  WA  |   .0850449   .0085697     9.92   0.000     .0678321    .1022578
                  OR  |   .0176121   .0073483     2.40   0.020     .0028527    .0323716
                  CA  |   .1927115   .0084227    22.88   0.000      .175794    .2096291
                  AK  |   .2272173   .0049066    46.31   0.000      .217362    .2370726
                  HI  |   .0720077   .0075464     9.54   0.000     .0568504     .087165
                      |
                 year |
                1990  |  -.0009841   .0052673    -0.19   0.853    -.0115638    .0095955
                1991  |  -.0060455   .0081381    -0.74   0.461    -.0223914    .0103003
                1992  |   .0068832   .0108791     0.63   0.530     -.014968    .0287345
                1993  |   .0147637   .0092791     1.59   0.118    -.0038739    .0334013
                1996  |   .0232134   .0084357     2.75   0.008     .0062697     .040157
                1997  |    .023935   .0069684     3.43   0.001     .0099385    .0379314
                1998  |   .0406285   .0068484     5.93   0.000     .0268731    .0543838
                1999  |   .0423009   .0066459     6.36   0.000     .0289522    .0556495
                2000  |   .0367111   .0075025     4.89   0.000     .0216419    .0517804
                2001  |    .051981   .0074511     6.98   0.000      .037015     .066947
                2002  |   .0619319   .0072107     8.59   0.000     .0474487    .0764151
                2003  |   .0518541   .0065267     7.94   0.000     .0387449    .0649633
                2004  |   .0466131    .009115     5.11   0.000     .0283051    .0649211
                2005  |   .0406112   .0088342     4.60   0.000     .0228671    .0583553
                2006  |   .0389065   .0076383     5.09   0.000     .0235645    .0542485
                2007  |   .0322791   .0084003     3.84   0.000     .0154066    .0491516
                2008  |   .0287806   .0124415     2.31   0.025     .0037912    .0537701
                2009  |   .0597175   .0144811     4.12   0.000     .0306313    .0888037
                2010  |   .0663722    .014609     4.54   0.000     .0370291    .0957153
                2011  |   .0426356   .0133093     3.20   0.002     .0159031    .0693681
                2012  |    .013159   .0119788     1.10   0.277    -.0109012    .0372192
                2013  |   .0246598   .0113904     2.16   0.035     .0017815    .0475381
                2014  |   .0078931   .0182824     0.43   0.668    -.0288281    .0446144
                2015  |   .0227036   .0133253     1.70   0.095     -.004061    .0494683
                2016  |   .0304143   .0086345     3.52   0.001     .0130712    .0477573
                2017  |   .0138712   .0123061     1.13   0.265    -.0108464    .0385887
                2018  |   .0142781   .0105853     1.35   0.183    -.0069832    .0355394
                2019  |   .0207826   .0091167     2.28   0.027     .0024711    .0390941
                      |
                 nind |
                   2  |   .0561273   .0519711     1.08   0.285    -.0482597    .1605143
                   3  |   .0448952   .0390527     1.15   0.256    -.0335445    .1233349
                   4  |  -.2343395   .0504374    -4.65   0.000    -.3356461    -.133033
                   5  |   .1415211   .0429459     3.30   0.002     .0552616    .2277805
                   6  |  -.0433698   .0477948    -0.91   0.369    -.1393684    .0526288
                   7  |  -.0998986   .0460288    -2.17   0.035    -.1923502    -.007447
                   8  |  -.1349469   .0495631    -2.72   0.009    -.2344974   -.0353964
                   9  |   -.182821   .0453049    -4.04   0.000    -.2738186   -.0918234
                  10  |  -.1466461   .0603772    -2.43   0.019    -.2679172    -.025375
                  11  |   .0040102   .0463369     0.09   0.931    -.0890603    .0970806
                      |
                 educ |   .1047464   .0056815    18.44   0.000     .0933348    .1161579
                exper |   .0504114   .0033944    14.85   0.000     .0435935    .0572293
               exper2 |  -.0017507   .0002624    -6.67   0.000    -.0022777   -.0012238
               exper3 |   .0000311   9.07e-06     3.43   0.001     .0000129    .0000494
               exper4 |  -2.14e-07   1.02e-07    -2.10   0.041    -4.18e-07   -9.57e-09
                 edex |  -.0004618   .0001241    -3.72   0.001     -.000711   -.0002125
                      |
                ee_cl |
                   2  |  -.0586215   .0137879    -4.25   0.000    -.0863152   -.0309278
                   3  |  -.1198375   .0178306    -6.72   0.000    -.1556513   -.0840237
                   4  |  -.1684682   .0333535    -5.05   0.000    -.2354607   -.1014758
                   5  |  -.0717236   .0206327    -3.48   0.001    -.1131656   -.0302815
                   6  |  -.0908222   .0171312    -5.30   0.000    -.1252312   -.0564132
                   7  |  -.1366416   .0219741    -6.22   0.000    -.1807778   -.0925054
                   8  |  -.1647177   .0347227    -4.74   0.000    -.2344603   -.0949751
                   9  |  -.0466102   .0164035    -2.84   0.006    -.0795575   -.0136629
                  10  |  -.1111019   .0229841    -4.83   0.000    -.1572668   -.0649369
                  11  |  -.1503979   .0243958    -6.16   0.000    -.1993983   -.1013975
                  12  |  -.1434604   .0312925    -4.58   0.000    -.2063132   -.0806077
                  13  |   .0010892   .0208552     0.05   0.959    -.0407997    .0429781
                  14  |  -.1022024    .021778    -4.69   0.000    -.1459449     -.05846
                  15  |  -.1155228   .0258162    -4.47   0.000    -.1673763   -.0636694
                  16  |  -.1117868   .0320549    -3.49   0.001    -.1761709   -.0474027
                      |
                 marr |   .0058698   .0034702     1.69   0.097    -.0011003      .01284
                partt |  -.0642405   .0070274    -9.14   0.000    -.0783555   -.0501255
               public |   .0233017   .0120803     1.93   0.059    -.0009624    .0475657
                 cmsa |   .1208601    .009575    12.62   0.000     .1016281    .1400922
                      |
                nocc2 |
                   2  |  -.0392285   .0107504    -3.65   0.001    -.0608214   -.0176355
                   3  |  -.0222638   .0136407    -1.63   0.109    -.0496619    .0051343
                   4  |  -.1069378   .0109545    -9.76   0.000    -.1289405    -.084935
                   5  |   .1403582    .016213     8.66   0.000     .1077934     .172923
                   6  |  -.2347559   .0095692   -24.53   0.000    -.2539762   -.2155355
                   7  |  -.2427644   .0234071   -10.37   0.000     -.289779   -.1957498
                   8  |  -.0912423   .0463284    -1.97   0.054    -.1842955     .001811
                   9  |  -.2887084   .0152764   -18.90   0.000     -.319392   -.2580248
                  10  |  -.2593578   .0175415   -14.79   0.000     -.294591   -.2241247
                  11  |   .0067168   .0186483     0.36   0.720    -.0307394    .0441731
                  12  |  -.2416241   .0131456   -18.38   0.000    -.2680278   -.2152203
                      |
                unemp |  -.0018357   .0014922    -1.23   0.224    -.0048329    .0011615
                      |
              quarter |
                   2  |   .0046847   .0026943     1.74   0.088    -.0007271    .0100964
                   3  |   .0143112    .002561     5.59   0.000     .0091674    .0194551
                   4  |   .0182632   .0028717     6.36   0.000     .0124952    .0240312
                      |
                _cons |    .180274   .0539948     3.34   0.002     .0718223    .2887257
---------------------------------------------------------------------------------------

. 
. ** HISP-WHITE
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2
>  exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 0, vce(cluster state) 
(sum of wgt is 7,768,999,613)

Linear regression                               Number of obs     =    834,372
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2115
                                                Root MSE          =     .31669

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0021954   .0054425    -0.40   0.688    -.0131271    .0087362
            treat_st |  -.0251749   .0082313    -3.06   0.004     -.041708   -.0086417
treat_sthisprelwhite |   .0082849   .0091922     0.90   0.372    -.0101781     .026748
                     |
               state |
                 NH  |   -.042604   .0030127   -14.14   0.000    -.0486551   -.0365528
                 VT  |  -.0449327   .0015661   -28.69   0.000    -.0480783   -.0417872
                 MA  |   .0060293   .0045879     1.31   0.195    -.0031859    .0152444
                 RI  |   .0109717   .0048869     2.25   0.029     .0011561    .0207874
                 CT  |   .0101744   .0045086     2.26   0.028     .0011187    .0192302
                 NY  |   .0960137   .0042789    22.44   0.000     .0874191    .1046082
                 NJ  |   .0430607   .0049528     8.69   0.000     .0331127    .0530087
                 PA  |   .0124438   .0036391     3.42   0.001     .0051345    .0197531
                 OH  |   .0054376    .003672     1.48   0.145    -.0019379     .012813
                 IN  |  -.0190202   .0043645    -4.36   0.000    -.0277866   -.0102539
                 IL  |   .0352983   .0048008     7.35   0.000     .0256556     .044941
                 MI  |    .040772   .0052411     7.78   0.000     .0302449    .0512991
                 WI  |  -.0081731   .0035977    -2.27   0.027    -.0153993   -.0009468
                 MN  |   .0133235     .00355     3.75   0.000     .0061931     .020454
                 IA  |  -.0006342   .0086411    -0.07   0.942    -.0179904     .016722
                 MO  |  -.0104037   .0034833    -2.99   0.004       -.0174   -.0034074
                 ND  |  -.0644834   .0081244    -7.94   0.000    -.0808018   -.0481649
                 SD  |   -.087651   .0083273   -10.53   0.000    -.1043769   -.0709251
                 NE  |  -.0405677   .0088001    -4.61   0.000    -.0582432   -.0228922
                 KS  |  -.0458291   .0089964    -5.09   0.000    -.0638988   -.0277593
                 DE  |  -.0561776   .0016321   -34.42   0.000    -.0594557   -.0528995
                 MD  |  -.0527122   .0043634   -12.08   0.000    -.0614764   -.0439481
                 DC  |  -.0585001    .007647    -7.65   0.000    -.0738595   -.0431407
                 VA  |  -.0880593   .0091734    -9.60   0.000    -.1064846    -.069634
                 WV  |  -.0251061   .0031947    -7.86   0.000    -.0315228   -.0186895
                 NC  |  -.1088269   .0097532   -11.16   0.000    -.1284166   -.0892371
                 SC  |   -.110711   .0097696   -11.33   0.000    -.1303338   -.0910882
                 GA  |  -.0742962   .0100364    -7.40   0.000    -.0944549   -.0541375
                 FL  |  -.0612943   .0104031    -5.89   0.000    -.0821895    -.040399
                 KY  |  -.0463866   .0034202   -13.56   0.000    -.0532563    -.039517
                 TN  |  -.0716587   .0096602    -7.42   0.000    -.0910619   -.0522556
                 AL  |   -.051059   .0095555    -5.34   0.000    -.0702518   -.0318662
                 MS  |  -.0889059   .0095254    -9.33   0.000    -.1080382   -.0697735
                 AR  |  -.1005535   .0093147   -10.80   0.000    -.1192627   -.0818443
                 LA  |  -.0700602    .010107    -6.93   0.000    -.0903607   -.0497598
                 OK  |  -.0839305   .0072988   -11.50   0.000    -.0985906   -.0692703
                 TX  |  -.0760308   .0103077    -7.38   0.000    -.0967345   -.0553271
                 MT  |  -.0140949   .0020963    -6.72   0.000    -.0183055   -.0098844
                 ID  |  -.0909642   .0020918   -43.49   0.000    -.0951658   -.0867627
                 WY  |  -.0652189   .0085606    -7.62   0.000    -.0824134   -.0480244
                 CO  |  -.0577486   .0041998   -13.75   0.000    -.0661841    -.049313
                 NM  |  -.0857814   .0048545   -17.67   0.000     -.095532   -.0760307
                 AZ  |  -.0706099   .0105581    -6.69   0.000    -.0918165   -.0494033
                 UT  |  -.0754432   .0097005    -7.78   0.000    -.0949272   -.0559593
                 NV  |   .0463367   .0109464     4.23   0.000     .0243502    .0683233
                 WA  |   .0416649   .0043458     9.59   0.000     .0329362    .0503936
                 OR  |   .0025115   .0044916     0.56   0.579    -.0065102    .0115332
                 CA  |   .0244982   .0058953     4.16   0.000     .0126571    .0363393
                 AK  |   .0489159   .0069093     7.08   0.000     .0350382    .0627936
                 HI  |   .0397174   .0039718    10.00   0.000     .0317399    .0476948
                     |
                year |
               1997  |  -.0014488   .0024424    -0.59   0.556    -.0063546    .0034569
               1998  |  -.0076896   .0028448    -2.70   0.009    -.0134035   -.0019758
               1999  |  -.0072716    .003914    -1.86   0.069     -.015133    .0005898
               2000  |  -.0109884   .0040683    -2.70   0.009    -.0191597   -.0028171
               2001  |  -.0125229   .0038102    -3.29   0.002    -.0201759     -.00487
               2002  |  -.0142231   .0038292    -3.71   0.001    -.0219142   -.0065319
               2003  |  -.0185807   .0039137    -4.75   0.000    -.0264416   -.0107198
               2004  |  -.0243422   .0035172    -6.92   0.000    -.0314068   -.0172776
               2005  |  -.0299937   .0048667    -6.16   0.000    -.0397687   -.0202188
               2006  |   -.035835   .0050962    -7.03   0.000    -.0460711   -.0255989
               2007  |  -.0347345   .0055473    -6.26   0.000    -.0458766   -.0235924
               2008  |  -.0242253   .0048412    -5.00   0.000    -.0339491   -.0145014
               2009  |  -.0218314   .0048932    -4.46   0.000    -.0316596   -.0120032
               2010  |  -.0263104   .0056515    -4.66   0.000    -.0376618   -.0149589
               2011  |  -.0295823   .0046961    -6.30   0.000    -.0390147   -.0201498
               2012  |  -.0289191   .0049252    -5.87   0.000    -.0388116   -.0190266
               2013  |   -.033748   .0041227    -8.19   0.000    -.0420286   -.0254674
               2014  |  -.0336181   .0052229    -6.44   0.000    -.0441086   -.0231277
               2015  |   -.037228   .0051654    -7.21   0.000    -.0476031   -.0268529
               2016  |  -.0384392   .0053052    -7.25   0.000    -.0490951   -.0277834
               2017  |   -.035554   .0046379    -7.67   0.000    -.0448694   -.0262385
               2018  |  -.0361031   .0051825    -6.97   0.000    -.0465125   -.0256937
               2019  |   -.036796   .0068223    -5.39   0.000     -.050499    -.023093
                     |
                nind |
                  2  |   .0845109   .0156265     5.41   0.000     .0531241    .1158978
                  3  |   .0684144   .0084593     8.09   0.000     .0514234    .0854055
                  4  |   .0076125   .0074195     1.03   0.310      -.00729    .0225151
                  5  |   .1530732   .0068803    22.25   0.000     .1392538    .1668927
                  6  |   .0042968   .0082646     0.52   0.605    -.0123032    .0208968
                  7  |  -.0018584   .0059012    -0.31   0.754    -.0137112    .0099944
                  8  |   .0141541   .0117882     1.20   0.236    -.0095232    .0378313
                  9  |   .1147798    .014564     7.88   0.000     .0855272    .1440325
                 10  |   .0054987   .0151428     0.36   0.718    -.0249164    .0359139
                 11  |   .0768197   .0135452     5.67   0.000     .0496134    .1040261
                     |
                educ |   .0094735   .0016768     5.65   0.000     .0061055    .0128415
               exper |   .0066057   .0007896     8.37   0.000     .0050198    .0081917
              exper2 |  -.0000348   .0000436    -0.80   0.429    -.0001225    .0000528
              exper3 |   2.73e-07   1.91e-06     0.14   0.887    -3.57e-06    4.11e-06
              exper4 |  -1.80e-08   2.49e-08    -0.72   0.472    -6.81e-08    3.20e-08
                edex |  -.0002251   .0000342    -6.58   0.000    -.0002938   -.0001564
                     |
               ee_cl |
                  2  |  -.0157353    .004553    -3.46   0.001    -.0248802   -.0065903
                  3  |  -.0141745     .00573    -2.47   0.017    -.0256835   -.0026654
                  4  |  -.0281143   .0104138    -2.70   0.009    -.0490311   -.0071975
                  5  |  -.0464507   .0078725    -5.90   0.000    -.0622631   -.0306383
                  6  |  -.0091725   .0038555    -2.38   0.021    -.0169166   -.0014285
                  7  |   .0166496   .0067255     2.48   0.017     .0031409    .0301582
                  8  |  -.0320805   .0120075    -2.67   0.010    -.0561983   -.0079628
                  9  |  -.0560611   .0067035    -8.36   0.000    -.0695255   -.0425967
                 10  |   .0065809   .0062154     1.06   0.295    -.0059032     .019065
                 11  |   .0197464   .0080841     2.44   0.018     .0035091    .0359837
                 12  |   -.040102   .0128979    -3.11   0.003    -.0660082   -.0141957
                 13  |  -.0264871   .0067806    -3.91   0.000    -.0401063   -.0128679
                 14  |   .0246836   .0067676     3.65   0.001     .0110904    .0382768
                 15  |   .0159217    .009135     1.74   0.087    -.0024264    .0342699
                 16  |  -.0420673   .0136798    -3.08   0.003     -.069544   -.0145905
                     |
                marr |   .0155245    .002155     7.20   0.000     .0111961    .0198529
               partt |  -.0523416   .0055326    -9.46   0.000     -.063454   -.0412291
              public |   .2723589   .0288897     9.43   0.000     .2143322    .3303856
                cmsa |   .0359416   .0053085     6.77   0.000     .0252792    .0466041
                     |
               nocc2 |
                  2  |   .0461942   .0029309    15.76   0.000     .0403073    .0520811
                  3  |   .0301753    .004971     6.07   0.000     .0201907    .0401599
                  4  |   .1520036   .0094285    16.12   0.000     .1330659    .1709413
                  5  |   .1366704   .0161191     8.48   0.000     .1042942    .1690467
                  6  |   .1292208   .0078245    16.51   0.000     .1135048    .1449369
                  7  |   .0702696   .0054355    12.93   0.000     .0593521     .081187
                  8  |   .0589617   .0089831     6.56   0.000     .0409187    .0770047
                  9  |   .1571888   .0108006    14.55   0.000     .1354952    .1788824
                 10  |   .1707338   .0123888    13.78   0.000     .1458502    .1956174
                 11  |   .1896929   .0155806    12.17   0.000     .1583983    .2209875
                 12  |   .1884124   .0157605    11.95   0.000     .1567564    .2200683
                     |
               unemp |  -.0015454   .0013912    -1.11   0.272    -.0043398    .0012489
             citizen |   -.016753   .0026948    -6.22   0.000    -.0221656   -.0113404
                     |
             quarter |
                  2  |  -.0035622   .0013506    -2.64   0.011    -.0062749   -.0008495
                  3  |  -.0019368   .0014146    -1.37   0.177    -.0047781    .0009045
                  4  |  -.0028958   .0013705    -2.11   0.040    -.0056485   -.0001432
                     |
               _cons |  -.1655459   .0362877    -4.56   0.000    -.2384318     -.09266
--------------------------------------------------------------------------------------

.         
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2
>  exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 1, vce(cluster state)
(sum of wgt is 7,117,480,992)

Linear regression                               Number of obs     =    805,753
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2766
                                                Root MSE          =     .28781

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |   .0097959   .0085252     1.15   0.256    -.0073275    .0269193
            treat_st |  -.0279255   .0115106    -2.43   0.019    -.0510452   -.0048059
treat_sthisprelwhite |   .0066745   .0129309     0.52   0.608     -.019298     .032647
                     |
               state |
                 NH  |  -.0116942   .0016395    -7.13   0.000    -.0149872   -.0084011
                 VT  |  -.0050285   .0011125    -4.52   0.000    -.0072631    -.002794
                 MA  |   .0210403   .0030223     6.96   0.000     .0149698    .0271108
                 RI  |   .0381735   .0028473    13.41   0.000     .0324545    .0438925
                 CT  |   .0313553   .0026596    11.79   0.000     .0260134    .0366973
                 NY  |   .1024307   .0028879    35.47   0.000     .0966302    .1082313
                 NJ  |   .0332227   .0032399    10.25   0.000      .026715    .0397303
                 PA  |   .0064773   .0025279     2.56   0.013     .0013998    .0115549
                 OH  |  -.0016573    .002104    -0.79   0.435    -.0058833    .0025686
                 IN  |  -.0427711   .0041682   -10.26   0.000    -.0511432    -.034399
                 IL  |  -.0003836   .0033727    -0.11   0.910    -.0071578    .0063906
                 MI  |   .0434663    .003765    11.54   0.000     .0359041    .0510285
                 WI  |  -.0048171    .003377    -1.43   0.160    -.0115999    .0019658
                 MN  |     .03332   .0020961    15.90   0.000     .0291098    .0375302
                 IA  |   .0051392   .0116616     0.44   0.661    -.0182839    .0285622
                 MO  |  -.0502593   .0020908   -24.04   0.000    -.0544589   -.0460598
                 ND  |  -.0435248   .0115473    -3.77   0.000    -.0667183   -.0203313
                 SD  |  -.0530575   .0116639    -4.55   0.000    -.0764851     -.02963
                 NE  |  -.0220792   .0116565    -1.89   0.064    -.0454919    .0013336
                 KS  |  -.0521232   .0115544    -4.51   0.000    -.0753309   -.0289156
                 DE  |  -.0303851   .0011579   -26.24   0.000    -.0327109   -.0280593
                 MD  |  -.0317554   .0028886   -10.99   0.000    -.0375573   -.0259534
                 DC  |   -.062222   .0039103   -15.91   0.000     -.070076    -.054368
                 VA  |  -.0744177   .0115247    -6.46   0.000    -.0975657   -.0512697
                 WV  |  -.0304764   .0025203   -12.09   0.000    -.0355385   -.0254143
                 NC  |  -.0914978   .0117799    -7.77   0.000    -.1151583   -.0678372
                 SC  |  -.0967213   .0116484    -8.30   0.000    -.1201178   -.0733247
                 GA  |  -.0763783   .0117693    -6.49   0.000    -.1000176    -.052739
                 FL  |  -.0336564   .0118949    -2.83   0.007     -.057548   -.0097648
                 KY  |  -.0566917   .0020307   -27.92   0.000    -.0607705   -.0526129
                 TN  |  -.0636279   .0117704    -5.41   0.000    -.0872695   -.0399864
                 AL  |  -.0312285   .0116241    -2.69   0.010    -.0545762   -.0078808
                 MS  |  -.0844713   .0116366    -7.26   0.000    -.1078441   -.0610984
                 AR  |  -.0773561   .0116119    -6.66   0.000    -.1006794   -.0540329
                 LA  |  -.0608097   .0116354    -5.23   0.000    -.0841801   -.0374394
                 OK  |  -.0611256   .0084721    -7.21   0.000    -.0781424   -.0441089
                 TX  |   -.066401   .0118323    -5.61   0.000    -.0901669    -.042635
                 MT  |   .0027064   .0016068     1.68   0.098     -.000521    .0059338
                 ID  |  -.0754894   .0013403   -56.32   0.000    -.0781815   -.0727972
                 WY  |  -.0874611   .0119109    -7.34   0.000    -.1113849   -.0635373
                 CO  |  -.0412905    .002933   -14.08   0.000    -.0471815   -.0353995
                 NM  |  -.0670973   .0048748   -13.76   0.000    -.0768887    -.057306
                 AZ  |  -.0520835   .0117704    -4.42   0.000    -.0757251   -.0284419
                 UT  |  -.0549653   .0116646    -4.71   0.000    -.0783944   -.0315362
                 NV  |   .0639015   .0119473     5.35   0.000     .0399047    .0878983
                 WA  |    .057579     .00228    25.25   0.000     .0529995    .0621584
                 OR  |   .0446446   .0022295    20.02   0.000     .0401664    .0491227
                 CA  |   .0438499    .004771     9.19   0.000      .034267    .0534328
                 AK  |   .0789352   .0043919    17.97   0.000     .0701137    .0877567
                 HI  |   .0582581    .002792    20.87   0.000     .0526502    .0638661
                     |
                year |
               1997  |  -.0047149   .0014978    -3.15   0.003    -.0077234   -.0017065
               1998  |  -.0071404   .0027789    -2.57   0.013     -.012722   -.0015588
               1999  |  -.0095057   .0018729    -5.08   0.000    -.0132676   -.0057438
               2000  |  -.0093217    .001832    -5.09   0.000    -.0130014    -.005642
               2001  |  -.0073358   .0023705    -3.09   0.003     -.012097   -.0025746
               2002  |  -.0090365   .0032334    -2.79   0.007    -.0155309   -.0025421
               2003  |  -.0137994   .0029429    -4.69   0.000    -.0197104   -.0078884
               2004  |  -.0156968   .0031199    -5.03   0.000    -.0219633   -.0094303
               2005  |  -.0174768   .0027217    -6.42   0.000    -.0229435     -.01201
               2006  |  -.0192789   .0027375    -7.04   0.000    -.0247774   -.0137805
               2007  |  -.0206987   .0033704    -6.14   0.000    -.0274683   -.0139291
               2008  |    -.01636   .0041039    -3.99   0.000     -.024603   -.0081169
               2009  |  -.0137357   .0042623    -3.22   0.002    -.0222967   -.0051746
               2010  |  -.0174626   .0047574    -3.67   0.001     -.027018   -.0079071
               2011  |  -.0166821   .0043559    -3.83   0.000    -.0254311   -.0079331
               2012  |  -.0222569   .0044958    -4.95   0.000     -.031287   -.0132269
               2013  |  -.0188909   .0038669    -4.89   0.000    -.0266579   -.0111239
               2014  |  -.0223073    .003612    -6.18   0.000    -.0295623   -.0150524
               2015  |   -.022631   .0034237    -6.61   0.000    -.0295077   -.0157543
               2016  |  -.0218897   .0034821    -6.29   0.000    -.0288837   -.0148957
               2017  |  -.0249779   .0035139    -7.11   0.000    -.0320357     -.01792
               2018  |  -.0265646   .0029655    -8.96   0.000     -.032521   -.0206083
               2019  |  -.0272231   .0048611    -5.60   0.000     -.036987   -.0174592
                     |
                nind |
                  2  |   .0326644   .0089164     3.66   0.001     .0147553    .0505736
                  3  |   .0350523   .0085976     4.08   0.000     .0177836    .0523211
                  4  |   .0377822   .0099448     3.80   0.000     .0178075    .0577569
                  5  |   .1292183   .0091423    14.13   0.000     .1108553    .1475812
                  6  |   .0165023   .0080318     2.05   0.045     .0003699    .0326346
                  7  |   .0053382   .0077046     0.69   0.492     -.010137    .0208134
                  8  |   .0203878   .0121185     1.68   0.099    -.0039529    .0447285
                  9  |   .1395199   .0177184     7.87   0.000     .1039314    .1751084
                 10  |   .0102221   .0109303     0.94   0.354    -.0117321    .0321762
                 11  |   .0028625   .0190881     0.15   0.881     -.035477    .0412021
                     |
                educ |   .0160115   .0022189     7.22   0.000     .0115546    .0204683
               exper |    .009655   .0011537     8.37   0.000     .0073376    .0119723
              exper2 |  -.0003037   .0000669    -4.54   0.000     -.000438   -.0001694
              exper3 |   6.35e-06   2.08e-06     3.05   0.004     2.17e-06    .0000105
              exper4 |  -5.52e-08   2.22e-08    -2.48   0.016    -9.98e-08   -1.06e-08
                edex |   -.000209   .0000453    -4.62   0.000    -.0002999   -.0001181
                     |
               ee_cl |
                  2  |  -.0356074   .0044378    -8.02   0.000    -.0445209   -.0266939
                  3  |  -.0667586   .0069011    -9.67   0.000      -.08062   -.0528972
                  4  |   -.094557   .0148641    -6.36   0.000    -.1244125   -.0647015
                  5  |  -.0392062   .0091878    -4.27   0.000    -.0576604    -.020752
                  6  |  -.0521066   .0059416    -8.77   0.000    -.0640407   -.0401726
                  7  |  -.0670108   .0090357    -7.42   0.000    -.0851595    -.048862
                  8  |  -.0877283   .0145876    -6.01   0.000    -.1170284   -.0584281
                  9  |  -.0373993   .0078914    -4.74   0.000    -.0532497    -.021549
                 10  |  -.0523302   .0076394    -6.85   0.000    -.0676744    -.036986
                 11  |  -.0664129   .0092863    -7.15   0.000     -.085065   -.0477608
                 12  |  -.0780644   .0143453    -5.44   0.000    -.1068778    -.049251
                 13  |  -.0148117   .0099806    -1.48   0.144    -.0348583    .0052349
                 14  |  -.0384474   .0076779    -5.01   0.000    -.0538689   -.0230259
                 15  |  -.0539375   .0113124    -4.77   0.000    -.0766591   -.0312159
                 16  |  -.0669065   .0151214    -4.42   0.000    -.0972788   -.0365343
                     |
                marr |  -.0014731    .000958    -1.54   0.130    -.0033972    .0004511
               partt |  -.0502834    .004909   -10.24   0.000    -.0601435   -.0404234
              public |   .2891033   .0302673     9.55   0.000     .2283097    .3498969
                cmsa |   .0203311   .0028324     7.18   0.000     .0146421    .0260201
                     |
               nocc2 |
                  2  |   .0206652   .0018949    10.91   0.000     .0168592    .0244713
                  3  |   .0326997   .0071654     4.56   0.000     .0183076    .0470918
                  4  |   .1449694   .0066457    21.81   0.000     .1316212    .1583176
                  5  |   .1316219   .0161861     8.13   0.000     .0991113    .1641326
                  6  |   .0602329   .0054233    11.11   0.000     .0493399    .0711258
                  7  |   .0774804     .00765    10.13   0.000      .062115    .0928458
                  8  |   .0531778   .0030223    17.60   0.000     .0471073    .0592482
                  9  |   .0923394   .0086212    10.71   0.000     .0750231    .1096557
                 10  |    .146574   .0116149    12.62   0.000     .1232447    .1699032
                 11  |   .1771907   .0155535    11.39   0.000     .1459506    .2084308
                 12  |   .1636128    .015052    10.87   0.000       .13338    .1938455
                     |
               unemp |  -.0005678    .000815    -0.70   0.489    -.0022047    .0010691
             citizen |   -.007009   .0019065    -3.68   0.001    -.0108383   -.0031797
                     |
             quarter |
                  2  |  -.0011967   .0010582    -1.13   0.264    -.0033222    .0009288
                  3  |  -.0002244   .0009826    -0.23   0.820    -.0021981    .0017493
                  4  |   -.002202    .001249    -1.76   0.084    -.0047107    .0003068
                     |
               _cons |  -.2141442   .0344779    -6.21   0.000    -.2833951   -.1448933
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 0, vce(cluster state) 
(sum of wgt is 7,769,055,819)

Linear regression                               Number of obs     =    834,380
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5288
                                                Root MSE          =     .41541

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1286997   .0121792   -10.57   0.000    -.1531623   -.1042371
            treat_st |  -.0367242   .0159098    -2.31   0.025    -.0686799   -.0047684
treat_sthisprelwhite |   .0190234   .0280323     0.68   0.501    -.0372811    .0753279
                     |
               state |
                 NH  |   .0838418   .0047759    17.56   0.000     .0742492    .0934344
                 VT  |   .0197659   .0021913     9.02   0.000     .0153645    .0241673
                 MA  |   .1386941    .008665    16.01   0.000     .1212899    .1560983
                 RI  |   .0535427   .0089252     6.00   0.000     .0356158    .0714695
                 CT  |    .146767   .0087212    16.83   0.000     .1292499    .1642841
                 NY  |   .1181781   .0087965    13.43   0.000     .1005099    .1358463
                 NJ  |    .184903   .0097916    18.88   0.000      .165236    .2045699
                 PA  |   .0231055   .0066308     3.48   0.001     .0097871    .0364239
                 OH  |  -.0066632   .0064527    -1.03   0.307    -.0196239    .0062974
                 IN  |   .0170826   .0066872     2.55   0.014     .0036511    .0305142
                 IL  |   .1082051   .0086435    12.52   0.000     .0908441     .125566
                 MI  |   .0552981   .0085564     6.46   0.000      .038112    .0724842
                 WI  |   .0384224   .0057592     6.67   0.000     .0268547    .0499901
                 MN  |   .0799835   .0063968    12.50   0.000     .0671351     .092832
                 IA  |   .0281079   .0146978     1.91   0.062    -.0014136    .0576293
                 MO  |  -.0081273   .0061591    -1.32   0.193    -.0204983    .0042437
                 ND  |   .0365051   .0145992     2.50   0.016     .0071819    .0658284
                 SD  |  -.0372622   .0142493    -2.62   0.012    -.0658827   -.0086417
                 NE  |  -.0130413    .014499    -0.90   0.373    -.0421635    .0160809
                 KS  |   .0043563   .0159106     0.27   0.785     -.027601    .0363137
                 DE  |   .0451015     .00209    21.58   0.000     .0409036    .0492995
                 MD  |    .144792    .009243    15.67   0.000      .126227    .1633571
                 DC  |   .2440995   .0131088    18.62   0.000     .2177697    .2704293
                 VA  |   .1449524   .0160371     9.04   0.000     .1127409    .1771638
                 WV  |   -.047592   .0044329   -10.74   0.000    -.0564958   -.0386882
                 NC  |   .0116079   .0179911     0.65   0.522    -.0245283     .047744
                 SC  |  -.0058218   .0180465    -0.32   0.748    -.0420694    .0304257
                 GA  |   .0601862   .0180808     3.33   0.002     .0238697    .0965026
                 FL  |   .0061079   .0192627     0.32   0.753    -.0325825    .0447982
                 KY  |  -.0350953    .005836    -6.01   0.000    -.0468172   -.0233733
                 TN  |  -.0247749   .0174688    -1.42   0.162     -.059862    .0103123
                 AL  |   .0161315   .0176129     0.92   0.364     -.019245     .051508
                 MS  |  -.0119549   .0187083    -0.64   0.526    -.0495316    .0256218
                 AR  |  -.0628694   .0171959    -3.66   0.001    -.0974083   -.0283305
                 LA  |   .0471519   .0184481     2.56   0.014     .0100978     .084206
                 OK  |  -.0475065   .0124323    -3.82   0.000    -.0724776   -.0225354
                 TX  |   .0541521   .0197248     2.75   0.008     .0145337    .0937704
                 MT  |  -.0326837   .0011696   -27.94   0.000    -.0350329   -.0303345
                 ID  |  -.0264337   .0054065    -4.89   0.000     -.037293   -.0155744
                 WY  |   .1688708   .0167098    10.11   0.000     .1353082    .2024333
                 CO  |   .0635214   .0087092     7.29   0.000     .0460283    .0810144
                 NM  |   .0208538   .0087581     2.38   0.021     .0032625     .038445
                 AZ  |   .0587493   .0201299     2.92   0.005     .0183172    .0991814
                 UT  |   .0185375   .0163785     1.13   0.263    -.0143597    .0514347
                 NV  |   .1453663   .0203336     7.15   0.000     .1045251    .1862074
                 WA  |   .1290845   .0078937    16.35   0.000     .1132295    .1449395
                 OR  |    .051965    .008084     6.43   0.000     .0357278    .0682022
                 CA  |   .1658657   .0126513    13.11   0.000     .1404549    .1912766
                 AK  |   .2333825   .0071843    32.49   0.000     .2189525    .2478125
                 HI  |   .1508043   .0065514    23.02   0.000     .1376454    .1639632
                     |
                year |
               1997  |   .0101278   .0036344     2.79   0.008     .0028279    .0174276
               1998  |   .0310069   .0048286     6.42   0.000     .0213083    .0407055
               1999  |   .0506452   .0063596     7.96   0.000     .0378716    .0634188
               2000  |   .0592271   .0072215     8.20   0.000     .0447223    .0737318
               2001  |   .0793345   .0067536    11.75   0.000     .0657694    .0928995
               2002  |   .0958017   .0056705    16.89   0.000     .0844121    .1071913
               2003  |   .0878673   .0064381    13.65   0.000      .074936    .1007985
               2004  |   .0748311   .0058352    12.82   0.000     .0631108    .0865514
               2005  |   .0584097    .007092     8.24   0.000      .044165    .0726544
               2006  |   .0503281   .0081457     6.18   0.000     .0339669    .0666892
               2007  |   .0535012   .0093655     5.71   0.000       .03469    .0723123
               2008  |   .0581554   .0086784     6.70   0.000     .0407243    .0755865
               2009  |    .097992    .009359    10.47   0.000     .0791939    .1167902
               2010  |   .0889563   .0085972    10.35   0.000     .0716882    .1062243
               2011  |   .0609428   .0081038     7.52   0.000     .0446658    .0772198
               2012  |   .0517231   .0092776     5.58   0.000     .0330885    .0703578
               2013  |    .044202   .0083573     5.29   0.000     .0274159     .060988
               2014  |   .0348052    .008774     3.97   0.000     .0171822    .0524282
               2015  |   .0481737   .0086507     5.57   0.000     .0307983    .0655492
               2016  |   .0619676    .009661     6.41   0.000      .042563    .0813723
               2017  |   .0651627   .0105249     6.19   0.000     .0440229    .0863025
               2018  |    .072839   .0104444     6.97   0.000     .0518609    .0938172
               2019  |   .0878721   .0100331     8.76   0.000     .0677201     .108024
                     |
                nind |
                  2  |   .0767021   .0362889     2.11   0.040     .0038137    .1495904
                  3  |   .0927855   .0252818     3.67   0.001     .0420054    .1435656
                  4  |  -.0791097   .0312828    -2.53   0.015     -.141943   -.0162764
                  5  |   .1328655   .0288977     4.60   0.000     .0748227    .1909082
                  6  |   .0955839   .0311353     3.07   0.003     .0330468    .1581209
                  7  |   .0071867   .0288228     0.25   0.804    -.0507056     .065079
                  8  |   -.045953    .029254    -1.57   0.123    -.1047114    .0128055
                  9  |  -.0670708    .031344    -2.14   0.037     -.130027   -.0041145
                 10  |   -.084429   .0334979    -2.52   0.015    -.1517115   -.0171465
                 11  |   .1168274   .0325551     3.59   0.001     .0514384    .1822163
                     |
                educ |   .0597119   .0024509    24.36   0.000     .0547891    .0646347
               exper |   .0489933    .002177    22.50   0.000     .0446207    .0533659
              exper2 |  -.0010301   .0001183    -8.71   0.000    -.0012678   -.0007924
              exper3 |   7.67e-06   3.38e-06     2.27   0.028     8.81e-07    .0000145
              exper4 |  -1.13e-09   3.37e-08    -0.03   0.973    -6.87e-08    6.65e-08
                edex |  -.0006627   .0000659   -10.05   0.000    -.0007951   -.0005302
                     |
               ee_cl |
                  2  |  -.0427057   .0050907    -8.39   0.000    -.0529306   -.0324808
                  3  |  -.0400501   .0104228    -3.84   0.000     -.060985   -.0191153
                  4  |   .0369421   .0211121     1.75   0.086    -.0054629    .0793471
                  5  |  -.1023618   .0058899   -17.38   0.000    -.1141921   -.0905315
                  6  |  -.0801904   .0061003   -13.15   0.000    -.0924432   -.0679376
                  7  |  -.0263128   .0127299    -2.07   0.044    -.0518815   -.0007441
                  8  |   .1071693   .0213213     5.03   0.000     .0643442    .1499944
                  9  |  -.1388646    .008841   -15.71   0.000    -.1566222   -.1211069
                 10  |  -.0909529   .0087274   -10.42   0.000    -.1084824   -.0734234
                 11  |  -.0218575   .0144287    -1.51   0.136    -.0508384    .0071234
                 12  |   .1094437   .0219688     4.98   0.000      .065318    .1535693
                 13  |  -.1190015   .0129598    -9.18   0.000    -.1450321   -.0929709
                 14  |  -.0685584   .0094092    -7.29   0.000    -.0874573   -.0496595
                 15  |    -.01205   .0146147    -0.82   0.414    -.0414044    .0173044
                 16  |   .1124699   .0237648     4.73   0.000     .0647369     .160203
                     |
                marr |    .123223    .002101    58.65   0.000     .1190029     .127443
               partt |  -.1898595   .0082146   -23.11   0.000     -.206359   -.1733599
              public |   .0149072   .0083554     1.78   0.080     -.001875    .0316895
                cmsa |   .1377672   .0088093    15.64   0.000     .1200732    .1554611
                     |
               nocc2 |
                  2  |  -.1523615    .004165   -36.58   0.000    -.1607272   -.1439959
                  3  |  -.0362049   .0064921    -5.58   0.000    -.0492448   -.0231651
                  4  |  -.3008033   .0087773   -34.27   0.000    -.3184331   -.2831735
                  5  |  -.0888604    .009835    -9.04   0.000    -.1086145   -.0691063
                  6  |  -.3926613   .0067263   -58.38   0.000    -.4061715   -.3791511
                  7  |  -.2418338   .0079135   -30.56   0.000    -.2577286    -.225939
                  8  |  -.0944509   .0135444    -6.97   0.000    -.1216557   -.0672461
                  9  |  -.3931415   .0043406   -90.57   0.000    -.4018598   -.3844232
                 10  |  -.3557034   .0086832   -40.96   0.000    -.3731441   -.3382626
                 11  |  -.2411285   .0082672   -29.17   0.000    -.2577338   -.2245233
                 12  |  -.3984144   .0076533   -52.06   0.000    -.4137865   -.3830423
                     |
               unemp |  -.0080723    .002239    -3.61   0.001    -.0125695   -.0035752
             citizen |  -.0412689   .0039722   -10.39   0.000    -.0492474   -.0332904
                     |
             quarter |
                  2  |   .0040004   .0018809     2.13   0.038     .0002226    .0077783
                  3  |   .0036381   .0019772     1.84   0.072    -.0003333    .0076094
                  4  |   .0136014   .0016464     8.26   0.000     .0102945    .0169083
                     |
               _cons |   .7636125   .0423774    18.02   0.000     .6784949    .8487301
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 1, vce(cluster state)
(sum of wgt is 7,117,518,476)

Linear regression                               Number of obs     =    805,759
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5094
                                                Root MSE          =     .39708

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0927871   .0144183    -6.44   0.000    -.1217471   -.0638272
            treat_st |  -.0341712   .0080504    -4.24   0.000    -.0503409   -.0180016
treat_sthisprelwhite |   .0128856   .0258922     0.50   0.621    -.0391205    .0648917
                     |
               state |
                 NH  |   .0549217   .0037031    14.83   0.000     .0474839    .0623595
                 VT  |   .0364187   .0016421    22.18   0.000     .0331205    .0397169
                 MA  |   .1130934   .0083897    13.48   0.000     .0962422    .1299446
                 RI  |   .0353316   .0087256     4.05   0.000     .0178057    .0528575
                 CT  |   .1177093   .0085081    13.84   0.000     .1006203    .1347983
                 NY  |   .0778119   .0085851     9.06   0.000     .0605683    .0950555
                 NJ  |   .1354434   .0096639    14.02   0.000     .1160329    .1548538
                 PA  |  -.0304201   .0063426    -4.80   0.000    -.0431595   -.0176806
                 OH  |   -.056399   .0061664    -9.15   0.000    -.0687845   -.0440135
                 IN  |  -.0514168   .0053244    -9.66   0.000    -.0621112   -.0407224
                 IL  |   .0205246   .0081486     2.52   0.015     .0041577    .0368914
                 MI  |  -.0099985   .0072219    -1.38   0.172     -.024504    .0045071
                 WI  |   .0042633   .0049562     0.86   0.394    -.0056914    .0142181
                 MN  |   .0579686   .0056464    10.27   0.000     .0466275    .0693097
                 IA  |  -.0164528   .0077997    -2.11   0.040     -.032119   -.0007866
                 MO  |  -.0779112   .0059209   -13.16   0.000    -.0898037   -.0660187
                 ND  |  -.0483616   .0075439    -6.41   0.000     -.063514   -.0332092
                 SD  |  -.0683925   .0075931    -9.01   0.000    -.0836436   -.0531414
                 NE  |  -.0499511   .0079345    -6.30   0.000     -.065888   -.0340143
                 KS  |  -.0543815   .0085916    -6.33   0.000    -.0716383   -.0371247
                 DE  |   .0410274   .0015336    26.75   0.000     .0379471    .0441077
                 MD  |   .1125031   .0091652    12.27   0.000     .0940942     .130912
                 DC  |   .2031366   .0140869    14.42   0.000     .1748423     .231431
                 VA  |   .0845772   .0099882     8.47   0.000     .0645154     .104639
                 WV  |   -.155033   .0024274   -63.87   0.000    -.1599086   -.1501574
                 NC  |  -.0230512   .0098178    -2.35   0.023    -.0427708   -.0033315
                 SC  |  -.0666896   .0100726    -6.62   0.000     -.086921   -.0464582
                 GA  |  -.0027088   .0103377    -0.26   0.794    -.0234728    .0180551
                 FL  |  -.0271695   .0113384    -2.40   0.020    -.0499434   -.0043957
                 KY  |  -.0811587   .0046853   -17.32   0.000    -.0905695    -.071748
                 TN  |  -.0715347   .0098232    -7.28   0.000    -.0912651   -.0518042
                 AL  |  -.0705571   .0096528    -7.31   0.000    -.0899454   -.0511689
                 MS  |  -.0955123   .0093971   -10.16   0.000     -.114387   -.0766375
                 AR  |  -.1060057   .0089356   -11.86   0.000    -.1239533   -.0880581
                 LA  |  -.0752629   .0107106    -7.03   0.000    -.0967757   -.0537501
                 OK  |  -.1326027   .0075108   -17.65   0.000    -.1476887   -.1175168
                 TX  |  -.0064613   .0114375    -0.56   0.575    -.0294343    .0165116
                 MT  |   -.072691   .0008131   -89.40   0.000    -.0743242   -.0710579
                 ID  |  -.0661412   .0041862   -15.80   0.000    -.0745494   -.0577329
                 WY  |   .0154936   .0078271     1.98   0.053    -.0002275    .0312147
                 CO  |   .0220123   .0083629     2.63   0.011      .005215    .0388097
                 NM  |  -.0580476   .0086275    -6.73   0.000    -.0753765   -.0407186
                 AZ  |   .0211321   .0113636     1.86   0.069    -.0016924    .0439565
                 UT  |  -.0338726   .0099603    -3.40   0.001    -.0538785   -.0138667
                 NV  |   .0945282   .0115203     8.21   0.000     .0713889    .1176674
                 WA  |   .0774178   .0077745     9.96   0.000     .0618023    .0930332
                 OR  |   .0115652   .0075185     1.54   0.130    -.0035362    .0266665
                 CA  |   .1332135   .0121423    10.97   0.000      .108825     .157602
                 AK  |   .1821213   .0055124    33.04   0.000     .1710494    .1931932
                 HI  |   .0971159   .0065215    14.89   0.000     .0840172    .1102147
                     |
                year |
               1997  |   .0093962   .0033053     2.84   0.006     .0027573    .0160351
               1998  |   .0354109   .0028358    12.49   0.000      .029715    .0411068
               1999  |   .0507833   .0045244    11.22   0.000     .0416957    .0598709
               2000  |   .0642273    .004889    13.14   0.000     .0544074    .0740471
               2001  |   .0810375   .0055719    14.54   0.000     .0698459    .0922291
               2002  |   .0958035   .0060919    15.73   0.000     .0835675    .1080395
               2003  |   .1014962   .0065205    15.57   0.000     .0883995     .114593
               2004  |   .0930119    .005163    18.02   0.000     .0826416    .1033821
               2005  |   .0812651   .0050187    16.19   0.000     .0711848    .0913454
               2006  |   .0748135   .0043797    17.08   0.000     .0660167    .0836103
               2007  |   .0746405   .0053682    13.90   0.000     .0638581    .0854229
               2008  |   .0745018   .0064647    11.52   0.000     .0615171    .0874865
               2009  |   .1001053   .0076859    13.02   0.000     .0846678    .1155427
               2010  |   .0963163    .006446    14.94   0.000     .0833691    .1092634
               2011  |   .0757481   .0060579    12.50   0.000     .0635805    .0879158
               2012  |   .0580975   .0055145    10.54   0.000     .0470213    .0691737
               2013  |    .055296   .0055341     9.99   0.000     .0441804    .0664116
               2014  |   .0487526   .0049116     9.93   0.000     .0388874    .0586178
               2015  |   .0639037   .0048828    13.09   0.000     .0540962    .0737112
               2016  |   .0771224   .0062473    12.34   0.000     .0645745    .0896704
               2017  |   .0845508   .0066813    12.65   0.000      .071131    .0979706
               2018  |   .0865083   .0062002    13.95   0.000     .0740547    .0989618
               2019  |   .0968476    .006237    15.53   0.000     .0843202     .109375
                     |
                nind |
                  2  |   .0470662   .0331027     1.42   0.161    -.0194226    .1135549
                  3  |   .1050517   .0303929     3.46   0.001     .0440057    .1660976
                  4  |  -.0916545   .0311999    -2.94   0.005    -.1543213   -.0289876
                  5  |   .1198769   .0314718     3.81   0.000      .056664    .1830898
                  6  |   .0745556   .0328037     2.27   0.027     .0086675    .1404437
                  7  |   .0174189   .0331095     0.53   0.601    -.0490834    .0839212
                  8  |  -.0306027    .033631    -0.91   0.367    -.0981525    .0369471
                  9  |  -.0866421   .0383367    -2.26   0.028    -.1636436   -.0096406
                 10  |  -.0768487   .0319036    -2.41   0.020    -.1409289   -.0127684
                 11  |   .0549007   .0348104     1.58   0.121    -.0150181    .1248195
                     |
                educ |   .0906829   .0035773    25.35   0.000     .0834976    .0978682
               exper |   .0541733   .0018597    29.13   0.000     .0504379    .0579086
              exper2 |   -.001516   .0000926   -16.36   0.000     -.001702   -.0013299
              exper3 |   .0000239   2.59e-06     9.24   0.000     .0000187    .0000291
              exper4 |  -1.38e-07   2.46e-08    -5.62   0.000    -1.88e-07   -8.89e-08
                edex |  -.0010188   .0000728   -14.00   0.000    -.0011651   -.0008726
                     |
               ee_cl |
                  2  |   -.126935   .0086443   -14.68   0.000    -.1442975   -.1095724
                  3  |  -.1581628   .0136916   -11.55   0.000    -.1856633   -.1306623
                  4  |  -.1483056   .0266697    -5.56   0.000    -.2018733   -.0947379
                  5  |  -.1378776   .0080399   -17.15   0.000    -.1540261   -.1217291
                  6  |  -.1856366   .0114695   -16.19   0.000    -.2086739   -.1625993
                  7  |   -.171079   .0176751    -9.68   0.000    -.2065806   -.1355774
                  8  |  -.0734911    .029575    -2.48   0.016    -.1328942    -.014088
                  9  |   -.162154   .0103368   -15.69   0.000     -.182916    -.141392
                 10  |  -.2009819   .0120761   -16.64   0.000    -.2252374   -.1767263
                 11  |  -.1733753   .0168843   -10.27   0.000    -.2072883   -.1394622
                 12  |  -.0736813   .0294513    -2.50   0.016    -.1328359   -.0145267
                 13  |  -.1644386    .012689   -12.96   0.000    -.1899251   -.1389521
                 14  |  -.1858657   .0106111   -17.52   0.000    -.2071788   -.1645526
                 15  |  -.1402704   .0177236    -7.91   0.000    -.1758693   -.1046715
                 16  |  -.0471325   .0329621    -1.43   0.159    -.1133389    .0190739
                     |
                marr |   .0368911   .0023314    15.82   0.000     .0322083    .0415738
               partt |  -.1325169   .0039874   -33.23   0.000    -.1405258   -.1245079
              public |   .0499063   .0059798     8.35   0.000     .0378956     .061917
                cmsa |   .1531423   .0080573    19.01   0.000     .1369587    .1693258
                     |
               nocc2 |
                  2  |  -.1535464   .0039809   -38.57   0.000    -.1615424   -.1455504
                  3  |  -.0513254   .0060751    -8.45   0.000    -.0635276   -.0391232
                  4  |  -.3077598   .0057495   -53.53   0.000    -.3193079   -.2962117
                  5  |   .0298843   .0068733     4.35   0.000     .0160788    .0436898
                  6  |  -.3538901   .0045762   -77.33   0.000    -.3630817   -.3446985
                  7  |  -.3772991   .0057003   -66.19   0.000    -.3887486   -.3658496
                  8  |  -.1789642   .0089399   -20.02   0.000    -.1969206   -.1610079
                  9  |  -.4203041   .0061813   -68.00   0.000    -.4327195   -.4078886
                 10  |  -.4509205   .0137265   -32.85   0.000     -.478491     -.42335
                 11  |  -.2109782   .0102275   -20.63   0.000    -.2315207   -.1904357
                 12  |   -.431318   .0126971   -33.97   0.000    -.4568209    -.405815
                     |
               unemp |  -.0029128   .0011752    -2.48   0.017    -.0052733   -.0005523
             citizen |  -.0303354    .003573    -8.49   0.000     -.037512   -.0231588
                     |
             quarter |
                  2  |      .0061   .0017375     3.51   0.001       .00261      .00959
                  3  |   .0155592   .0019152     8.12   0.000     .0117124    .0194061
                  4  |   .0190741   .0012042    15.84   0.000     .0166554    .0214928
                     |
               _cons |   .4125482   .0471704     8.75   0.000     .3178037    .5072926
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 6,607,298,283)

Linear regression                               Number of obs     =    708,498
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5531
                                                Root MSE          =     .41531

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1404436   .0149167    -9.42   0.000    -.1704048   -.1104825
            treat_st |  -.0285527   .0132158    -2.16   0.036    -.0550974   -.0020079
treat_sthisprelwhite |   .0282749   .0284041     1.00   0.324    -.0287765    .0853263
                     |
               state |
                 NH  |   .0908263   .0044651    20.34   0.000      .081858    .0997947
                 VT  |   .0305025   .0021344    14.29   0.000     .0262154    .0347895
                 MA  |   .1363222   .0084125    16.20   0.000     .1194252    .1532192
                 RI  |   .0471448   .0087491     5.39   0.000     .0295718    .0647178
                 CT  |   .1386415   .0085493    16.22   0.000     .1214697    .1558134
                 NY  |    .085973   .0090415     9.51   0.000     .0678126    .1041335
                 NJ  |   .1642257   .0099194    16.56   0.000      .144302    .1841494
                 PA  |   .0162654   .0064325     2.53   0.015     .0033453    .0291855
                 OH  |  -.0165365    .006253    -2.64   0.011    -.0290961    -.003977
                 IN  |   .0106345   .0061785     1.72   0.091    -.0017754    .0230444
                 IL  |   .0868107   .0089217     9.73   0.000      .068891    .1047304
                 MI  |   .0338166   .0080382     4.21   0.000     .0176714    .0499617
                 WI  |   .0328879   .0054295     6.06   0.000     .0219824    .0437935
                 MN  |   .0731229   .0060996    11.99   0.000     .0608715    .0853743
                 IA  |   .0224525   .0123324     1.82   0.075    -.0023177    .0472228
                 MO  |  -.0223765   .0057779    -3.87   0.000    -.0339817   -.0107714
                 ND  |   .0437661   .0123465     3.54   0.001     .0189675    .0685647
                 SD  |  -.0292897   .0119336    -2.45   0.018    -.0532591   -.0053202
                 NE  |  -.0122066   .0122641    -1.00   0.324    -.0368397    .0124265
                 KS  |  -.0008999   .0133559    -0.07   0.947     -.027726    .0259263
                 DE  |   .0496133   .0021955    22.60   0.000     .0452035     .054023
                 MD  |   .1529354   .0089853    17.02   0.000     .1348878     .170983
                 DC  |   .2537398   .0129845    19.54   0.000     .2276596      .27982
                 VA  |   .1512128   .0136099    11.11   0.000     .1238765    .1785491
                 WV  |   -.056579   .0037675   -15.02   0.000    -.0641461   -.0490118
                 NC  |   .0232483   .0150395     1.55   0.128    -.0069595     .053456
                 SC  |   .0089561   .0149889     0.60   0.553    -.0211501    .0390622
                 GA  |   .0642719   .0152097     4.23   0.000     .0337223    .0948214
                 FL  |   .0088415   .0165893     0.53   0.596     -.024479     .042162
                 KY  |  -.0312142   .0052508    -5.94   0.000    -.0417607   -.0206676
                 TN  |  -.0216828   .0146123    -1.48   0.144    -.0510324    .0076667
                 AL  |   .0190538   .0146689     1.30   0.200    -.0104096    .0485173
                 MS  |  -.0015617   .0154481    -0.10   0.920    -.0325901    .0294667
                 AR  |  -.0527087   .0142895    -3.69   0.001    -.0814099   -.0240075
                 LA  |   .0535182   .0153993     3.48   0.001     .0225878    .0844486
                 OK  |  -.0381882   .0107165    -3.56   0.001     -.059713   -.0166635
                 TX  |   .0601978   .0170458     3.53   0.001     .0259603    .0944353
                 MT  |  -.0299199   .0011423   -26.19   0.000    -.0322144   -.0276255
                 ID  |  -.0139369   .0054827    -2.54   0.014    -.0249492   -.0029246
                 WY  |    .170959   .0140278    12.19   0.000     .1427833    .1991346
                 CO  |   .0780273   .0084128     9.27   0.000     .0611298    .0949248
                 NM  |   .0408151   .0095948     4.25   0.000     .0215434    .0600869
                 AZ  |   .0618088   .0173284     3.57   0.001     .0270037    .0966138
                 UT  |   .0231889   .0138156     1.68   0.099    -.0045604    .0509383
                 NV  |   .1203003   .0171974     7.00   0.000     .0857583    .1548423
                 WA  |   .1231046    .007821    15.74   0.000     .1073956    .1388136
                 OR  |   .0519641   .0081425     6.38   0.000     .0356095    .0683188
                 CA  |   .1521366   .0139424    10.91   0.000     .1241324    .1801409
                 AK  |    .226019   .0064355    35.12   0.000      .213093     .238945
                 HI  |   .1532689   .0062034    24.71   0.000      .140809    .1657288
                     |
                year |
               1997  |   .0123273   .0034686     3.55   0.001     .0053603    .0192942
               1998  |   .0371021   .0043825     8.47   0.000     .0282997    .0459046
               1999  |   .0591742   .0056012    10.56   0.000     .0479238    .0704246
               2000  |   .0692809   .0065682    10.55   0.000     .0560882    .0824735
               2001  |    .093469   .0058269    16.04   0.000     .0817654    .1051727
               2002  |   .1103945   .0054951    20.09   0.000     .0993571    .1214318
               2003  |   .1002091   .0066155    15.15   0.000     .0869215    .1134968
               2004  |   .0881223   .0061579    14.31   0.000     .0757537    .1004908
               2005  |   .0714254    .006728    10.62   0.000     .0579118    .0849391
               2006  |   .0659165   .0074266     8.88   0.000     .0509997    .0808332
               2007  |   .0679891   .0082693     8.22   0.000     .0513797    .0845984
               2008  |   .0721625   .0082656     8.73   0.000     .0555606    .0887644
               2009  |   .1131739    .010845    10.44   0.000      .091391    .1349567
               2010  |   .1027309   .0105852     9.71   0.000     .0814699    .1239919
               2011  |   .0738348   .0094305     7.83   0.000     .0548931    .0927764
               2012  |   .0661035   .0099172     6.67   0.000     .0461842    .0860229
               2013  |   .0584177   .0084438     6.92   0.000     .0414579    .0753774
               2014  |   .0486435   .0081349     5.98   0.000      .032304    .0649829
               2015  |   .0640727   .0081312     7.88   0.000     .0477407    .0804047
               2016  |   .0791326   .0091234     8.67   0.000     .0608077    .0974575
               2017  |   .0804124   .0100648     7.99   0.000     .0601967     .100628
               2018  |   .0892793   .0097398     9.17   0.000     .0697163    .1088422
               2019  |   .1063088   .0094087    11.30   0.000     .0874109    .1252067
                     |
                nind |
                  2  |   .0398205    .030939     1.29   0.204    -.0223223    .1019632
                  3  |   .0868425   .0242815     3.58   0.001     .0380717    .1356133
                  4  |  -.0715171   .0295057    -2.42   0.019    -.1307811   -.0122531
                  5  |   .0869648   .0275636     3.16   0.003     .0316016    .1423279
                  6  |   .0937951   .0295664     3.17   0.003     .0344093    .1531809
                  7  |    .006976   .0273643     0.25   0.800    -.0479869    .0619388
                  8  |  -.0409393   .0277235    -1.48   0.146    -.0966236     .014745
                  9  |  -.0830953   .0273268    -3.04   0.004    -.1379828   -.0282078
                 10  |  -.0816667   .0295614    -2.76   0.008    -.1410426   -.0222908
                 11  |   .0814334   .0280576     2.90   0.005     .0250781    .1377888
                     |
                educ |   .0557984   .0020232    27.58   0.000     .0517346    .0598622
               exper |   .0451698   .0022649    19.94   0.000     .0406205     .049719
              exper2 |  -.0008847   .0001314    -6.73   0.000    -.0011486   -.0006207
              exper3 |   3.70e-06   3.95e-06     0.94   0.353    -4.23e-06    .0000116
              exper4 |   4.01e-08   4.04e-08     0.99   0.326    -4.10e-08    1.21e-07
                edex |    -.00059    .000068    -8.67   0.000    -.0007266   -.0004533
                     |
               ee_cl |
                  2  |  -.0436676    .005086    -8.59   0.000    -.0538831   -.0334521
                  3  |  -.0426431   .0096666    -4.41   0.000    -.0620591   -.0232271
                  4  |   .0450531   .0191055     2.36   0.022     .0066786    .0834275
                  5  |  -.0953747   .0055469   -17.19   0.000     -.106516   -.0842335
                  6  |  -.0874454   .0062601   -13.97   0.000    -.1000192   -.0748716
                  7  |  -.0407273   .0117073    -3.48   0.001     -.064242   -.0172126
                  8  |   .1272551   .0192071     6.63   0.000     .0886764    .1658338
                  9  |  -.1334285    .007552   -17.67   0.000    -.1485972   -.1182598
                 10  |  -.1033268   .0083598   -12.36   0.000    -.1201179   -.0865357
                 11  |  -.0291837   .0125213    -2.33   0.024    -.0543334    -.004034
                 12  |   .1305283   .0192269     6.79   0.000       .09191    .1691465
                 13  |  -.1190592    .013123    -9.07   0.000    -.1454174   -.0927009
                 14  |  -.0801721   .0086026    -9.32   0.000     -.097451   -.0628932
                 15  |  -.0111294    .012399    -0.90   0.374    -.0360335    .0137748
                 16  |   .1331007    .021059     6.32   0.000     .0908026    .1753989
                     |
                marr |   .1261304   .0027375    46.08   0.000      .120632    .1316287
               partt |  -.1866675   .0082287   -22.68   0.000    -.2031953   -.1701396
              public |  -.0173219   .0066191    -2.62   0.012    -.0306168    -.004027
                cmsa |   .1311233   .0080382    16.31   0.000      .114978    .1472685
                     |
               nocc2 |
                  2  |  -.1618459   .0044696   -36.21   0.000    -.1708234   -.1528683
                  3  |  -.0375979    .006968    -5.40   0.000    -.0515935   -.0236024
                  4  |  -.3379029   .0070586   -47.87   0.000    -.3520805   -.3237252
                  5  |   -.104305   .0124568    -8.37   0.000    -.1293252   -.0792847
                  6  |  -.4179353   .0077078   -54.22   0.000    -.4334168   -.4024538
                  7  |  -.2600841   .0095706   -27.18   0.000    -.2793071    -.240861
                  8  |  -.1061588   .0132832    -7.99   0.000    -.1328389   -.0794787
                  9  |  -.4395526    .006295   -69.83   0.000    -.4521964   -.4269088
                 10  |  -.4013426   .0116061   -34.58   0.000    -.4246542    -.378031
                 11  |  -.2930673   .0088926   -32.96   0.000    -.3109286   -.2752059
                 12  |  -.4521754     .01096   -41.26   0.000    -.4741892   -.4301616
                     |
               unemp |  -.0082267   .0019645    -4.19   0.000    -.0121724    -.004281
             citizen |  -.0353467   .0031781   -11.12   0.000      -.04173   -.0289634
                     |
             quarter |
                  2  |   .0043574    .001815     2.40   0.020     .0007119    .0080029
                  3  |   .0033785   .0020441     1.65   0.105    -.0007272    .0074842
                  4  |   .0144788   .0018595     7.79   0.000     .0107438    .0182137
                     |
               _cons |   .8378662   .0313148    26.76   0.000     .7749686    .9007639
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 6,178,829,603)

Linear regression                               Number of obs     =    698,882
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5107
                                                Root MSE          =     .39749

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1002617   .0164818    -6.08   0.000    -.1333664   -.0671571
            treat_st |  -.0274134   .0068806    -3.98   0.000    -.0412336   -.0135933
treat_sthisprelwhite |   .0101607   .0270733     0.38   0.709    -.0442177     .064539
                     |
               state |
                 NH  |   .0558766   .0036641    15.25   0.000      .048517    .0632361
                 VT  |   .0458265   .0016856    27.19   0.000     .0424409    .0492121
                 MA  |    .105851   .0084587    12.51   0.000     .0888613    .1228408
                 RI  |   .0053591    .009077     0.59   0.558    -.0128725    .0235907
                 CT  |   .1031694   .0086443    11.93   0.000     .0858068     .120532
                 NY  |   .0509878   .0090076     5.66   0.000     .0328955    .0690801
                 NJ  |   .1122922   .0101406    11.07   0.000     .0919242    .1326602
                 PA  |  -.0445914   .0064216    -6.94   0.000    -.0574896   -.0316931
                 OH  |  -.0673919   .0061838   -10.90   0.000    -.0798124   -.0549714
                 IN  |  -.0557528   .0052163   -10.69   0.000      -.06623   -.0452756
                 IL  |   .0161974   .0084452     1.92   0.061    -.0007653      .03316
                 MI  |  -.0337808   .0073945    -4.57   0.000    -.0486332   -.0189284
                 WI  |  -.0022156   .0048768    -0.45   0.652     -.012011    .0075797
                 MN  |   .0509524   .0057202     8.91   0.000     .0394631    .0624418
                 IA  |  -.0257045   .0068327    -3.76   0.000    -.0394283   -.0119806
                 MO  |  -.0752481   .0058256   -12.92   0.000    -.0869492   -.0635471
                 ND  |  -.0506199   .0066653    -7.59   0.000    -.0640076   -.0372322
                 SD  |  -.0667108   .0067151    -9.93   0.000    -.0801984   -.0532232
                 NE  |  -.0525311   .0071519    -7.35   0.000    -.0668961    -.038166
                 KS  |   -.055371   .0077232    -7.17   0.000    -.0708835   -.0398585
                 DE  |   .0301097    .001564    19.25   0.000     .0269684    .0332511
                 MD  |   .1078365   .0092011    11.72   0.000     .0893555    .1263174
                 DC  |    .209651   .0141253    14.84   0.000     .1812796    .2380225
                 VA  |   .0834956   .0093883     8.89   0.000     .0646387    .1023526
                 WV  |  -.1634834   .0024801   -65.92   0.000    -.1684648   -.1585019
                 NC  |  -.0191022    .009024    -2.12   0.039    -.0372275    -.000977
                 SC  |  -.0602205   .0093275    -6.46   0.000    -.0789553   -.0414857
                 GA  |  -.0001527    .009621    -0.02   0.987    -.0194771    .0191717
                 FL  |  -.0316241     .01064    -2.97   0.005    -.0529952   -.0102529
                 KY  |  -.0781546   .0047191   -16.56   0.000    -.0876333    -.068676
                 TN  |  -.0730707   .0090495    -8.07   0.000    -.0912472   -.0548942
                 AL  |  -.0719447   .0088735    -8.11   0.000    -.0897677   -.0541217
                 MS  |  -.0903801   .0086038   -10.50   0.000    -.1076614   -.0730987
                 AR  |  -.1034404   .0080493   -12.85   0.000    -.1196079   -.0872729
                 LA  |  -.0763472   .0099567    -7.67   0.000    -.0963458   -.0563487
                 OK  |  -.1277274   .0071126   -17.96   0.000    -.1420135   -.1134413
                 TX  |  -.0048432   .0105572    -0.46   0.648     -.026048    .0163616
                 MT  |  -.0657334   .0009503   -69.17   0.000    -.0676421   -.0638246
                 ID  |  -.0590404   .0042384   -13.93   0.000    -.0675536   -.0505273
                 WY  |    .020094   .0068882     2.92   0.005     .0062587    .0339293
                 CO  |   .0280842   .0083259     3.37   0.001      .011361    .0448073
                 NM  |  -.0484729    .009494    -5.11   0.000    -.0675421   -.0294037
                 AZ  |   .0213917   .0105345     2.03   0.048     .0002325    .0425509
                 UT  |  -.0341125    .009141    -3.73   0.000    -.0524727   -.0157523
                 NV  |   .0721644   .0105759     6.82   0.000      .050922    .0934068
                 WA  |   .0740648   .0081065     9.14   0.000     .0577824    .0903473
                 OR  |   .0073738   .0078881     0.93   0.354    -.0084698    .0232175
                 CA  |   .1143581   .0133875     8.54   0.000     .0874686    .1412476
                 AK  |   .1700621   .0060511    28.10   0.000     .1579081     .182216
                 HI  |   .0981166   .0067623    14.51   0.000      .084534    .1116991
                     |
                year |
               1997  |   .0124415   .0036569     3.40   0.001     .0050964    .0197867
               1998  |   .0412954   .0024369    16.95   0.000     .0364008      .04619
               1999  |   .0585724   .0046447    12.61   0.000     .0492433    .0679014
               2000  |   .0743741   .0042285    17.59   0.000     .0658809    .0828672
               2001  |   .0917297   .0051865    17.69   0.000     .0813123    .1021471
               2002  |   .1063504   .0052829    20.13   0.000     .0957394    .1169613
               2003  |   .1149903   .0058971    19.50   0.000     .1031456    .1268349
               2004  |   .1060279   .0048499    21.86   0.000     .0962867    .1157692
               2005  |   .0949787   .0049424    19.22   0.000     .0850516    .1049058
               2006  |   .0875489   .0039128    22.37   0.000     .0796898    .0954081
               2007  |   .0881739   .0047644    18.51   0.000     .0786044    .0977434
               2008  |   .0872067   .0065118    13.39   0.000     .0741274    .1002859
               2009  |   .1127214   .0086158    13.08   0.000     .0954162    .1300267
               2010  |    .108781   .0078642    13.83   0.000     .0929853    .1245768
               2011  |   .0890118   .0067057    13.27   0.000      .075543    .1024806
               2012  |   .0724786   .0056876    12.74   0.000     .0610548    .0839024
               2013  |    .069028   .0055787    12.37   0.000     .0578229     .080233
               2014  |   .0650718   .0056791    11.46   0.000     .0536651    .0764786
               2015  |   .0785444   .0049596    15.84   0.000     .0685827    .0885062
               2016  |   .0927584   .0058553    15.84   0.000     .0809977    .1045191
               2017  |     .10338   .0062028    16.67   0.000     .0909213    .1158386
               2018  |   .1055475   .0057679    18.30   0.000     .0939624    .1171326
               2019  |   .1176319   .0067507    17.43   0.000     .1040727     .131191
                     |
                nind |
                  2  |   .0383459    .032075     1.20   0.238    -.0260788    .1027705
                  3  |   .0998113   .0308313     3.24   0.002     .0378847    .1617378
                  4  |  -.0926026   .0305389    -3.03   0.004    -.1539417   -.0312635
                  5  |   .0830339   .0324001     2.56   0.013     .0179564    .1481115
                  6  |    .072161   .0330159     2.19   0.034     .0058466    .1384755
                  7  |   .0192319   .0330999     0.58   0.564    -.0472512    .0857151
                  8  |  -.0271972   .0333212    -0.82   0.418    -.0941248    .0397305
                  9  |  -.1023016   .0361553    -2.83   0.007    -.1749216   -.0296816
                 10  |  -.0756074   .0312398    -2.42   0.019    -.1383543   -.0128605
                 11  |   .0720764   .0380664     1.89   0.064    -.0043822    .1485351
                     |
                educ |   .0836504   .0031169    26.84   0.000     .0773899     .089911
               exper |   .0525254    .001648    31.87   0.000     .0492154    .0558354
              exper2 |  -.0014583   .0000918   -15.88   0.000    -.0016427   -.0012738
              exper3 |   .0000228   2.66e-06     8.56   0.000     .0000174    .0000281
              exper4 |  -1.29e-07   2.64e-08    -4.89   0.000    -1.82e-07   -7.62e-08
                edex |  -.0010191   .0000631   -16.16   0.000    -.0011457   -.0008924
                     |
               ee_cl |
                  2  |  -.1168222   .0075192   -15.54   0.000    -.1319248   -.1017195
                  3  |  -.1386028    .012661   -10.95   0.000    -.1640331   -.1131725
                  4  |  -.1121462   .0243355    -4.61   0.000    -.1610254    -.063267
                  5  |  -.1359344   .0081001   -16.78   0.000     -.152204   -.1196648
                  6  |  -.1713062   .0104461   -16.40   0.000    -.1922879   -.1503245
                  7  |    -.14768   .0162441    -9.09   0.000    -.1803072   -.1150527
                  8  |   -.024738   .0271471    -0.91   0.367    -.0792646    .0297886
                  9  |  -.1644221   .0087041   -18.89   0.000    -.1819047   -.1469395
                 10  |  -.1848032    .010975   -16.84   0.000    -.2068471   -.1627593
                 11  |  -.1463284   .0153315    -9.54   0.000    -.1771226   -.1155342
                 12  |  -.0326212   .0261847    -1.25   0.219    -.0852147    .0199722
                 13  |  -.1745266   .0107153   -16.29   0.000    -.1960489   -.1530044
                 14  |  -.1711784   .0102213   -16.75   0.000    -.1917085   -.1506484
                 15  |  -.1138874   .0161184    -7.07   0.000    -.1462621   -.0815127
                 16  |  -.0158647   .0299109    -0.53   0.598    -.0759425    .0442131
                     |
                marr |    .041445   .0025496    16.26   0.000     .0363239     .046566
               partt |  -.1296092     .00328   -39.52   0.000    -.1361972   -.1230211
              public |   .0024966   .0057915     0.43   0.668     -.009136    .0141291
                cmsa |   .1546409   .0078386    19.73   0.000     .1388965    .1703852
                     |
               nocc2 |
                  2  |  -.1601151   .0037548   -42.64   0.000    -.1676568   -.1525735
                  3  |  -.0504886   .0062926    -8.02   0.000    -.0631277   -.0378495
                  4  |  -.3526673   .0044211   -79.77   0.000    -.3615474   -.3437873
                  5  |   .0091374   .0087246     1.05   0.300    -.0083865    .0266614
                  6  |  -.3676671    .005211   -70.56   0.000    -.3781337   -.3572005
                  7  |  -.3935199   .0066017   -59.61   0.000    -.4067798   -.3802601
                  8  |   -.190367   .0085063   -22.38   0.000    -.2074524   -.1732815
                  9  |  -.4413033   .0067324   -65.55   0.000    -.4548256    -.427781
                 10  |  -.4868998   .0139544   -34.89   0.000     -.514928   -.4588717
                 11  |  -.2762202   .0064951   -42.53   0.000    -.2892659   -.2631745
                 12  |  -.4772063   .0159668   -29.89   0.000    -.5092765   -.4451361
                     |
               unemp |    -.00306   .0013399    -2.28   0.027    -.0057514   -.0003687
             citizen |  -.0284972   .0034697    -8.21   0.000    -.0354663   -.0215281
                     |
             quarter |
                  2  |    .007407   .0017305     4.28   0.000     .0039312    .0108828
                  3  |   .0159749   .0021927     7.29   0.000     .0115708     .020379
                  4  |     .02049   .0012919    15.86   0.000     .0178951    .0230849
                     |
               _cons |   .4993739   .0451168    11.07   0.000     .4087541    .5899937
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,161,701,330)

Linear regression                               Number of obs     =    125,874
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3569
                                                Root MSE          =     .36466

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0707191   .0064506   -10.96   0.000    -.0836755   -.0577628
            treat_st |  -.0517761   .0275583    -1.88   0.066    -.1071286    .0035764
treat_sthisprelwhite |   .0032104   .0283549     0.11   0.910     -.053742    .0601629
                     |
               state |
                 NH  |   .0434295   .0088929     4.88   0.000     .0255676    .0612915
                 VT  |  -.0108474   .0052251    -2.08   0.043    -.0213424   -.0003525
                 MA  |   .1104947   .0117212     9.43   0.000     .0869521    .1340374
                 RI  |    .055002   .0115916     4.74   0.000     .0317197    .0782844
                 CT  |   .1520346   .0113165    13.43   0.000     .1293046    .1747645
                 NY  |   .1331792   .0098107    13.57   0.000     .1134738    .1528846
                 NJ  |    .203922   .0112711    18.09   0.000     .1812833    .2265606
                 PA  |   .0082048   .0080061     1.02   0.310    -.0078758    .0242854
                 OH  |   .0018249   .0071451     0.26   0.799    -.0125265    .0161763
                 IN  |   .0294314   .0080456     3.66   0.001     .0132713    .0455914
                 IL  |   .1135645   .0090097    12.60   0.000      .095468    .1316609
                 MI  |   .0826707   .0095613     8.65   0.000     .0634662    .1018752
                 WI  |   .0412425    .006948     5.94   0.000     .0272869     .055198
                 MN  |   .0652417   .0094671     6.89   0.000     .0462265    .0842569
                 IA  |    .019252   .0254435     0.76   0.453    -.0318527    .0703568
                 MO  |    .028504   .0083804     3.40   0.001     .0116715    .0453366
                 ND  |   .0356923   .0250686     1.42   0.161    -.0146594     .086044
                 SD  |  -.0032241   .0251594    -0.13   0.899    -.0537583    .0473101
                 NE  |  -.0045109   .0249051    -0.18   0.857    -.0545342    .0455124
                 KS  |   .0663107   .0261244     2.54   0.014     .0138383    .1187831
                 DE  |   .0763994   .0025766    29.65   0.000     .0712241    .0815747
                 MD  |   .1315508   .0125124    10.51   0.000     .1064188    .1566827
                 DC  |   .2374348   .0130338    18.22   0.000     .2112558    .2636139
                 VA  |   .1795773   .0260484     6.89   0.000     .1272575    .2318971
                 WV  |  -.0153693   .0093681    -1.64   0.107    -.0341857     .003447
                 NC  |   .0387012   .0290526     1.33   0.189    -.0196527    .0970551
                 SC  |    .006973   .0298406     0.23   0.816    -.0529635    .0669096
                 GA  |   .0832225   .0290187     2.87   0.006     .0249367    .1415083
                 FL  |   .0411243   .0296658     1.39   0.172    -.0184613    .1007099
                 KY  |  -.0278828   .0082115    -3.40   0.001     -.044376   -.0113896
                 TN  |   .0161475   .0288485     0.56   0.578    -.0417964    .0740914
                 AL  |   .0357203   .0286758     1.25   0.219    -.0218767    .0933173
                 MS  |   .0135739   .0310981     0.44   0.664    -.0488885    .0760363
                 AR  |   -.006181   .0288154    -0.21   0.831    -.0640584    .0516963
                 LA  |   .0698909   .0289249     2.42   0.019     .0117935    .1279883
                 OK  |  -.0248742   .0189502    -1.31   0.195    -.0629367    .0131883
                 TX  |   .0637965   .0293425     2.17   0.034     .0048604    .1227325
                 MT  |  -.0559278   .0041699   -13.41   0.000    -.0643034   -.0475522
                 ID  |  -.0135485   .0047782    -2.84   0.007    -.0231459   -.0039512
                 WY  |   .2039274   .0295363     6.90   0.000     .1446021    .2632527
                 CO  |   .0207333   .0105364     1.97   0.055    -.0004297    .0418964
                 NM  |  -.0290236   .0099595    -2.91   0.005    -.0490278   -.0090195
                 AZ  |   .0888065   .0306693     2.90   0.006     .0272055    .1504076
                 UT  |   .0274775   .0273033     1.01   0.319    -.0273628    .0823178
                 NV  |   .1759408   .0323376     5.44   0.000     .1109888    .2408928
                 WA  |   .1187353   .0086952    13.66   0.000     .1012704    .1362002
                 OR  |   .0366749    .009285     3.95   0.000     .0180255    .0553243
                 CA  |   .1871164   .0120823    15.49   0.000     .1628485    .2113844
                 AK  |    .220785   .0097064    22.75   0.000     .2012892    .2402808
                 HI  |   .1023573   .0100563    10.18   0.000     .0821585    .1225561
                     |
                year |
               1997  |   .0015419   .0057538     0.27   0.790     -.010015    .0130988
               1998  |   .0119701   .0080144     1.49   0.142    -.0041274    .0280675
               1999  |   .0182679   .0082929     2.20   0.032     .0016111    .0349247
               2000  |   .0222577   .0080874     2.75   0.008     .0060136    .0385018
               2001  |   .0233476   .0082124     2.84   0.006     .0068525    .0398428
               2002  |   .0413175   .0062501     6.61   0.000     .0287638    .0538713
               2003  |   .0498496   .0087022     5.73   0.000     .0323707    .0673285
               2004  |   .0396569   .0051305     7.73   0.000      .029352    .0499618
               2005  |   .0351352   .0073573     4.78   0.000     .0203576    .0499128
               2006  |   .0214216   .0115971     1.85   0.071    -.0018718     .044715
               2007  |    .028536   .0127577     2.24   0.030     .0029114    .0541606
               2008  |   .0238919   .0080914     2.95   0.005     .0076399    .0401438
               2009  |   .0557091   .0127524     4.37   0.000     .0300951    .0813232
               2010  |   .0620932   .0145024     4.28   0.000     .0329642    .0912222
               2011  |   .0414238    .013312     3.11   0.003     .0146858    .0681617
               2012  |   .0248838   .0090915     2.74   0.009      .006623    .0431446
               2013  |   .0237924   .0086861     2.74   0.009     .0063459    .0412389
               2014  |   .0168664   .0118001     1.43   0.159    -.0068347    .0405676
               2015  |   .0228075   .0106031     2.15   0.036     .0015106    .0441045
               2016  |    .028777   .0124814     2.31   0.025     .0037073    .0538467
               2017  |   .0414444   .0121311     3.42   0.001     .0170784    .0658103
               2018  |   .0436739   .0118847     3.67   0.001     .0198029     .067545
               2019  |   .0425483   .0129974     3.27   0.002     .0164422    .0686543
                     |
                nind |
                  2  |    .116313   .0594212     1.96   0.056    -.0030379     .235664
                  3  |  -.0138636   .0522711    -0.27   0.792    -.1188531     .091126
                  4  |  -.1909519   .0626458    -3.05   0.004    -.3167796   -.0651242
                  5  |   .1188059   .0515374     2.31   0.025       .01529    .2223217
                  6  |  -.0425602   .0611631    -0.70   0.490    -.1654099    .0802895
                  7  |  -.0311785   .0510466    -0.61   0.544    -.1337086    .0713515
                  8  |  -.1337101   .0541732    -2.47   0.017    -.2425202      -.0249
                  9  |  -.1114267   .0528507    -2.11   0.040    -.2175805   -.0052729
                 10  |   -.125208   .0709221    -1.77   0.084    -.2676592    .0172431
                 11  |   .1315744   .0604677     2.18   0.034     .0101215    .2530273
                     |
                educ |   .0734869   .0049839    14.74   0.000     .0634765    .0834973
               exper |   .0739429   .0035089    21.07   0.000     .0668951    .0809907
              exper2 |  -.0025219   .0002886    -8.74   0.000    -.0031015   -.0019423
              exper3 |   .0000491   9.23e-06     5.32   0.000     .0000306    .0000677
              exper4 |  -3.90e-07   9.56e-08    -4.07   0.000    -5.82e-07   -1.98e-07
                edex |  -.0009382   .0001239    -7.57   0.000    -.0011872   -.0006893
                     |
               ee_cl |
                  2  |   .0540472   .0164414     3.29   0.002     .0210238    .0870707
                  3  |   .0337537   .0182189     1.85   0.070    -.0028401    .0703475
                  4  |  -.0054404   .0297555    -0.18   0.856     -.065206    .0543252
                  5  |   .0062163   .0237291     0.26   0.794    -.0414451    .0538777
                  6  |   .0188018    .016128     1.17   0.249    -.0135922    .0511958
                  7  |   .0373458   .0208823     1.79   0.080    -.0045976    .0792891
                  8  |  -.0046463   .0282589    -0.16   0.870     -.061406    .0521133
                  9  |   -.006772   .0248439    -0.27   0.786    -.0566724    .0431284
                 10  |  -.0011324   .0203089    -0.06   0.956    -.0419239    .0396592
                 11  |   .0194454   .0246221     0.79   0.433    -.0300095    .0689003
                 12  |   .0417239   .0311305     1.34   0.186    -.0208036    .1042515
                 13  |  -.0255489   .0255135    -1.00   0.321    -.0767943    .0256965
                 14  |  -.0084926   .0210748    -0.40   0.689    -.0508226    .0338374
                 15  |   .0073113   .0234238     0.31   0.756    -.0397367    .0543593
                 16  |   .0636054    .030952     2.05   0.045     .0014364    .1257744
                     |
                marr |    .071006    .004375    16.23   0.000     .0622186    .0797933
               partt |  -.0911956   .0139585    -6.53   0.000     -.119232   -.0631592
              public |  -.0535344   .0076874    -6.96   0.000     -.068975   -.0380938
                cmsa |   .1102175   .0118938     9.27   0.000      .086328     .134107
                     |
               nocc2 |
                  2  |  -.0457648   .0110812    -4.13   0.000    -.0680221   -.0235075
                  3  |  -.0194522   .0126297    -1.54   0.130    -.0448197    .0059153
                  4  |  -.0746601   .0139047    -5.37   0.000    -.1025886   -.0467317
                  5  |  -.0120825   .0195339    -0.62   0.539    -.0513176    .0271526
                  6  |  -.2633923   .0082971   -31.75   0.000    -.2800575    -.246727
                  7  |  -.2172056   .0154783   -14.03   0.000    -.2482947   -.1861166
                  8  |  -.0235012   .0502354    -0.47   0.642    -.1244019    .0773996
                  9  |  -.2178655   .0111831   -19.48   0.000    -.2403274   -.1954036
                 10  |  -.1550578   .0079084   -19.61   0.000    -.1709423   -.1391734
                 11  |  -.0676724   .0083947    -8.06   0.000    -.0845336   -.0508112
                 12  |  -.2033528   .0083266   -24.42   0.000    -.2200772   -.1866285
                     |
               unemp |  -.0055049   .0035961    -1.53   0.132    -.0127279    .0017182
             citizen |  -.0441224   .0028902   -15.27   0.000    -.0499275   -.0383174
                     |
             quarter |
                  2  |   .0036869   .0026754     1.38   0.174    -.0016867    .0090605
                  3  |    .006792   .0028393     2.39   0.021      .001089     .012495
                  4  |   .0110103   .0027115     4.06   0.000      .005564    .0164566
                     |
               _cons |   .5315666   .0857671     6.20   0.000     .3592984    .7038349
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 938,651,389)

Linear regression                               Number of obs     =    106,871
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4427
                                                Root MSE          =     .36807

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0551045   .0093165    -5.91   0.000    -.0738173   -.0363917
            treat_st |  -.0570959   .0171597    -3.33   0.002    -.0915621   -.0226296
treat_sthisprelwhite |   .0574228   .0233833     2.46   0.018     .0104561    .1043895
                     |
               state |
                 NH  |   .0515384   .0063384     8.13   0.000     .0388074    .0642694
                 VT  |  -.0104669   .0029881    -3.50   0.001    -.0164686   -.0044653
                 MA  |   .1451239   .0097495    14.89   0.000     .1255414    .1647064
                 RI  |   .1645726   .0098489    16.71   0.000     .1447905    .1843547
                 CT  |   .1791314   .0100177    17.88   0.000     .1590103    .1992525
                 NY  |   .1369617   .0086174    15.89   0.000     .1196532    .1542703
                 NJ  |   .2366847   .0098318    24.07   0.000     .2169369    .2564325
                 PA  |   .0482255   .0075411     6.40   0.000     .0330788    .0633721
                 OH  |   .0153451   .0079691     1.93   0.060    -.0006613    .0313516
                 IN  |   .0146653   .0075356     1.95   0.057    -.0004704    .0298011
                 IL  |   .0477929   .0081311     5.88   0.000     .0314612    .0641246
                 MI  |     .08547   .0096052     8.90   0.000     .0661773    .1047627
                 WI  |   .0484001   .0065126     7.43   0.000     .0353191     .061481
                 MN  |   .0840136   .0075177    11.18   0.000     .0689138    .0991134
                 IA  |   .0414491   .0163904     2.53   0.015     .0085279    .0743702
                 MO  |  -.0603551   .0081103    -7.44   0.000    -.0766452    -.044065
                 ND  |   .0157119   .0159574     0.98   0.330    -.0163395    .0477633
                 SD  |  -.0358619   .0156673    -2.29   0.026    -.0673307   -.0043932
                 NE  |  -.0275846   .0157007    -1.76   0.085    -.0591205    .0039513
                 KS  |  -.0016853   .0162496    -0.10   0.918    -.0343236     .030953
                 DE  |   .1441371   .0025137    57.34   0.000     .1390882    .1491859
                 MD  |   .1822044   .0107903    16.89   0.000     .1605314    .2038774
                 DC  |   .2384489   .0123505    19.31   0.000     .2136423    .2632556
                 VA  |   .1904989   .0175558    10.85   0.000      .155237    .2257607
                 WV  |  -.0694343   .0036216   -19.17   0.000    -.0767085   -.0621602
                 NC  |   .0614648   .0178507     3.44   0.001     .0256105    .0973191
                 SC  |  -.0245129   .0184085    -1.33   0.189    -.0614876    .0124617
                 GA  |   .0589381   .0179136     3.29   0.002     .0229576    .0949186
                 FL  |   .0375515   .0181297     2.07   0.044     .0011368    .0739661
                 KY  |  -.0435556   .0070908    -6.14   0.000    -.0577978   -.0293133
                 TN  |   .0102844   .0175229     0.59   0.560    -.0249115    .0454802
                 AL  |  -.0446768    .017237    -2.59   0.012    -.0792983   -.0100553
                 MS  |  -.0361884   .0187977    -1.93   0.060    -.0739447    .0015678
                 AR  |   -.043824   .0179635    -2.44   0.018    -.0799046   -.0077433
                 LA  |  -.0017301   .0186375    -0.09   0.926    -.0391647    .0357045
                 OK  |  -.1195567   .0123636    -9.67   0.000    -.1443897   -.0947236
                 TX  |   .0461248   .0181684     2.54   0.014     .0096325    .0826171
                 MT  |  -.0923657   .0029898   -30.89   0.000    -.0983708   -.0863606
                 ID  |  -.0642143   .0040089   -16.02   0.000    -.0722664   -.0561622
                 WY  |   .0964683   .0167834     5.75   0.000     .0627578    .1301788
                 CO  |   .0211045     .01032     2.05   0.046     .0003762    .0418329
                 NM  |  -.0436365   .0073616    -5.93   0.000    -.0584228   -.0288502
                 AZ  |   .0541856   .0192922     2.81   0.007      .015436    .0929352
                 UT  |     .00671   .0181165     0.37   0.713    -.0296781    .0430981
                 NV  |   .1826252   .0216134     8.45   0.000     .1392134    .2260369
                 WA  |   .0890237   .0090927     9.79   0.000     .0707605     .107287
                 OR  |    .026924   .0081273     3.31   0.002     .0105998    .0432482
                 CA  |    .213888    .010401    20.56   0.000      .192997    .2347791
                 AK  |   .2152616   .0063437    33.93   0.000     .2025199    .2280033
                 HI  |   .0847189   .0073427    11.54   0.000     .0699707    .0994671
                     |
                year |
               1997  |   -.005777   .0081312    -0.71   0.481     -.022109     .010555
               1998  |   .0055654    .008557     0.65   0.518    -.0116219    .0227527
               1999  |   .0129047   .0110695     1.17   0.249    -.0093289    .0351384
               2000  |   .0076171   .0109806     0.69   0.491    -.0144381    .0296723
               2001  |    .019966   .0099913     2.00   0.051    -.0001022    .0400342
               2002  |   .0376964   .0102337     3.68   0.001     .0171413    .0582514
               2003  |   .0291078   .0093496     3.11   0.003     .0103286    .0478871
               2004  |   .0246941    .007646     3.23   0.002     .0093367    .0400516
               2005  |   .0101085   .0098696     1.02   0.311    -.0097153    .0299322
               2006  |   .0132354   .0113111     1.17   0.247    -.0094836    .0359544
               2007  |   .0110934   .0117891     0.94   0.351    -.0125858    .0347725
               2008  |   .0115741   .0075207     1.54   0.130    -.0035317      .02668
               2009  |   .0404197   .0092082     4.39   0.000     .0219245    .0589149
               2010  |   .0421389   .0093011     4.53   0.000      .023457    .0608207
               2011  |   .0144514   .0077808     1.86   0.069    -.0011768    .0300796
               2012  |  -.0029859   .0074422    -0.40   0.690    -.0179341    .0119623
               2013  |  -.0054496   .0075169    -0.72   0.472    -.0205477    .0096484
               2014  |  -.0265709   .0110012    -2.42   0.019    -.0486675   -.0044742
               2015  |  -.0030261   .0075975    -0.40   0.692    -.0182862    .0122339
               2016  |   .0063674   .0110439     0.58   0.567     -.015815    .0285498
               2017  |  -.0077057   .0141817    -0.54   0.589    -.0361904    .0207791
               2018  |  -.0069801   .0126655    -0.55   0.584    -.0324195    .0184592
               2019  |  -.0090221   .0119216    -0.76   0.453    -.0329674    .0149231
                     |
                nind |
                  2  |   .1012227   .0611738     1.65   0.104    -.0216485    .2240939
                  3  |   .0664249   .0510935     1.30   0.200    -.0361994    .1690491
                  4  |  -.1950204   .0600775    -3.25   0.002    -.3156895   -.0743513
                  5  |    .170362   .0523287     3.26   0.002     .0652567    .2754672
                  6  |  -.0066343   .0485486    -0.14   0.892    -.1041471    .0908785
                  7  |   -.055468   .0488025    -1.14   0.261    -.1534906    .0425547
                  8  |   -.093876   .0606102    -1.55   0.128    -.2156151    .0278631
                  9  |  -.1543337   .0571337    -2.70   0.009    -.2690902   -.0395772
                 10  |  -.1034292    .050858    -2.03   0.047    -.2055805   -.0012779
                 11  |   .0420041   .0566439     0.74   0.462    -.0717685    .1557767
                     |
                educ |    .114122   .0070442    16.20   0.000     .0999733    .1282708
               exper |   .0567555   .0046617    12.17   0.000     .0473923    .0661187
              exper2 |  -.0017563   .0002106    -8.34   0.000    -.0021792   -.0013333
              exper3 |   .0000326   7.34e-06     4.44   0.000     .0000179    .0000473
              exper4 |  -2.39e-07   8.28e-08    -2.89   0.006    -4.05e-07   -7.26e-08
                edex |  -.0009096   .0001731    -5.25   0.000    -.0012573   -.0005619
                     |
               ee_cl |
                  2  |  -.0730067   .0310013    -2.35   0.022    -.1352746   -.0107388
                  3  |   -.130096   .0285905    -4.55   0.000    -.1875216   -.0726703
                  4  |  -.1910747   .0517751    -3.69   0.001    -.2950681   -.0870813
                  5  |  -.0240749    .025535    -0.94   0.350    -.0753636    .0272137
                  6  |  -.1232727   .0261328    -4.72   0.000    -.1757619   -.0707834
                  7  |  -.1609613   .0308719    -5.21   0.000    -.2229694   -.0989532
                  8  |  -.1788826   .0525007    -3.41   0.001    -.2843335   -.0734318
                  9  |  -.0248186    .026527    -0.94   0.354    -.0780997    .0284624
                 10  |  -.1576519    .029812    -5.29   0.000    -.2175311   -.0977728
                 11  |   -.184977   .0335525    -5.51   0.000    -.2523692   -.1175849
                 12  |  -.1600056   .0509325    -3.14   0.003    -.2623065   -.0577046
                 13  |  -.0329676   .0313795    -1.05   0.298    -.0959952    .0300601
                 14  |  -.1526854   .0300633    -5.08   0.000    -.2130692   -.0923015
                 15  |  -.1597621   .0374301    -4.27   0.000    -.2349426   -.0845815
                 16  |  -.1165658   .0558326    -2.09   0.042    -.2287088   -.0044227
                     |
                marr |   .0094142   .0024876     3.78   0.000     .0044177    .0144107
               partt |  -.0713849   .0088937    -8.03   0.000    -.0892484   -.0535213
              public |   .0105184   .0150135     0.70   0.487    -.0196372    .0406739
                cmsa |    .115933   .0106477    10.89   0.000     .0945464    .1373196
                     |
               nocc2 |
                  2  |  -.0595886   .0154402    -3.86   0.000    -.0906011   -.0285761
                  3  |  -.0290251   .0143209    -2.03   0.048    -.0577895   -.0002607
                  4  |  -.1303963   .0115053   -11.33   0.000    -.1535053   -.1072873
                  5  |   .1348152   .0153902     8.76   0.000      .103903    .1657274
                  6  |  -.2472178   .0100034   -24.71   0.000    -.2673102   -.2271253
                  7  |  -.2677279   .0199373   -13.43   0.000    -.3077731   -.2276827
                  8  |  -.0926238   .0505957    -1.83   0.073    -.1942483    .0090007
                  9  |  -.3035304   .0176776   -17.17   0.000     -.339037   -.2680239
                 10  |   -.271222   .0214402   -12.65   0.000    -.3142859   -.2281581
                 11  |   .0119591   .0302474     0.40   0.694    -.0487946    .0727129
                 12  |  -.2567147   .0138974   -18.47   0.000    -.2846284    -.228801
                     |
               unemp |  -.0025335   .0020773    -1.22   0.228    -.0067059    .0016388
             citizen |  -.0324317   .0042589    -7.62   0.000     -.040986   -.0238774
                     |
             quarter |
                  2  |   .0000258   .0034912     0.01   0.994    -.0069866    .0070381
                  3  |   .0133023   .0042963     3.10   0.003     .0046729    .0219317
                  4  |   .0142317   .0040459     3.52   0.001     .0061053    .0223581
                     |
               _cons |   .1157312   .0643429     1.80   0.078    -.0135055    .2449678
--------------------------------------------------------------------------------------

. 
. ** RUST BELT ONLY BLACK-WHITE + WV, KY - IA
. keep if inrange(state, 31, 35) | inlist(state, 23, 41, 43) | inlist(state, 55, 61)
(2,305,190 observations deleted)

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper expe
> r2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 0, vce(cluster state) 
(sum of wgt is 2,898,944,040)

Linear regression                               Number of obs     =    292,705
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2306
                                                Root MSE          =     .36083

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0660871   .0109609     6.03   0.000     .0412919    .0908823
             treat_st |  -.0222228   .0063504    -3.50   0.007    -.0365885   -.0078571
treat_stblackrelwhite |  -.0284392   .0128759    -2.21   0.055    -.0575665    .0006881
                      |
                state |
                  OH  |  -.0115147   .0007148   -16.11   0.000    -.0131317   -.0098978
                  IN  |   -.033239   .0029557   -11.25   0.000    -.0399253   -.0265528
                  IL  |   .0219203   .0010581    20.72   0.000     .0195266     .024314
                  MI  |   .0313912   .0024927    12.59   0.000     .0257523    .0370301
                  WI  |  -.0231551   .0031619    -7.32   0.000    -.0303079   -.0160023
                  MN  |   .0042433   .0016471     2.58   0.030     .0005173    .0079693
                  MO  |  -.0322524   .0008126   -39.69   0.000    -.0340905   -.0304142
                  WV  |  -.0386965   .0090175    -4.29   0.002    -.0590956   -.0182975
                  KY  |  -.0661987   .0034652   -19.10   0.000    -.0740376   -.0583597
                      |
                 year |
                1990  |   -.004424   .0048174    -0.92   0.382    -.0153218    .0064738
                1991  |  -.0041951   .0045916    -0.91   0.385     -.014582    .0061918
                1992  |  -.0114752   .0059753    -1.92   0.087    -.0249922    .0020419
                1993  |  -.0161458   .0061469    -2.63   0.028    -.0300511   -.0022405
                1996  |  -.0318674   .0086188    -3.70   0.005    -.0513644   -.0123703
                1997  |   -.036508   .0081179    -4.50   0.001     -.054872   -.0181441
                1998  |  -.0453987   .0085524    -5.31   0.000    -.0647455   -.0260519
                1999  |  -.0446196   .0072336    -6.17   0.000    -.0609831    -.028256
                2000  |  -.0502073   .0086818    -5.78   0.000    -.0698468   -.0305678
                2001  |  -.0536073   .0099667    -5.38   0.000    -.0761535    -.031061
                2002  |  -.0592369   .0121991    -4.86   0.001    -.0868331   -.0316406
                2003  |  -.0638392   .0101938    -6.26   0.000    -.0868991   -.0407794
                2004  |  -.0668387   .0106734    -6.26   0.000    -.0909836   -.0426937
                2005  |   -.082113   .0106431    -7.72   0.000    -.1061893   -.0580368
                2006  |  -.0862617   .0128011    -6.74   0.000    -.1152198   -.0573035
                2007  |  -.0850139   .0098181    -8.66   0.000     -.107224   -.0628038
                2008  |  -.0769629   .0126563    -6.08   0.000    -.1055934   -.0483323
                2009  |  -.0705215   .0083204    -8.48   0.000    -.0893435   -.0516995
                2010  |  -.0786096   .0086575    -9.08   0.000    -.0981942    -.059025
                2011  |   -.078849   .0076896   -10.25   0.000    -.0962441   -.0614539
                2012  |  -.0850277   .0081428   -10.44   0.000     -.103448   -.0666074
                2013  |  -.0811478   .0080911   -10.03   0.000    -.0994513   -.0628444
                2014  |  -.0847337    .009675    -8.76   0.000    -.1066201   -.0628473
                2015  |  -.0918757   .0086585   -10.61   0.000    -.1114625   -.0722889
                2016  |  -.0922774   .0097971    -9.42   0.000    -.1144401   -.0701147
                2017  |  -.0776705   .0091296    -8.51   0.000     -.098323   -.0570179
                2018  |  -.0790811   .0084839    -9.32   0.000    -.0982729   -.0598893
                2019  |  -.0885408   .0098301    -9.01   0.000    -.1107781   -.0663035
                      |
                 nind |
                   2  |   .1626237   .0271459     5.99   0.000     .1012155     .224032
                   3  |    .115292   .0208346     5.53   0.000     .0681607    .1624232
                   4  |   .0111171   .0197267     0.56   0.587    -.0335077     .055742
                   5  |   .1816261   .0232899     7.80   0.000     .1289407    .2343116
                   6  |   .0027308   .0188517     0.14   0.888    -.0399148    .0453763
                   7  |  -.0144938   .0187445    -0.77   0.459    -.0568968    .0279092
                   8  |   .0074289   .0229459     0.32   0.754    -.0444783    .0593362
                   9  |   .1415758   .0210509     6.73   0.000     .0939554    .1891962
                  10  |  -.0247832   .0194446    -1.27   0.234    -.0687699    .0192035
                  11  |   .1143674   .0268018     4.27   0.002     .0537376    .1749973
                      |
                 educ |   .0119949   .0029616     4.05   0.003     .0052953    .0186945
                exper |   .0065111   .0020127     3.23   0.010      .001958    .0110642
               exper2 |   .0001472   .0001033     1.42   0.188    -.0000866    .0003809
               exper3 |  -3.14e-06   3.47e-06    -0.91   0.389     -.000011    4.71e-06
               exper4 |  -2.06e-08   3.77e-08    -0.54   0.599    -1.06e-07    6.48e-08
                 edex |  -.0002615   .0000944    -2.77   0.022     -.000475    -.000048
                      |
                ee_cl |
                   2  |  -.0373036   .0075995    -4.91   0.001    -.0544949   -.0201124
                   3  |  -.0257982   .0087355    -2.95   0.016    -.0455594    -.006037
                   4  |  -.0423642   .0154933    -2.73   0.023    -.0774124    -.007316
                   5  |  -.0944522   .0131101    -7.20   0.000    -.1241094    -.064795
                   6  |  -.0177736   .0084434    -2.11   0.065    -.0368739    .0013267
                   7  |  -.0006604    .010348    -0.06   0.951    -.0240693    .0227484
                   8  |  -.0623042   .0175794    -3.54   0.006    -.1020716   -.0225368
                   9  |  -.0652398   .0132357    -4.93   0.001     -.095181   -.0352987
                  10  |   .0081556   .0121811     0.67   0.520    -.0193998    .0357111
                  11  |  -.0046356   .0134457    -0.34   0.738    -.0350519    .0257807
                  12  |  -.0909221   .0184505    -4.93   0.001    -.1326601   -.0491842
                  13  |   .0198312    .016386     1.21   0.257    -.0172364    .0568989
                  14  |   .0157563   .0121912     1.29   0.228     -.011822    .0433347
                  15  |  -.0084815   .0139601    -0.61   0.559    -.0400614    .0230985
                  16  |  -.1042511   .0207845    -5.02   0.001    -.1512688   -.0572333
                      |
                 marr |   .0199741    .002172     9.20   0.000     .0150608    .0248875
                partt |  -.0710663   .0059372   -11.97   0.000    -.0844972   -.0576355
               public |   .2885801    .030757     9.38   0.000     .2190029    .3581573
                 cmsa |   .0528581   .0102601     5.15   0.001     .0296481    .0760681
                      |
                nocc2 |
                   2  |   .0605983   .0035916    16.87   0.000     .0524736    .0687231
                   3  |    .031794   .0031725    10.02   0.000     .0246174    .0389706
                   4  |   .2057711   .0065425    31.45   0.000      .190971    .2205712
                   5  |   .1547369   .0081204    19.06   0.000     .1363673    .1731065
                   6  |   .1639839   .0049439    33.17   0.000     .1528001    .1751678
                   7  |   .0816716   .0034291    23.82   0.000     .0739144    .0894288
                   8  |   .0851778   .0119233     7.14   0.000     .0582054    .1121502
                   9  |   .1962836   .0078249    25.08   0.000     .1785823    .2139848
                  10  |   .2430414    .008691    27.96   0.000      .223381    .2627017
                  11  |   .2706514   .0110373    24.52   0.000     .2456832    .2956196
                  12  |   .2619984   .0119476    21.93   0.000     .2349711    .2890257
                      |
                unemp |  -.0020283   .0012819    -1.58   0.148    -.0049281    .0008716
                      |
              quarter |
                   2  |  -.0060425   .0025511    -2.37   0.042    -.0118136   -.0002714
                   3  |  -.0051066   .0028008    -1.82   0.102    -.0114424    .0012292
                   4  |  -.0073759   .0011436    -6.45   0.000    -.0099629   -.0047889
                      |
                _cons |  -.2426374    .037226    -6.52   0.000    -.3268484   -.1584264
---------------------------------------------------------------------------------------

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper expe
> r2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 1, vce(cluster state)
(sum of wgt is 2,842,234,791)

Linear regression                               Number of obs     =    292,654
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2837
                                                Root MSE          =     .30352

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0757634   .0112038     6.76   0.000     .0504187    .1011081
             treat_st |  -.0179197   .0121659    -1.47   0.175    -.0454409    .0096014
treat_stblackrelwhite |  -.0150866   .0192451    -0.78   0.453    -.0586219    .0284488
                      |
                state |
                  OH  |  -.0153567   .0008595   -17.87   0.000    -.0173011   -.0134123
                  IN  |   -.058478   .0033863   -17.27   0.000    -.0661383   -.0508177
                  IL  |  -.0094689   .0014488    -6.54   0.000    -.0127463   -.0061915
                  MI  |   .0322815   .0029592    10.91   0.000     .0255874    .0389756
                  WI  |  -.0159011   .0034044    -4.67   0.001    -.0236025   -.0081997
                  MN  |   .0264972   .0033928     7.81   0.000     .0188221    .0341723
                  MO  |  -.0621327   .0008381   -74.13   0.000    -.0640287   -.0602367
                  WV  |   -.040869   .0058712    -6.96   0.000    -.0541506   -.0275875
                  KY  |  -.0723912   .0032227   -22.46   0.000    -.0796815    -.065101
                      |
                 year |
                1990  |  -.0038694   .0023258    -1.66   0.131    -.0091308     .001392
                1991  |  -.0035773   .0034939    -1.02   0.333     -.011481    .0043264
                1992  |   .0002966   .0023927     0.12   0.904    -.0051161    .0057092
                1993  |   .0002916   .0035756     0.08   0.937    -.0077969    .0083802
                1996  |  -.0058032   .0043903    -1.32   0.219    -.0157348    .0041283
                1997  |   -.008466   .0063498    -1.33   0.215    -.0228303    .0058982
                1998  |  -.0148395   .0075542    -1.96   0.081    -.0319283    .0022493
                1999  |  -.0201228   .0059304    -3.39   0.008    -.0335384   -.0067072
                2000  |  -.0109206   .0055691    -1.96   0.082    -.0235187    .0016776
                2001  |  -.0114138   .0034324    -3.33   0.009    -.0191783   -.0036493
                2002  |  -.0163199   .0056017    -2.91   0.017    -.0289919    -.003648
                2003  |  -.0215232   .0042135    -5.11   0.001    -.0310548   -.0119916
                2004  |  -.0257696   .0048891    -5.27   0.001    -.0368296   -.0147096
                2005  |  -.0302645   .0060304    -5.02   0.001    -.0439062   -.0166228
                2006  |  -.0327037   .0075076    -4.36   0.002    -.0496871   -.0157203
                2007  |  -.0351244   .0059064    -5.95   0.000    -.0484855   -.0217633
                2008  |   -.029693   .0034663    -8.57   0.000    -.0375343   -.0218518
                2009  |  -.0250417   .0072504    -3.45   0.007    -.0414433   -.0086402
                2010  |   -.028965   .0078223    -3.70   0.005    -.0466602   -.0112698
                2011  |  -.0236261   .0057464    -4.11   0.003    -.0366254   -.0106269
                2012  |  -.0326127   .0018522   -17.61   0.000    -.0368027   -.0284228
                2013  |  -.0325288   .0041386    -7.86   0.000    -.0418911   -.0231666
                2014  |  -.0361067   .0058548    -6.17   0.000    -.0493511   -.0228623
                2015  |  -.0406565   .0062609    -6.49   0.000    -.0548197   -.0264933
                2016  |  -.0385218   .0057593    -6.69   0.000    -.0515502   -.0254934
                2017  |  -.0448456   .0066464    -6.75   0.000    -.0598808   -.0298104
                2018  |  -.0458063   .0066854    -6.85   0.000    -.0609298   -.0306828
                2019  |  -.0464193   .0065803    -7.05   0.000     -.061305   -.0315336
                      |
                 nind |
                   2  |   .0853337   .0125968     6.77   0.000     .0568377    .1138297
                   3  |   .1016136   .0072262    14.06   0.000     .0852668    .1179604
                   4  |   .0722703   .0074674     9.68   0.000     .0553778    .0891629
                   5  |   .2225197   .0164101    13.56   0.000     .1853974    .2596419
                   6  |   .0505299   .0105305     4.80   0.001     .0267082    .0743516
                   7  |   .0378328   .0088102     4.29   0.002     .0179028    .0577628
                   8  |   .0491633   .0108066     4.55   0.001     .0247171    .0736094
                   9  |   .2033241   .0160283    12.69   0.000     .1670655    .2395827
                  10  |   .0272085   .0089738     3.03   0.014     .0069083    .0475088
                  11  |    .051403   .0284122     1.81   0.104    -.0128698    .1156758
                      |
                 educ |   .0183603    .002136     8.60   0.000     .0135283    .0231924
                exper |   .0094605   .0020749     4.56   0.001     .0047667    .0141542
               exper2 |  -.0003851   .0001548    -2.49   0.035    -.0007354   -.0000348
               exper3 |   9.73e-06   4.95e-06     1.97   0.081    -1.47e-06    .0000209
               exper4 |  -9.47e-08   5.21e-08    -1.82   0.103    -2.13e-07    2.32e-08
                 edex |   -.000159    .000066    -2.41   0.039    -.0003084   -9.62e-06
                      |
                ee_cl |
                   2  |  -.0449679   .0055928    -8.04   0.000    -.0576196   -.0323161
                   3  |  -.0766268   .0054739   -14.00   0.000    -.0890096    -.064244
                   4  |  -.1141604    .010536   -10.84   0.000    -.1379944   -.0903264
                   5  |  -.0420837   .0120548    -3.49   0.007    -.0693536   -.0148139
                   6  |  -.0425764   .0065366    -6.51   0.000    -.0573633   -.0277896
                   7  |  -.0705511   .0081934    -8.61   0.000    -.0890859   -.0520162
                   8  |  -.1017235   .0104626    -9.72   0.000    -.1253914   -.0780555
                   9  |  -.0230307   .0126443    -1.82   0.102    -.0516341    .0055727
                  10  |  -.0394427    .007775    -5.07   0.001     -.057031   -.0218544
                  11  |  -.0644902   .0105711    -6.10   0.000    -.0884038   -.0405767
                  12  |  -.0904497   .0111868    -8.09   0.000    -.1157561   -.0651433
                  13  |    .014548   .0112149     1.30   0.227     -.010822    .0399179
                  14  |   -.034874   .0105288    -3.31   0.009    -.0586918   -.0110562
                  15  |   -.061066   .0105716    -5.78   0.000    -.0849806   -.0371515
                  16  |  -.0887325   .0157751    -5.62   0.000    -.1244183   -.0530467
                      |
                 marr |  -.0011909   .0017793    -0.67   0.520     -.005216    .0028342
                partt |  -.0648493   .0058405   -11.10   0.000    -.0780614   -.0516371
               public |   .3138793   .0264617    11.86   0.000     .2540188    .3737398
                 cmsa |   .0221867   .0044442     4.99   0.001     .0121333      .03224
                      |
                nocc2 |
                   2  |   .0199895   .0024361     8.21   0.000     .0144787    .0255004
                   3  |   .0280571   .0058846     4.77   0.001     .0147452    .0413689
                   4  |   .1799286   .0050527    35.61   0.000     .1684986    .1913587
                   5  |   .1456831   .0154864     9.41   0.000     .1106505    .1807157
                   6  |    .070069   .0045278    15.48   0.000     .0598264    .0803116
                   7  |   .1018874   .0067972    14.99   0.000      .086511    .1172638
                   8  |   .0666448   .0050584    13.18   0.000     .0552019    .0780877
                   9  |   .1187344   .0083621    14.20   0.000     .0998179    .1376508
                  10  |   .2359573   .0103398    22.82   0.000      .212567    .2593475
                  11  |   .2579896   .0157447    16.39   0.000     .2223727    .2936065
                  12  |   .2159868   .0188131    11.48   0.000     .1734286    .2585449
                      |
                unemp |   -.001229    .001768    -0.70   0.505    -.0052285    .0027705
                      |
              quarter |
                   2  |  -.0036308   .0023011    -1.58   0.149    -.0088363    .0015746
                   3  |  -.0009341   .0014786    -0.63   0.543    -.0042789    .0024106
                   4  |  -.0042955   .0023514    -1.83   0.101    -.0096146    .0010237
                      |
                _cons |  -.2905891   .0367676    -7.90   0.000    -.3737633    -.207415
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 0, vce(cluster state) 
(sum of wgt is 2,902,766,793)

Linear regression                               Number of obs     =    293,193
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5105
                                                Root MSE          =     .39982

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1297949    .012157   -10.68   0.000    -.1572958   -.1022939
             treat_st |  -.0352751   .0186814    -1.89   0.092    -.0775355    .0069852
treat_stblackrelwhite |  -.0255628   .0124143    -2.06   0.070    -.0536458    .0025202
                      |
                state |
                  OH  |  -.0284774   .0013068   -21.79   0.000    -.0314335   -.0255214
                  IN  |  -.0080034    .005403    -1.48   0.173    -.0202258     .004219
                  IL  |   .0724482   .0015432    46.95   0.000     .0689572    .0759391
                  MI  |    .036996   .0057537     6.43   0.000     .0239803    .0500117
                  WI  |   .0074859   .0047352     1.58   0.148    -.0032259    .0181977
                  MN  |   .0553188    .004253    13.01   0.000     .0456978    .0649398
                  MO  |  -.0324539   .0007574   -42.85   0.000    -.0341672   -.0307405
                  WV  |  -.0525761   .0133281    -3.94   0.003    -.0827264   -.0224259
                  KY  |  -.0525242   .0062283    -8.43   0.000    -.0666137   -.0384347
                      |
                 year |
                1990  |  -.0070607   .0063015    -1.12   0.292    -.0213157    .0071943
                1991  |   -.016689   .0071007    -2.35   0.043    -.0327518   -.0006261
                1992  |  -.0152011   .0076752    -1.98   0.079    -.0325636    .0021614
                1993  |  -.0256566    .007002    -3.66   0.005    -.0414963   -.0098169
                1996  |  -.0218851   .0090999    -2.40   0.040    -.0424705   -.0012998
                1997  |  -.0103321   .0083102    -1.24   0.245     -.029131    .0084669
                1998  |   .0060376   .0098086     0.62   0.553    -.0161509    .0282261
                1999  |   .0323057   .0128561     2.51   0.033     .0032231    .0613883
                2000  |    .042071   .0137604     3.06   0.014     .0109428    .0731993
                2001  |   .0556773   .0134126     4.15   0.002     .0253358    .0860188
                2002  |   .0530708   .0114528     4.63   0.001     .0271627    .0789789
                2003  |   .0451886   .0114874     3.93   0.003     .0192023     .071175
                2004  |   .0382082   .0118229     3.23   0.010      .011463    .0649535
                2005  |   .0170532   .0121091     1.41   0.193    -.0103394    .0444458
                2006  |   .0046547   .0109267     0.43   0.680    -.0200633    .0293727
                2007  |   .0002533   .0144288     0.02   0.986     -.032387    .0328936
                2008  |  -.0143192   .0152528    -0.94   0.372    -.0488235    .0201852
                2009  |   .0217411   .0140126     1.55   0.155    -.0099576    .0534399
                2010  |   .0081143   .0184802     0.44   0.671    -.0336908    .0499194
                2011  |  -.0116241   .0131965    -0.88   0.401    -.0414768    .0182285
                2012  |  -.0109896    .013148    -0.84   0.425    -.0407324    .0187533
                2013  |  -.0155635   .0150874    -1.03   0.329    -.0496937    .0185666
                2014  |  -.0156013   .0114665    -1.36   0.207    -.0415403    .0103378
                2015  |  -.0003665   .0120236    -0.03   0.976    -.0275659    .0268328
                2016  |   .0054205   .0137448     0.39   0.702    -.0256724    .0365134
                2017  |    .016953   .0140275     1.21   0.258    -.0147794    .0486854
                2018  |   .0265125   .0163099     1.63   0.138    -.0103831    .0634082
                2019  |   .0516377   .0166567     3.10   0.013     .0139576    .0893179
                      |
                 nind |
                   2  |   .1295423   .0474805     2.73   0.023      .022134    .2369506
                   3  |   .1172285   .0430481     2.72   0.023      .019847    .2146099
                   4  |  -.0810003   .0441703    -1.83   0.100    -.1809205    .0189199
                   5  |   .1456386   .0413817     3.52   0.007     .0520268    .2392505
                   6  |   .0943379   .0430894     2.19   0.056     -.003137    .1918128
                   7  |  -.0108477   .0443806    -0.24   0.812    -.1112437    .0895482
                   8  |  -.0400975   .0440977    -0.91   0.387    -.1398534    .0596583
                   9  |  -.0386522     .04075    -0.95   0.368    -.1308352    .0535308
                  10  |  -.1085765   .0439271    -2.47   0.035    -.2079464   -.0092065
                  11  |   .1139274   .0417763     2.73   0.023     .0194227     .208432
                      |
                 educ |   .0659061   .0021893    30.10   0.000     .0609536    .0708586
                exper |   .0419075   .0023602    17.76   0.000     .0365685    .0472466
               exper2 |  -.0008964     .00013    -6.90   0.000    -.0011904   -.0006024
               exper3 |   5.87e-06   2.61e-06     2.25   0.051    -2.81e-08    .0000118
               exper4 |   1.94e-09   2.31e-08     0.08   0.935    -5.03e-08    5.42e-08
                 edex |  -.0003299   .0000976    -3.38   0.008    -.0005508   -.0001091
                      |
                ee_cl |
                   2  |  -.0631667   .0066836    -9.45   0.000    -.0782861   -.0480473
                   3  |  -.0745446   .0054573   -13.66   0.000    -.0868898   -.0621993
                   4  |  -.0337957   .0121253    -2.79   0.021    -.0612252   -.0063663
                   5  |  -.1467276   .0117565   -12.48   0.000    -.1733226   -.1201326
                   6  |  -.0832059   .0073272   -11.36   0.000    -.0997812   -.0666307
                   7  |   -.062251   .0083143    -7.49   0.000    -.0810593   -.0434428
                   8  |   .0232957   .0097057     2.40   0.040     .0013398    .0452516
                   9  |  -.1473555   .0137984   -10.68   0.000    -.1785695   -.1161415
                  10  |  -.0904251   .0088848   -10.18   0.000    -.1105239   -.0703262
                  11  |  -.0548337   .0110023    -4.98   0.001    -.0797226   -.0299449
                  12  |   .0299781   .0121105     2.48   0.035     .0025822    .0573739
                  13  |  -.0516056   .0143796    -3.59   0.006    -.0841344   -.0190767
                  14  |  -.0715896   .0085221    -8.40   0.000    -.0908679   -.0523112
                  15  |  -.0515079   .0109937    -4.69   0.001    -.0763773   -.0266385
                  16  |    .006186   .0153842     0.40   0.697    -.0286155    .0409876
                      |
                 marr |   .1242246   .0023876    52.03   0.000     .1188235    .1296257
                partt |  -.2292196   .0081299   -28.19   0.000    -.2476106   -.2108285
               public |     .02868   .0110567     2.59   0.029     .0036681     .053692
                 cmsa |   .1466709   .0178428     8.22   0.000     .1063076    .1870342
                      |
                nocc2 |
                   2  |  -.1416471   .0070495   -20.09   0.000    -.1575941      -.1257
                   3  |  -.0454596   .0070928    -6.41   0.000    -.0615047   -.0294145
                   4  |  -.3076024   .0154346   -19.93   0.000     -.342518   -.2726868
                   5  |   -.073521    .013373    -5.50   0.000    -.1037728   -.0432693
                   6  |  -.3588835   .0108618   -33.04   0.000    -.3834546   -.3343123
                   7  |  -.2214136   .0077148   -28.70   0.000    -.2388657   -.2039616
                   8  |  -.1291506   .0175054    -7.38   0.000    -.1687506   -.0895505
                   9  |  -.3931588   .0102433   -38.38   0.000    -.4163308   -.3699868
                  10  |  -.3218701   .0100456   -32.04   0.000    -.3445948   -.2991454
                  11  |  -.2034404   .0089911   -22.63   0.000    -.2237797   -.1831011
                  12  |   -.369145   .0120013   -30.76   0.000    -.3962938   -.3419963
                      |
                unemp |  -.0034622   .0032991    -1.05   0.321    -.0109252    .0040008
                      |
              quarter |
                   2  |  -.0023157    .003625    -0.64   0.539    -.0105159    .0058846
                   3  |  -.0021675    .002759    -0.79   0.452    -.0084086    .0040737
                   4  |   .0091367   .0027158     3.36   0.008     .0029931    .0152803
                      |
                _cons |   .6894384   .0545528    12.64   0.000     .5660313    .8128455
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 1, vce(cluster state)
(sum of wgt is 2,846,325,247)

Linear regression                               Number of obs     =    293,187
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5014
                                                Root MSE          =     .37785

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0583272   .0077649    -7.51   0.000    -.0758926   -.0407619
             treat_st |  -.0238301   .0094302    -2.53   0.032    -.0451627   -.0024975
treat_stblackrelwhite |  -.0290251   .0060039    -4.83   0.001     -.042607   -.0154433
                      |
                state |
                  OH  |  -.0347234   .0009652   -35.97   0.000    -.0369068   -.0325399
                  IN  |  -.0374042   .0046159    -8.10   0.000    -.0478461   -.0269623
                  IL  |   .0294661   .0017912    16.45   0.000     .0254142     .033518
                  MI  |   .0049274   .0044612     1.10   0.298    -.0051644    .0150193
                  WI  |   .0195465   .0051978     3.76   0.004     .0077883    .0313047
                  MN  |   .0845196   .0047815    17.68   0.000      .073703    .0953361
                  MO  |   -.051621   .0014718   -35.07   0.000    -.0549504   -.0482916
                  WV  |  -.1228516   .0102861   -11.94   0.000    -.1461204   -.0995829
                  KY  |  -.0655977   .0052747   -12.44   0.000    -.0775298   -.0536655
                      |
                 year |
                1990  |  -.0127389   .0030304    -4.20   0.002    -.0195941   -.0058838
                1991  |  -.0103895   .0064943    -1.60   0.144    -.0250805    .0043015
                1992  |   .0058383   .0077574     0.75   0.471    -.0117102    .0233869
                1993  |   .0078564   .0069386     1.13   0.287    -.0078397    .0235525
                1996  |   .0092337   .0076311     1.21   0.257     -.008029    .0264965
                1997  |   .0221576   .0108466     2.04   0.071    -.0023791    .0466943
                1998  |   .0571391    .010354     5.52   0.000     .0337168    .0805613
                1999  |   .0740402   .0105679     7.01   0.000     .0501339    .0979465
                2000  |   .0863939   .0123149     7.02   0.000     .0585356    .1142521
                2001  |   .0948575   .0107066     8.86   0.000     .0706375    .1190775
                2002  |   .0985539   .0091619    10.76   0.000     .0778282    .1192795
                2003  |    .105098   .0065138    16.13   0.000     .0903627    .1198334
                2004  |   .0927996   .0099545     9.32   0.000     .0702809    .1153183
                2005  |   .0825211   .0085644     9.64   0.000     .0631472    .1018951
                2006  |   .0727804   .0081505     8.93   0.000     .0543428    .0912181
                2007  |   .0638648   .0095776     6.67   0.000     .0421986    .0855309
                2008  |   .0523525   .0079624     6.57   0.000     .0343403    .0703647
                2009  |   .0573549   .0135543     4.23   0.002     .0266928     .088017
                2010  |   .0538014    .012419     4.33   0.002     .0257076    .0818951
                2011  |    .044816   .0076917     5.83   0.000     .0274163    .0622158
                2012  |   .0354545   .0070068     5.06   0.001     .0196039    .0513051
                2013  |   .0416412   .0078569     5.30   0.000     .0238676    .0594148
                2014  |   .0415812    .006953     5.98   0.000     .0258524      .05731
                2015  |   .0539329   .0084787     6.36   0.000     .0347528     .073113
                2016  |   .0682067   .0132428     5.15   0.001     .0382493    .0981641
                2017  |   .0806545   .0115454     6.99   0.000     .0545371    .1067719
                2018  |   .0914503   .0146336     6.25   0.000     .0583468    .1245537
                2019  |   .1022748   .0100884    10.14   0.000     .0794533    .1250962
                      |
                 nind |
                   2  |   .1269775   .0197407     6.43   0.000     .0823209    .1716341
                   3  |    .202791    .015718    12.90   0.000     .1672343    .2383476
                   4  |  -.0391492   .0209182    -1.87   0.094    -.0864695     .008171
                   5  |   .2096203   .0172674    12.14   0.000     .1705587    .2486819
                   6  |    .135878   .0167949     8.09   0.000     .0978852    .1738708
                   7  |   .0767131   .0203105     3.78   0.004     .0307676    .1226585
                   8  |   .0470768   .0202292     2.33   0.045     .0013152    .0928384
                   9  |  -.0006271   .0142461    -0.04   0.966    -.0328541    .0315999
                  10  |  -.0358796   .0157145    -2.28   0.048    -.0714282   -.0003311
                  11  |   .1132239   .0191752     5.90   0.000     .0698466    .1566013
                      |
                 educ |   .0919329   .0022924    40.10   0.000     .0867471    .0971188
                exper |   .0431118   .0030795    14.00   0.000     .0361455     .050078
               exper2 |  -.0015466   .0002111    -7.33   0.000    -.0020241   -.0010692
               exper3 |   .0000251   6.57e-06     3.82   0.004     .0000102    .0000399
               exper4 |  -1.40e-07   6.90e-08    -2.04   0.072    -2.97e-07    1.56e-08
                 edex |  -.0003207    .000113    -2.84   0.019    -.0005762   -.0000652
                      |
                ee_cl |
                   2  |  -.1293112   .0099843   -12.95   0.000    -.1518973    -.106725
                   3  |  -.1731159   .0103932   -16.66   0.000    -.1966269   -.1496049
                   4  |  -.1862879   .0161688   -11.52   0.000    -.2228643   -.1497115
                   5  |  -.1550998   .0186888    -8.30   0.000    -.1973767   -.1128229
                   6  |  -.1635078   .0136575   -11.97   0.000    -.1944032   -.1326123
                   7  |  -.1767081   .0150027   -11.78   0.000    -.2106466   -.1427696
                   8  |  -.1257971   .0143158    -8.79   0.000    -.1581817   -.0934124
                   9  |  -.1428586   .0219068    -6.52   0.000    -.1924151   -.0933021
                  10  |  -.1613186   .0170525    -9.46   0.000    -.1998941   -.1227431
                  11  |  -.1688851   .0153085   -11.03   0.000    -.2035153   -.1342548
                  12  |  -.1322297   .0117383   -11.26   0.000    -.1587836   -.1056758
                  13  |  -.0601093    .028554    -2.11   0.065     -.124703    .0044843
                  14  |  -.1389386   .0209136    -6.64   0.000    -.1862486   -.0916287
                  15  |  -.1387605    .018151    -7.64   0.000    -.1798209      -.0977
                  16  |  -.1429666   .0131735   -10.85   0.000     -.172767   -.1131662
                      |
                 marr |   .0416094    .002882    14.44   0.000     .0350898     .048129
                partt |  -.1476435   .0037505   -39.37   0.000    -.1561276   -.1391594
               public |   .0831363   .0068879    12.07   0.000     .0675549    .0987177
                 cmsa |   .1536117   .0163109     9.42   0.000      .116714    .1905095
                      |
                nocc2 |
                   2  |  -.1229096   .0083803   -14.67   0.000    -.1418671   -.1039521
                   3  |  -.0381398   .0134022    -2.85   0.019    -.0684578   -.0078218
                   4  |  -.2832032   .0081395   -34.79   0.000    -.3016161   -.2647903
                   5  |   .0671846   .0116015     5.79   0.000     .0409403     .093429
                   6  |  -.3115555    .009854   -31.62   0.000    -.3338469   -.2892642
                   7  |  -.3380606   .0083996   -40.25   0.000    -.3570618   -.3190595
                   8  |  -.1586425   .0107938   -14.70   0.000    -.1830597   -.1342253
                   9  |  -.3892809   .0090721   -42.91   0.000    -.4098034   -.3687584
                  10  |  -.3850999   .0183978   -20.93   0.000    -.4267186   -.3434813
                  11  |  -.1182339   .0144059    -8.21   0.000    -.1508224   -.0856454
                  12  |   -.357971   .0151281   -23.66   0.000     -.392193   -.3237489
                      |
                unemp |   .0045866   .0032237     1.42   0.189    -.0027058    .0118791
                      |
              quarter |
                   2  |   .0056332   .0022552     2.50   0.034     .0005316    .0107347
                   3  |   .0119919   .0017712     6.77   0.000     .0079851    .0159986
                   4  |   .0196402   .0015058    13.04   0.000     .0162338    .0230466
                      |
                _cons |   .2265461    .055563     4.08   0.003     .1008539    .3522383
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 2,273,656,610)

Linear regression                               Number of obs     =    227,227
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5491
                                                Root MSE          =     .40355

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1530898   .0079547   -19.25   0.000    -.1710846    -.135095
             treat_st |  -.0256833   .0145787    -1.76   0.112    -.0586625     .007296
treat_stblackrelwhite |  -.0048705   .0100755    -0.48   0.640    -.0276629    .0179219
                      |
                state |
                  OH  |  -.0336614   .0012446   -27.05   0.000    -.0364768   -.0308459
                  IN  |  -.0089865   .0048495    -1.85   0.097    -.0199568    .0019837
                  IL  |   .0590845    .001873    31.55   0.000     .0548476    .0633215
                  MI  |   .0163013   .0053213     3.06   0.013     .0042636     .028339
                  WI  |   .0090796    .004552     1.99   0.077    -.0012178     .019377
                  MN  |   .0518191   .0045931    11.28   0.000     .0414288    .0622093
                  MO  |  -.0383363   .0012791   -29.97   0.000    -.0412298   -.0354428
                  WV  |  -.0564426   .0126556    -4.46   0.002    -.0850715   -.0278137
                  KY  |  -.0421775   .0060911    -6.92   0.000    -.0559566   -.0283984
                      |
                 year |
                1990  |  -.0019719   .0068625    -0.29   0.780     -.017496    .0135523
                1991  |  -.0048549   .0090639    -0.54   0.605    -.0253589    .0156492
                1992  |  -.0037297   .0096477    -0.39   0.708    -.0255544    .0180949
                1993  |   -.017661   .0070643    -2.50   0.034    -.0336416   -.0016804
                1996  |  -.0126633   .0111991    -1.13   0.287    -.0379975    .0126709
                1997  |   .0012461   .0092532     0.13   0.896    -.0196862    .0221784
                1998  |   .0231188   .0109577     2.11   0.064    -.0016692    .0479069
                1999  |   .0515253   .0142177     3.62   0.006     .0193626    .0836879
                2000  |   .0624158   .0148942     4.19   0.002     .0287229    .0961088
                2001  |    .083874   .0141935     5.91   0.000     .0517661    .1159818
                2002  |   .0786532   .0104234     7.55   0.000     .0550739    .1022325
                2003  |   .0677533   .0132743     5.10   0.001     .0377247     .097782
                2004  |   .0625851   .0115094     5.44   0.000     .0365489    .0886212
                2005  |   .0437581   .0141272     3.10   0.013     .0118001     .075716
                2006  |   .0283733   .0105519     2.69   0.025     .0045032    .0522433
                2007  |   .0259979   .0140681     1.85   0.098    -.0058264    .0578222
                2008  |     .00844   .0133708     0.63   0.544     -.021807    .0386869
                2009  |   .0455399   .0160597     2.84   0.020     .0092104    .0818695
                2010  |   .0318763    .017814     1.79   0.107    -.0084217    .0721743
                2011  |   .0114203   .0135934     0.84   0.423    -.0193301    .0421706
                2012  |   .0135617   .0137994     0.98   0.351    -.0176548    .0447781
                2013  |   .0082127   .0140238     0.59   0.573    -.0235115    .0399368
                2014  |   .0082788   .0089297     0.93   0.378    -.0119216    .0284792
                2015  |   .0283416   .0104203     2.72   0.024     .0047693    .0519138
                2016  |   .0343585   .0127058     2.70   0.024      .005616     .063101
                2017  |   .0403599   .0149725     2.70   0.025     .0064897    .0742301
                2018  |   .0509533   .0176157     2.89   0.018     .0111037    .0908028
                2019  |    .079876   .0175416     4.55   0.001     .0401941     .119558
                      |
                 nind |
                   2  |   .0694035   .0445168     1.56   0.153    -.0313005    .1701074
                   3  |   .1220165   .0397157     3.07   0.013     .0321735    .2118596
                   4  |  -.0574172   .0421646    -1.36   0.206    -.1528001    .0379657
                   5  |   .1065887   .0382164     2.79   0.021     .0201371    .1930402
                   6  |   .1091012   .0405135     2.69   0.025     .0174534    .2007491
                   7  |    .009765   .0425742     0.23   0.824    -.0865444    .1060744
                   8  |  -.0145957   .0421951    -0.35   0.737    -.1100478    .0808563
                   9  |  -.0534397   .0365059    -1.46   0.177    -.1360218    .0291423
                  10  |  -.0871018   .0419386    -2.08   0.068    -.1819734    .0077699
                  11  |   .0761398   .0393262     1.94   0.085    -.0128223    .1651019
                      |
                 educ |   .0606074   .0021651    27.99   0.000     .0557097    .0655051
                exper |   .0350347   .0024545    14.27   0.000     .0294822    .0405872
               exper2 |  -.0006339   .0001071    -5.92   0.000    -.0008762   -.0003916
               exper3 |  -3.11e-06   2.99e-06    -1.04   0.325    -9.88e-06    3.65e-06
               exper4 |   1.07e-07   3.92e-08     2.73   0.023     1.83e-08    1.96e-07
                 edex |  -.0001206   .0001206    -1.00   0.343    -.0003934    .0001522
                      |
                ee_cl |
                   2  |  -.0610728   .0042199   -14.47   0.000    -.0706188   -.0515268
                   3  |  -.0774205   .0055374   -13.98   0.000    -.0899469   -.0648941
                   4  |  -.0232871   .0124313    -1.87   0.094    -.0514087    .0048345
                   5  |  -.1325619   .0098819   -13.41   0.000    -.1549163   -.1102075
                   6  |  -.0945749    .007715   -12.26   0.000    -.1120274   -.0771224
                   7  |  -.0739408   .0091128    -8.11   0.000    -.0945555   -.0533261
                   8  |   .0449467   .0114457     3.93   0.003     .0190548    .0708385
                   9  |  -.1553454   .0119979   -12.95   0.000    -.1824865   -.1282043
                  10  |  -.1055609   .0076967   -13.71   0.000    -.1229721   -.0881496
                  11  |  -.0588723   .0110879    -5.31   0.000    -.0839548   -.0337898
                  12  |   .0533504   .0149314     3.57   0.006     .0195733    .0871276
                  13  |  -.0648449   .0122115    -5.31   0.000    -.0924691   -.0372206
                  14  |  -.0737351   .0060092   -12.27   0.000    -.0873288   -.0601414
                  15  |  -.0436247   .0101015    -4.32   0.002    -.0664758   -.0207736
                  16  |    .030947   .0197193     1.57   0.151    -.0136612    .0755551
                      |
                 marr |   .1328972   .0027902    47.63   0.000     .1265852    .1392091
                partt |  -.2223261   .0066896   -33.23   0.000     -.237459   -.2071931
               public |   .0067048   .0089316     0.75   0.472    -.0134999    .0269094
                 cmsa |   .1400582   .0164364     8.52   0.000     .1028764      .17724
                      |
                nocc2 |
                   2  |  -.1518616   .0065861   -23.06   0.000    -.1667603   -.1369629
                   3  |  -.0477029   .0084516    -5.64   0.000    -.0668217   -.0285841
                   4  |  -.3546248   .0159863   -22.18   0.000    -.3907884   -.3184612
                   5  |  -.0922427    .013497    -6.83   0.000    -.1227751   -.0617102
                   6  |  -.3871271   .0106848   -36.23   0.000    -.4112978   -.3629564
                   7  |  -.2385802   .0073737   -32.36   0.000    -.2552607   -.2218998
                   8  |  -.1393451   .0154891    -9.00   0.000    -.1743839   -.1043063
                   9  |  -.4403412   .0109176   -40.33   0.000    -.4650385   -.4156439
                  10  |  -.3728191   .0088788   -41.99   0.000    -.3929043   -.3527339
                  11  |  -.2651875   .0092366   -28.71   0.000     -.286082   -.2442929
                  12  |  -.4326903    .012633   -34.25   0.000    -.4612682   -.4041123
                      |
                unemp |  -.0031748   .0033641    -0.94   0.370    -.0107849    .0044352
                      |
              quarter |
                   2  |   -.001096   .0034822    -0.31   0.760    -.0089732    .0067812
                   3  |  -.0029346   .0027935    -1.05   0.321     -.009254    .0033848
                   4  |   .0098163   .0030863     3.18   0.011     .0028347    .0167979
                      |
                _cons |    .770252   .0574111    13.42   0.000     .6403792    .9001249
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 2,411,505,356)

Linear regression                               Number of obs     =    246,746
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5081
                                                Root MSE          =     .37727

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0828386    .010257    -8.08   0.000    -.1060415   -.0596357
             treat_st |  -.0199367   .0079795    -2.50   0.034    -.0379876   -.0018857
treat_stblackrelwhite |  -.0256929   .0080858    -3.18   0.011    -.0439843   -.0074015
                      |
                state |
                  OH  |  -.0334533   .0011212   -29.84   0.000    -.0359896   -.0309169
                  IN  |  -.0273979   .0045025    -6.09   0.000    -.0375832   -.0172127
                  IL  |   .0384753   .0020319    18.94   0.000     .0338788    .0430718
                  MI  |   -.007721   .0046635    -1.66   0.132    -.0182706    .0028287
                  WI  |   .0254853   .0052207     4.88   0.001     .0136753    .0372952
                  MN  |   .0879417    .004806    18.30   0.000     .0770699    .0988136
                  MO  |  -.0377532   .0018802   -20.08   0.000    -.0420066   -.0334998
                  WV  |  -.1179356   .0104409   -11.30   0.000    -.1415545   -.0943168
                  KY  |  -.0499309   .0055233    -9.04   0.000    -.0624255   -.0374363
                      |
                 year |
                1990  |  -.0126081   .0036969    -3.41   0.008    -.0209711   -.0042451
                1991  |  -.0044012   .0071401    -0.62   0.553    -.0205532    .0117508
                1992  |   .0143873   .0090338     1.59   0.146    -.0060485    .0348232
                1993  |   .0117477   .0074976     1.57   0.152     -.005213    .0287084
                1996  |    .011822   .0090715     1.30   0.225    -.0086992    .0323431
                1997  |   .0259702   .0126056     2.06   0.069    -.0025455     .054486
                1998  |   .0646881    .011863     5.45   0.000     .0378521    .0915242
                1999  |   .0849745   .0121973     6.97   0.000     .0573824    .1125666
                2000  |   .0983828   .0136968     7.18   0.000     .0673984    .1293672
                2001  |   .1092524   .0138735     7.87   0.000     .0778683    .1406365
                2002  |   .1133528   .0108922    10.41   0.000     .0887129    .1379927
                2003  |   .1223346   .0086016    14.22   0.000     .1028764    .1417928
                2004  |   .1111565   .0132311     8.40   0.000     .0812257    .1410874
                2005  |   .1015673    .008892    11.42   0.000     .0814522    .1216824
                2006  |   .0895583   .0108028     8.29   0.000     .0651207    .1139959
                2007  |   .0824979   .0100454     8.21   0.000     .0597737     .105222
                2008  |   .0728274   .0098947     7.36   0.000     .0504441    .0952107
                2009  |   .0763902   .0145041     5.27   0.001     .0435796    .1092007
                2010  |   .0718994   .0146529     4.91   0.001     .0387522    .1050467
                2011  |   .0622727   .0085216     7.31   0.000     .0429956    .0815498
                2012  |   .0539752   .0075023     7.19   0.000     .0370039    .0709465
                2013  |   .0582728   .0095075     6.13   0.000     .0367652    .0797803
                2014  |   .0662147   .0097118     6.82   0.000     .0442451    .0881842
                2015  |   .0783708   .0101129     7.75   0.000     .0554938    .1012477
                2016  |   .0907413   .0148672     6.10   0.000     .0571094    .1243731
                2017  |   .1052113   .0135824     7.75   0.000     .0744858    .1359369
                2018  |    .118006   .0154703     7.63   0.000     .0830098    .1530022
                2019  |   .1296617   .0114009    11.37   0.000     .1038711    .1554523
                      |
                 nind |
                   2  |   .1103516   .0161745     6.82   0.000     .0737622     .146941
                   3  |   .1888242   .0125326    15.07   0.000     .1604736    .2171748
                   4  |  -.0383764   .0193379    -1.98   0.078    -.0821218     .005369
                   5  |   .1524005   .0151747    10.04   0.000     .1180729    .1867281
                   6  |   .1332234   .0148968     8.94   0.000     .0995246    .1669222
                   7  |   .0788557   .0184967     4.26   0.002     .0370133     .120698
                   8  |   .0534777   .0178313     3.00   0.015     .0131404     .093815
                   9  |  -.0227184   .0129564    -1.75   0.113    -.0520277    .0065909
                  10  |  -.0289336    .013268    -2.18   0.057    -.0589478    .0010806
                  11  |   .1295909   .0163568     7.92   0.000     .0925892    .1665926
                      |
                 educ |   .0866872   .0031074    27.90   0.000     .0796579    .0937165
                exper |   .0427693   .0032047    13.35   0.000     .0355198    .0500189
               exper2 |  -.0015185   .0002096    -7.25   0.000    -.0019926   -.0010445
               exper3 |   .0000244   6.46e-06     3.78   0.004     9.82e-06    .0000391
               exper4 |  -1.30e-07   6.71e-08    -1.94   0.084    -2.82e-07    2.14e-08
                 edex |  -.0004025   .0001108    -3.63   0.005     -.000653   -.0001519
                      |
                ee_cl |
                   2  |  -.1190833   .0110939   -10.73   0.000    -.1441794   -.0939871
                   3  |  -.1577413   .0126226   -12.50   0.000    -.1862955    -.129187
                   4  |  -.1568175   .0216462    -7.24   0.000    -.2057847   -.1078503
                   5  |  -.1493922   .0189597    -7.88   0.000     -.192282   -.1065025
                   6  |  -.1545379   .0157589    -9.81   0.000    -.1901871   -.1188887
                   7  |  -.1576898   .0181194    -8.70   0.000    -.1986788   -.1167008
                   8  |  -.0853432   .0199641    -4.27   0.002    -.1305051   -.0401813
                   9  |  -.1445116   .0217106    -6.66   0.000    -.1936244   -.0953987
                  10  |  -.1509393   .0197723    -7.63   0.000    -.1956673   -.1062112
                  11  |  -.1447269   .0183966    -7.87   0.000     -.186343   -.1031108
                  12  |  -.0973717   .0164865    -5.91   0.000    -.1346668   -.0600767
                  13  |  -.0774125   .0277549    -2.79   0.021    -.1401984   -.0146266
                  14  |  -.1278733   .0234474    -5.45   0.000     -.180915   -.0748316
                  15  |   -.114556   .0220722    -5.19   0.001    -.1644869   -.0646252
                  16  |  -.1151725   .0188443    -6.11   0.000    -.1578013   -.0725438
                      |
                 marr |   .0481856   .0028373    16.98   0.000     .0417672    .0546041
                partt |  -.1431535   .0035797   -39.99   0.000    -.1512515   -.1350556
               public |   .0250795   .0092348     2.72   0.024     .0041889    .0459701
                 cmsa |   .1556558   .0159439     9.76   0.000     .1195882    .1917234
                      |
                nocc2 |
                   2  |  -.1300747   .0087019   -14.95   0.000    -.1497598   -.1103895
                   3  |  -.0373881   .0135834    -2.75   0.022    -.0681159   -.0066604
                   4  |   -.340653   .0098866   -34.46   0.000     -.363018    -.318288
                   5  |   .0491438   .0122678     4.01   0.003      .021392    .0768956
                   6  |   -.326759   .0095889   -34.08   0.000    -.3484505   -.3050675
                   7  |  -.3574744   .0082691   -43.23   0.000    -.3761804   -.3387683
                   8  |  -.1745033   .0116102   -15.03   0.000    -.2007673   -.1482394
                   9  |   -.416392   .0090486   -46.02   0.000    -.4368615   -.3959226
                  10  |  -.4391309   .0169364   -25.93   0.000    -.4774436   -.4008182
                  11  |  -.2160133   .0158737   -13.61   0.000     -.251922   -.1801046
                  12  |  -.4082084   .0171407   -23.82   0.000    -.4469834   -.3694335
                      |
                unemp |   .0045578   .0034878     1.31   0.224    -.0033322    .0124478
                      |
              quarter |
                   2  |   .0069445   .0020819     3.34   0.009      .002235    .0116541
                   3  |    .013109   .0020851     6.29   0.000     .0083923    .0178258
                   4  |   .0219425   .0015349    14.30   0.000     .0184704    .0254147
                      |
                _cons |   .2886452    .065968     4.38   0.002     .1394151    .4378752
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 625,287,430)

Linear regression                               Number of obs     =     65,478
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3341
                                                Root MSE          =     .33785

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1103552   .0192043    -5.75   0.000    -.1537983    -.066912
             treat_st |  -.0590251   .0339016    -1.74   0.116    -.1357159    .0176657
treat_stblackrelwhite |  -.0451163   .0252748    -1.79   0.108    -.1022918    .0120591
                      |
                state |
                  OH  |  -.0005872   .0021683    -0.27   0.793    -.0054923     .004318
                  IN  |    .017628    .007542     2.34   0.044     .0005669    .0346891
                  IL  |   .0826877   .0021875    37.80   0.000     .0777394    .0876361
                  MI  |   .0867274   .0065091    13.32   0.000     .0720028    .1014521
                  WI  |   .0191508   .0042133     4.55   0.001     .0096197    .0286819
                  MN  |   .0580405    .003858    15.04   0.000     .0493132    .0667679
                  MO  |   .0141754   .0021908     6.47   0.000     .0092193    .0191314
                  WV  |  -.0094746    .014337    -0.66   0.525    -.0419072     .022958
                  KY  |  -.0252446   .0066633    -3.79   0.004    -.0403181   -.0101711
                      |
                 year |
                1990  |  -.0140434   .0093809    -1.50   0.169    -.0352644    .0071776
                1991  |  -.0345848   .0056359    -6.14   0.000     -.047334   -.0218356
                1992  |  -.0304763    .006268    -4.86   0.001    -.0446555   -.0162971
                1993  |  -.0271541   .0072422    -3.75   0.005    -.0435371   -.0107712
                1996  |  -.0155177   .0094038    -1.65   0.133    -.0367905    .0057552
                1997  |  -.0105911   .0075743    -1.40   0.196    -.0277254    .0065433
                1998  |   -.005091   .0093476    -0.54   0.599    -.0262367    .0160548
                1999  |   .0114793   .0101371     1.13   0.287    -.0114523     .034411
                2000  |   .0226992   .0085326     2.66   0.026     .0033971    .0420012
                2001  |   .0128001   .0103655     1.23   0.248    -.0106483    .0362485
                2002  |   .0255567   .0129174     1.98   0.079    -.0036646    .0547779
                2003  |   .0295311   .0137814     2.14   0.061    -.0016447    .0607069
                2004  |   .0209455   .0113462     1.85   0.098    -.0047213    .0466124
                2005  |   .0077493   .0098071     0.79   0.450    -.0144359    .0299344
                2006  |   .0086972   .0111754     0.78   0.456    -.0165832    .0339776
                2007  |  -.0072294   .0151797    -0.48   0.645    -.0415683    .0271095
                2008  |  -.0154299   .0141573    -1.09   0.304     -.047456    .0165962
                2009  |   .0173775   .0175687     0.99   0.348    -.0223657    .0571206
                2010  |   .0172582     .01763     0.98   0.353    -.0226236    .0571399
                2011  |  -.0046636   .0109021    -0.43   0.679    -.0293259    .0199987
                2012  |  -.0041465   .0194333    -0.21   0.836    -.0481076    .0398146
                2013  |   -.008615   .0135483    -0.64   0.541    -.0392633    .0220334
                2014  |  -.0089086   .0213751    -0.42   0.687    -.0572625    .0394453
                2015  |  -.0094291   .0173492    -0.54   0.600    -.0486758    .0298176
                2016  |  -.0064772   .0206374    -0.31   0.761    -.0531623    .0402078
                2017  |   .0151921   .0175364     0.87   0.409     -.024478    .0548623
                2018  |   .0218165   .0156492     1.39   0.197    -.0135844    .0572174
                2019  |   .0368127    .019237     1.91   0.088    -.0067043    .0803297
                      |
                 nind |
                   2  |   .0590375   .0405984     1.45   0.180    -.0328025    .1508775
                   3  |  -.0923386   .0374199    -2.47   0.036    -.1769882    -.007689
                   4  |  -.2596547   .0435408    -5.96   0.000    -.3581508   -.1611586
                   5  |   .0286191   .0409061     0.70   0.502    -.0639168    .1211551
                   6  |  -.1423269   .0413788    -3.44   0.007    -.2359323   -.0487216
                   7  |  -.1551323   .0383099    -4.05   0.003    -.2417953   -.0684692
                   8  |  -.2300648   .0430531    -5.34   0.000    -.3274577   -.1326719
                   9  |  -.1492614   .0455269    -3.28   0.010    -.2522503   -.0462724
                  10  |  -.2068647   .0574609    -3.60   0.006    -.3368504   -.0768791
                  11  |   .0476667   .0407534     1.17   0.272    -.0445238    .1398572
                      |
                 educ |   .0681006   .0090007     7.57   0.000     .0477395    .0884617
                exper |   .0694317   .0034775    19.97   0.000     .0615651    .0772983
               exper2 |    -.00262   .0003661    -7.16   0.000    -.0034483   -.0017917
               exper3 |   .0000563   .0000102     5.50   0.000     .0000331    .0000794
               exper4 |  -4.80e-07   9.67e-08    -4.97   0.001    -6.99e-07   -2.62e-07
                 edex |  -.0007803    .000232    -3.36   0.008    -.0013051   -.0002555
                      |
                ee_cl |
                   2  |   .0756807   .0374312     2.02   0.074    -.0089946     .160356
                   3  |   .0654163   .0371926     1.76   0.112    -.0187192    .1495518
                   4  |   .0030132   .0495824     0.06   0.953      -.10915    .1151764
                   5  |   .0115421   .0460877     0.25   0.808    -.0927155    .1157996
                   6  |   .0644575   .0330461     1.95   0.083     -.010298    .1392131
                   7  |   .0659203   .0443991     1.48   0.172    -.0345175    .1663582
                   8  |   .0118525   .0460804     0.26   0.803    -.0923887    .1160937
                   9  |   .0469734   .0487855     0.96   0.361    -.0633871    .1573338
                  10  |   .0486516   .0412879     1.18   0.269    -.0447482    .1420514
                  11  |   .0677748    .042646     1.59   0.146    -.0286972    .1642469
                  12  |   .0676374   .0470758     1.44   0.185    -.0388555    .1741303
                  13  |   .0522059   .0443986     1.18   0.270    -.0482308    .1526426
                  14  |   .0365204   .0420426     0.87   0.408    -.0585865    .1316273
                  15  |   .0565027   .0469875     1.20   0.260    -.0497904    .1627957
                  16  |   .0680386   .0431855     1.58   0.150    -.0296538     .165731
                      |
                 marr |   .0615048   .0048248    12.75   0.000     .0505903    .0724194
                partt |  -.1378473   .0211504    -6.52   0.000    -.1856929   -.0900017
               public |  -.0556378   .0131907    -4.22   0.002    -.0854771   -.0257984
                 cmsa |   .1086711   .0152468     7.13   0.000     .0741804    .1431618
                      |
                nocc2 |
                   2  |  -.0002709   .0200207    -0.01   0.989     -.045561    .0450192
                   3  |   .0073961   .0193332     0.38   0.711    -.0363385    .0511307
                   4  |  -.0470761   .0160126    -2.94   0.016     -.083299   -.0108531
                   5  |   .0160705   .0205689     0.78   0.455    -.0304596    .0626005
                   6  |  -.2056801   .0097205   -21.16   0.000    -.2276695   -.1836907
                   7  |  -.1878086   .0178556   -10.52   0.000    -.2282007   -.1474165
                   8  |  -.1147756    .049505    -2.32   0.046    -.2267636   -.0027876
                   9  |  -.2239044   .0099465   -22.51   0.000     -.246405   -.2014039
                  10  |  -.1351543   .0160275    -8.43   0.000     -.171411   -.0988977
                  11  |  -.0410834   .0169595    -2.42   0.038    -.0794484   -.0027185
                  12  |  -.1849127   .0159421   -11.60   0.000    -.2209763    -.148849
                      |
                unemp |  -.0042593   .0031473    -1.35   0.209    -.0113789    .0028603
                      |
              quarter |
                   2  |  -.0015726   .0044902    -0.35   0.734    -.0117301     .008585
                   3  |   .0073713   .0039508     1.87   0.095     -.001566    .0163086
                   4  |    .013103   .0023397     5.60   0.000     .0078103    .0183958
                      |
                _cons |   .6403398   .0885652     7.23   0.000     .4399915    .8406881
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] i
> f female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 430,729,435)

Linear regression                               Number of obs     =     45,908
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4313
                                                Root MSE          =     .35069

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0191372   .0070322    -2.72   0.024    -.0350452   -.0032292
             treat_st |  -.0430639   .0192858    -2.23   0.052    -.0866914    .0005637
treat_stblackrelwhite |   .0066141   .0315245     0.21   0.838    -.0646994    .0779276
                      |
                state |
                  OH  |  -.0241757   .0016368   -14.77   0.000    -.0278785    -.020473
                  IN  |  -.0445467   .0062508    -7.13   0.000    -.0586868   -.0304065
                  IL  |  -.0081191   .0021057    -3.86   0.004    -.0128826   -.0033557
                  MI  |   .0392939    .007338     5.35   0.000     .0226942    .0558936
                  WI  |   .0043148   .0037154     1.16   0.275      -.00409    .0127195
                  MN  |   .0595894   .0057239    10.41   0.000     .0466411    .0725378
                  MO  |  -.0826738   .0018621   -44.40   0.000    -.0868862   -.0784614
                  WV  |  -.1059315   .0105955   -10.00   0.000    -.1299002   -.0819628
                  KY  |    -.07921   .0047712   -16.60   0.000    -.0900031   -.0684169
                      |
                 year |
                1990  |  -.0053316   .0058958    -0.90   0.389     -.018669    .0080057
                1991  |  -.0333907    .009911    -3.37   0.008    -.0558109   -.0109704
                1992  |   -.025307    .010969    -2.31   0.046    -.0501208   -.0004933
                1993  |  -.0056817   .0144497    -0.39   0.703    -.0383693    .0270058
                1996  |   .0089199   .0091455     0.98   0.355    -.0117687    .0296084
                1997  |   .0169545   .0118374     1.43   0.186    -.0098236    .0437326
                1998  |   .0383713   .0092226     4.16   0.002     .0175083    .0592343
                1999  |    .044471   .0084226     5.28   0.001     .0254179    .0635242
                2000  |   .0348773   .0134268     2.60   0.029     .0045038    .0652508
                2001  |   .0352853   .0144054     2.45   0.037     .0026981    .0678725
                2002  |   .0435387   .0087064     5.00   0.001     .0238434     .063234
                2003  |   .0434777   .0126053     3.45   0.007     .0149624    .0719929
                2004  |   .0292325   .0094089     3.11   0.013     .0079481    .0505169
                2005  |   .0163385   .0131244     1.24   0.245     -.013351     .046028
                2006  |   .0182216   .0151417     1.20   0.260    -.0160314    .0524745
                2007  |   .0099303   .0173867     0.57   0.582    -.0294012    .0492618
                2008  |  -.0201767   .0187238    -1.08   0.309     -.062533    .0221796
                2009  |   .0014527   .0231707     0.06   0.951    -.0509631    .0538685
                2010  |   .0066694   .0189659     0.35   0.733    -.0362343    .0495732
                2011  |  -.0074304   .0203256    -0.37   0.723      -.05341    .0385493
                2012  |  -.0200855   .0189246    -1.06   0.316     -.062896     .022725
                2013  |   .0067285   .0194609     0.35   0.737    -.0372951    .0507521
                2014  |  -.0425646   .0190732    -2.23   0.053    -.0857112    .0005819
                2015  |  -.0277655   .0096719    -2.87   0.018    -.0496448   -.0058862
                2016  |  -.0042773   .0128147    -0.33   0.746    -.0332661    .0247114
                2017  |    -.00787   .0167368    -0.47   0.649    -.0457313    .0299912
                2018  |  -.0037727    .010429    -0.36   0.726    -.0273647    .0198192
                2019  |   .0005062   .0080118     0.06   0.951    -.0176178    .0186301
                      |
                 nind |
                   2  |  -.0738061   .0623097    -1.18   0.267    -.2147603    .0671481
                   3  |  -.0879317   .0440793    -1.99   0.077    -.1876461    .0117827
                   4  |  -.4240716   .0541072    -7.84   0.000    -.5464705   -.3016727
                   5  |  -.0144223   .0469967    -0.31   0.766    -.1207361    .0918916
                   6  |  -.2153584   .0467222    -4.61   0.001    -.3210515   -.1096654
                   7  |  -.2634963   .0427022    -6.17   0.000    -.3600953   -.1668973
                   8  |  -.3017182   .0447699    -6.74   0.000    -.4029949   -.2004415
                   9  |  -.3397299   .0443811    -7.65   0.000    -.4401268    -.239333
                  10  |  -.3623839   .0472035    -7.68   0.000    -.4691657    -.255602
                  11  |  -.1631917   .0407149    -4.01   0.003    -.2552952   -.0710883
                      |
                 educ |   .1067892    .004926    21.68   0.000     .0956458    .1179326
                exper |   .0476448    .002787    17.10   0.000     .0413402    .0539494
               exper2 |   -.001648   .0002216    -7.44   0.000    -.0021492   -.0011468
               exper3 |   .0000305   8.72e-06     3.50   0.007     .0000108    .0000502
               exper4 |  -2.32e-07   9.97e-08    -2.33   0.045    -4.57e-07   -6.45e-09
                 edex |  -.0003736   .0001644    -2.27   0.049    -.0007456   -1.70e-06
                      |
                ee_cl |
                   2  |  -.0904322   .0194533    -4.65   0.001    -.1344386   -.0464259
                   3  |  -.1354956   .0214147    -6.33   0.000    -.1839389   -.0870523
                   4  |  -.2048082   .0278942    -7.34   0.000    -.2679093   -.1417071
                   5  |  -.0792993   .0300952    -2.63   0.027    -.1473794   -.0112192
                   6  |  -.1160334   .0193249    -6.00   0.000    -.1597492   -.0723175
                   7  |  -.1658722   .0252197    -6.58   0.000    -.2229231   -.1088213
                   8  |  -.1977657    .032883    -6.01   0.000    -.2721522   -.1233791
                   9  |  -.0841319     .02487    -3.38   0.008    -.1403919    -.027872
                  10  |  -.1395786   .0316206    -4.41   0.002    -.2111095   -.0680477
                  11  |  -.1893207   .0293198    -6.46   0.000    -.2556466   -.1229948
                  12  |  -.1916173   .0350766    -5.46   0.000     -.270966   -.1122685
                  13  |  -.0107019   .0322933    -0.33   0.748    -.0837545    .0623507
                  14  |  -.1394808   .0275641    -5.06   0.001     -.201835   -.0771266
                  15  |     -.1604   .0353889    -4.53   0.001    -.2404552   -.0803447
                  16  |  -.1739073   .0369895    -4.70   0.001    -.2575833   -.0902313
                      |
                 marr |   .0070706   .0047545     1.49   0.171    -.0036849    .0178261
                partt |  -.0686623   .0129119    -5.32   0.000    -.0978711   -.0394536
               public |   .0491009    .010582     4.64   0.001     .0251628     .073039
                 cmsa |   .1175168   .0165529     7.10   0.000     .0800716     .154962
                      |
                nocc2 |
                   2  |  -.0143598   .0190651    -0.75   0.471     -.057488    .0287684
                   3  |   .0025206   .0363472     0.07   0.946    -.0797024    .0847436
                   4  |  -.0729494    .022755    -3.21   0.011    -.1244249   -.0214739
                   5  |   .1555522   .0283055     5.50   0.000     .0915206    .2195837
                   6  |  -.1914992   .0242819    -7.89   0.000    -.2464287   -.1365698
                   7  |  -.2188263   .0227703    -9.61   0.000    -.2703363   -.1673163
                   8  |   .0254822   .0640587     0.40   0.700    -.1194286     .170393
                   9  |  -.2432641   .0252734    -9.63   0.000    -.3004366   -.1860917
                  10  |  -.2299977    .035008    -6.57   0.000    -.3091914    -.150804
                  11  |   .0793115   .0281525     2.82   0.020     .0156262    .1429968
                  12  |  -.2042308   .0274859    -7.43   0.000    -.2664083   -.1420533
                      |
                unemp |   .0035896   .0032652     1.10   0.300    -.0037968     .010976
                      |
              quarter |
                   2  |   .0023402   .0055343     0.42   0.682    -.0101793    .0148597
                   3  |   .0083221    .002787     2.99   0.015     .0020174    .0146268
                   4  |   .0152842   .0030313     5.04   0.001      .008427    .0221414
                      |
                _cons |   .3223191   .0745323     4.32   0.002     .1537154    .4909229
---------------------------------------------------------------------------------------

. 
. ** RUST BELT ONLY HISP-WHITE + WV, KY - IA
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2
>  exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 0, vce(cluster state) 
(sum of wgt is 2,172,961,165)

Linear regression                               Number of obs     =    203,950
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2207
                                                Root MSE          =     .34481

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |   .0060188   .0062652     0.96   0.362    -.0081541    .0201917
            treat_st |  -.0156642   .0069042    -2.27   0.049    -.0312826   -.0000458
treat_sthisprelwhite |  -.0139446   .0068239    -2.04   0.071    -.0293814    .0014923
                     |
               state |
                 OH  |  -.0085599   .0005121   -16.72   0.000    -.0097184   -.0074015
                 IN  |  -.0385108   .0029014   -13.27   0.000    -.0450743   -.0319473
                 IL  |   .0231784   .0015422    15.03   0.000     .0196897    .0266672
                 MI  |   .0255222    .002306    11.07   0.000     .0203056    .0307388
                 WI  |  -.0238742   .0029731    -8.03   0.000    -.0305997   -.0171487
                 MN  |   .0037656   .0021359     1.76   0.112    -.0010661    .0085972
                 MO  |  -.0243193   .0009031   -26.93   0.000    -.0263623   -.0222763
                 WV  |  -.0420511   .0077931    -5.40   0.000    -.0596805   -.0244218
                 KY  |  -.0602151   .0030159   -19.97   0.000    -.0670376   -.0533927
                     |
                year |
               1997  |   -.002382   .0060276    -0.40   0.702    -.0160174    .0112534
               1998  |  -.0131307   .0064546    -2.03   0.072     -.027732    .0014706
               1999  |  -.0142546   .0086232    -1.65   0.133    -.0337615    .0052523
               2000  |  -.0199849    .007637    -2.62   0.028     -.037261   -.0027088
               2001  |  -.0221027   .0079829    -2.77   0.022    -.0401612   -.0040442
               2002  |   -.025124    .007906    -3.18   0.011    -.0430086   -.0072394
               2003  |   -.032511   .0077917    -4.17   0.002    -.0501371   -.0148849
               2004  |  -.0335895   .0083579    -4.02   0.003    -.0524963   -.0146827
               2005  |  -.0490826    .008483    -5.79   0.000    -.0682726   -.0298927
               2006  |  -.0551237   .0101281    -5.44   0.000    -.0780349   -.0322124
               2007  |  -.0556262    .008927    -6.23   0.000    -.0758205   -.0354319
               2008  |  -.0467829   .0062094    -7.53   0.000    -.0608294   -.0327363
               2009  |  -.0362908   .0058871    -6.16   0.000    -.0496084   -.0229732
               2010  |  -.0431247   .0082701    -5.21   0.001    -.0618331   -.0244164
               2011  |  -.0458246   .0080884    -5.67   0.000    -.0641217   -.0275275
               2012  |  -.0538616   .0048502   -11.11   0.000    -.0648335   -.0428898
               2013  |  -.0548093   .0060565    -9.05   0.000      -.06851   -.0411086
               2014  |  -.0581573   .0077533    -7.50   0.000    -.0756964   -.0406181
               2015  |  -.0629082   .0070413    -8.93   0.000    -.0788367   -.0469796
               2016  |   -.064828   .0088293    -7.34   0.000    -.0848014   -.0448546
               2017  |   -.054443   .0086996    -6.26   0.000    -.0741228   -.0347632
               2018  |  -.0536779   .0079738    -6.73   0.000    -.0717159   -.0356399
               2019  |  -.0627779   .0086265    -7.28   0.000    -.0822924   -.0432634
                     |
                nind |
                  2  |   .1673736   .0273727     6.11   0.000     .1054521     .229295
                  3  |   .0950045   .0133988     7.09   0.000     .0646942    .1253148
                  4  |   .0110621    .013703     0.81   0.440    -.0199362    .0420605
                  5  |   .1674169   .0182624     9.17   0.000     .1261045    .2087293
                  6  |    .006427    .013923     0.46   0.655    -.0250691     .037923
                  7  |  -.0095977   .0143486    -0.67   0.520    -.0420565     .022861
                  8  |   .0094091   .0177263     0.53   0.608    -.0306906    .0495088
                  9  |   .1448366   .0167345     8.65   0.000     .1069806    .1826926
                 10  |  -.0294019    .015014    -1.96   0.082     -.063366    .0045622
                 11  |   .1259868   .0214293     5.88   0.000     .0775104    .1744633
                     |
                educ |   .0153965   .0022915     6.72   0.000     .0102129    .0205802
               exper |   .0088286   .0014062     6.28   0.000     .0056476    .0120097
              exper2 |  -.0001549   .0000733    -2.11   0.064    -.0003207    .0000109
              exper3 |   7.31e-06   3.14e-06     2.33   0.045     2.00e-07    .0000144
              exper4 |  -1.23e-07   4.14e-08    -2.98   0.015    -2.17e-07   -2.97e-08
                edex |  -.0003388   .0000579    -5.86   0.000    -.0004697   -.0002079
                     |
               ee_cl |
                  2  |  -.0380793   .0077198    -4.93   0.001    -.0555428   -.0206159
                  3  |  -.0374369   .0081112    -4.62   0.001    -.0557857   -.0190882
                  4  |  -.0584674   .0134541    -4.35   0.002    -.0889028   -.0280321
                  5  |  -.0766046   .0160146    -4.78   0.001    -.1128321    -.040377
                  6  |  -.0204122   .0079697    -2.56   0.031    -.0384409   -.0023835
                  7  |    .001654   .0108785     0.15   0.883    -.0229549    .0262629
                  8  |  -.0626931   .0145437    -4.31   0.002    -.0955932   -.0297931
                  9  |  -.0685038   .0150644    -4.55   0.001    -.1025818   -.0344259
                 10  |   .0040654   .0080341     0.51   0.625    -.0141089    .0222397
                 11  |   .0048352   .0103336     0.47   0.651    -.0185411    .0282114
                 12  |  -.0783809    .012668    -6.19   0.000     -.107038   -.0497238
                 13  |  -.0186016   .0120321    -1.55   0.157      -.04582    .0086168
                 14  |   .0181231   .0065078     2.78   0.021     .0034015    .0328448
                 15  |   .0046968   .0084566     0.56   0.592    -.0144333    .0238269
                 16  |  -.0911784   .0113494    -8.03   0.000    -.1168524   -.0655044
                     |
                marr |   .0181411   .0032008     5.67   0.000     .0109003    .0253819
               partt |  -.0600629   .0051017   -11.77   0.000    -.0716038    -.048522
              public |   .2922453   .0324664     9.00   0.000     .2188011    .3656895
                cmsa |   .0474451   .0107086     4.43   0.002     .0232206    .0716696
                     |
               nocc2 |
                  2  |   .0547205   .0031573    17.33   0.000     .0475782    .0618628
                  3  |   .0293777   .0029709     9.89   0.000      .022657    .0360983
                  4  |   .1929165   .0079465    24.28   0.000     .1749404    .2108926
                  5  |   .1403364   .0089267    15.72   0.000     .1201428      .16053
                  6  |   .1568026   .0065663    23.88   0.000     .1419485    .1716566
                  7  |   .0769022   .0036635    20.99   0.000     .0686149    .0851896
                  8  |   .0733318   .0077572     9.45   0.000     .0557839    .0908798
                  9  |   .1790429   .0074481    24.04   0.000      .162194    .1958917
                 10  |   .2189932    .009114    24.03   0.000     .1983759    .2396105
                 11  |   .2541371   .0112628    22.56   0.000      .228659    .2796152
                 12  |   .2407352   .0115554    20.83   0.000     .2145951    .2668752
                     |
               unemp |  -.0027453   .0015942    -1.72   0.119    -.0063517     .000861
             citizen |  -.0152521   .0021647    -7.05   0.000     -.020149   -.0103551
                     |
             quarter |
                  2  |  -.0051608   .0027596    -1.87   0.094    -.0114034    .0010817
                  3  |  -.0025396   .0035488    -0.72   0.492    -.0105676    .0054884
                  4  |  -.0043464   .0018663    -2.33   0.045    -.0085682   -.0001245
                     |
               _cons |  -.2604185   .0296365    -8.79   0.000     -.327461    -.193376
--------------------------------------------------------------------------------------

.         
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2
>  exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 1, vce(cluster state)
(sum of wgt is 2,090,984,505)

Linear regression                               Number of obs     =    201,890
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2922
                                                Root MSE          =     .28994

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |   .0202047   .0034072     5.93   0.000      .012497    .0279123
            treat_st |  -.0193022    .012652    -1.53   0.161    -.0479229    .0093185
treat_sthisprelwhite |  -.0095365   .0102105    -0.93   0.375    -.0326341    .0135612
                     |
               state |
                 OH  |  -.0100491   .0007809   -12.87   0.000    -.0118156   -.0082826
                 IN  |  -.0553568   .0039079   -14.17   0.000    -.0641972   -.0465165
                 IL  |   -.009399   .0015188    -6.19   0.000    -.0128348   -.0059631
                 MI  |   .0319214   .0030674    10.41   0.000     .0249826    .0388603
                 WI  |  -.0143486   .0036476    -3.93   0.003    -.0226001   -.0060972
                 MN  |   .0275226   .0032059     8.58   0.000     .0202704    .0347749
                 MO  |  -.0576557   .0008412   -68.54   0.000    -.0595586   -.0557528
                 WV  |  -.0410539     .00559    -7.34   0.000    -.0536993   -.0284085
                 KY  |  -.0685471   .0029799   -23.00   0.000    -.0752881   -.0618062
                     |
                year |
               1997  |  -.0021519     .00362    -0.59   0.567    -.0103408    .0060371
               1998  |  -.0065205   .0063713    -1.02   0.333    -.0209334    .0078924
               1999  |  -.0116002   .0037943    -3.06   0.014    -.0201836   -.0030168
               2000  |  -.0070694   .0045264    -1.56   0.153     -.017309    .0031701
               2001  |  -.0056611   .0045522    -1.24   0.245    -.0159588    .0046367
               2002  |  -.0119509   .0041955    -2.85   0.019    -.0214419     -.00246
               2003  |  -.0187686   .0052204    -3.60   0.006     -.030578   -.0069593
               2004  |   -.020158   .0025761    -7.82   0.000    -.0259856   -.0143304
               2005  |  -.0234375   .0035933    -6.52   0.000    -.0315661    -.015309
               2006  |  -.0255526   .0030156    -8.47   0.000    -.0323744   -.0187309
               2007  |  -.0280886    .004041    -6.95   0.000      -.03723   -.0189472
               2008  |  -.0239628   .0052704    -4.55   0.001    -.0358853   -.0120403
               2009  |  -.0253695   .0115531    -2.20   0.056    -.0515043    .0007654
               2010  |  -.0310626   .0130132    -2.39   0.041    -.0605005   -.0016247
               2011  |  -.0220225   .0101158    -2.18   0.057     -.044906     .000861
               2012  |   -.031561   .0067596    -4.67   0.001    -.0468523   -.0162697
               2013  |  -.0304881   .0045101    -6.76   0.000    -.0406906   -.0202856
               2014  |  -.0323815   .0043842    -7.39   0.000    -.0422992   -.0224638
               2015  |  -.0328776   .0060044    -5.48   0.000    -.0464605   -.0192948
               2016  |  -.0351033   .0048582    -7.23   0.000    -.0460933   -.0241133
               2017  |  -.0384484   .0036181   -10.63   0.000    -.0466332   -.0302637
               2018  |   -.037092   .0063131    -5.88   0.000    -.0513732   -.0228108
               2019  |  -.0395413   .0048008    -8.24   0.000    -.0504016    -.028681
                     |
                nind |
                  2  |   .0680877   .0135941     5.01   0.001     .0373357    .0988397
                  3  |    .065075   .0054455    11.95   0.000     .0527564    .0773937
                  4  |   .0521001    .007617     6.84   0.000     .0348693    .0693309
                  5  |   .1625293   .0165985     9.79   0.000      .124981    .2000777
                  6  |   .0338752   .0099437     3.41   0.008      .011381    .0563694
                  7  |   .0187378   .0085058     2.20   0.055    -.0005035    .0379792
                  8  |   .0273259   .0093991     2.91   0.017     .0060637    .0485882
                  9  |   .1868652   .0169634    11.02   0.000     .1484912    .2252391
                 10  |   .0062745   .0089961     0.70   0.503     -.014076    .0266251
                 11  |   .0176891    .031075     0.57   0.583    -.0526073    .0879856
                     |
                educ |   .0205054   .0026149     7.84   0.000       .01459    .0264207
               exper |   .0114076   .0027137     4.20   0.002     .0052689    .0175464
              exper2 |  -.0004125   .0001915    -2.15   0.060    -.0008456    .0000207
              exper3 |   9.29e-06   6.63e-06     1.40   0.194    -5.69e-06    .0000243
              exper4 |  -7.93e-08   7.36e-08    -1.08   0.309    -2.46e-07    8.72e-08
                edex |  -.0002642   .0000957    -2.76   0.022    -.0004807   -.0000477
                     |
               ee_cl |
                  2  |  -.0462245   .0064803    -7.13   0.000     -.060884   -.0315649
                  3  |  -.0827046   .0068855   -12.01   0.000    -.0982807   -.0671285
                  4  |  -.1210902   .0125594    -9.64   0.000    -.1495016   -.0926788
                  5  |  -.0452285   .0069619    -6.50   0.000    -.0609774   -.0294795
                  6  |  -.0587028   .0051851   -11.32   0.000    -.0704323   -.0469734
                  7  |  -.0791376   .0085349    -9.27   0.000     -.098445   -.0598302
                  8  |  -.1107336   .0132651    -8.35   0.000    -.1407414   -.0807259
                  9  |   -.044741   .0160783    -2.78   0.021    -.0811126   -.0083694
                 10  |  -.0557259   .0081408    -6.85   0.000    -.0741416   -.0373101
                 11  |  -.0702468   .0103071    -6.82   0.000    -.0935631   -.0469304
                 12  |  -.0936103   .0138332    -6.77   0.000    -.1249031   -.0623175
                 13  |   .0037851   .0104834     0.36   0.726      -.01993    .0275002
                 14  |  -.0346413    .010972    -3.16   0.012    -.0594616    -.009821
                 15  |  -.0594786   .0130404    -4.56   0.001     -.088978   -.0299792
                 16  |  -.0854429   .0187586    -4.55   0.001    -.1278778    -.043008
                     |
                marr |  -.0027117   .0018017    -1.51   0.167    -.0067875    .0013641
               partt |  -.0603239   .0051244   -11.77   0.000     -.071916   -.0487318
              public |   .3138248   .0286116    10.97   0.000     .2491009    .3785486
                cmsa |   .0200777   .0038458     5.22   0.001     .0113779    .0287775
                     |
               nocc2 |
                  2  |   .0184754   .0026877     6.87   0.000     .0123954    .0245554
                  3  |   .0280278   .0059901     4.68   0.001     .0144772    .0415783
                  4  |   .1727805   .0057199    30.21   0.000     .1598413    .1857198
                  5  |   .1409484   .0160327     8.79   0.000       .10468    .1772168
                  6  |   .0680913   .0038425    17.72   0.000      .059399    .0767835
                  7  |   .0946668   .0058254    16.25   0.000     .0814888    .1078448
                  8  |    .064712   .0058099    11.14   0.000     .0515692    .0778549
                  9  |    .113112   .0077885    14.52   0.000     .0954933    .1307308
                 10  |   .1999056   .0092999    21.50   0.000     .1788677    .2209435
                 11  |   .2305764   .0138073    16.70   0.000     .1993421    .2618107
                 12  |    .203658   .0188579    10.80   0.000     .1609986    .2463174
                     |
               unemp |   .0004539   .0019292     0.24   0.819    -.0039103     .004818
             citizen |  -.0097744   .0013596    -7.19   0.000      -.01285   -.0066989
                     |
             quarter |
                  2  |   -.002464   .0027676    -0.89   0.396    -.0087247    .0037967
                  3  |  -.0020993     .00168    -1.25   0.243    -.0058996    .0017011
                  4  |  -.0020472    .003243    -0.63   0.544    -.0093834     .005289
                     |
               _cons |  -.2862008    .041044    -6.97   0.000    -.3790487   -.1933529
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 0, vce(cluster state) 
(sum of wgt is 2,172,977,984)

Linear regression                               Number of obs     =    203,952
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5245
                                                Root MSE          =     .39677

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0883233    .003962   -22.29   0.000    -.0972861   -.0793606
            treat_st |  -.0306185   .0152324    -2.01   0.075    -.0650766    .0038397
treat_sthisprelwhite |   .0075502   .0170971     0.44   0.669    -.0311262    .0462266
                     |
               state |
                 OH  |  -.0296863   .0017133   -17.33   0.000     -.033562   -.0258105
                 IN  |  -.0124311   .0053662    -2.32   0.046    -.0245703   -.0002918
                 IL  |   .0802466   .0027997    28.66   0.000     .0739131      .08658
                 MI  |    .029896   .0063485     4.71   0.001     .0155346    .0442574
                 WI  |   .0121608   .0045944     2.65   0.027     .0017677     .022554
                 MN  |   .0565492   .0053304    10.61   0.000      .044491    .0686074
                 MO  |  -.0323344   .0005143   -62.87   0.000    -.0334979   -.0311709
                 WV  |  -.0703944   .0104293    -6.75   0.000    -.0939872   -.0468016
                 KY  |  -.0581457   .0061468    -9.46   0.000    -.0720507   -.0442406
                     |
                year |
               1997  |   .0065773   .0082362     0.80   0.445    -.0120542    .0252088
               1998  |   .0210584   .0096958     2.17   0.058    -.0008751    .0429919
               1999  |   .0447491   .0142056     3.15   0.012     .0126139    .0768843
               2000  |   .0549049   .0148128     3.71   0.005     .0213959    .0884139
               2001  |   .0733715   .0132886     5.52   0.000     .0433106    .1034324
               2002  |    .082074    .009522     8.62   0.000     .0605337    .1036143
               2003  |   .0738327   .0120833     6.11   0.000     .0464984    .1011671
               2004  |   .0636623   .0111964     5.69   0.000     .0383342    .0889903
               2005  |   .0437685   .0123637     3.54   0.006     .0157998    .0717372
               2006  |   .0244738   .0114893     2.13   0.062    -.0015168    .0504643
               2007  |    .019673   .0140871     1.40   0.196    -.0121942    .0515402
               2008  |   .0131527   .0120025     1.10   0.302    -.0139988    .0403042
               2009  |   .0721409   .0179677     4.02   0.003     .0314952    .1127866
               2010  |    .057005   .0190023     3.00   0.015      .014019    .0999911
               2011  |   .0303919   .0167125     1.82   0.102    -.0074143    .0681981
               2012  |   .0259991   .0170352     1.53   0.161    -.0125373    .0645354
               2013  |   .0220276   .0167928     1.31   0.222    -.0159604    .0600155
               2014  |   .0135008   .0138242     0.98   0.354    -.0177717    .0447734
               2015  |   .0182542   .0156116     1.17   0.272    -.0170617    .0535702
               2016  |   .0260519   .0159044     1.64   0.136    -.0099262    .0620301
               2017  |   .0289726   .0132916     2.18   0.057    -.0010951    .0590403
               2018  |   .0354512   .0183741     1.93   0.086    -.0061139    .0770162
               2019  |   .0567445   .0169266     3.35   0.008     .0184538    .0950352
                     |
                nind |
                  2  |   .1241919   .0421151     2.95   0.016      .028921    .2194628
                  3  |   .1034566   .0367139     2.82   0.020     .0204038    .1865093
                  4  |  -.0893123   .0385736    -2.32   0.046    -.1765719   -.0020528
                  5  |   .1298682   .0357269     3.64   0.005     .0490484     .210688
                  6  |   .0974255    .038685     2.52   0.033     .0099138    .1849371
                  7  |   .0003302   .0393827     0.01   0.993    -.0887596    .0894199
                  8  |  -.0371087   .0383145    -0.97   0.358     -.123782    .0495646
                  9  |  -.0455443   .0360873    -1.26   0.239    -.1271795    .0360908
                 10  |  -.1097777   .0389668    -2.82   0.020    -.1979268   -.0216286
                 11  |   .1142658   .0385671     2.96   0.016      .027021    .2015105
                     |
                educ |   .0668106   .0019011    35.14   0.000     .0625101    .0711112
               exper |   .0429885   .0036852    11.67   0.000      .034652     .051325
              exper2 |  -.0008323   .0001917    -4.34   0.002    -.0012659   -.0003986
              exper3 |   4.20e-06   4.79e-06     0.88   0.403    -6.63e-06     .000015
              exper4 |   1.49e-08   4.29e-08     0.35   0.736    -8.21e-08    1.12e-07
                edex |  -.0005025   .0001026    -4.90   0.001    -.0007346   -.0002705
                     |
               ee_cl |
                  2  |  -.0611283   .0054699   -11.18   0.000     -.073502   -.0487545
                  3  |  -.0751758   .0057895   -12.98   0.000    -.0882726    -.062079
                  4  |  -.0315596    .011419    -2.76   0.022    -.0573912   -.0057279
                  5  |  -.1201264   .0130149    -9.23   0.000    -.1495681   -.0906848
                  6  |  -.0946578   .0099434    -9.52   0.000    -.1171513   -.0721642
                  7  |  -.0618461   .0078943    -7.83   0.000    -.0797043   -.0439878
                  8  |   .0395943   .0136626     2.90   0.018     .0086875    .0705012
                  9  |  -.1445071   .0204692    -7.06   0.000    -.1908115   -.0982026
                 10  |  -.1051319   .0104678   -10.04   0.000    -.1288118    -.081452
                 11  |  -.0575917     .01207    -4.77   0.001    -.0848959   -.0302875
                 12  |   .0449235   .0143898     3.12   0.012     .0123716    .0774754
                 13  |  -.0902304   .0167882    -5.37   0.000     -.128208   -.0522529
                 14  |  -.0811641   .0116848    -6.95   0.000    -.1075969   -.0547313
                 15  |  -.0480404   .0126747    -3.79   0.004    -.0767127   -.0193681
                 16  |   .0262595   .0150717     1.74   0.115    -.0078351     .060354
                     |
                marr |   .1286109   .0025659    50.12   0.000     .1228065    .1344153
               partt |  -.2179019   .0071563   -30.45   0.000    -.2340905   -.2017133
              public |   .0184054   .0112253     1.64   0.136     -.006988    .0437987
                cmsa |   .1425121   .0182258     7.82   0.000     .1012825    .1837417
                     |
               nocc2 |
                  2  |  -.1530482   .0071855   -21.30   0.000    -.1693031   -.1367934
                  3  |  -.0470205   .0070277    -6.69   0.000    -.0629181   -.0311228
                  4  |  -.3179736   .0165609   -19.20   0.000     -.355437   -.2805103
                  5  |  -.0744995   .0112581    -6.62   0.000    -.0999671   -.0490319
                  6  |   -.380288   .0123718   -30.74   0.000    -.4082751    -.352301
                  7  |  -.2227552   .0096156   -23.17   0.000    -.2445071   -.2010032
                  8  |  -.1260705   .0159004    -7.93   0.000    -.1620398   -.0901013
                  9  |  -.3883581   .0094462   -41.11   0.000    -.4097268   -.3669894
                 10  |  -.3352667   .0095491   -35.11   0.000    -.3568682   -.3136652
                 11  |  -.2091715   .0092124   -22.71   0.000    -.2300115   -.1883315
                 12  |  -.3802968   .0134475   -28.28   0.000    -.4107171   -.3498765
                     |
               unemp |  -.0100987    .003971    -2.54   0.032    -.0190817   -.0011157
             citizen |  -.0365426   .0071976    -5.08   0.001    -.0528248   -.0202604
                     |
             quarter |
                  2  |  -.0017894   .0041617    -0.43   0.677    -.0112038     .007625
                  3  |  -.0036069   .0034782    -1.04   0.327    -.0114751    .0042614
                  4  |   .0080976   .0029413     2.75   0.022     .0014438    .0147513
                     |
               _cons |   .7547069   .0554229    13.62   0.000     .6293317    .8800822
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 1, vce(cluster state)
(sum of wgt is 2,090,994,011)

Linear regression                               Number of obs     =    201,891
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5078
                                                Root MSE          =     .38048

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0491668   .0054804    -8.97   0.000    -.0615642   -.0367694
            treat_st |  -.0319799   .0063327    -5.05   0.001    -.0463054   -.0176545
treat_sthisprelwhite |   .0190137   .0241765     0.79   0.452    -.0356774    .0737049
                     |
               state |
                 OH  |  -.0278232   .0012818   -21.71   0.000     -.030723   -.0249235
                 IN  |  -.0239692   .0038739    -6.19   0.000    -.0327324   -.0152059
                 IL  |   .0439905   .0019605    22.44   0.000     .0395556    .0484254
                 MI  |   .0143005   .0040087     3.57   0.006     .0052322    .0233687
                 WI  |   .0343647   .0045828     7.50   0.000     .0239976    .0447318
                 MN  |   .0934597   .0049162    19.01   0.000     .0823384     .104581
                 MO  |  -.0464355   .0009511   -48.82   0.000    -.0485871    -.044284
                 WV  |   -.124906   .0085339   -14.64   0.000    -.1442111   -.1056009
                 KY  |  -.0544059   .0042925   -12.67   0.000    -.0641162   -.0446956
                     |
                year |
               1997  |   .0119713   .0046658     2.57   0.030     .0014165    .0225261
               1998  |   .0434168   .0059328     7.32   0.000      .029996    .0568376
               1999  |   .0600488   .0055734    10.77   0.000     .0474408    .0726568
               2000  |   .0723922   .0073096     9.90   0.000     .0558568    .0889276
               2001  |    .085639   .0043439    19.71   0.000     .0758124    .0954656
               2002  |   .0958929   .0074476    12.88   0.000     .0790452    .1127406
               2003  |   .1002017    .005603    17.88   0.000     .0875269    .1128765
               2004  |    .087112   .0061985    14.05   0.000     .0730901    .1011339
               2005  |    .079367   .0051991    15.27   0.000     .0676059    .0911281
               2006  |   .0662095   .0037001    17.89   0.000     .0578393    .0745797
               2007  |   .0577679   .0073912     7.82   0.000     .0410478     .074488
               2008  |   .0503322   .0065509     7.68   0.000      .035513    .0651515
               2009  |    .070869   .0153454     4.62   0.001     .0361553    .1055827
               2010  |   .0649843   .0166025     3.91   0.004     .0274269    .1025417
               2011  |   .0508784   .0118105     4.31   0.002     .0241612    .0775956
               2012  |   .0394998   .0090389     4.37   0.002     .0190525    .0599471
               2013  |    .041649   .0085844     4.85   0.001     .0222299    .0610682
               2014  |   .0433794   .0052159     8.32   0.000     .0315801    .0551787
               2015  |   .0498633   .0048147    10.36   0.000     .0389717    .0607549
               2016  |   .0626691   .0076293     8.21   0.000     .0454103    .0799278
               2017  |   .0747792   .0057832    12.93   0.000     .0616968    .0878617
               2018  |    .084356     .00974     8.66   0.000     .0623226    .1063893
               2019  |   .0918049   .0060218    15.25   0.000     .0781826    .1054272
                     |
                nind |
                  2  |   .1092552   .0182166     6.00   0.000     .0680463     .150464
                  3  |   .1681311   .0147005    11.44   0.000     .1348762     .201386
                  4  |  -.0630449   .0189584    -3.33   0.009    -.1059318   -.0201581
                  5  |   .1606432   .0148255    10.84   0.000     .1271056    .1941809
                  6  |   .1093959   .0168825     6.48   0.000      .071205    .1475867
                  7  |   .0507814   .0204871     2.48   0.035     .0044363    .0971266
                  8  |   .0211066   .0194472     1.09   0.306    -.0228859    .0650992
                  9  |  -.0337093   .0158549    -2.13   0.062    -.0695757    .0021571
                 10  |   -.047839   .0130564    -3.66   0.005    -.0773746   -.0183034
                 11  |   .0854678   .0203971     4.19   0.002     .0393265    .1316091
                     |
                educ |   .0986047   .0024261    40.64   0.000     .0931164     .104093
               exper |   .0454808   .0028204    16.13   0.000     .0391007    .0518609
              exper2 |  -.0013556   .0001994    -6.80   0.000    -.0018067   -.0009046
              exper3 |   .0000189   6.28e-06     3.01   0.015     4.71e-06    .0000331
              exper4 |  -8.08e-08   6.36e-08    -1.27   0.236    -2.25e-07    6.30e-08
                edex |  -.0006113   .0001438    -4.25   0.002    -.0009366   -.0002859
                     |
               ee_cl |
                  2  |  -.1420482   .0097407   -14.58   0.000    -.1640832   -.1200132
                  3  |  -.1935192   .0069027   -28.04   0.000    -.2091342   -.1779042
                  4  |  -.2177518   .0178088   -12.23   0.000     -.258038   -.1774656
                  5  |  -.1365925   .0214928    -6.36   0.000    -.1852125   -.0879724
                  6  |  -.1872198    .012103   -15.47   0.000    -.2145986    -.159841
                  7  |  -.2042357    .012667   -16.12   0.000    -.2328905   -.1755809
                  8  |  -.1470596   .0168347    -8.74   0.000    -.1851423   -.1089769
                  9  |  -.1573821    .028779    -5.47   0.000    -.2224846   -.0922795
                 10  |  -.1935693     .01651   -11.72   0.000    -.2309175   -.1562211
                 11  |  -.1992066   .0144374   -13.80   0.000    -.2318661    -.166547
                 12  |   -.151795    .020548    -7.39   0.000    -.1982778   -.1053121
                 13  |  -.0991883   .0235525    -4.21   0.002    -.1524678   -.0459088
                 14  |  -.1663568    .016893    -9.85   0.000    -.2045714   -.1281423
                 15  |  -.1593795   .0187798    -8.49   0.000    -.2018623   -.1168967
                 16  |   -.152682   .0221977    -6.88   0.000    -.2028967   -.1024673
                     |
                marr |   .0454886   .0029464    15.44   0.000     .0388234    .0521539
               partt |   -.145883   .0038251   -38.14   0.000     -.154536     -.13723
              public |   .0698719    .007122     9.81   0.000     .0537608    .0859831
                cmsa |   .1540389   .0163436     9.43   0.000     .1170671    .1910106
                     |
               nocc2 |
                  2  |  -.1450942   .0088384   -16.42   0.000    -.1650881   -.1251003
                  3  |  -.0506764    .014477    -3.50   0.007    -.0834257    -.017927
                  4  |  -.3108185   .0071243   -43.63   0.000    -.3269347   -.2947022
                  5  |    .050875    .011043     4.61   0.001      .025894    .0758559
                  6  |  -.3367291   .0096177   -35.01   0.000     -.358486   -.3149723
                  7  |  -.3534256   .0097182   -36.37   0.000    -.3754096   -.3314415
                  8  |  -.1737452   .0125444   -13.85   0.000    -.2021226   -.1453679
                  9  |  -.3978709   .0081686   -48.71   0.000    -.4163495   -.3793923
                 10  |  -.4125633   .0204896   -20.14   0.000     -.458914   -.3662126
                 11  |  -.1504546   .0148932   -10.10   0.000    -.1841454   -.1167639
                 12  |  -.3848862   .0156205   -24.64   0.000    -.4202222   -.3495503
                     |
               unemp |    .000547   .0030904     0.18   0.863     -.006444     .007538
             citizen |  -.0239929   .0041697    -5.75   0.000    -.0334253   -.0145605
                     |
             quarter |
                  2  |   .0036158   .0040026     0.90   0.390    -.0054388    .0126704
                  3  |   .0097016   .0031188     3.11   0.013     .0026463    .0167568
                  4  |   .0187038    .001735    10.78   0.000     .0147789    .0226288
                     |
               _cons |   .2489768   .0507698     4.90   0.001     .1341275    .3638261
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 1,764,973,285)

Linear regression                               Number of obs     =    165,049
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5590
                                                Root MSE          =     .39788

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0962678   .0045559   -21.13   0.000    -.1065739   -.0859618
            treat_st |  -.0225243   .0119847    -1.88   0.093    -.0496356     .004587
treat_sthisprelwhite |   .0102471   .0188897     0.54   0.601    -.0324844    .0529786
                     |
               state |
                 OH  |  -.0333632   .0019558   -17.06   0.000    -.0377876   -.0289388
                 IN  |  -.0107213   .0048047    -2.23   0.053    -.0215902    .0001476
                 IL  |   .0641142   .0027894    22.99   0.000     .0578042    .0704241
                 MI  |    .013863   .0061184     2.27   0.050     .0000221    .0277038
                 WI  |   .0143043   .0045772     3.13   0.012     .0039499    .0246587
                 MN  |    .057522   .0056972    10.10   0.000     .0446342    .0704099
                 MO  |   -.038316   .0011305   -33.89   0.000    -.0408733   -.0357587
                 WV  |  -.0700041     .01001    -6.99   0.000    -.0926483   -.0473599
                 KY  |  -.0480908   .0059066    -8.14   0.000    -.0614524   -.0347292
                     |
                year |
               1997  |   .0103285   .0088408     1.17   0.273    -.0096706    .0303277
               1998  |   .0310923   .0093854     3.31   0.009     .0098611    .0523235
               1999  |   .0572348   .0132006     4.34   0.002      .027373    .0870965
               2000  |   .0695268   .0150846     4.61   0.001      .035403    .1036506
               2001  |   .0936363   .0135544     6.91   0.000     .0629741    .1242985
               2002  |   .0968131    .010489     9.23   0.000     .0730853     .120541
               2003  |   .0884067   .0120194     7.36   0.000     .0612169    .1155965
               2004  |   .0789092   .0115211     6.85   0.000     .0528467    .1049717
               2005  |    .061575   .0127367     4.83   0.001     .0327625    .0903875
               2006  |   .0402962   .0114786     3.51   0.007     .0143298    .0662626
               2007  |   .0391759   .0127723     3.07   0.013      .010283    .0680688
               2008  |   .0285263   .0120706     2.36   0.042     .0012206    .0558319
               2009  |   .0840362   .0230192     3.65   0.005     .0319632    .1361092
               2010  |   .0672225   .0243638     2.76   0.022     .0121077    .1223373
               2011  |   .0402763   .0190178     2.12   0.063    -.0027449    .0832975
               2012  |   .0391099   .0196923     1.99   0.078    -.0054371    .0836569
               2013  |   .0371696   .0165421     2.25   0.051    -.0002513    .0745904
               2014  |   .0314667   .0118589     2.65   0.026       .00464    .0582934
               2015  |    .038782   .0139348     2.78   0.021     .0072594    .0703047
               2016  |   .0469883   .0160403     2.93   0.017     .0107025    .0832741
               2017  |   .0457328   .0127623     3.58   0.006     .0168625     .074603
               2018  |   .0548795    .017981     3.05   0.014     .0142036    .0955553
               2019  |   .0802944   .0154066     5.21   0.001     .0454422    .1151466
                     |
                nind |
                  2  |   .0601349   .0391454     1.54   0.159    -.0284182    .1486879
                  3  |   .1061245   .0354876     2.99   0.015     .0258459    .1864031
                  4  |  -.0715233   .0376384    -1.90   0.090    -.1566673    .0136206
                  5  |   .0862094   .0339989     2.54   0.032     .0092984    .1631203
                  6  |   .1051148   .0362459     2.90   0.018     .0231209    .1871088
                  7  |   .0134022   .0380121     0.35   0.733    -.0725873    .0993916
                  8  |  -.0210737   .0373732    -0.56   0.587    -.1056178    .0634705
                  9  |  -.0602966   .0326001    -1.85   0.097    -.1340432      .01345
                 10  |   -.094222   .0371606    -2.54   0.032    -.1782851   -.0101588
                 11  |   .0680453   .0356096     1.91   0.088    -.0125093    .1485999
                     |
                educ |   .0609626   .0022338    27.29   0.000     .0559093    .0660159
               exper |   .0365078   .0034834    10.48   0.000     .0286277    .0443879
              exper2 |  -.0004806   .0001664    -2.89   0.018    -.0008572   -.0001041
              exper3 |  -7.98e-06   4.32e-06    -1.85   0.098    -.0000178    1.80e-06
              exper4 |   1.54e-07   4.46e-08     3.45   0.007     5.30e-08    2.55e-07
                edex |  -.0003633   .0001098    -3.31   0.009    -.0006117   -.0001148
                     |
               ee_cl |
                  2  |  -.0577857   .0061728    -9.36   0.000    -.0717496   -.0438218
                  3  |  -.0730231   .0069417   -10.52   0.000    -.0887263   -.0573199
                  4  |  -.0129594   .0111739    -1.16   0.276    -.0382365    .0123176
                  5  |    -.10899   .0121941    -8.94   0.000    -.1365749   -.0814051
                  6  |  -.1023013   .0133452    -7.67   0.000    -.1324902   -.0721124
                  7  |  -.0728948   .0106432    -6.85   0.000    -.0969713   -.0488183
                  8  |   .0685485   .0132465     5.17   0.001     .0385828    .0985142
                  9  |  -.1468746   .0121442   -12.09   0.000    -.1743467   -.1194024
                 10  |  -.1162368   .0132514    -8.77   0.000    -.1462136     -.08626
                 11  |  -.0621846   .0102796    -6.05   0.000    -.0854388   -.0389305
                 12  |   .0751865   .0124177     6.05   0.000     .0470958    .1032772
                 13  |  -.0924483   .0125965    -7.34   0.000    -.1209437    -.063953
                 14  |  -.0830764   .0125517    -6.62   0.000    -.1114704   -.0546824
                 15  |  -.0362202   .0109258    -3.32   0.009    -.0609361   -.0115042
                 16  |   .0643169   .0130157     4.94   0.001     .0348734    .0937604
                     |
                marr |   .1347626   .0033101    40.71   0.000     .1272747    .1422505
               partt |   -.213854   .0061276   -34.90   0.000    -.2277155   -.1999925
              public |  -.0040571   .0099418    -0.41   0.693     -.026547    .0184328
                cmsa |   .1360434   .0163699     8.31   0.000     .0990122    .1730747
                     |
               nocc2 |
                  2  |  -.1626391   .0066162   -24.58   0.000    -.1776059   -.1476723
                  3  |  -.0497228   .0073596    -6.76   0.000    -.0663715   -.0330742
                  4  |   -.362901   .0164535   -22.06   0.000    -.4001215   -.3256806
                  5  |  -.0867105    .011257    -7.70   0.000    -.1121756   -.0612454
                  6  |  -.4064894   .0103659   -39.21   0.000    -.4299386   -.3830401
                  7  |  -.2372964   .0091912   -25.82   0.000    -.2580883   -.2165045
                  8  |  -.1327761   .0132726   -10.00   0.000    -.1628008   -.1027514
                  9  |  -.4316016   .0095884   -45.01   0.000    -.4532921   -.4099111
                 10  |  -.3820273   .0090911   -42.02   0.000    -.4025927   -.3614618
                 11  |  -.2700998   .0096992   -27.85   0.000     -.292041   -.2481586
                 12  |  -.4342862   .0127827   -33.97   0.000    -.4632027   -.4053697
                     |
               unemp |  -.0085058   .0042895    -1.98   0.079    -.0182093    .0011977
             citizen |  -.0311071   .0055756    -5.58   0.000    -.0437199   -.0184943
                     |
             quarter |
                  2  |  -.0011779   .0038257    -0.31   0.765    -.0098322    .0074765
                  3  |  -.0046777   .0033373    -1.40   0.195    -.0122272    .0028717
                  4  |   .0078208   .0035433     2.21   0.055    -.0001946    .0158363
                     |
               _cons |   .8329366   .0575831    14.46   0.000     .7026745    .9631986
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 1,803,122,397)

Linear regression                               Number of obs     =    173,412
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5132
                                                Root MSE          =     .38073

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0591035   .0088484    -6.68   0.000      -.07912    -.039087
            treat_st |   -.027883   .0052571    -5.30   0.000    -.0397755   -.0159906
treat_sthisprelwhite |   .0233532   .0263534     0.89   0.399    -.0362624    .0829689
                     |
               state |
                 OH  |  -.0244151   .0013248   -18.43   0.000     -.027412   -.0214182
                 IN  |  -.0129196   .0037747    -3.42   0.008    -.0214586   -.0043806
                 IL  |    .054594   .0018738    29.14   0.000     .0503552    .0588329
                 MI  |    .006079   .0038485     1.58   0.149    -.0026268    .0147848
                 WI  |   .0432621    .004678     9.25   0.000     .0326797    .0538446
                 MN  |    .101305   .0046704    21.69   0.000     .0907397    .1118703
                 MO  |  -.0297339   .0012349   -24.08   0.000    -.0325274   -.0269404
                 WV  |  -.1177963     .00862   -13.67   0.000    -.1372961   -.0982965
                 KY  |  -.0362073   .0044827    -8.08   0.000    -.0463478   -.0260668
                     |
                year |
               1997  |   .0122417   .0056048     2.18   0.057    -.0004373    .0249208
               1998  |   .0476968   .0065495     7.28   0.000     .0328808    .0625129
               1999  |   .0677796   .0064845    10.45   0.000     .0531106    .0824486
               2000  |   .0829065   .0072491    11.44   0.000     .0665079     .099305
               2001  |    .096378   .0062915    15.32   0.000     .0821457    .1106103
               2002  |   .1062829    .007635    13.92   0.000     .0890115    .1235544
               2003  |   .1127024    .005237    21.52   0.000     .1008554    .1245494
               2004  |   .1012814   .0078596    12.89   0.000     .0835018     .119061
               2005  |   .0938951   .0039978    23.49   0.000     .0848514    .1029387
               2006  |   .0780741   .0038813    20.12   0.000     .0692939    .0868542
               2007  |   .0708017   .0062102    11.40   0.000     .0567532    .0848502
               2008  |     .06583   .0060674    10.85   0.000     .0521046    .0795555
               2009  |   .0852705   .0146097     5.84   0.000     .0522211    .1183199
               2010  |   .0791094   .0182535     4.33   0.002     .0378172    .1204017
               2011  |   .0644437   .0116298     5.54   0.000     .0381352    .0907522
               2012  |   .0540063   .0081833     6.60   0.000     .0354944    .0725183
               2013  |   .0555199   .0085045     6.53   0.000     .0362814    .0747584
               2014  |   .0645697   .0070964     9.10   0.000     .0485165    .0806229
               2015  |   .0700628   .0044838    15.63   0.000     .0599197    .0802059
               2016  |    .080503   .0074928    10.74   0.000     .0635531    .0974529
               2017  |   .0955276   .0051685    18.48   0.000     .0838357    .1072194
               2018  |   .1071818   .0083325    12.86   0.000     .0883323    .1260313
               2019  |   .1141753   .0078647    14.52   0.000     .0963842    .1319664
                     |
                nind |
                  2  |   .0979911   .0151213     6.48   0.000     .0637844    .1321978
                  3  |   .1652852   .0136243    12.13   0.000     .1344648    .1961056
                  4  |  -.0558165   .0183397    -3.04   0.014    -.0973038   -.0143292
                  5  |   .1204789   .0151924     7.93   0.000     .0861114    .1548464
                  6  |   .1115241   .0153097     7.28   0.000     .0768912    .1461569
                  7  |   .0585437   .0189584     3.09   0.013     .0156567    .1014307
                  8  |   .0318914    .018525     1.72   0.119    -.0100151    .0737979
                  9  |  -.0474609   .0135459    -3.50   0.007    -.0781038    -.016818
                 10  |  -.0364071   .0118157    -3.08   0.013    -.0631362   -.0096781
                 11  |   .1109027   .0181094     6.12   0.000     .0699365    .1518689
                     |
                educ |   .0917301   .0032316    28.39   0.000     .0844196    .0990405
               exper |    .045015   .0029243    15.39   0.000     .0383999    .0516302
              exper2 |  -.0013197   .0002104    -6.27   0.000    -.0017957   -.0008436
              exper3 |   .0000187   6.56e-06     2.85   0.019     3.82e-06    .0000335
              exper4 |  -8.00e-08   6.69e-08    -1.20   0.263    -2.31e-07    7.14e-08
                edex |  -.0006998   .0001406    -4.98   0.001    -.0010178   -.0003818
                     |
               ee_cl |
                  2  |   -.128796   .0102488   -12.57   0.000    -.1519805   -.1056116
                  3  |  -.1727496   .0094205   -18.34   0.000    -.1940603   -.1514389
                  4  |   -.179042   .0234095    -7.65   0.000    -.2319979   -.1260861
                  5  |  -.1312302   .0203424    -6.45   0.000    -.1772478   -.0852126
                  6  |  -.1700451   .0140652   -12.09   0.000    -.2018628   -.1382274
                  7  |  -.1769498   .0160494   -11.03   0.000    -.2132562   -.1406435
                  8  |  -.0941879   .0210179    -4.48   0.002    -.1417338    -.046642
                  9  |  -.1576411   .0249942    -6.31   0.000     -.214182   -.1011002
                 10  |  -.1748493    .017206   -10.16   0.000    -.2137719   -.1359267
                 11  |  -.1677812   .0154912   -10.83   0.000    -.2028246   -.1327377
                 12  |  -.1026166   .0207251    -4.95   0.001       -.1495   -.0557333
                 13  |  -.1220731   .0243067    -5.02   0.001    -.1770587   -.0670875
                 14  |  -.1551792   .0183983    -8.43   0.000    -.1967989   -.1135594
                 15  |  -.1305178   .0209979    -6.22   0.000    -.1780184   -.0830173
                 16  |  -.1146849   .0249723    -4.59   0.001    -.1711761   -.0581937
                     |
                marr |   .0518675   .0030575    16.96   0.000     .0449509    .0587841
               partt |  -.1412454   .0033574   -42.07   0.000    -.1488403   -.1336505
              public |      .0137   .0090974     1.51   0.166    -.0068798    .0342798
                cmsa |   .1574239   .0161625     9.74   0.000     .1208618    .1939861
                     |
               nocc2 |
                  2  |  -.1520969   .0094464   -16.10   0.000    -.1734661   -.1307276
                  3  |  -.0500367   .0145527    -3.44   0.007    -.0829572   -.0171163
                  4  |  -.3635809   .0102288   -35.54   0.000    -.3867201   -.3404417
                  5  |   .0350247   .0126904     2.76   0.022     .0063171    .0637323
                  6  |   -.351671   .0098622   -35.66   0.000    -.3739808   -.3293612
                  7  |  -.3712295   .0100598   -36.90   0.000    -.3939863   -.3484727
                  8  |  -.1893024   .0129995   -14.56   0.000    -.2187092   -.1598956
                  9  |   -.423787   .0093188   -45.48   0.000    -.4448675   -.4027066
                 10  |  -.4564989   .0200119   -22.81   0.000     -.501769   -.4112289
                 11  |  -.2515378   .0138756   -18.13   0.000    -.2829267   -.2201489
                 12  |  -.4305441   .0177982   -24.19   0.000    -.4708065   -.3902817
                     |
               unemp |   .0003785   .0031724     0.12   0.908    -.0067981     .007555
             citizen |  -.0234839   .0043923    -5.35   0.000      -.03342   -.0135477
                     |
             quarter |
                  2  |   .0051982   .0038747     1.34   0.213    -.0035669    .0139634
                  3  |   .0106736   .0032485     3.29   0.009      .003325    .0180221
                  4  |   .0207679   .0019332    10.74   0.000     .0163946    .0251411
                     |
               _cons |   .3160295   .0565417     5.59   0.000     .1881233    .4439357
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 407,987,880)

Linear regression                               Number of obs     =     38,901
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3435
                                                Root MSE          =     .34022

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0519325   .0090919    -5.71   0.000    -.0724998   -.0313652
            treat_st |  -.0557388    .029676    -1.88   0.093    -.1228706    .0113929
treat_sthisprelwhite |   .0457544   .0099539     4.60   0.001     .0232371    .0682717
                     |
               state |
                 OH  |  -.0049827   .0016405    -3.04   0.014    -.0086938   -.0012716
                 IN  |    .013915   .0089714     1.55   0.155    -.0063796    .0342097
                 IL  |   .1022073   .0023105    44.24   0.000     .0969805    .1074341
                 MI  |   .0781907   .0066989    11.67   0.000     .0630367    .0933447
                 WI  |    .027876   .0048304     5.77   0.000     .0169489    .0388032
                 MN  |   .0492939   .0042588    11.57   0.000     .0396598    .0589281
                 MO  |   .0136454   .0032764     4.16   0.002     .0062337    .0210572
                 WV  |  -.0336874   .0115483    -2.92   0.017    -.0598115   -.0075632
                 KY  |  -.0326717   .0069198    -4.72   0.001    -.0483255    -.017018
                     |
                year |
               1997  |  -.0069479   .0100379    -0.69   0.506    -.0296551    .0157593
               1998  |   -.004083   .0139776    -0.29   0.777    -.0357025    .0275365
               1999  |   .0101529     .01538     0.66   0.526    -.0246391    .0449449
               2000  |   .0192258   .0132297     1.45   0.180    -.0107019    .0491535
               2001  |   .0168128   .0139928     1.20   0.260    -.0148411    .0484666
               2002  |   .0446685   .0102304     4.37   0.002     .0215258    .0678112
               2003  |   .0444842   .0183522     2.42   0.038     .0029685    .0859998
               2004  |    .034732   .0093665     3.71   0.005     .0135434    .0559205
               2005  |    .022711   .0098313     2.31   0.046     .0004712    .0449509
               2006  |   .0187048   .0164525     1.14   0.285    -.0185135    .0559231
               2007  |  -.0042986   .0171606    -0.25   0.808    -.0431186    .0345213
               2008  |   -.001985   .0132902    -0.15   0.885    -.0320495    .0280795
               2009  |   .0546844   .0141882     3.85   0.004     .0225884    .0867804
               2010  |   .0573868   .0111989     5.12   0.001     .0320531    .0827206
               2011  |   .0353226   .0154848     2.28   0.048     .0002935    .0703517
               2012  |   .0295858   .0164717     1.80   0.106    -.0076758    .0668473
               2013  |   .0189832    .017171     1.11   0.298    -.0198604    .0578268
               2014  |   .0019722   .0228304     0.09   0.933    -.0496739    .0536182
               2015  |    .002761   .0251623     0.11   0.915    -.0541601    .0596822
               2016  |   .0116136   .0209123     0.56   0.592    -.0356933    .0589205
               2017  |   .0216214   .0197081     1.10   0.301    -.0229614    .0662042
               2018  |   .0176775   .0194836     0.91   0.388    -.0263975    .0617524
               2019  |   .0266179   .0245326     1.08   0.306    -.0288788    .0821145
                     |
                nind |
                  2  |   .0572024   .0519851     1.10   0.300    -.0603962    .1748009
                  3  |   -.101181   .0388109    -2.61   0.028    -.1889773   -.0133848
                  4  |  -.2733275    .056582    -4.83   0.001    -.4013249     -.14533
                  5  |    .037449   .0492829     0.76   0.467    -.0740368    .1489347
                  6  |  -.1301828   .0596966    -2.18   0.057    -.2652259    .0048603
                  7  |  -.1164098   .0502754    -2.32   0.046    -.2301406    -.002679
                  8  |  -.2146764   .0510874    -4.20   0.002     -.330244   -.0991088
                  9  |  -.1623484    .056422    -2.88   0.018    -.2899839   -.0347129
                 10  |  -.1786575   .0640581    -2.79   0.021    -.3235669    -.033748
                 11  |   .0557324   .0523769     1.06   0.315    -.0627524    .1742172
                     |
                educ |   .0711494   .0106311     6.69   0.000     .0471002    .0951987
               exper |   .0739674   .0058792    12.58   0.000     .0606679     .087267
              exper2 |  -.0030289   .0006324    -4.79   0.001    -.0044596   -.0015982
              exper3 |   .0000702   .0000201     3.49   0.007     .0000247    .0001156
              exper4 |  -6.35e-07   2.05e-07    -3.10   0.013    -1.10e-06   -1.72e-07
                edex |  -.0007517   .0001799    -4.18   0.002    -.0011586   -.0003448
                     |
               ee_cl |
                  2  |   .0668448   .0413422     1.62   0.140    -.0266777    .1603674
                  3  |   .0454519   .0452426     1.00   0.341     -.056894    .1477977
                  4  |  -.0348127   .0573066    -0.61   0.559    -.1644493    .0948239
                  5  |   .0218661   .0663371     0.33   0.749    -.1281989    .1719311
                  6  |    .038315   .0451037     0.85   0.418    -.0637166    .1403466
                  7  |   .0450822   .0581307     0.78   0.458    -.0864185     .176583
                  8  |  -.0310082   .0631439    -0.49   0.635    -.1738496    .1118333
                  9  |     .04128   .0700657     0.59   0.570    -.1172197    .1997797
                 10  |   .0148204   .0579859     0.26   0.804    -.1163527    .1459935
                 11  |   .0374383   .0651915     0.57   0.580    -.1100351    .1849116
                 12  |   .0227013    .072345     0.31   0.761    -.1409544     .186357
                 13  |   .0153782    .070485     0.22   0.832      -.14407    .1748264
                 14  |   -.005964   .0597568    -0.10   0.923    -.1411432    .1292153
                 15  |   .0063249   .0642028     0.10   0.924    -.1389119    .1515616
                 16  |  -.0004603   .0670158    -0.01   0.995    -.1520606      .15114
                     |
                marr |   .0673931   .0063735    10.57   0.000     .0529752    .0818109
               partt |  -.1221643   .0212477    -5.75   0.000    -.1702301   -.0740986
              public |  -.0682365   .0115158    -5.93   0.000     -.094287   -.0421859
                cmsa |   .1091349   .0152341     7.16   0.000     .0746729    .1435969
                     |
               nocc2 |
                  2  |  -.0217015   .0194155    -1.12   0.293    -.0656224    .0222193
                  3  |  -.0076242   .0194883    -0.39   0.705    -.0517098    .0364615
                  4  |  -.0577691   .0146223    -3.95   0.003     -.090847   -.0246911
                  5  |  -.0196205   .0186355    -1.05   0.320     -.061777    .0225359
                  6  |  -.2496812   .0202048   -12.36   0.000    -.2953876   -.2039748
                  7  |  -.2546147   .0293507    -8.67   0.000    -.3210107   -.1882187
                  8  |    -.21823   .1268732    -1.72   0.120    -.5052371     .068777
                  9  |  -.2302174   .0112354   -20.49   0.000    -.2556337   -.2048011
                 10  |  -.1551717   .0195923    -7.92   0.000    -.1994925   -.1108508
                 11  |  -.0554069   .0173373    -3.20   0.011    -.0946265   -.0161873
                 12  |  -.2150214   .0187705   -11.46   0.000    -.2574833   -.1725596
                     |
               unemp |  -.0121033   .0031646    -3.82   0.004    -.0192622   -.0049444
             citizen |  -.0404354   .0102155    -3.96   0.003    -.0635445   -.0173264
                     |
             quarter |
                  2  |  -.0020033   .0049531    -0.40   0.695    -.0132081    .0092015
                  3  |   .0047355    .005336     0.89   0.398    -.0073355    .0168065
                  4  |   .0103068   .0040514     2.54   0.032     .0011419    .0194717
                     |
               _cons |   .7055022   .1041996     6.77   0.000     .4697862    .9412182
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = final
> wt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 287,862,108)

Linear regression                               Number of obs     =     28,478
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4370
                                                Root MSE          =     .34977

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0089418   .0286864    -0.31   0.762    -.0738351    .0559514
            treat_st |  -.0483892   .0177916    -2.72   0.024    -.0886366   -.0081418
treat_sthisprelwhite |  -.0055195   .0418956    -0.13   0.898    -.1002941     .089255
                     |
               state |
                 OH  |   -.032699   .0021492   -15.21   0.000    -.0375609   -.0278371
                 IN  |  -.0387887    .006451    -6.01   0.000    -.0533819   -.0241954
                 IL  |   -.009667   .0030581    -3.16   0.012    -.0165849   -.0027491
                 MI  |   .0348275   .0075457     4.62   0.001      .017758    .0518971
                 WI  |  -.0040202    .003926    -1.02   0.333    -.0129015    .0048611
                 MN  |   .0416738   .0052101     8.00   0.000     .0298877    .0534599
                 MO  |  -.1056779   .0029008   -36.43   0.000    -.1122399   -.0991158
                 WV  |  -.1196414    .009762   -12.26   0.000    -.1417247   -.0975582
                 KY  |  -.0913125   .0054957   -16.62   0.000    -.1037446   -.0788805
                     |
                year |
               1997  |   .0128437   .0138625     0.93   0.378    -.0185155    .0442029
               1998  |   .0221685   .0112772     1.97   0.081    -.0033423    .0476792
               1999  |   .0274882   .0121062     2.27   0.049     .0001021    .0548742
               2000  |   .0142262   .0085652     1.66   0.131    -.0051497    .0336022
               2001  |   .0251925   .0115618     2.18   0.057    -.0009622    .0513471
               2002  |   .0434092   .0103476     4.20   0.002     .0200014     .066817
               2003  |   .0441673   .0155148     2.85   0.019     .0090704    .0792643
               2004  |   .0237219   .0105501     2.25   0.051     -.000144    .0475877
               2005  |   .0166705   .0165599     1.01   0.340    -.0207905    .0541315
               2006  |   .0171095   .0166167     1.03   0.330    -.0204801    .0546992
               2007  |   .0109097   .0208565     0.52   0.614     -.036271    .0580904
               2008  |  -.0178586   .0175437    -1.02   0.335    -.0575451    .0218279
               2009  |   .0194997   .0237458     0.82   0.433    -.0342169    .0732164
               2010  |   .0218552   .0141363     1.55   0.156    -.0101233    .0538337
               2011  |  -.0022372   .0194009    -0.12   0.911    -.0461251    .0416507
               2012  |  -.0136076   .0151195    -0.90   0.392    -.0478103    .0205951
               2013  |   .0004004   .0142368     0.03   0.978    -.0318054    .0326062
               2014  |  -.0440284   .0190711    -2.31   0.046    -.0871702   -.0008866
               2015  |  -.0307815   .0107089    -2.87   0.018    -.0550067   -.0065563
               2016  |  -.0057779   .0153732    -0.38   0.716    -.0405545    .0289987
               2017  |  -.0158668   .0175019    -0.91   0.388    -.0554588    .0237253
               2018  |  -.0175156   .0176721    -0.99   0.348    -.0574927    .0224615
               2019  |  -.0049524   .0164424    -0.30   0.770    -.0421476    .0322428
                     |
                nind |
                  2  |  -.0808749   .0796608    -1.02   0.337    -.2610802    .0993304
                  3  |  -.1390039   .0633456    -2.19   0.056    -.2823017    .0042938
                  4  |  -.4598492   .0655449    -7.02   0.000     -.608122   -.3115764
                  5  |  -.0301509   .0645556    -0.47   0.652    -.1761858    .1158841
                  6  |  -.2330273   .0682813    -3.41   0.008    -.3874905   -.0785642
                  7  |  -.2770694   .0607689    -4.56   0.001    -.4145383   -.1396006
                  8  |  -.3098716   .0563977    -5.49   0.000    -.4374521   -.1822911
                  9  |  -.3708609   .0582319    -6.37   0.000    -.5025905   -.2391312
                 10  |  -.3376914    .053417    -6.32   0.000     -.458529   -.2168537
                 11  |   -.180095   .0549577    -3.28   0.010    -.3044178   -.0557721
                     |
                educ |   .1178329   .0084511    13.94   0.000     .0987153    .1369506
               exper |   .0460207    .003341    13.77   0.000     .0384629    .0535785
              exper2 |  -.0014378   .0003343    -4.30   0.002    -.0021941   -.0006815
              exper3 |   .0000222   .0000123     1.81   0.104    -5.55e-06      .00005
              exper4 |  -1.34e-07   1.36e-07    -0.98   0.351    -4.43e-07    1.74e-07
                edex |  -.0003627   .0002757    -1.32   0.221    -.0009865     .000261
                     |
               ee_cl |
                  2  |  -.1635224   .0250183    -6.54   0.000    -.2201178    -.106927
                  3  |   -.208424   .0295674    -7.05   0.000    -.2753101   -.1415378
                  4  |  -.2998285   .0493721    -6.07   0.000    -.4115159   -.1881412
                  5  |  -.1100779   .0575195    -1.91   0.088     -.240196    .0200402
                  6  |   -.201673   .0413384    -4.88   0.001    -.2951871    -.108159
                  7  |   -.259347   .0458968    -5.65   0.000    -.3631727   -.1555213
                  8  |  -.2997196   .0555253    -5.40   0.000    -.4253264   -.1741127
                  9  |  -.1201779   .0538285    -2.23   0.052    -.2419465    .0015906
                 10  |  -.2285428    .060653    -3.77   0.004    -.3657494   -.0913362
                 11  |  -.2844258   .0565415    -5.03   0.001    -.4123315   -.1565201
                 12  |  -.3062471   .0564875    -5.42   0.000    -.4340306   -.1784635
                 13  |  -.0272838   .0605976    -0.45   0.663    -.1643651    .1097974
                 14  |  -.1951779   .0614487    -3.18   0.011    -.3341845   -.0561714
                 15  |  -.2377544   .0643743    -3.69   0.005    -.3833791   -.0921297
                 16  |  -.2743927   .0537968    -5.10   0.001    -.3960896   -.1526958
                     |
                marr |   .0065214   .0031448     2.07   0.068    -.0005927    .0136356
               partt |  -.0724816    .013555    -5.35   0.000    -.1031452   -.0418181
              public |   .0373368   .0089074     4.19   0.002     .0171869    .0574866
                cmsa |   .1121539   .0164602     6.81   0.000     .0749184    .1493895
                     |
               nocc2 |
                  2  |  -.0181894   .0191993    -0.95   0.368    -.0616213    .0252426
                  3  |  -.0006329   .0324793    -0.02   0.985    -.0741062    .0728404
                  4  |   -.091146   .0242207    -3.76   0.004    -.1459371   -.0363549
                  5  |   .1544817   .0297646     5.19   0.001     .0871494     .221814
                  6  |   -.194694   .0229514    -8.48   0.000    -.2466138   -.1427742
                  7  |  -.2320789    .024496    -9.47   0.000    -.2874927    -.176665
                  8  |   .0474614   .0905647     0.52   0.613    -.1574102    .2523329
                  9  |  -.2257704   .0236566    -9.54   0.000    -.2792853   -.1722556
                 10  |   -.204919   .0366804    -5.59   0.000    -.2878958   -.1219423
                 11  |   .1339731   .0312323     4.29   0.002     .0633207    .2046254
                 12  |  -.1983802   .0257552    -7.70   0.000    -.2566426   -.1401178
                     |
               unemp |    -.00022   .0037116    -0.06   0.954    -.0086161    .0081762
             citizen |  -.0128683   .0071634    -1.80   0.106    -.0290731    .0033365
                     |
             quarter |
                  2  |  -.0017767   .0083826    -0.21   0.837    -.0207395     .017186
                  3  |   .0080981   .0051181     1.58   0.148    -.0034797     .019676
                  4  |   .0132938   .0051254     2.59   0.029     .0016994    .0248881
                     |
               _cons |   .3379128    .106991     3.16   0.012     .0958824    .5799433
--------------------------------------------------------------------------------------

. 
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 closed on:   8 Mar 2021, 22:57:23
------------------------------------------------------------------------------------------------
