---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-wo-ar2w.log
  log type:  text
 opened on:  22 Mar 2021, 21:22:09

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt public marr hisprace hispracesex citize
> n eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effective; signed Dec2012) Mar1,2015(Mar11,20
> 15) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82) //incl Idaho which changed in 1
> 985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. gen lyear = year - 1900

. 
. drop if alwaysr2w == 1
(1,149,124 observations deleted)

. 
. eststo clear

. 
. ** BLACK-WHITE
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cms
> a i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 5,857,928,429)

Linear regression                               Number of obs     =    675,883
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2539
                                                Root MSE          =     .35738

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0514113   .0074065     6.94   0.000     .0362632    .0665593
             treat_st |  -.0262827   .0110522    -2.38   0.024    -.0488871   -.0036784
treat_stblackrelwhite |  -.0259259   .0112999    -2.29   0.029    -.0490367   -.0028151
                      |
                state |
                  NH  |  -.0354541   .0039909    -8.88   0.000    -.0436164   -.0272918
                  VT  |  -.0424489   .0009417   -45.08   0.000    -.0443749   -.0405229
                  MA  |   .0068751   .0071723     0.96   0.346     -.007794    .0215442
                  RI  |   .0081395   .0072342     1.13   0.270    -.0066561    .0229351
                  CT  |   .0073176   .0070707     1.03   0.309    -.0071436    .0217788
                  NY  |   .0898438   .0064591    13.91   0.000     .0766333    .1030542
                  NJ  |   .0424932   .0077069     5.51   0.000     .0267309    .0582555
                  PA  |    .018977   .0057317     3.31   0.002     .0072545    .0306996
                  OH  |   .0079225   .0057228     1.38   0.177     -.003782     .019627
                  IN  |  -.0093786    .005354    -1.75   0.090    -.0203287    .0015716
                  IL  |   .0402601   .0061853     6.51   0.000     .0276096    .0529105
                  MI  |   .0522152    .006426     8.13   0.000     .0390727    .0653578
                  WI  |  -.0013034    .004754    -0.27   0.786    -.0110265    .0084197
                  MN  |   .0238555   .0056611     4.21   0.000     .0122773    .0354337
                  MO  |  -.0126245   .0056571    -2.23   0.034    -.0241946   -.0010543
                  DE  |  -.0582074   .0024409   -23.85   0.000    -.0631997   -.0532152
                  MD  |  -.0538802   .0080967    -6.65   0.000    -.0704399   -.0373205
                  DC  |  -.0537875   .0089817    -5.99   0.000    -.0721571    -.035418
                  WV  |     -.0239   .0022305   -10.72   0.000    -.0284619   -.0193382
                  KY  |  -.0487691   .0039765   -12.26   0.000    -.0569019   -.0406363
                  OK  |  -.0892182   .0076795   -11.62   0.000    -.1049246   -.0735119
                  MT  |  -.0042491   .0029196    -1.46   0.156    -.0102204    .0017222
                  CO  |  -.0533892   .0072909    -7.32   0.000    -.0683007   -.0384777
                  NM  |  -.1074715    .005428   -19.80   0.000     -.118573     -.09637
                  WA  |   .0484906   .0064794     7.48   0.000     .0352388    .0617425
                  OR  |   .0117364   .0058301     2.01   0.053    -.0001875    .0236602
                  CA  |   .0291462   .0073524     3.96   0.000     .0141089    .0441835
                  AK  |   .0246714   .0051754     4.77   0.000     .0140865    .0352562
                  HI  |   .0180051   .0056395     3.19   0.003     .0064711    .0295392
                      |
                 year |
                1990  |  -.0062615   .0033565    -1.87   0.072    -.0131264    .0006033
                1991  |  -.0088044   .0041418    -2.13   0.042    -.0172754   -.0003335
                1992  |  -.0153941   .0033425    -4.61   0.000    -.0222302   -.0085579
                1993  |  -.0200963   .0047264    -4.25   0.000    -.0297629   -.0104298
                1996  |  -.0286602   .0051209    -5.60   0.000    -.0391336   -.0181868
                1997  |  -.0319003   .0050989    -6.26   0.000    -.0423288   -.0214719
                1998  |  -.0365148   .0052095    -7.01   0.000    -.0471694   -.0258601
                1999  |  -.0382452   .0041121    -9.30   0.000    -.0466554    -.029835
                2000  |  -.0426531   .0043114    -9.89   0.000    -.0514709   -.0338354
                2001  |  -.0433656   .0058704    -7.39   0.000    -.0553719   -.0313593
                2002  |  -.0469438   .0066465    -7.06   0.000    -.0605374   -.0333503
                2003  |  -.0536703   .0059322    -9.05   0.000    -.0658031   -.0415375
                2004  |  -.0564247   .0066612    -8.47   0.000    -.0700484   -.0428011
                2005  |  -.0654622   .0069572    -9.41   0.000    -.0796912   -.0512331
                2006  |  -.0683607   .0077237    -8.85   0.000    -.0841574    -.052564
                2007  |  -.0640205   .0077797    -8.23   0.000    -.0799319   -.0481092
                2008  |  -.0559687   .0081564    -6.86   0.000    -.0726505   -.0392869
                2009  |  -.0594325   .0067655    -8.78   0.000    -.0732696   -.0455954
                2010  |  -.0650653   .0092323    -7.05   0.000    -.0839475   -.0461832
                2011  |  -.0683568   .0067706   -10.10   0.000    -.0822043   -.0545094
                2012  |  -.0687527   .0071546    -9.61   0.000    -.0833855     -.05412
                2013  |  -.0663972   .0073307    -9.06   0.000    -.0813901   -.0514042
                2014  |  -.0694579   .0063429   -10.95   0.000    -.0824307   -.0564852
                2015  |  -.0716857   .0070168   -10.22   0.000    -.0860367   -.0573348
                2016  |  -.0689465   .0078065    -8.83   0.000    -.0849126   -.0529805
                2017  |  -.0590248   .0071292    -8.28   0.000    -.0736055    -.044444
                2018  |  -.0594248   .0053815   -11.04   0.000    -.0704313   -.0484184
                2019  |  -.0672942   .0064384   -10.45   0.000    -.0804623   -.0541262
                      |
                 nind |
                   2  |    .149141   .0166099     8.98   0.000     .1151699    .1831121
                   3  |   .1142003   .0147886     7.72   0.000     .0839541    .1444465
                   4  |   .0283871   .0131456     2.16   0.039     .0015013    .0552729
                   5  |   .1975403   .0140639    14.05   0.000     .1687764    .2263042
                   6  |   .0202697   .0135146     1.50   0.144    -.0073707    .0479101
                   7  |   .0085981   .0126638     0.68   0.503    -.0173024    .0344985
                   8  |   .0390787   .0178235     2.19   0.037     .0026255    .0755319
                   9  |   .1599348   .0146447    10.92   0.000     .1299831    .1898864
                  10  |   .0171004   .0221503     0.77   0.446    -.0282021    .0624029
                  11  |    .116127      .0215     5.40   0.000     .0721545    .1600995
                      |
                 educ |   .0098476   .0017744     5.55   0.000     .0062184    .0134767
                exper |   .0092549   .0013815     6.70   0.000     .0064295    .0120804
               exper2 |   -.000083   .0000874    -0.95   0.350    -.0002619    .0000958
               exper3 |   3.03e-06   2.67e-06     1.13   0.266    -2.43e-06    8.50e-06
               exper4 |  -7.00e-08   2.74e-08    -2.55   0.016    -1.26e-07   -1.39e-08
                 edex |  -.0002932   .0000535    -5.48   0.000    -.0004025   -.0001838
                      |
                ee_cl |
                   2  |  -.0235035   .0072355    -3.25   0.003    -.0383017   -.0087052
                   3  |  -.0172509    .007996    -2.16   0.039    -.0336045   -.0008973
                   4  |  -.0343582   .0099093    -3.47   0.002     -.054625   -.0140914
                   5  |  -.0885061    .008924    -9.92   0.000    -.1067577   -.0702545
                   6  |  -.0063557   .0067461    -0.94   0.354     -.020153    .0074416
                   7  |   .0064945   .0080797     0.80   0.428    -.0100305    .0230194
                   8  |  -.0480199   .0121896    -3.94   0.000    -.0729505   -.0230893
                   9  |   -.067282   .0091842    -7.33   0.000    -.0860659   -.0484982
                  10  |   .0119902   .0079461     1.51   0.142    -.0042613    .0282417
                  11  |   .0057571   .0097121     0.59   0.558    -.0141063    .0256206
                  12  |  -.0648589   .0145904    -4.45   0.000    -.0946996   -.0350182
                  13  |   .0139823   .0090899     1.54   0.135    -.0046086    .0325733
                  14  |   .0237577   .0081668     2.91   0.007     .0070548    .0404606
                  15  |  -.0034567    .010097    -0.34   0.735    -.0241073    .0171939
                  16  |  -.0717093   .0157239    -4.56   0.000    -.1038683   -.0395504
                      |
                 marr |   .0194877   .0017022    11.45   0.000     .0160064    .0229691
                partt |  -.0760109   .0043173   -17.61   0.000    -.0848407   -.0671811
               public |   .3360925   .0215677    15.58   0.000     .2919816    .3802034
                 cmsa |   .0494805   .0072197     6.85   0.000     .0347146    .0642465
                      |
                nocc2 |
                   2  |   .0575549   .0034331    16.76   0.000     .0505334    .0645764
                   3  |   .0415159   .0056635     7.33   0.000     .0299327     .053099
                   4  |   .1956792   .0051325    38.13   0.000     .1851821    .2061763
                   5  |   .1879365   .0168742    11.14   0.000     .1534249    .2224481
                   6  |   .1541068   .0058755    26.23   0.000       .14209    .1661237
                   7  |   .0830828   .0029588    28.08   0.000     .0770314    .0891342
                   8  |   .0710622   .0091565     7.76   0.000     .0523351    .0897893
                   9  |   .1978408   .0065296    30.30   0.000     .1844862    .2111953
                  10  |   .2331361    .008253    28.25   0.000     .2162568    .2500155
                  11  |   .2538768   .0095354    26.62   0.000     .2343747     .273379
                  12  |   .2581374   .0086464    29.85   0.000     .2404536    .2758212
                      |
              quarter |
                   2  |  -.0018144   .0020171    -0.90   0.376      -.00594    .0023111
                   3  |  -.0037055    .001658    -2.23   0.033    -.0070964   -.0003146
                   4  |  -.0046715   .0013158    -3.55   0.001    -.0073625   -.0019804
                      |
                _cons |  -.2729722   .0303249    -9.00   0.000    -.3349935   -.2109509
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cms
> a i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 5,857,928,429)

Linear regression                               Number of obs     =    675,883
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2539
                                                Root MSE          =     .35737

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0514087   .0074162     6.93   0.000     .0362409    .0665765
             treat_st |  -.0271008   .0107321    -2.53   0.017    -.0490503   -.0051512
treat_stblackrelwhite |  -.0260759    .011223    -2.32   0.027    -.0490295   -.0031223
                      |
                state |
                  NH  |  -.0394134   .0035892   -10.98   0.000     -.046754   -.0320727
                  VT  |  -.0461703   .0013209   -34.95   0.000    -.0488719   -.0434687
                  MA  |   .0071192   .0072215     0.99   0.332    -.0076504    .0218888
                  RI  |   .0118222   .0078596     1.50   0.143    -.0042525     .027897
                  CT  |   .0077338   .0071307     1.08   0.287    -.0068501    .0223177
                  NY  |   .0924644   .0068914    13.42   0.000     .0783699     .106559
                  NJ  |   .0444377   .0080356     5.53   0.000      .028003    .0608723
                  PA  |   .0203609   .0059239     3.44   0.002     .0082452    .0324765
                  OH  |   .0101109   .0059801     1.69   0.102    -.0021198    .0223416
                  IN  |  -.0090616   .0053413    -1.70   0.101    -.0199858    .0018627
                  IL  |   .0437474   .0067091     6.52   0.000     .0300257    .0574691
                  MI  |   .0575197   .0070281     8.18   0.000     .0431456    .0718937
                  WI  |   -.002694     .00467    -0.58   0.568    -.0122452    .0068571
                  MN  |   .0210099   .0053878     3.90   0.001     .0099906    .0320293
                  MO  |  -.0119064   .0057651    -2.07   0.048    -.0236974   -.0001153
                  DE  |   -.060504   .0030313   -19.96   0.000    -.0667038   -.0543042
                  MD  |  -.0549683   .0079612    -6.90   0.000    -.0712508   -.0386858
                  DC  |  -.0477023    .009914    -4.81   0.000    -.0679787   -.0274259
                  WV  |  -.0183209   .0038928    -4.71   0.000    -.0262827   -.0103591
                  KY  |  -.0458518   .0045218   -10.14   0.000    -.0550998   -.0366037
                  OK  |  -.0905393   .0073925   -12.25   0.000    -.1056586   -.0754199
                  MT  |  -.0045725   .0028412    -1.61   0.118    -.0103834    .0012384
                  CO  |  -.0547122   .0070688    -7.74   0.000    -.0691695   -.0402549
                  NM  |  -.1048379   .0061057   -17.17   0.000    -.1173255   -.0923503
                  WA  |   .0514614   .0070447     7.30   0.000     .0370533    .0658694
                  OR  |   .0158233   .0066628     2.37   0.024     .0021964    .0294503
                  CA  |   .0346214   .0084735     4.09   0.000     .0172912    .0519516
                  AK  |   .0317471   .0071408     4.45   0.000     .0171426    .0463517
                  HI  |   .0141958   .0050182     2.83   0.008     .0039325     .024459
                      |
                 year |
                1990  |  -.0047155   .0035124    -1.34   0.190    -.0118992    .0024683
                1991  |  -.0026381   .0048696    -0.54   0.592    -.0125975    .0073214
                1992  |  -.0070108   .0047742    -1.47   0.153    -.0167751    .0027534
                1993  |  -.0136368   .0055088    -2.48   0.019    -.0249036     -.00237
                1996  |  -.0278671   .0051914    -5.37   0.000    -.0384847   -.0172495
                1997  |  -.0326802   .0051085    -6.40   0.000    -.0431282   -.0222322
                1998  |  -.0387626   .0053235    -7.28   0.000    -.0496504   -.0278748
                1999  |  -.0415328   .0045971    -9.03   0.000    -.0509349   -.0321307
                2000  |  -.0465866   .0047204    -9.87   0.000    -.0562409   -.0369324
                2001  |  -.0448725   .0061581    -7.29   0.000    -.0574672   -.0322777
                2002  |  -.0447443   .0066738    -6.70   0.000    -.0583937   -.0310949
                2003  |  -.0504056   .0057449    -8.77   0.000    -.0621554   -.0386559
                2004  |  -.0545705   .0064926    -8.40   0.000    -.0678495   -.0412916
                2005  |  -.0651586   .0069263    -9.41   0.000    -.0793244   -.0509928
                2006  |  -.0693111    .007741    -8.95   0.000    -.0851432   -.0534789
                2007  |  -.0649754   .0079679    -8.15   0.000    -.0812716   -.0486792
                2008  |  -.0534013   .0079257    -6.74   0.000    -.0696113   -.0371913
                2009  |  -.0453245   .0067373    -6.73   0.000    -.0591039   -.0315452
                2010  |   -.049908   .0086387    -5.78   0.000    -.0675762   -.0322399
                2011  |  -.0558257   .0066883    -8.35   0.000    -.0695049   -.0421465
                2012  |  -.0587084   .0065011    -9.03   0.000    -.0720045   -.0454122
                2013  |  -.0582423    .006951    -8.38   0.000    -.0724587   -.0440259
                2014  |  -.0657165   .0063757   -10.31   0.000    -.0787563   -.0526767
                2015  |  -.0712423   .0073468    -9.70   0.000    -.0862681   -.0562165
                2016  |  -.0697543   .0081156    -8.60   0.000    -.0863524   -.0531561
                2017  |  -.0613816   .0073632    -8.34   0.000     -.076441   -.0463222
                2018  |  -.0631855   .0062089   -10.18   0.000    -.0758842   -.0504868
                2019  |   -.071621    .007848    -9.13   0.000    -.0876719     -.05557
                      |
                 nind |
                   2  |   .1491167   .0165947     8.99   0.000     .1151768    .1830566
                   3  |    .114208    .014785     7.72   0.000     .0839693    .1444466
                   4  |     .02843    .013143     2.16   0.039     .0015495    .0553105
                   5  |   .1975818   .0140593    14.05   0.000     .1688273    .2263363
                   6  |   .0203078   .0135063     1.50   0.144    -.0073156    .0479312
                   7  |   .0086003   .0126591     0.68   0.502    -.0172904     .034491
                   8  |   .0391322   .0178188     2.20   0.036     .0026888    .0755756
                   9  |   .1599762   .0146308    10.93   0.000     .1300529    .1898996
                  10  |   .0171395   .0221406     0.77   0.445    -.0281431     .062422
                  11  |   .1161431   .0214819     5.41   0.000     .0722078    .1600785
                      |
                 educ |   .0098575    .001787     5.52   0.000     .0062026    .0135124
                exper |   .0092955   .0013815     6.73   0.000     .0064699    .0121211
               exper2 |  -.0000847   .0000874    -0.97   0.340    -.0002636    .0000941
               exper3 |   3.09e-06   2.68e-06     1.15   0.258    -2.38e-06    8.56e-06
               exper4 |  -7.06e-08   2.75e-08    -2.57   0.016    -1.27e-07   -1.44e-08
                 edex |  -.0002945   .0000538    -5.48   0.000    -.0004044   -.0001845
                      |
                ee_cl |
                   2  |  -.0234205   .0072346    -3.24   0.003    -.0382169   -.0086241
                   3  |  -.0172098   .0079895    -2.15   0.040    -.0335501   -.0008694
                   4  |  -.0343141   .0099325    -3.45   0.002    -.0546283   -.0139998
                   5  |  -.0885557   .0089223    -9.93   0.000    -.1068039   -.0703075
                   6  |  -.0063441   .0067585    -0.94   0.356    -.0201668    .0074787
                   7  |   .0065551   .0080814     0.81   0.424    -.0099732    .0230833
                   8  |  -.0479365   .0122078    -3.93   0.000    -.0729044   -.0229687
                   9  |  -.0672875   .0091853    -7.33   0.000    -.0860735   -.0485014
                  10  |   .0119141   .0079659     1.50   0.146    -.0043781    .0282062
                  11  |   .0057872    .009727     0.59   0.556    -.0141068    .0256812
                  12  |  -.0647601   .0145951    -4.44   0.000    -.0946104   -.0349097
                  13  |   .0138384   .0091018     1.52   0.139    -.0047769    .0324537
                  14  |   .0236809   .0081919     2.89   0.007     .0069266    .0404352
                  15  |  -.0034477   .0101066    -0.34   0.735    -.0241179    .0172226
                  16  |   -.071589   .0157249    -4.55   0.000      -.10375   -.0394281
                      |
                 marr |   .0195024   .0017023    11.46   0.000     .0160209    .0229839
                partt |  -.0759086   .0043093   -17.61   0.000    -.0847222   -.0670951
               public |   .3361023   .0215837    15.57   0.000     .2919587     .380246
                 cmsa |   .0494043   .0072479     6.82   0.000     .0345807    .0642279
                      |
                nocc2 |
                   2  |   .0575547   .0034309    16.78   0.000     .0505378    .0645717
                   3  |   .0415148   .0056602     7.33   0.000     .0299385    .0530912
                   4  |   .1956689   .0051353    38.10   0.000      .185166    .2061717
                   5  |   .1878893    .016892    11.12   0.000     .1533414    .2224373
                   6  |    .154118   .0058885    26.17   0.000     .1420747    .1661613
                   7  |   .0830901   .0029586    28.08   0.000      .077039    .0891412
                   8  |   .0709762    .009148     7.76   0.000     .0522664     .089686
                   9  |   .1978472   .0065383    30.26   0.000     .1844748    .2112196
                  10  |   .2331086   .0082531    28.25   0.000     .2162292     .249988
                  11  |   .2538515   .0095381    26.61   0.000     .2343438    .2733591
                  12  |   .2581225   .0086465    29.85   0.000     .2404384    .2758066
                      |
                unemp |  -.0033456   .0013544    -2.47   0.020    -.0061157   -.0005754
                      |
              quarter |
                   2  |  -.0018129   .0020232    -0.90   0.378    -.0059507     .002325
                   3  |  -.0036661   .0016602    -2.21   0.035    -.0070616   -.0002706
                   4  |  -.0046063    .001309    -3.52   0.001    -.0072835   -.0019292
                      |
                _cons |  -.2580055   .0289926    -8.90   0.000    -.3173021    -.198709
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt p
> ublic cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 5,857,928,429)

Linear regression                               Number of obs     =    675,883
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2544
                                                Root MSE          =     .35725

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |    .051529   .0073912     6.97   0.000     .0364124    .0666456
             treat_st |   .0194966    .008656     2.25   0.032      .001793    .0372001
treat_stblackrelwhite |  -.0254208   .0117758    -2.16   0.039    -.0495051   -.0013365
                      |
                state |
                  NH  |  -.1693416   .0079299   -21.35   0.000    -.1855601    -.153123
                  VT  |  -.2394612     .00816   -29.35   0.000    -.2561503   -.2227721
                  MA  |   -.064091   .0121031    -5.30   0.000    -.0888447   -.0393373
                  RI  |  -.0490916    .014614    -3.36   0.002    -.0789807   -.0192025
                  CT  |  -.0756236   .0137746    -5.49   0.000    -.1037959   -.0474512
                  NY  |   .0511407   .0145603     3.51   0.001     .0213615    .0809199
                  NJ  |   .0619157   .0145649     4.25   0.000     .0321271    .0917043
                  PA  |   .1072255   .0116409     9.21   0.000     .0834172    .1310339
                  OH  |   .2265508   .0147146    15.40   0.000      .196456    .2566456
                  IN  |   .3897868   .0292958    13.31   0.000     .3298702    .4497034
                  IL  |   .1196335   .0110793    10.80   0.000     .0969739    .1422932
                  MI  |   .3727924   .0281081    13.26   0.000     .3153048      .43028
                  WI  |   .2812506   .0230899    12.18   0.000     .2340265    .3284747
                  MN  |   .0517576   .0121419     4.26   0.000     .0269247    .0765906
                  MO  |   .0015326   .0101653     0.15   0.881    -.0192579    .0223231
                  DE  |   .0255428   .0135438     1.89   0.069    -.0021574     .053243
                  MD  |  -.1524849    .015582    -9.79   0.000    -.1843537   -.1206161
                  DC  |   -.224551   .0227879    -9.85   0.000    -.2711574   -.1779445
                  WV  |   .1521074   .0147631    10.30   0.000     .1219134    .1823014
                  KY  |  -.1372192   .0168098    -8.16   0.000    -.1715991   -.1028393
                  OK  |  -.0511571   .0407665    -1.25   0.220     -.134534    .0322199
                  MT  |   .0046554   .0120343     0.39   0.702    -.0199576    .0292684
                  CO  |   -.310965   .0111892   -27.79   0.000    -.3338495   -.2880805
                  NM  |  -.3196205   .0107616   -29.70   0.000    -.3416305   -.2976104
                  WA  |   .1276094   .0093089    13.71   0.000     .1085704    .1466483
                  OR  |   .0079123   .0066907     1.18   0.247    -.0057716    .0215963
                  CA  |  -.0739962   .0146403    -5.05   0.000    -.1039389   -.0440534
                  AK  |  -.1189917   .0146729    -8.11   0.000    -.1490011   -.0889823
                  HI  |   .1766522   .0145046    12.18   0.000     .1469869    .2063176
                      |
        state#c.lyear |
                  ME  |  -.0020703    .000095   -21.79   0.000    -.0022647    -.001876
                  NH  |  -.0008256   .0001789    -4.61   0.000    -.0011915   -.0004596
                  VT  |   -.000175   .0000481    -3.64   0.001    -.0002734   -.0000766
                  MA  |  -.0013765   .0000603   -22.84   0.000    -.0014997   -.0012532
                  RI  |  -.0015103   .0000669   -22.58   0.000    -.0016471   -.0013735
                  CT  |  -.0012654   .0000934   -13.55   0.000    -.0014565   -.0010744
                  NY  |  -.0016835   .0000584   -28.82   0.000    -.0018029    -.001564
                  NJ  |  -.0022584   .0000699   -32.32   0.000    -.0024013   -.0021155
                  PA  |  -.0029236   .0000576   -50.77   0.000    -.0030414   -.0028058
                  OH  |  -.0041834   .0000494   -84.68   0.000    -.0042844   -.0040823
                  IN  |  -.0060459   .0002983   -20.27   0.000    -.0066559   -.0054358
                  IL  |  -.0028358   .0000684   -41.47   0.000    -.0029756   -.0026959
                  MI  |  -.0052763   .0002492   -21.17   0.000    -.0057861   -.0047666
                  WI  |  -.0048781   .0002157   -22.62   0.000    -.0053192   -.0044369
                  MN  |  -.0023471   .0000445   -52.70   0.000    -.0024382    -.002256
                  MO  |   -.002207   .0000504   -43.79   0.000    -.0023101   -.0021039
                  DE  |   -.002914   .0001465   -19.89   0.000    -.0032137   -.0026143
                  MD  |  -.0011394   .0000578   -19.72   0.000    -.0012575   -.0010212
                  DC  |   -.000419   .0001641    -2.55   0.016    -.0007546   -.0000835
                  WV  |  -.0038084   .0001526   -24.96   0.000    -.0041205   -.0034963
                  KY  |  -.0012599   .0001628    -7.74   0.000    -.0015929   -.0009268
                  OK  |  -.0026943   .0004255    -6.33   0.000    -.0035646    -.001824
                  MT  |  -.0021656   .0000617   -35.12   0.000    -.0022917   -.0020395
                  CO  |   .0003872   .0000571     6.78   0.000     .0002705     .000504
                  NM  |  -.0000588   .0001858    -0.32   0.754    -.0004389    .0003213
                  WA  |  -.0028262   .0000814   -34.70   0.000    -.0029928   -.0026597
                  OR  |  -.0020344    .000092   -22.11   0.000    -.0022226   -.0018462
                  CA  |  -.0010549   .0000502   -21.00   0.000    -.0011577   -.0009522
                  AK  |  -.0006375   .0000287   -22.18   0.000    -.0006963   -.0005787
                  HI  |  -.0036312   .0000402   -90.36   0.000    -.0037133    -.003549
                      |
                 nind |
                   2  |   .1481518   .0166515     8.90   0.000     .1140957    .1822079
                   3  |   .1133334   .0147303     7.69   0.000     .0832065    .1434602
                   4  |   .0273516    .013195     2.07   0.047     .0003647    .0543385
                   5  |     .19645   .0140533    13.98   0.000     .1677078    .2251923
                   6  |   .0193915   .0135393     1.43   0.163    -.0082995    .0470824
                   7  |   .0073073   .0126837     0.58   0.569    -.0186338    .0332483
                   8  |   .0381784   .0178516     2.14   0.041     .0016679     .074689
                   9  |   .1588865    .014614    10.87   0.000     .1289975    .1887755
                  10  |   .0166705   .0221485     0.75   0.458    -.0286282    .0619692
                  11  |   .1152842   .0215059     5.36   0.000     .0712997    .1592687
                      |
                 educ |   .0105088   .0016874     6.23   0.000     .0070577    .0139599
                exper |   .0096957   .0013807     7.02   0.000     .0068718    .0125196
               exper2 |  -.0001114   .0000866    -1.29   0.209    -.0002885    .0000657
               exper3 |   3.92e-06   2.64e-06     1.48   0.149    -1.49e-06    9.33e-06
               exper4 |  -7.82e-08   2.71e-08    -2.89   0.007    -1.34e-07   -2.28e-08
                 edex |  -.0003066   .0000533    -5.75   0.000    -.0004157   -.0001976
                      |
                ee_cl |
                   2  |  -.0240256   .0070461    -3.41   0.002    -.0384365   -.0096147
                   3  |  -.0187006   .0074488    -2.51   0.018    -.0339352    -.003466
                   4  |  -.0372974   .0092759    -4.02   0.000    -.0562687   -.0183261
                   5  |  -.0871155   .0090528    -9.62   0.000    -.1056306   -.0686005
                   6  |    -.00672   .0065069    -1.03   0.310    -.0200281     .006588
                   7  |   .0058424    .007717     0.76   0.455    -.0099406    .0216253
                   8  |  -.0502199   .0114603    -4.38   0.000    -.0736588   -.0267809
                   9  |  -.0666411   .0090502    -7.36   0.000    -.0851509   -.0481313
                  10  |   .0110519    .007658     1.44   0.160    -.0046104    .0267143
                  11  |   .0048623    .009337     0.52   0.606    -.0142341    .0239587
                  12  |  -.0666739   .0137907    -4.83   0.000     -.094879   -.0384688
                  13  |   .0136715   .0089228     1.53   0.136    -.0045777    .0319208
                  14  |   .0230228   .0080323     2.87   0.008     .0065948    .0394508
                  15  |  -.0049318   .0097074    -0.51   0.615    -.0247856     .014922
                  16  |  -.0738045   .0151078    -4.89   0.000    -.1047034   -.0429056
                      |
                 marr |   .0192759   .0017022    11.32   0.000     .0157945    .0227572
                partt |  -.0759505   .0042922   -17.69   0.000     -.084729   -.0671719
               public |   .3361574   .0216126    15.55   0.000     .2919547      .38036
                 cmsa |   .0491438   .0077115     6.37   0.000     .0333719    .0649156
                      |
                nocc2 |
                   2  |   .0572679   .0034456    16.62   0.000     .0502208     .064315
                   3  |   .0414744   .0057215     7.25   0.000     .0297725    .0531763
                   4  |   .1950435   .0051404    37.94   0.000     .1845303    .2055567
                   5  |    .187835   .0169437    11.09   0.000     .1531813    .2224887
                   6  |   .1543675   .0058344    26.46   0.000     .1424349    .1663001
                   7  |   .0833394   .0029204    28.54   0.000     .0773666    .0893122
                   8  |    .070928   .0092111     7.70   0.000     .0520892    .0897667
                   9  |   .1978011    .006462    30.61   0.000     .1845849    .2110174
                  10  |   .2329114   .0082054    28.39   0.000     .2161294    .2496934
                  11  |   .2538211   .0094805    26.77   0.000     .2344313    .2732109
                  12  |    .258408   .0086275    29.95   0.000     .2407628    .2760533
                      |
                unemp |  -.0005108   .0004778    -1.07   0.294     -.001488    .0004664
                      |
              quarter |
                   2  |  -.0018172   .0020228    -0.90   0.376    -.0059543    .0023199
                   3  |  -.0037841   .0016576    -2.28   0.030    -.0071742   -.0003939
                   4  |  -.0047212   .0013351    -3.54   0.001    -.0074518   -.0019907
                      |
                _cons |    -.10786   .0341372    -3.16   0.004    -.1776785   -.0380415
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_mal_all_sltt 

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cms
> a i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,726,442,181)

Linear regression                               Number of obs     =    682,696
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3162
                                                Root MSE          =     .31647

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0721468   .0111986     6.44   0.000     .0492431    .0950504
             treat_st |   -.025179   .0117137    -2.15   0.040    -.0491362   -.0012218
treat_stblackrelwhite |  -.0249282      .0204    -1.22   0.232     -.066651    .0167945
                      |
                state |
                  NH  |  -.0122296   .0019081    -6.41   0.000    -.0161321   -.0083272
                  VT  |  -.0051907   .0006036    -8.60   0.000    -.0064252   -.0039562
                  MA  |   .0210579   .0042286     4.98   0.000     .0124094    .0297064
                  RI  |   .0356649   .0041303     8.63   0.000     .0272175    .0441123
                  CT  |   .0293236   .0041512     7.06   0.000     .0208334    .0378138
                  NY  |   .0941221   .0042129    22.34   0.000     .0855058    .1027385
                  NJ  |   .0358874   .0043883     8.18   0.000     .0269123    .0448624
                  PA  |   .0137186   .0036969     3.71   0.001     .0061576    .0212796
                  OH  |  -.0031143   .0034582    -0.90   0.375    -.0101871    .0039586
                  IN  |  -.0407656   .0040075   -10.17   0.000    -.0489619   -.0325693
                  IL  |   .0046295   .0039822     1.16   0.254    -.0035151     .012774
                  MI  |   .0460323   .0040416    11.39   0.000     .0377664    .0542982
                  WI  |   .0005073   .0033121     0.15   0.879    -.0062666    .0072812
                  MN  |   .0408601    .003116    13.11   0.000     .0344872    .0472331
                  MO  |  -.0485416   .0035091   -13.83   0.000    -.0557185   -.0413646
                  DE  |  -.0309421   .0028154   -10.99   0.000    -.0367001    -.025184
                  MD  |  -.0456273   .0067541    -6.76   0.000    -.0594409   -.0318137
                  DC  |  -.0643821   .0085315    -7.55   0.000     -.081831   -.0469332
                  WV  |  -.0337302   .0023731   -14.21   0.000    -.0385837   -.0288766
                  KY  |  -.0606149   .0023883   -25.38   0.000    -.0654995   -.0557304
                  OK  |  -.0710599   .0064461   -11.02   0.000    -.0842437   -.0578762
                  MT  |   .0039132   .0020308     1.93   0.064    -.0002402    .0080667
                  CO  |  -.0416436   .0039231   -10.62   0.000    -.0496672     -.03362
                  NM  |  -.0842038   .0031807   -26.47   0.000    -.0907089   -.0776986
                  WA  |   .0627682   .0035044    17.91   0.000     .0556008    .0699356
                  OR  |   .0457744   .0031877    14.36   0.000     .0392548     .052294
                  CA  |    .045059   .0039725    11.34   0.000     .0369343    .0531837
                  AK  |   .0565799    .003755    15.07   0.000     .0489001    .0642597
                  HI  |   .0519458   .0025336    20.50   0.000     .0467641    .0571276
                      |
                 year |
                1990  |  -.0011228   .0021181    -0.53   0.600    -.0054549    .0032092
                1991  |  -.0033103   .0021992    -1.51   0.143    -.0078081    .0011876
                1992  |  -.0020511    .002691    -0.76   0.452    -.0075548    .0034526
                1993  |  -.0016404   .0030056    -0.55   0.589    -.0077875    .0045067
                1996  |  -.0004629   .0031586    -0.15   0.884    -.0069231    .0059972
                1997  |  -.0035299   .0031432    -1.12   0.271    -.0099584    .0028986
                1998  |  -.0094447   .0040113    -2.35   0.026    -.0176486   -.0012407
                1999  |   -.010528    .003567    -2.95   0.006    -.0178234   -.0032327
                2000  |  -.0069413   .0030707    -2.26   0.031    -.0132217   -.0006609
                2001  |  -.0069233   .0024873    -2.78   0.009    -.0120104   -.0018362
                2002  |  -.0074392   .0045617    -1.63   0.114    -.0167689    .0018905
                2003  |  -.0146577   .0035183    -4.17   0.000    -.0218535    -.007462
                2004  |  -.0173275   .0042217    -4.10   0.000    -.0259619   -.0086931
                2005  |  -.0202051   .0047062    -4.29   0.000    -.0298304   -.0105799
                2006  |  -.0215089   .0044434    -4.84   0.000    -.0305967   -.0124211
                2007  |  -.0177554   .0057765    -3.07   0.005    -.0295697   -.0059411
                2008  |  -.0173819   .0053075    -3.27   0.003     -.028237   -.0065267
                2009  |  -.0153867   .0052215    -2.95   0.006    -.0260659   -.0047075
                2010  |   -.019328   .0052476    -3.68   0.001    -.0300606   -.0085954
                2011  |  -.0168511     .00491    -3.43   0.002    -.0268932   -.0068089
                2012  |  -.0235294   .0053629    -4.39   0.000    -.0344976   -.0125611
                2013  |  -.0211788    .006308    -3.36   0.002    -.0340802   -.0082775
                2014  |   -.022099   .0061221    -3.61   0.001    -.0346202   -.0095778
                2015  |  -.0264658   .0069078    -3.83   0.001    -.0405938   -.0123378
                2016  |   -.018813   .0060154    -3.13   0.004    -.0311158   -.0065103
                2017  |  -.0230026   .0068782    -3.34   0.002    -.0370702    -.008935
                2018  |  -.0289807   .0045486    -6.37   0.000    -.0382837   -.0196778
                2019  |  -.0262012   .0069375    -3.78   0.001    -.0403899   -.0120125
                      |
                 nind |
                   2  |   .0610293   .0115313     5.29   0.000     .0374452    .0846134
                   3  |   .0745379   .0118846     6.27   0.000     .0502311    .0988447
                   4  |   .0661489   .0078883     8.39   0.000     .0500156    .0822822
                   5  |   .1983925   .0098478    20.15   0.000     .1782516    .2185335
                   6  |   .0347711   .0088288     3.94   0.000     .0167141    .0528281
                   7  |   .0239121   .0086977     2.75   0.010     .0061233    .0417008
                   8  |   .0546305   .0103952     5.26   0.000     .0333698    .0758911
                   9  |   .1942886   .0128719    15.09   0.000     .1679626    .2206146
                  10  |   .0198035   .0085893     2.31   0.028     .0022364    .0373705
                  11  |    .041095   .0217509     1.89   0.069    -.0033905    .0855806
                      |
                 educ |   .0153346   .0023618     6.49   0.000     .0105043    .0201649
                exper |   .0110738   .0014827     7.47   0.000     .0080414    .0141062
               exper2 |  -.0004272   .0000912    -4.68   0.000    -.0006139   -.0002406
               exper3 |   .0000106   3.00e-06     3.53   0.001     4.47e-06    .0000168
               exper4 |  -1.03e-07   3.21e-08    -3.20   0.003    -1.68e-07   -3.70e-08
                 edex |  -.0001888   .0000533    -3.54   0.001    -.0002978   -.0000798
                      |
                ee_cl |
                   2  |  -.0363902   .0056532    -6.44   0.000    -.0479524    -.024828
                   3  |   -.069517   .0066737   -10.42   0.000    -.0831662   -.0558678
                   4  |  -.0999158   .0137127    -7.29   0.000    -.1279615   -.0718702
                   5  |  -.0475717   .0081734    -5.82   0.000    -.0642882   -.0308552
                   6  |  -.0423543   .0062135    -6.82   0.000    -.0550622   -.0296463
                   7  |  -.0638734   .0086194    -7.41   0.000    -.0815021   -.0462447
                   8  |  -.0918824   .0130695    -7.03   0.000    -.1186126   -.0651523
                   9  |   -.028297   .0092118    -3.07   0.005    -.0471373   -.0094567
                  10  |  -.0428037   .0077368    -5.53   0.000    -.0586271   -.0269803
                  11  |  -.0636577   .0094939    -6.71   0.000    -.0830748   -.0442405
                  12  |  -.0842231   .0122373    -6.88   0.000    -.1092512    -.059195
                  13  |   -.001004   .0087908    -0.11   0.910    -.0189831    .0169752
                  14  |  -.0380865   .0088069    -4.32   0.000    -.0560985   -.0200744
                  15  |  -.0606926   .0103539    -5.86   0.000    -.0818687   -.0395165
                  16  |  -.0783612   .0138696    -5.65   0.000    -.1067276   -.0499948
                      |
                 marr |   -.000303   .0011918    -0.25   0.801    -.0027406    .0021345
                partt |    -.06706   .0054471   -12.31   0.000    -.0782006   -.0559194
               public |   .3661761    .022779    16.08   0.000     .3195878    .4127644
                 cmsa |   .0260418   .0040512     6.43   0.000     .0177561    .0343275
                      |
                nocc2 |
                   2  |   .0236321   .0023109    10.23   0.000     .0189057    .0283585
                   3  |   .0422884    .006903     6.13   0.000     .0281703    .0564066
                   4  |   .1701103    .004192    40.58   0.000     .1615367    .1786838
                   5  |   .1760161   .0144457    12.18   0.000     .1464712    .2055609
                   6  |   .0759721   .0036436    20.85   0.000       .06852    .0834241
                   7  |   .1051219    .005732    18.34   0.000     .0933987     .116845
                   8  |   .0580546   .0046729    12.42   0.000     .0484973    .0676118
                   9  |   .1195975   .0082632    14.47   0.000     .1026975    .1364976
                  10  |   .2248816    .009227    24.37   0.000     .2060102    .2437531
                  11  |   .2576799   .0094124    27.38   0.000     .2384294    .2769305
                  12  |   .2236799   .0117993    18.96   0.000     .1995476    .2478123
                      |
              quarter |
                   2  |   -.002214   .0012269    -1.80   0.082    -.0047233    .0002953
                   3  |  -.0003549   .0011559    -0.31   0.761     -.002719    .0020092
                   4  |  -.0037855   .0015873    -2.38   0.024    -.0070319   -.0005391
                      |
                _cons |  -.2995498   .0334675    -8.95   0.000    -.3679984   -.2311011
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cms
> a i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,726,442,181)

Linear regression                               Number of obs     =    682,696
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3162
                                                Root MSE          =     .31647

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0721485   .0111967     6.44   0.000     .0492488    .0950483
             treat_st |  -.0256905   .0115345    -2.23   0.034    -.0492812   -.0020998
treat_stblackrelwhite |  -.0250808   .0204166    -1.23   0.229    -.0668374    .0166759
                      |
                state |
                  NH  |  -.0146675   .0020068    -7.31   0.000    -.0187719    -.010563
                  VT  |  -.0074534   .0015425    -4.83   0.000    -.0106082   -.0042987
                  MA  |    .021191   .0042465     4.99   0.000     .0125059    .0298762
                  RI  |   .0379653   .0045467     8.35   0.000     .0286663    .0472644
                  CT  |    .029607   .0041694     7.10   0.000     .0210798    .0381343
                  NY  |    .095749   .0041968    22.81   0.000     .0871656    .1043325
                  NJ  |   .0371041   .0044803     8.28   0.000     .0279409    .0462673
                  PA  |   .0145872   .0037905     3.85   0.001     .0068347    .0223397
                  OH  |  -.0017277   .0036028    -0.48   0.635    -.0090962    .0056408
                  IN  |  -.0405049   .0039895   -10.15   0.000    -.0486643   -.0323455
                  IL  |   .0067945   .0041989     1.62   0.116    -.0017933    .0153822
                  MI  |   .0493367   .0046955    10.51   0.000     .0397334      .05894
                  WI  |  -.0002747   .0032441    -0.08   0.933    -.0069096    .0063602
                  MN  |   .0391378   .0030839    12.69   0.000     .0328305    .0454452
                  MO  |  -.0480794   .0035326   -13.61   0.000    -.0553044   -.0408544
                  DE  |  -.0322706   .0033519    -9.63   0.000     -.039126   -.0254151
                  MD  |   -.046285   .0068448    -6.76   0.000    -.0602841   -.0322859
                  DC  |  -.0606159   .0081574    -7.43   0.000    -.0772997   -.0439321
                  WV  |  -.0306152   .0028451   -10.76   0.000    -.0364341   -.0247963
                  KY  |  -.0587859   .0026507   -22.18   0.000    -.0642072   -.0533646
                  OK  |  -.0718479   .0062623   -11.47   0.000    -.0846558     -.05904
                  MT  |   .0036853   .0020427     1.80   0.082    -.0004926    .0078631
                  CO  |  -.0424223   .0038583   -11.00   0.000    -.0503135   -.0345312
                  NM  |  -.0826577   .0033194   -24.90   0.000    -.0894467   -.0758688
                  WA  |   .0646286   .0039142    16.51   0.000     .0566231     .072634
                  OR  |   .0483277    .003894    12.41   0.000     .0403637    .0562918
                  CA  |   .0484622    .004622    10.49   0.000     .0390092    .0579152
                  AK  |   .0609572   .0045732    13.33   0.000      .051604    .0703105
                  HI  |   .0496662   .0026927    18.44   0.000      .044159    .0551735
                      |
                 year |
                1990  |  -.0001452    .002387    -0.06   0.952    -.0050271    .0047367
                1991  |   .0005082   .0037042     0.14   0.892    -.0070677    .0080841
                1992  |   .0031311   .0034038     0.92   0.365    -.0038305    .0100927
                1993  |   .0023942   .0036818     0.65   0.521    -.0051361    .0099244
                1996  |   .0000739   .0031593     0.02   0.982    -.0063876    .0065353
                1997  |  -.0039432   .0031253    -1.26   0.217    -.0103351    .0024487
                1998  |   -.010765   .0040453    -2.66   0.013    -.0190386   -.0024914
                1999  |  -.0124754   .0036415    -3.43   0.002    -.0199231   -.0050277
                2000  |  -.0092932   .0029459    -3.15   0.004    -.0153182   -.0032683
                2001  |  -.0077953   .0024706    -3.16   0.004    -.0128482   -.0027425
                2002  |  -.0060726   .0047473    -1.28   0.211    -.0157818    .0036367
                2003  |  -.0126215   .0038081    -3.31   0.002    -.0204098   -.0048331
                2004  |  -.0161368   .0044681    -3.61   0.001    -.0252751   -.0069985
                2005  |   -.019971   .0047752    -4.18   0.000    -.0297375   -.0102045
                2006  |  -.0220377   .0045197    -4.88   0.000    -.0312816   -.0127938
                2007  |    -.01827   .0059984    -3.05   0.005     -.030538    -.006002
                2008  |  -.0157442   .0055964    -2.81   0.009    -.0271901   -.0042982
                2009  |   -.006674   .0071174    -0.94   0.356    -.0212307    .0078827
                2010  |  -.0099887   .0070666    -1.41   0.168    -.0244415    .0044642
                2011  |  -.0091514   .0065571    -1.40   0.173    -.0225623    .0042594
                2012  |  -.0173288   .0066005    -2.63   0.014    -.0308283   -.0038293
                2013  |  -.0161223   .0070334    -2.29   0.029    -.0305073   -.0017373
                2014  |  -.0197614   .0062732    -3.15   0.004    -.0325917   -.0069312
                2015  |  -.0261374   .0070482    -3.71   0.001    -.0405526   -.0117223
                2016  |  -.0192382   .0060394    -3.19   0.003    -.0315903   -.0068862
                2017  |  -.0243698   .0070212    -3.47   0.002    -.0387298   -.0100099
                2018  |  -.0312272   .0051213    -6.10   0.000    -.0417015   -.0207529
                2019  |  -.0287838   .0076207    -3.78   0.001    -.0443699   -.0131977
                      |
                 nind |
                   2  |   .0609351   .0115268     5.29   0.000     .0373602      .08451
                   3  |   .0744663   .0118688     6.27   0.000     .0501919    .0987406
                   4  |   .0660875   .0079001     8.37   0.000       .04993     .082245
                   5  |   .1983399   .0098669    20.10   0.000     .1781599    .2185198
                   6  |   .0347057   .0088386     3.93   0.000     .0166288    .0527827
                   7  |   .0238277   .0087036     2.74   0.010     .0060269    .0416285
                   8  |   .0545714   .0103953     5.25   0.000     .0333107    .0758321
                   9  |   .1942145   .0128656    15.10   0.000     .1679014    .2205277
                  10  |   .0197385   .0086118     2.29   0.029     .0021253    .0373517
                  11  |   .0409855   .0217511     1.88   0.070    -.0035004    .0854714
                      |
                 educ |   .0153273   .0023646     6.48   0.000     .0104912    .0201634
                exper |   .0110849   .0014818     7.48   0.000     .0080543    .0141154
               exper2 |  -.0004282   .0000911    -4.70   0.000    -.0006145    -.000242
               exper3 |   .0000106   3.00e-06     3.55   0.001     4.51e-06    .0000168
               exper4 |  -1.03e-07   3.20e-08    -3.21   0.003    -1.68e-07   -3.74e-08
                 edex |  -.0001889   .0000532    -3.55   0.001    -.0002977     -.00008
                      |
                ee_cl |
                   2  |  -.0363399   .0056448    -6.44   0.000    -.0478848   -.0247951
                   3  |  -.0694508   .0066491   -10.45   0.000    -.0830497   -.0558519
                   4  |  -.0998283   .0136982    -7.29   0.000    -.1278444   -.0718123
                   5  |  -.0475222   .0081511    -5.83   0.000     -.064193   -.0308514
                   6  |  -.0423054   .0061974    -6.83   0.000    -.0549806   -.0296302
                   7  |  -.0637842   .0085873    -7.43   0.000    -.0813472   -.0462212
                   8  |  -.0917766   .0130372    -7.04   0.000    -.1184407   -.0651125
                   9  |  -.0282504   .0092079    -3.07   0.005    -.0470826   -.0094183
                  10  |  -.0427522   .0077117    -5.54   0.000    -.0585243     -.02698
                  11  |  -.0635599    .009455    -6.72   0.000    -.0828975   -.0442222
                  12  |  -.0841059   .0121973    -6.90   0.000    -.1090521   -.0591596
                  13  |  -.0009539    .008764    -0.11   0.914    -.0188784    .0169705
                  14  |  -.0380075   .0087707    -4.33   0.000    -.0559455   -.0200695
                  15  |  -.0605773   .0103057    -5.88   0.000    -.0816549   -.0394998
                  16  |  -.0782459   .0138389    -5.65   0.000    -.1065495   -.0499422
                      |
                 marr |  -.0003037   .0011917    -0.25   0.801    -.0027411    .0021336
                partt |  -.0670331   .0054344   -12.33   0.000    -.0781477   -.0559184
               public |   .3661945   .0227862    16.07   0.000     .3195914    .4127976
                 cmsa |   .0260064   .0040604     6.40   0.000     .0177019    .0343109
                      |
                nocc2 |
                   2  |   .0236142   .0023071    10.24   0.000     .0188958    .0283327
                   3  |   .0422754   .0068974     6.13   0.000     .0281686    .0563823
                   4  |   .1701001   .0041911    40.59   0.000     .1615283    .1786719
                   5  |   .1759937   .0144493    12.18   0.000     .1464416    .2055458
                   6  |   .0759699   .0036424    20.86   0.000     .0685205    .0834194
                   7  |   .1051105   .0057252    18.36   0.000     .0934012    .1168199
                   8  |    .058085   .0046796    12.41   0.000     .0485142    .0676558
                   9  |   .1195868   .0082613    14.48   0.000     .1026907     .136483
                  10  |   .2248386   .0092118    24.41   0.000     .2059983    .2436789
                  11  |   .2576432   .0094144    27.37   0.000     .2383887    .2768977
                  12  |   .2236385   .0118124    18.93   0.000     .1994794    .2477975
                      |
                unemp |  -.0020515   .0012475    -1.64   0.111     -.004603    .0004999
                      |
              quarter |
                   2  |  -.0022041   .0012256    -1.80   0.083    -.0047107    .0003025
                   3  |  -.0003359   .0011478    -0.29   0.772    -.0026835    .0020117
                   4  |  -.0037501   .0015648    -2.40   0.023    -.0069506   -.0005497
                      |
                _cons |  -.2901931   .0313903    -9.24   0.000    -.3543934   -.2259928
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt p
> ublic cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,726,442,181)

Linear regression                               Number of obs     =    682,696
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3167
                                                Root MSE          =     .31636

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |    .072317   .0111777     6.47   0.000     .0494561    .0951779
             treat_st |  -.0076791   .0117585    -0.65   0.519    -.0317278    .0163696
treat_stblackrelwhite |   -.027275   .0201841    -1.35   0.187    -.0685562    .0140061
                      |
                state |
                  NH  |  -.1412484   .0042208   -33.47   0.000    -.1498809    -.132616
                  VT  |  -.1472431   .0052971   -27.80   0.000    -.1580769   -.1364093
                  MA  |  -.0122929   .0099115    -1.24   0.225    -.0325643    .0079785
                  RI  |  -.0501677   .0094125    -5.33   0.000    -.0694183    -.030917
                  CT  |  -.0831333   .0119102    -6.98   0.000    -.1074924   -.0587741
                  NY  |   .0056194    .011587     0.48   0.631    -.0180787    .0293176
                  NJ  |    .134713   .0120676    11.16   0.000      .110032     .159394
                  PA  |   .1176004   .0104631    11.24   0.000     .0962011    .1389998
                  OH  |    .113792   .0101636    11.20   0.000     .0930051    .1345789
                  IN  |   .1290885   .0390658     3.30   0.003     .0491901     .208987
                  IL  |   .0240826    .009633     2.50   0.018     .0043808    .0437844
                  MI  |   .1191944    .036861     3.23   0.003     .0438052    .1945837
                  WI  |   .3129818   .0306827    10.20   0.000     .2502286     .375735
                  MN  |   .1616682   .0100843    16.03   0.000     .1410435    .1822929
                  MO  |   .0264929    .006952     3.81   0.001     .0122743    .0407114
                  DE  |   .0059379   .0166234     0.36   0.724    -.0280608    .0399367
                  MD  |   .0980391   .0145886     6.72   0.000      .068202    .1278761
                  DC  |  -.0972943   .0387595    -2.51   0.018    -.1765663   -.0180223
                  WV  |  -.0458843    .017682    -2.59   0.015    -.0820481   -.0097206
                  KY  |  -.0973897   .0211552    -4.60   0.000     -.140657   -.0541224
                  OK  |   -.025469   .0526563    -0.48   0.632    -.1331633    .0822252
                  MT  |  -.0394343   .0120784    -3.26   0.003    -.0641374   -.0147312
                  CO  |  -.1646223   .0102654   -16.04   0.000    -.1856174   -.1436272
                  NM  |  -.1462809   .0055822   -26.21   0.000    -.1576978   -.1348641
                  WA  |   .1310269   .0100802    13.00   0.000     .1104105    .1516432
                  OR  |  -.0099523   .0069087    -1.44   0.160    -.0240821    .0041775
                  CA  |  -.0410035   .0115793    -3.54   0.001    -.0646857   -.0173213
                  AK  |  -.0280275   .0101596    -2.76   0.010    -.0488063   -.0072488
                  HI  |   .1885999   .0129098    14.61   0.000     .1621965    .2150033
                      |
        state#c.lyear |
                  ME  |  -.0007179   .0000994    -7.22   0.000    -.0009212   -.0005146
                  NH  |   .0004859   .0001255     3.87   0.001     .0002292    .0007425
                  VT  |   .0006546   .0000585    11.18   0.000     .0005348    .0007743
                  MA  |  -.0003944   .0000601    -6.57   0.000    -.0005172   -.0002715
                  RI  |   .0001107     .00008     1.38   0.177    -.0000528    .0002743
                  CT  |   .0003704   .0000824     4.49   0.000     .0002019    .0005389
                  NY  |   .0001455   .0000422     3.44   0.002     .0000591    .0002319
                  NJ  |  -.0016674   .0000453   -36.78   0.000    -.0017602   -.0015747
                  PA  |    -.00172   .0000352   -48.88   0.000     -.001792   -.0016481
                  OH  |  -.0018455   .0000482   -38.27   0.000    -.0019442   -.0017469
                  IN  |  -.0023984   .0003956    -6.06   0.000    -.0032075   -.0015893
                  IL  |  -.0009062   .0000443   -20.43   0.000    -.0009969   -.0008154
                  MI  |  -.0014596   .0003488    -4.18   0.000    -.0021729   -.0007463
                  WI  |  -.0037637   .0003029   -12.43   0.000    -.0043831   -.0031442
                  MN  |  -.0018795    .000041   -45.82   0.000    -.0019634   -.0017956
                  MO  |  -.0014403   .0000629   -22.89   0.000     -.001569   -.0013116
                  DE  |  -.0010828   .0001265    -8.56   0.000    -.0013415   -.0008241
                  MD  |  -.0020873   .0000551   -37.88   0.000       -.0022   -.0019746
                  DC  |  -.0004048   .0002331    -1.74   0.093    -.0008816    .0000719
                  WV  |  -.0006165   .0001671    -3.69   0.001    -.0009582   -.0002748
                  KY  |  -.0003826   .0001959    -1.95   0.061    -.0007832    .0000181
                  OK  |  -.0012527    .000558    -2.24   0.033     -.002394   -.0001114
                  MT  |  -.0003017   .0000374    -8.06   0.000    -.0003782   -.0002251
                  CO  |   .0004581   .0000653     7.01   0.000     .0003245    .0005917
                  NM  |  -.0001292   .0001035    -1.25   0.222    -.0003409    .0000825
                  WA  |  -.0013747   .0000405   -33.93   0.000    -.0014575   -.0012918
                  OR  |  -.0001838   .0000707    -2.60   0.015    -.0003284   -.0000391
                  CA  |   .0001197   .0000605     1.98   0.057    -4.00e-06    .0002435
                  AK  |   .0001166   .0000843     1.38   0.177    -.0000558    .0002889
                  HI  |  -.0020618   .0001006   -20.49   0.000    -.0022676   -.0018561
                      |
                 nind |
                   2  |   .0602365   .0116061     5.19   0.000     .0364994    .0839736
                   3  |   .0740958   .0118778     6.24   0.000     .0498029    .0983886
                   4  |    .065408   .0079442     8.23   0.000     .0491604    .0816556
                   5  |   .1974914   .0098706    20.01   0.000     .1773038    .2176789
                   6  |   .0342889   .0088726     3.86   0.001     .0161425    .0524353
                   7  |   .0231945   .0087595     2.65   0.013     .0052792    .0411098
                   8  |   .0539939    .010514     5.14   0.000     .0324903    .0754975
                   9  |   .1936426   .0129945    14.90   0.000     .1670659    .2202192
                  10  |   .0193103    .008544     2.26   0.031     .0018358    .0367847
                  11  |   .0402629    .021861     1.84   0.076     -.004448    .0849737
                      |
                 educ |   .0152327   .0022414     6.80   0.000     .0106485    .0198169
                exper |   .0111078   .0014798     7.51   0.000     .0080814    .0141343
               exper2 |  -.0004274   .0000903    -4.73   0.000    -.0006121   -.0002427
               exper3 |   .0000106   2.98e-06     3.56   0.001     4.50e-06    .0000167
               exper4 |  -1.02e-07   3.18e-08    -3.21   0.003    -1.67e-07   -3.70e-08
                 edex |  -.0001899   .0000533    -3.56   0.001     -.000299   -.0000808
                      |
                ee_cl |
                   2  |  -.0368062   .0055519    -6.63   0.000    -.0481612   -.0254513
                   3  |  -.0693442   .0063994   -10.84   0.000    -.0824325   -.0562558
                   4  |  -.0997064   .0131975    -7.55   0.000    -.1266983   -.0727146
                   5  |  -.0482451   .0083567    -5.77   0.000    -.0653365   -.0311537
                   6  |  -.0431714   .0062662    -6.89   0.000    -.0559873   -.0303556
                   7  |  -.0634719   .0084443    -7.52   0.000    -.0807424   -.0462013
                   8  |  -.0915364   .0126651    -7.23   0.000    -.1174395   -.0656334
                   9  |  -.0291111   .0093649    -3.11   0.004    -.0482644   -.0099578
                  10  |  -.0433084   .0077392    -5.60   0.000    -.0591368     -.02748
                  11  |  -.0633987   .0093462    -6.78   0.000    -.0825139   -.0442834
                  12  |  -.0838813   .0117968    -7.11   0.000    -.1080085    -.059754
                  13  |  -.0018952   .0089678    -0.21   0.834    -.0202363     .016446
                  14  |  -.0382733   .0087296    -4.38   0.000    -.0561274   -.0204192
                  15  |  -.0606602   .0101615    -5.97   0.000    -.0814428   -.0398776
                  16  |  -.0784422   .0134031    -5.85   0.000    -.1058546   -.0510298
                      |
                 marr |  -.0002738   .0011898    -0.23   0.820    -.0027073    .0021597
                partt |  -.0670603   .0053966   -12.43   0.000    -.0780976    -.056023
               public |   .3661393   .0228085    16.05   0.000     .3194907    .4127878
                 cmsa |   .0257803   .0042033     6.13   0.000     .0171835    .0343771
                      |
                nocc2 |
                   2  |   .0237761   .0022877    10.39   0.000     .0190972    .0284551
                   3  |   .0422232   .0068972     6.12   0.000     .0281169    .0563296
                   4  |   .1698759   .0042106    40.35   0.000     .1612643    .1784875
                   5  |   .1759329   .0144624    12.16   0.000     .1463539    .2055118
                   6  |   .0759015    .003656    20.76   0.000      .068424    .0833789
                   7  |   .1051969   .0056349    18.67   0.000     .0936721    .1167216
                   8  |   .0579897   .0047165    12.30   0.000     .0483434     .067636
                   9  |   .1193562   .0082444    14.48   0.000     .1024945    .1362178
                  10  |   .2241764   .0092523    24.23   0.000     .2052532    .2430995
                  11  |   .2577631   .0094593    27.25   0.000     .2384166    .2771095
                  12  |   .2236536   .0118476    18.88   0.000     .1994225    .2478847
                      |
                unemp |   .0001602   .0004127     0.39   0.701    -.0006839    .0010042
                      |
              quarter |
                   2  |   -.002309   .0012263    -1.88   0.070     -.004817     .000199
                   3  |  -.0004518   .0011904    -0.38   0.707    -.0028864    .0019827
                   4  |  -.0038541   .0015979    -2.41   0.022    -.0071222   -.0005859
                      |
                _cons |  -.2367578   .0315634    -7.50   0.000    -.3013123   -.1722033
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,866,086,925)

Linear regression                               Number of obs     =    677,009
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5101
                                                Root MSE          =     .41713

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1437029   .0066898   -21.48   0.000    -.1573851   -.1300206
             treat_st |  -.0350627   .0184381    -1.90   0.067    -.0727729    .0026475
treat_stblackrelwhite |  -.0118894   .0075032    -1.58   0.124    -.0272351    .0034563
                      |
                state |
                  NH  |   .0903849   .0051856    17.43   0.000     .0797792    .1009905
                  VT  |   .0259003   .0010186    25.43   0.000      .023817    .0279836
                  MA  |   .1198454   .0119503    10.03   0.000     .0954042    .1442866
                  RI  |   .0313362    .012353     2.54   0.017     .0060714     .056601
                  CT  |   .1325362   .0118618    11.17   0.000      .108276    .1567963
                  NY  |   .0978621   .0114076     8.58   0.000     .0745308    .1211934
                  NJ  |   .1709787   .0127465    13.41   0.000     .1449091    .1970483
                  PA  |   .0112061   .0093059     1.20   0.238    -.0078267    .0302388
                  OH  |  -.0168322   .0090527    -1.86   0.073     -.035347    .0016827
                  IN  |   .0067112   .0068275     0.98   0.334    -.0072526     .020675
                  IL  |   .0817123   .0100556     8.13   0.000     .0611463    .1022783
                  MI  |   .0469436   .0087579     5.36   0.000     .0290317    .0648555
                  WI  |   .0222719    .006587     3.38   0.002        .0088    .0357438
                  MN  |   .0699822   .0086403     8.10   0.000     .0523107    .0876536
                  MO  |  -.0198509   .0087375    -2.27   0.031     -.037721   -.0019807
                  DE  |   .0516684   .0020414    25.31   0.000     .0474933    .0558435
                  MD  |   .1243199   .0125544     9.90   0.000     .0986433    .1499966
                  DC  |   .1710958    .015119    11.32   0.000      .140174    .2020176
                  WV  |  -.0456557   .0039245   -11.63   0.000    -.0536822   -.0376291
                  KY  |  -.0423745   .0058025    -7.30   0.000     -.054242   -.0305069
                  OK  |  -.0569194    .012002    -4.74   0.000    -.0814661   -.0323726
                  MT  |  -.0339324   .0020552   -16.51   0.000    -.0381357   -.0297291
                  CO  |   .0360892   .0113053     3.19   0.003     .0129673     .059211
                  NM  |   -.035461   .0073973    -4.79   0.000    -.0505901   -.0203319
                  WA  |   .0985255   .0105248     9.36   0.000     .0769999    .1200512
                  OR  |    .026258   .0094625     2.77   0.010      .006905    .0456111
                  CA  |   .1594193   .0124951    12.76   0.000      .133864    .1849746
                  AK  |   .2352697   .0067389    34.91   0.000     .2214872    .2490523
                  HI  |   .1126349   .0094619    11.90   0.000     .0932832    .1319866
                      |
                 year |
                1990  |  -.0086639   .0033148    -2.61   0.014    -.0154435   -.0018843
                1991  |  -.0216669   .0034002    -6.37   0.000     -.028621   -.0147128
                1992  |  -.0224635   .0036471    -6.16   0.000    -.0299227   -.0150043
                1993  |  -.0323202   .0038945    -8.30   0.000    -.0402853   -.0243552
                1996  |  -.0292493   .0068621    -4.26   0.000    -.0432838   -.0152148
                1997  |  -.0186705   .0069295    -2.69   0.012    -.0328429   -.0044981
                1998  |   .0011271   .0053099     0.21   0.833    -.0097329    .0119872
                1999  |    .023365   .0070819     3.30   0.003     .0088808    .0378492
                2000  |   .0335777   .0066746     5.03   0.000     .0199266    .0472289
                2001  |   .0483098    .007218     6.69   0.000     .0335474    .0630722
                2002  |   .0552943   .0071873     7.69   0.000     .0405946     .069994
                2003  |   .0412256   .0079194     5.21   0.000     .0250286    .0574225
                2004  |   .0360136   .0077907     4.62   0.000     .0200798    .0519474
                2005  |   .0202491    .007497     2.70   0.011     .0049159    .0355823
                2006  |   .0151383   .0084368     1.79   0.083    -.0021168    .0323935
                2007  |   .0159325    .009699     1.64   0.111    -.0039042    .0357693
                2008  |   .0065986   .0103114     0.64   0.527    -.0144907    .0276878
                2009  |   .0193593   .0093171     2.08   0.047     .0003036     .038415
                2010  |   .0130804   .0108179     1.21   0.236    -.0090446    .0352054
                2011  |  -.0055038   .0088161    -0.62   0.537    -.0235347    .0125272
                2012  |  -.0131725   .0103572    -1.27   0.214    -.0343553    .0080103
                2013  |  -.0112738   .0089641    -1.26   0.219    -.0296074    .0070598
                2014  |  -.0119332   .0073937    -1.61   0.117    -.0270552    .0031887
                2015  |   .0121689   .0074597     1.63   0.114    -.0030879    .0274257
                2016  |   .0194968   .0094513     2.06   0.048     .0001666    .0388269
                2017  |   .0334014   .0103992     3.21   0.003     .0121327      .05467
                2018  |   .0404283   .0099264     4.07   0.000     .0201266      .06073
                2019  |   .0609917   .0088315     6.91   0.000     .0429292    .0790541
                      |
                 nind |
                   2  |   .1261276   .0317691     3.97   0.000     .0611524    .1911028
                   3  |     .11687   .0285059     4.10   0.000     .0585688    .1751711
                   4  |  -.0706112   .0291713    -2.42   0.022    -.1302732   -.0109492
                   5  |   .1468148   .0279978     5.24   0.000      .089553    .2040767
                   6  |   .1197946   .0327383     3.66   0.001     .0528372     .186752
                   7  |    .016116   .0307001     0.52   0.604    -.0466728    .0789048
                   8  |  -.0496795   .0290539    -1.71   0.098    -.1091014    .0097425
                   9  |  -.0390618   .0299053    -1.31   0.202    -.1002251    .0221015
                  10  |   -.082665   .0319331    -2.59   0.015    -.1479754   -.0173545
                  11  |   .1338345   .0304313     4.40   0.000     .0715955    .1960734
                      |
                 educ |   .0671126   .0025237    26.59   0.000      .061951    .0722742
                exper |   .0451851   .0024689    18.30   0.000     .0401356    .0502346
               exper2 |  -.0010076   .0001141    -8.83   0.000    -.0012409   -.0007742
               exper3 |   6.41e-06   2.72e-06     2.36   0.025     8.51e-07     .000012
               exper4 |   1.50e-08   2.57e-08     0.58   0.564    -3.76e-08    6.76e-08
                 edex |  -.0003388   .0000718    -4.72   0.000    -.0004857   -.0001919
                      |
                ee_cl |
                   2  |   -.063819   .0056329   -11.33   0.000    -.0753396   -.0522983
                   3  |  -.0747972   .0070007   -10.68   0.000    -.0891153   -.0604792
                   4  |  -.0366455   .0114382    -3.20   0.003    -.0600392   -.0132518
                   5  |  -.1377462   .0090632   -15.20   0.000    -.1562825   -.1192099
                   6  |  -.0838553    .007018   -11.95   0.000    -.0982087    -.069502
                   7  |  -.0667112   .0079626    -8.38   0.000    -.0829965   -.0504258
                   8  |   .0132838    .011083     1.20   0.240    -.0093835    .0359512
                   9  |  -.1420551   .0106944   -13.28   0.000    -.1639275   -.1201826
                  10  |  -.0905709   .0097011    -9.34   0.000    -.1104118   -.0707299
                  11  |  -.0608034   .0095461    -6.37   0.000    -.0803273   -.0412795
                  12  |   .0124251   .0120328     1.03   0.310    -.0121848    .0370351
                  13  |  -.0514273   .0118312    -4.35   0.000    -.0756249   -.0272298
                  14  |  -.0702598   .0114229    -6.15   0.000    -.0936221   -.0468974
                  15  |  -.0525987   .0103021    -5.11   0.000    -.0736689   -.0315284
                  16  |   .0053104   .0127454     0.42   0.680    -.0207568    .0313777
                      |
                 marr |   .1207073   .0032342    37.32   0.000     .1140925     .127322
                partt |  -.2246201   .0058459   -38.42   0.000    -.2365762   -.2126639
               public |   .0323443   .0072558     4.46   0.000     .0175045    .0471841
                 cmsa |   .1454383   .0126684    11.48   0.000     .1195285     .171348
                      |
                nocc2 |
                   2  |  -.1432316   .0044389   -32.27   0.000      -.15231   -.1341531
                   3  |  -.0443083   .0079318    -5.59   0.000    -.0605307   -.0280859
                   4  |  -.2820482   .0124397   -22.67   0.000    -.3074902   -.2566061
                   5  |  -.0722645   .0093244    -7.75   0.000    -.0913351   -.0531938
                   6  |  -.3734576   .0077763   -48.03   0.000    -.3893618   -.3575533
                   7  |  -.2315754   .0066268   -34.95   0.000    -.2451288   -.2180221
                   8  |  -.0943817   .0146971    -6.42   0.000    -.1244406   -.0643228
                   9  |  -.3860925      .0051   -75.70   0.000    -.3965231   -.3756619
                  10  |  -.3283825   .0066703   -49.23   0.000    -.3420248   -.3147403
                  11  |  -.2146377     .00601   -35.71   0.000    -.2269296   -.2023458
                  12  |  -.3789864   .0076098   -49.80   0.000    -.3945502   -.3634227
                      |
              quarter |
                   2  |   .0011401   .0021884     0.52   0.606    -.0033357    .0056159
                   3  |   .0026143   .0026903     0.97   0.339    -.0028881    .0081166
                   4  |   .0129537   .0020204     6.41   0.000     .0088215    .0170859
                      |
                _cons |   .6201932   .0453765    13.67   0.000     .5273879    .7129986
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,866,086,925)

Linear regression                               Number of obs     =    677,009
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5101
                                                Root MSE          =     .41712

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1437061   .0066982   -21.45   0.000    -.1574054   -.1300068
             treat_st |  -.0360941   .0190806    -1.89   0.069    -.0751184    .0029302
treat_stblackrelwhite |  -.0120784   .0076291    -1.58   0.124    -.0276816    .0035249
                      |
                state |
                  NH  |   .0854033   .0053333    16.01   0.000     .0744955     .096311
                  VT  |   .0212164    .002354     9.01   0.000     .0164019    .0260308
                  MA  |   .1201587   .0119864    10.02   0.000     .0956438    .1446735
                  RI  |   .0359716   .0129925     2.77   0.010      .009399    .0625441
                  CT  |   .1330581   .0119017    11.18   0.000     .1087164    .1573998
                  NY  |   .1011627   .0118797     8.52   0.000      .076866    .1254595
                  NJ  |   .1734258   .0130479    13.29   0.000     .1467399    .2001118
                  PA  |   .0129488   .0094742     1.37   0.182    -.0064281    .0323257
                  OH  |  -.0140788   .0092718    -1.52   0.140    -.0330417    .0048841
                  IN  |   .0071105   .0069045     1.03   0.312    -.0070107    .0212317
                  IL  |   .0861035   .0106488     8.09   0.000     .0643242    .1078827
                  MI  |   .0536248   .0103354     5.19   0.000     .0324866     .074763
                  WI  |   .0205198   .0063255     3.24   0.003     .0075828    .0334569
                  MN  |   .0663991     .00862     7.70   0.000     .0487693    .0840289
                  MO  |  -.0189466     .00881    -2.15   0.040    -.0369651    -.000928
                  DE  |   .0487753   .0032041    15.22   0.000     .0422221    .0553285
                  MD  |   .1229502   .0124508     9.87   0.000     .0974854    .1484149
                  DC  |   .1787524   .0165777    10.78   0.000     .1448472    .2126576
                  WV  |  -.0386106   .0065488    -5.90   0.000    -.0520045   -.0252168
                  KY  |  -.0387019   .0067406    -5.74   0.000    -.0524879   -.0249159
                  OK  |  -.0585784    .011489    -5.10   0.000     -.082076   -.0350808
                  MT  |  -.0343377   .0019353   -17.74   0.000    -.0382958   -.0303796
                  CO  |   .0344224    .011149     3.09   0.004     .0116201    .0572246
                  NM  |  -.0321434   .0080676    -3.98   0.000    -.0486434   -.0156434
                  WA  |   .1022639   .0110295     9.27   0.000     .0797061    .1248218
                  OR  |   .0313998   .0103067     3.05   0.005     .0103202    .0524795
                  CA  |   .1663133   .0136995    12.14   0.000     .1382947    .1943318
                  AK  |   .2441756   .0095441    25.58   0.000     .2246558    .2636955
                  HI  |   .1078279   .0091776    11.75   0.000     .0890576    .1265983
                      |
                 year |
                1990  |  -.0067175   .0034834    -1.93   0.064    -.0138419    .0004068
                1991  |  -.0139012   .0055997    -2.48   0.019    -.0253539   -.0024484
                1992  |  -.0119054    .007273    -1.64   0.112    -.0267803    .0029695
                1993  |  -.0241819   .0051037    -4.74   0.000      -.03462   -.0137437
                1996  |  -.0282492   .0062672    -4.51   0.000    -.0410671   -.0154314
                1997  |  -.0196506   .0062128    -3.16   0.004    -.0323572    -.006944
                1998  |  -.0017009   .0047995    -0.35   0.726     -.011517    .0081153
                1999  |   .0192282   .0069424     2.77   0.010     .0050294    .0334269
                2000  |   .0286279    .007163     4.00   0.000     .0139779    .0432779
                2001  |   .0464146   .0075568     6.14   0.000     .0309593    .0618699
                2002  |   .0580648   .0070513     8.23   0.000     .0436434    .0724863
                2003  |   .0453369   .0077314     5.86   0.000     .0295243    .0611494
                2004  |   .0383494    .007617     5.03   0.000     .0227709    .0539279
                2005  |   .0206329   .0074923     2.75   0.010     .0053095    .0359563
                2006  |   .0139436   .0085837     1.62   0.115    -.0036121    .0314993
                2007  |   .0147322   .0100555     1.47   0.154    -.0058336    .0352981
                2008  |   .0098321   .0098439     1.00   0.326    -.0103009    .0299651
                2009  |   .0371204   .0117977     3.15   0.004     .0129914    .0612493
                2010  |   .0321624   .0097469     3.30   0.003     .0122277    .0520971
                2011  |   .0102724   .0092248     1.11   0.275    -.0085944    .0291392
                2012  |  -.0005268   .0110819    -0.05   0.962    -.0231919    .0221383
                2013  |  -.0010065   .0095383    -0.11   0.917    -.0205146    .0185016
                2014  |  -.0072216   .0072515    -1.00   0.328    -.0220525    .0076093
                2015  |    .012729   .0077001     1.65   0.109    -.0030194    .0284774
                2016  |    .018482   .0097591     1.89   0.068    -.0014776    .0384415
                2017  |   .0304366   .0106435     2.86   0.008     .0086682     .052205
                2018  |   .0356964   .0106495     3.35   0.002     .0139156    .0574771
                2019  |   .0555472   .0101856     5.45   0.000     .0347154     .076379
                      |
                 nind |
                   2  |   .1260983   .0317508     3.97   0.000     .0611605     .191036
                   3  |   .1168799   .0284957     4.10   0.000     .0585997    .1751602
                   4  |  -.0705576   .0291553    -2.42   0.022    -.1301868   -.0109284
                   5  |   .1468672   .0279776     5.25   0.000     .0896466    .2040878
                   6  |   .1198427   .0327123     3.66   0.001     .0529385    .1867469
                   7  |   .0161186   .0306856     0.53   0.603    -.0466405    .0788777
                   8  |   -.049611   .0290376    -1.71   0.098    -.1089996    .0097777
                   9  |  -.0390104   .0298766    -1.31   0.202    -.1001149     .022094
                  10  |  -.0826161   .0319126    -2.59   0.015    -.1478848   -.0173474
                  11  |   .1338546   .0304082     4.40   0.000     .0716629    .1960463
                      |
                 educ |   .0671243   .0025217    26.62   0.000     .0619668    .0722818
                exper |   .0452357   .0024592    18.39   0.000      .040206    .0502654
               exper2 |  -.0010097   .0001143    -8.84   0.000    -.0012434    -.000776
               exper3 |   6.48e-06   2.73e-06     2.38   0.024     9.00e-07    .0000121
               exper4 |   1.42e-08   2.59e-08     0.55   0.587    -3.87e-08    6.71e-08
                 edex |  -.0003404   .0000715    -4.76   0.000    -.0004866   -.0001942
                      |
                ee_cl |
                   2  |  -.0637127   .0056416   -11.29   0.000    -.0752511   -.0521743
                   3  |  -.0747423   .0069984   -10.68   0.000    -.0890557   -.0604288
                   4  |  -.0365849   .0114495    -3.20   0.003    -.0600018    -.013168
                   5  |  -.1378062   .0090538   -15.22   0.000    -.1563234   -.1192891
                   6  |  -.0838385   .0070034   -11.97   0.000     -.098162    -.069515
                   7  |  -.0666326   .0079622    -8.37   0.000    -.0829172    -.050348
                   8  |   .0133939   .0110965     1.21   0.237     -.009301    .0360888
                   9  |  -.1420623   .0106934   -13.29   0.000    -.1639328   -.1201919
                  10  |  -.0906656   .0096945    -9.35   0.000    -.1104931   -.0708382
                  11  |   -.060763   .0095527    -6.36   0.000    -.0803005   -.0412254
                  12  |   .0125522   .0120433     1.04   0.306     -.012079    .0371834
                  13  |  -.0516074   .0118177    -4.37   0.000    -.0757774   -.0274374
                  14  |  -.0703556   .0114011    -6.17   0.000    -.0936734   -.0470378
                  15  |  -.0525849   .0102967    -5.11   0.000     -.073644   -.0315258
                  16  |   .0054651   .0127579     0.43   0.672    -.0206277     .031558
                      |
                 marr |   .1207257    .003231    37.37   0.000     .1141176    .1273337
                partt |  -.2244921   .0058331   -38.49   0.000    -.2364222   -.2125621
               public |   .0323566   .0072676     4.45   0.000     .0174927    .0472206
                 cmsa |   .1453423   .0126753    11.47   0.000     .1194184    .1712661
                      |
                nocc2 |
                   2  |  -.1432309   .0044432   -32.24   0.000    -.1523182   -.1341435
                   3  |   -.044309   .0079344    -5.58   0.000    -.0605367   -.0280813
                   4  |  -.2820605   .0124305   -22.69   0.000    -.3074836   -.2566373
                   5  |  -.0723255   .0093156    -7.76   0.000     -.091378    -.053273
                   6  |  -.3734434   .0077922   -47.93   0.000    -.3893803   -.3575065
                   7  |  -.2315661   .0066421   -34.86   0.000    -.2451507   -.2179815
                   8  |  -.0944902   .0147282    -6.42   0.000    -.1246127   -.0643676
                   9  |  -.3860846      .0051   -75.70   0.000    -.3965152    -.375654
                  10  |  -.3284176   .0066651   -49.27   0.000    -.3420493   -.3147858
                  11  |  -.2146703   .0060029   -35.76   0.000    -.2269477    -.202393
                  12  |  -.3790053   .0076135   -49.78   0.000    -.3945766   -.3634341
                      |
                unemp |  -.0042115   .0024922    -1.69   0.102    -.0093086    .0008857
                      |
              quarter |
                   2  |   .0011429   .0021927     0.52   0.606    -.0033417    .0056275
                   3  |   .0026652   .0026993     0.99   0.332    -.0028556    .0081859
                   4  |   .0130374   .0020008     6.52   0.000     .0089453    .0171294
                      |
                _cons |   .6390381   .0492621    12.97   0.000     .5382857    .7397904
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all_unemp

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  p
> ublic cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,866,086,925)

Linear regression                               Number of obs     =    677,009
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5096
                                                Root MSE          =     .41732

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1445027   .0065793   -21.96   0.000     -.157959   -.1310465
             treat_st |  -.0201358   .0110964    -1.81   0.080    -.0428305     .002559
treat_stblackrelwhite |  -.0078052   .0068539    -1.14   0.264     -.021823    .0062126
                      |
                state |
                  NH  |   .1392172   .0130195    10.69   0.000     .1125892    .1658451
                  VT  |  -.0324046   .0124605    -2.60   0.014    -.0578892     -.00692
                  MA  |  -.0012581   .0190467    -0.07   0.948     -.040213    .0376968
                  RI  |  -.0305501   .0247228    -1.24   0.226    -.0811139    .0200137
                  CT  |   .1117907   .0215854     5.18   0.000     .0676435    .1559378
                  NY  |   .1803622    .023321     7.73   0.000     .1326655    .2280589
                  NJ  |    .189237   .0240441     7.87   0.000     .1400613    .2384128
                  PA  |  -.0191169   .0197423    -0.97   0.341    -.0594943    .0212606
                  OH  |   .1537216   .0241562     6.36   0.000     .1043167    .2031266
                  IN  |   .1491917   .0425774     3.50   0.002     .0621111    .2362722
                  IL  |    .185282   .0188856     9.81   0.000     .1466566    .2239073
                  MI  |   .4936573   .0397627    12.42   0.000     .4123333    .5749812
                  WI  |  -.0600933   .0348478    -1.72   0.095    -.1313651    .0111786
                  MN  |  -.0914127   .0193768    -4.72   0.000    -.1310426   -.0517827
                  MO  |   .0196048   .0149383     1.31   0.200    -.0109474     .050157
                  DE  |   .2345004   .0177538    13.21   0.000     .1981898     .270811
                  MD  |  -.1723721   .0272517    -6.33   0.000     -.228108   -.1166362
                  DC  |  -.2266434   .0252646    -8.97   0.000    -.2783153   -.1749715
                  WV  |   .1281211   .0126243    10.15   0.000     .1023015    .1539407
                  KY  |   .0845031   .0192795     4.38   0.000     .0450721    .1239341
                  OK  |  -.2392961   .0501899    -4.77   0.000     -.341946   -.1366462
                  MT  |  -.3318354    .014699   -22.58   0.000    -.3618982   -.3017725
                  CO  |  -.1425969   .0167691    -8.50   0.000    -.1768935   -.1083004
                  NM  |  -.3110056   .0195456   -15.91   0.000    -.3509808   -.2710305
                  WA  |  -.2169338   .0159184   -13.63   0.000    -.2494907   -.1843769
                  OR  |   .0586704   .0112841     5.20   0.000     .0355918     .081749
                  CA  |   .1293738   .0248814     5.20   0.000     .0784855     .180262
                  AK  |   .6903613   .0207529    33.27   0.000     .6479169    .7328058
                  HI  |   -.082709   .0237747    -3.48   0.002    -.1313338   -.0340842
                      |
        state#c.lyear |
                  ME  |   .0014252   .0001576     9.04   0.000     .0011028    .0017476
                  NH  |   .0008951   .0003064     2.92   0.007     .0002685    .0015216
                  VT  |   .0019205   .0000839    22.90   0.000     .0017489     .002092
                  MA  |   .0026097   .0001062    24.56   0.000     .0023924     .002827
                  RI  |   .0021058    .000106    19.87   0.000      .001889    .0023226
                  CT  |   .0016442   .0001383    11.89   0.000     .0013614    .0019271
                  NY  |   .0006762   .0000761     8.89   0.000     .0005207    .0008318
                  NJ  |   .0012961   .0001035    12.52   0.000     .0010844    .0015078
                  PA  |   .0017508   .0000793    22.09   0.000     .0015887     .001913
                  OH  |  -.0001747   .0000718    -2.43   0.021    -.0003216   -.0000277
                  IN  |   .0000256   .0004588     0.06   0.956    -.0009128     .000964
                  IL  |   .0004877   .0001031     4.73   0.000     .0002768    .0006986
                  MI  |  -.0028658   .0003609    -7.94   0.000    -.0036039   -.0021277
                  WI  |    .002175   .0003286     6.62   0.000      .001503     .002847
                  MN  |   .0029376   .0000857    34.27   0.000     .0027623    .0031129
                  MO  |   .0010661   .0001081     9.86   0.000      .000845    .0012872
                  DE  |  -.0005076   .0001535    -3.31   0.003    -.0008216   -.0001936
                  MD  |   .0042551   .0001152    36.93   0.000     .0040194    .0044907
                  DC  |   .0053614   .0001412    37.98   0.000     .0050728    .0056501
                  WV  |  -.0001843   .0002387    -0.77   0.446    -.0006724    .0003038
                  KY  |   .0002468   .0002339     1.05   0.300    -.0002316    .0007252
                  OK  |    .003103   .0005686     5.46   0.000     .0019401    .0042659
                  MT  |   .0043029   .0000639    67.33   0.000     .0041722    .0044336
                  CO  |   .0031262   .0001137    27.50   0.000     .0028937    .0033587
                  NM  |   .0041178   .0003538    11.64   0.000     .0033942    .0048413
                  WA  |   .0045167   .0001116    40.46   0.000     .0042883     .004745
                  OR  |   .0011989   .0001578     7.60   0.000     .0008763    .0015216
                  CA  |   .0018291   .0000804    22.76   0.000     .0016647    .0019935
                  AK  |  -.0028985   .0000609   -47.59   0.000    -.0030231   -.0027739
                  HI  |   .0032702   .0000768    42.61   0.000     .0031132    .0034272
                      |
                 nind |
                   2  |   .1275887   .0316542     4.03   0.000     .0628486    .1923289
                   3  |   .1172704    .028299     4.14   0.000     .0593925    .1751483
                   4  |  -.0697491   .0290528    -2.40   0.023    -.1291689   -.0103294
                   5  |   .1477612   .0278064     5.31   0.000     .0908907    .2046317
                   6  |   .1208055   .0324312     3.72   0.001     .0544763    .1871346
                   7  |   .0169234   .0305177     0.55   0.583    -.0454924    .0793391
                   8  |  -.0486984   .0288528    -1.69   0.102     -.107709    .0103122
                   9  |  -.0378927    .029702    -1.28   0.212    -.0986401    .0228548
                  10  |  -.0814897    .031843    -2.56   0.016    -.1466161   -.0163634
                  11  |    .134233   .0303329     4.43   0.000     .0721952    .1962708
                      |
                 educ |   .0671311   .0025158    26.68   0.000     .0619857    .0722766
                exper |   .0451718   .0024146    18.71   0.000     .0402333    .0501103
               exper2 |  -.0009908   .0001132    -8.75   0.000    -.0012223   -.0007592
               exper3 |   5.82e-06   2.72e-06     2.14   0.041     2.61e-07    .0000114
               exper4 |   2.02e-08   2.59e-08     0.78   0.441    -3.27e-08    7.31e-08
                 edex |  -.0003434   .0000714    -4.81   0.000    -.0004894   -.0001975
                      |
                ee_cl |
                   2  |  -.0652675   .0056738   -11.50   0.000    -.0768716   -.0536634
                   3  |  -.0763315   .0069547   -10.98   0.000    -.0905555   -.0621075
                   4  |  -.0383554   .0111731    -3.43   0.002     -.061207   -.0155038
                   5  |  -.1408098    .009108   -15.46   0.000    -.1594378   -.1221819
                   6  |  -.0866075   .0066622   -13.00   0.000    -.1002332   -.0729818
                   7  |  -.0683656   .0077499    -8.82   0.000     -.084216   -.0525152
                   8  |   .0120274   .0107599     1.12   0.273     -.009979    .0340338
                   9  |  -.1444835   .0105047   -13.75   0.000    -.1659681    -.122999
                  10  |  -.0920779   .0093277    -9.87   0.000    -.1111551   -.0730007
                  11  |   -.062089   .0093187    -6.66   0.000     -.081148     -.04303
                  12  |   .0107303   .0117167     0.92   0.367    -.0132331    .0346936
                  13  |  -.0539707   .0117848    -4.58   0.000    -.0780733    -.029868
                  14  |  -.0716919   .0112485    -6.37   0.000    -.0946976   -.0486862
                  15  |  -.0530351    .010113    -5.24   0.000    -.0737185   -.0323517
                  16  |   .0037988   .0124833     0.30   0.763    -.0217325      .02933
                      |
                 marr |   .1204239   .0032069    37.55   0.000     .1138651    .1269826
                partt |  -.2243973   .0057319   -39.15   0.000    -.2361203   -.2126744
               public |   .0323146   .0072129     4.48   0.000     .0175625    .0470667
                 cmsa |   .1440666    .012796    11.26   0.000     .1178959    .1702373
                      |
                nocc2 |
                   2  |  -.1441376   .0042948   -33.56   0.000    -.1529213   -.1353538
                   3  |  -.0449602    .007875    -5.71   0.000    -.0610663    -.028854
                   4  |  -.2824466   .0123604   -22.85   0.000    -.3077265   -.2571667
                   5  |  -.0729513   .0094388    -7.73   0.000    -.0922557   -.0536469
                   6  |  -.3738891   .0076682   -48.76   0.000    -.3895723    -.358206
                   7  |   -.231659   .0065892   -35.16   0.000    -.2451354   -.2181827
                   8  |  -.0934006   .0145662    -6.41   0.000    -.1231918   -.0636093
                   9  |  -.3866956   .0050912   -75.95   0.000    -.3971082    -.376283
                  10  |  -.3296912   .0064025   -51.49   0.000    -.3427857   -.3165966
                  11  |  -.2151568   .0058723   -36.64   0.000    -.2271669   -.2031467
                  12  |  -.3797309   .0074955   -50.66   0.000     -.395061   -.3644009
                      |
                unemp |  -.0062829    .001016    -6.18   0.000    -.0083609    -.004205
                      |
              quarter |
                   2  |   .0008927   .0021929     0.41   0.687    -.0035923    .0053777
                   3  |   .0022343   .0026894     0.83   0.413    -.0032663    .0077348
                   4  |   .0126075   .0019938     6.32   0.000     .0085296    .0166853
                      |
                _cons |   .5160542   .0394788    13.07   0.000     .4353111    .5967974
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_mal_all_sltt  

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,734,824,966)

Linear regression                               Number of obs     =    683,919
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5061
                                                Root MSE          =     .39555

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0668061   .0065839   -10.15   0.000    -.0802717   -.0533405
             treat_st |  -.0367642   .0085736    -4.29   0.000    -.0542992   -.0192291
treat_stblackrelwhite |  -.0170476   .0075386    -2.26   0.031    -.0324658   -.0016294
                      |
                state |
                  NH  |   .0570206   .0046803    12.18   0.000     .0474483    .0665929
                  VT  |   .0357459   .0010368    34.48   0.000     .0336254    .0378665
                  MA  |   .1010559     .01143     8.84   0.000     .0776789    .1244329
                  RI  |   .0248152   .0114493     2.17   0.039     .0013986    .0482317
                  CT  |   .1112919   .0113698     9.79   0.000     .0880381    .1345457
                  NY  |   .0644493   .0106362     6.06   0.000     .0426958    .0862029
                  NJ  |   .1282817   .0121433    10.56   0.000     .1034459    .1531175
                  PA  |  -.0298608   .0090398    -3.30   0.003    -.0483493   -.0113723
                  OH  |  -.0619414    .008724    -7.10   0.000    -.0797839   -.0440988
                  IN  |  -.0637027   .0063354   -10.05   0.000    -.0766601   -.0507453
                  IL  |   .0032396   .0097932     0.33   0.743    -.0167898     .023269
                  MI  |  -.0150637   .0087572    -1.72   0.096    -.0329743    .0028468
                  WI  |  -.0106026   .0062702    -1.69   0.102    -.0234265    .0022214
                  MN  |   .0486801   .0081359     5.98   0.000     .0320403    .0653199
                  MO  |  -.0817588   .0083654    -9.77   0.000     -.098868   -.0646496
                  DE  |   .0498572   .0029557    16.87   0.000     .0438122    .0559023
                  MD  |   .0953941   .0122193     7.81   0.000     .0704028    .1203855
                  DC  |   .1505617   .0151883     9.91   0.000     .1194981    .1816253
                  WV  |  -.1475676   .0020161   -73.20   0.000    -.1516909   -.1434442
                  KY  |  -.0911481   .0054667   -16.67   0.000    -.1023287   -.0799675
                  OK  |  -.1333209   .0081004   -16.46   0.000     -.149888   -.1167538
                  MT  |  -.0771562   .0009935   -77.66   0.000     -.079188   -.0751243
                  CO  |  -.0044782   .0108962    -0.41   0.684    -.0267634     .017807
                  NM  |  -.0981174   .0067934   -14.44   0.000    -.1120114   -.0842234
                  WA  |   .0589439   .0100402     5.87   0.000     .0384094    .0794784
                  OR  |  -.0045183   .0091729    -0.49   0.626     -.023279    .0142424
                  CA  |   .1253143   .0120628    10.39   0.000      .100643    .1499855
                  AK  |   .1807861   .0061296    29.49   0.000     .1682497    .1933225
                  HI  |    .072554   .0081853     8.86   0.000     .0558132    .0892947
                      |
                 year |
                1990  |  -.0044987   .0039523    -1.14   0.264     -.012582    .0035846
                1991  |  -.0010077   .0029669    -0.34   0.737    -.0070757    .0050603
                1992  |    .018202   .0038069     4.78   0.000      .010416    .0259879
                1993  |   .0146729   .0048685     3.01   0.005     .0047156    .0246301
                1996  |   .0087607   .0049259     1.78   0.086    -.0013139    .0188353
                1997  |    .014778   .0048695     3.03   0.005     .0048187    .0247372
                1998  |   .0474361   .0042356    11.20   0.000     .0387734    .0560988
                1999  |   .0605887   .0054624    11.09   0.000     .0494167    .0717607
                2000  |    .071937   .0056736    12.68   0.000     .0603332    .0835408
                2001  |   .0879528   .0056838    15.47   0.000      .076328    .0995776
                2002  |   .0981089   .0061441    15.97   0.000     .0855429    .1106749
                2003  |   .1052889   .0058847    17.89   0.000     .0932533    .1173245
                2004  |   .0972257   .0066571    14.60   0.000     .0836105    .1108409
                2005  |   .0907096   .0062037    14.62   0.000     .0780216    .1033976
                2006  |    .080538   .0059852    13.46   0.000      .068297     .092779
                2007  |    .078857   .0075171    10.49   0.000     .0634828    .0942312
                2008  |   .0721566   .0083955     8.59   0.000     .0549858    .0893274
                2009  |   .0931741   .0068401    13.62   0.000     .0791844    .1071637
                2010  |   .0916668   .0061382    14.93   0.000     .0791129    .1042207
                2011  |   .0709686   .0060479    11.73   0.000     .0585991     .083338
                2012  |   .0557958   .0064212     8.69   0.000      .042663    .0689286
                2013  |   .0592847    .005938     9.98   0.000       .04714    .0714293
                2014  |   .0559457   .0064559     8.67   0.000      .042742    .0691494
                2015  |   .0692172   .0067081    10.32   0.000     .0554976    .0829367
                2016  |   .0812003   .0085994     9.44   0.000     .0636125    .0987882
                2017  |   .0939795   .0089806    10.46   0.000     .0756122    .1123469
                2018  |   .0993953   .0090939    10.93   0.000     .0807963    .1179944
                2019  |   .1082267   .0070543    15.34   0.000     .0937991    .1226543
                      |
                 nind |
                   2  |       .111   .0230749     4.81   0.000     .0638065    .1581936
                   3  |   .1797076   .0218159     8.24   0.000      .135089    .2243262
                   4  |  -.0425027   .0230215    -1.85   0.075     -.089587    .0045816
                   5  |   .1958734   .0214847     9.12   0.000     .1519322    .2398146
                   6  |   .1361337   .0237357     5.74   0.000     .0875888    .1846786
                   7  |   .0808538   .0238533     3.39   0.002     .0320684    .1296392
                   8  |    .028269   .0218489     1.29   0.206    -.0164171     .072955
                   9  |  -.0095115   .0231314    -0.41   0.684    -.0568206    .0377976
                  10  |   -.041388   .0219467    -1.89   0.069     -.086274    .0034979
                  11  |   .1150315   .0234761     4.90   0.000     .0670175    .1630455
                      |
                 educ |    .089927   .0029159    30.84   0.000     .0839634    .0958907
                exper |   .0485079   .0030905    15.70   0.000     .0421871    .0548287
               exper2 |  -.0016869   .0001257   -13.42   0.000     -.001944   -.0014298
               exper3 |   .0000266   3.63e-06     7.33   0.000     .0000192    .0000341
               exper4 |  -1.40e-07   3.78e-08    -3.71   0.001    -2.18e-07   -6.30e-08
                 edex |  -.0004065   .0001094    -3.72   0.001    -.0006302   -.0001827
                      |
                ee_cl |
                   2  |  -.1249564   .0069557   -17.96   0.000    -.1391825   -.1107303
                   3  |  -.1661133   .0104088   -15.96   0.000    -.1874016   -.1448249
                   4  |  -.1751858    .016885   -10.38   0.000    -.2097194   -.1406522
                   5  |  -.1635401   .0125142   -13.07   0.000    -.1891345   -.1379457
                   6  |  -.1665204   .0128914   -12.92   0.000    -.1928863   -.1401544
                   7  |  -.1781615   .0143518   -12.41   0.000    -.2075142   -.1488087
                   8  |  -.1151576   .0183207    -6.29   0.000    -.1526276   -.0776876
                   9  |  -.1529785   .0134981   -11.33   0.000    -.1805852   -.1253719
                  10  |  -.1729115   .0160908   -10.75   0.000    -.2058209   -.1400022
                  11  |  -.1728971   .0158299   -10.92   0.000    -.2052728   -.1405213
                  12  |  -.1311399   .0146909    -8.93   0.000    -.1611862   -.1010936
                  13  |  -.0937234   .0202496    -4.63   0.000    -.1351386   -.0523083
                  14  |  -.1542802   .0169684    -9.09   0.000    -.1889845   -.1195759
                  15  |   -.141665   .0168205    -8.42   0.000    -.1760668   -.1072633
                  16  |  -.1227744   .0145254    -8.45   0.000    -.1524821   -.0930667
                      |
                 marr |   .0352387   .0032873    10.72   0.000     .0285154     .041962
                partt |  -.1455534   .0037271   -39.05   0.000    -.1531761   -.1379306
               public |   .0703418   .0079904     8.80   0.000     .0539996     .086684
                 cmsa |   .1527493   .0117586    12.99   0.000     .1287003    .1767982
                      |
                nocc2 |
                   2  |  -.1272256   .0044541   -28.56   0.000    -.1363352    -.118116
                   3  |  -.0467044   .0087877    -5.31   0.000    -.0646772   -.0287315
                   4  |  -.2711769   .0079252   -34.22   0.000    -.2873858    -.254968
                   5  |   .0603126   .0074628     8.08   0.000     .0450494    .0755758
                   6  |  -.3252223    .005627   -57.80   0.000    -.3367309   -.3137138
                   7  |  -.3482126   .0053916   -64.58   0.000    -.3592397   -.3371856
                   8  |  -.1602936   .0093276   -17.18   0.000    -.1793707   -.1412165
                   9  |  -.4050429   .0069596   -58.20   0.000    -.4192769    -.390809
                  10  |  -.4072554   .0137378   -29.64   0.000    -.4353523   -.3791585
                  11  |  -.1463683   .0104819   -13.96   0.000    -.1678062   -.1249304
                  12  |  -.3815414   .0113642   -33.57   0.000    -.4047838   -.3582991
                      |
              quarter |
                   2  |   .0088048   .0019229     4.58   0.000      .004872    .0127376
                   3  |   .0159519   .0020536     7.77   0.000     .0117517    .0201521
                   4  |   .0208347   .0013949    14.94   0.000     .0179819    .0236876
                      |
                _cons |   .2906957   .0406804     7.15   0.000     .2074949    .3738964
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,734,824,966)

Linear regression                               Number of obs     =    683,919
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5061
                                                Root MSE          =     .39556

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.066806   .0065842   -10.15   0.000    -.0802722   -.0533398
             treat_st |  -.0367878   .0088459    -4.16   0.000    -.0548797   -.0186959
treat_stblackrelwhite |  -.0170546   .0075639    -2.25   0.032    -.0325246   -.0015846
                      |
                state |
                  NH  |   .0569079   .0045873    12.41   0.000     .0475259    .0662899
                  VT  |   .0356413   .0021475    16.60   0.000     .0312492    .0400335
                  MA  |   .1010623   .0114575     8.82   0.000     .0776291    .1244955
                  RI  |   .0249215   .0120265     2.07   0.047     .0003246    .0495184
                  CT  |    .111305   .0114243     9.74   0.000     .0879396    .1346703
                  NY  |   .0645246   .0109861     5.87   0.000     .0420555    .0869936
                  NJ  |   .1283379   .0123989    10.35   0.000     .1029794    .1536965
                  PA  |  -.0298206   .0092333    -3.23   0.003    -.0487049   -.0109363
                  OH  |  -.0618773   .0090389    -6.85   0.000     -.080364   -.0433906
                  IN  |  -.0636907   .0064261    -9.91   0.000    -.0768336   -.0505478
                  IL  |   .0033397   .0103119     0.32   0.748    -.0177506      .02443
                  MI  |  -.0149109   .0099471    -1.50   0.145    -.0352551    .0054332
                  WI  |  -.0106388   .0060592    -1.76   0.090    -.0230313    .0017537
                  MN  |   .0486005    .007912     6.14   0.000     .0324185    .0647824
                  MO  |  -.0817374   .0084603    -9.66   0.000    -.0990407   -.0644341
                  DE  |   .0497958   .0032753    15.20   0.000     .0430971    .0564946
                  MD  |   .0953637   .0121333     7.86   0.000     .0705483     .120179
                  DC  |   .1507356   .0159117     9.47   0.000     .1181925    .1832788
                  WV  |   -.147423   .0037938   -38.86   0.000    -.1551822   -.1396639
                  KY  |  -.0910636   .0061051   -14.92   0.000      -.10355   -.0785772
                  OK  |  -.1333573     .00773   -17.25   0.000     -.149167   -.1175477
                  MT  |  -.0771666   .0010134   -76.15   0.000    -.0792393    -.075094
                  CO  |  -.0045142   .0107561    -0.42   0.678    -.0265129    .0174844
                  NM  |  -.0980459   .0071743   -13.67   0.000    -.1127191   -.0833727
                  WA  |   .0590299   .0104914     5.63   0.000     .0375725    .0804873
                  OR  |  -.0044004   .0098617    -0.45   0.659    -.0245698     .015769
                  CA  |   .1254716    .012928     9.71   0.000     .0990308    .1519123
                  AK  |   .1809884   .0075093    24.10   0.000     .1656302    .1963466
                  HI  |   .0724485   .0079204     9.15   0.000     .0562495    .0886474
                      |
                 year |
                1990  |  -.0044535   .0039983    -1.11   0.274    -.0126309     .003724
                1991  |   -.000831   .0046642    -0.18   0.860    -.0103703    .0087082
                1992  |   .0184417   .0061669     2.99   0.006      .005829    .0310544
                1993  |   .0148594   .0063792     2.33   0.027     .0018126    .0279063
                1996  |   .0087855   .0049121     1.79   0.084    -.0012608    .0188318
                1997  |   .0147589   .0048904     3.02   0.005     .0047569     .024761
                1998  |   .0473751   .0043105    10.99   0.000     .0385591    .0561911
                1999  |   .0604987   .0054221    11.16   0.000     .0494093    .0715881
                2000  |   .0718284   .0060322    11.91   0.000     .0594912    .0841655
                2001  |   .0879126   .0056699    15.51   0.000     .0763164    .0995087
                2002  |   .0981721   .0061741    15.90   0.000     .0855447    .1107995
                2003  |   .1053831   .0061513    17.13   0.000     .0928022    .1179639
                2004  |   .0972808   .0069272    14.04   0.000     .0831132    .1114485
                2005  |   .0907205   .0062213    14.58   0.000     .0779966    .1034444
                2006  |   .0805136   .0059536    13.52   0.000      .068337    .0926902
                2007  |   .0788333    .007542    10.45   0.000     .0634081    .0942585
                2008  |   .0722324   .0084606     8.54   0.000     .0549286    .0895362
                2009  |   .0935769   .0102139     9.16   0.000     .0726871    .1144667
                2010  |   .0920986   .0090571    10.17   0.000     .0735748    .1106223
                2011  |   .0713246   .0073942     9.65   0.000     .0562016    .0864475
                2012  |   .0560825   .0071629     7.83   0.000     .0414328    .0707322
                2013  |   .0595185   .0076753     7.75   0.000     .0438207    .0752163
                2014  |   .0560538   .0068607     8.17   0.000     .0420222    .0700854
                2015  |   .0692324   .0067199    10.30   0.000     .0554886    .0829762
                2016  |   .0811807   .0085863     9.45   0.000     .0636198    .0987417
                2017  |   .0939164   .0089116    10.54   0.000     .0756901    .1121427
                2018  |   .0992915   .0092293    10.76   0.000     .0804155    .1181676
                2019  |   .1081074   .0069649    15.52   0.000     .0938626    .1223521
                      |
                 nind |
                   2  |   .1109956   .0230857     4.81   0.000       .06378    .1582111
                   3  |   .1797043   .0218085     8.24   0.000     .1351009    .2243077
                   4  |  -.0425056   .0230266    -1.85   0.075    -.0896003    .0045891
                   5  |   .1958709   .0214865     9.12   0.000      .151926    .2398158
                   6  |   .1361306   .0237405     5.73   0.000     .0875759    .1846854
                   7  |   .0808498   .0238573     3.39   0.002     .0320561    .1296436
                   8  |   .0282662   .0218485     1.29   0.206     -.016419    .0729514
                   9  |  -.0095149   .0231306    -0.41   0.684    -.0568224    .0377925
                  10  |   -.041391   .0219482    -1.89   0.069      -.08628     .003498
                  11  |   .1150264   .0234687     4.90   0.000     .0670276    .1630252
                      |
                 educ |   .0899267   .0029175    30.82   0.000     .0839598    .0958936
                exper |   .0485084   .0030882    15.71   0.000     .0421923    .0548246
               exper2 |   -.001687   .0001257   -13.42   0.000     -.001944     -.00143
               exper3 |   .0000266   3.63e-06     7.33   0.000     .0000192    .0000341
               exper4 |  -1.40e-07   3.78e-08    -3.71   0.001    -2.18e-07   -6.29e-08
                 edex |  -.0004065   .0001094    -3.72   0.001    -.0006302   -.0001828
                      |
                ee_cl |
                   2  |  -.1249541   .0069659   -17.94   0.000     -.139201   -.1107073
                   3  |  -.1661102   .0104277   -15.93   0.000    -.1874373   -.1447832
                   4  |  -.1751818   .0169018   -10.36   0.000    -.2097498   -.1406138
                   5  |  -.1635378   .0125228   -13.06   0.000    -.1891499   -.1379257
                   6  |  -.1665181   .0129054   -12.90   0.000    -.1929127   -.1401236
                   7  |  -.1781574   .0143795   -12.39   0.000    -.2075667   -.1487481
                   8  |  -.1151527     .01835    -6.28   0.000    -.1526827   -.0776227
                   9  |  -.1529764    .013505   -11.33   0.000    -.1805972   -.1253556
                  10  |  -.1729092   .0161032   -10.74   0.000     -.205844   -.1399744
                  11  |  -.1728926   .0158563   -10.90   0.000    -.2053224   -.1404627
                  12  |  -.1311346   .0147214    -8.91   0.000    -.1612432   -.1010259
                  13  |  -.0937211   .0202558    -4.63   0.000    -.1351489   -.0522933
                  14  |  -.1542766   .0169875    -9.08   0.000      -.18902   -.1195332
                  15  |  -.1416597   .0168472    -8.41   0.000    -.1761162   -.1072033
                  16  |  -.1227691   .0145534    -8.44   0.000    -.1525342    -.093004
                      |
                 marr |   .0352387   .0032871    10.72   0.000     .0285159    .0419614
                partt |  -.1455521   .0037265   -39.06   0.000    -.1531737   -.1379306
               public |   .0703427    .007992     8.80   0.000     .0539971    .0866882
                 cmsa |   .1527476   .0117656    12.98   0.000     .1286843     .176811
                      |
                nocc2 |
                   2  |  -.1272264   .0044538   -28.57   0.000    -.1363355   -.1181173
                   3  |  -.0467049   .0087843    -5.32   0.000    -.0646708   -.0287391
                   4  |  -.2711773   .0079241   -34.22   0.000    -.2873839   -.2549707
                   5  |   .0603116   .0074602     8.08   0.000     .0450537    .0755694
                   6  |  -.3252224   .0056266   -57.80   0.000    -.3367301   -.3137147
                   7  |  -.3482131   .0053902   -64.60   0.000    -.3592374   -.3371889
                   8  |  -.1602921   .0093224   -17.19   0.000    -.1793586   -.1412256
                   9  |  -.4050434   .0069577   -58.22   0.000    -.4192735   -.3908134
                  10  |  -.4072574   .0137302   -29.66   0.000    -.4353388    -.379176
                  11  |    -.14637   .0104733   -13.98   0.000    -.1677903   -.1249497
                  12  |  -.3815433   .0113538   -33.60   0.000    -.4047645   -.3583222
                      |
                unemp |  -.0000948   .0015514    -0.06   0.952    -.0032677    .0030781
                      |
              quarter |
                   2  |   .0088053   .0019252     4.57   0.000     .0048678    .0127427
                   3  |   .0159528   .0020542     7.77   0.000     .0117515    .0201541
                   4  |   .0208364   .0014062    14.82   0.000     .0179605    .0237124
                      |
                _cons |   .2911281   .0423345     6.88   0.000     .2045444    .3777119
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  p
> ublic cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,734,824,966)

Linear regression                               Number of obs     =    683,919
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5048
                                                Root MSE          =     .39605

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.067617   .0065093   -10.39   0.000      -.08093    -.054304
             treat_st |  -.0564166    .012543    -4.50   0.000      -.08207   -.0307633
treat_stblackrelwhite |  -.0150898   .0068466    -2.20   0.036    -.0290927   -.0010869
                      |
                state |
                  NH  |   .1095124   .0125747     8.71   0.000     .0837944    .1352305
                  VT  |  -.1258673   .0116442   -10.81   0.000    -.1496824   -.1020521
                  MA  |  -.1083956    .019876    -5.45   0.000    -.1490465   -.0677446
                  RI  |   -.211904   .0227583    -9.31   0.000    -.2584499   -.1653581
                  CT  |   .0632278   .0228973     2.76   0.010     .0163976    .1100581
                  NY  |  -.0127276   .0230684    -0.55   0.585    -.0599077    .0344524
                  NJ  |   .0356151   .0248076     1.44   0.162    -.0151222    .0863523
                  PA  |  -.0248839   .0212205    -1.17   0.250    -.0682847    .0185169
                  OH  |  -.0630231   .0256413    -2.46   0.020    -.1154655   -.0105808
                  IN  |  -.2077066   .0456177    -4.55   0.000    -.3010054   -.1144079
                  IL  |  -.0918088   .0195342    -4.70   0.000    -.1317608   -.0518569
                  MI  |  -.0064697   .0414278    -0.16   0.877    -.0911992    .0782597
                  WI  |  -.3217179   .0358327    -8.98   0.000     -.395004   -.2484319
                  MN  |  -.1171988   .0189599    -6.18   0.000    -.1559762   -.0784213
                  MO  |   -.004114   .0158251    -0.26   0.797    -.0364799    .0282519
                  DE  |   .1658074   .0174048     9.53   0.000     .1302105    .2014042
                  MD  |  -.3106394   .0265861   -11.68   0.000    -.3650141   -.2562647
                  DC  |  -.2700863   .0260567   -10.37   0.000    -.3233782   -.2167945
                  WV  |   -.058626   .0128945    -4.55   0.000    -.0849982   -.0322537
                  KY  |   -.203558   .0232149    -8.77   0.000    -.2510378   -.1560782
                  OK  |  -.3714547   .0545936    -6.80   0.000    -.4831111   -.2597983
                  MT  |  -.5001334   .0130792   -38.24   0.000    -.5268834   -.4733834
                  CO  |  -.1958862    .018129   -10.81   0.000    -.2329642   -.1588081
                  NM  |  -.4789515   .0077999   -61.41   0.000     -.494904    -.462999
                  WA  |  -.2866762   .0139938   -20.49   0.000    -.3152967   -.2580557
                  OR  |   -.182788   .0123766   -14.77   0.000     -.208101    -.157475
                  CA  |  -.0606153   .0254166    -2.38   0.024     -.112598   -.0086326
                  AK  |    .396632   .0223345    17.76   0.000     .3509529    .4423111
                  HI  |  -.1203553   .0237847    -5.06   0.000    -.1690006   -.0717101
                      |
        state#c.lyear |
                  ME  |   .0020536   .0001846    11.13   0.000     .0016761    .0024312
                  NH  |   .0015657   .0003271     4.79   0.000     .0008967    .0022346
                  VT  |   .0035972   .0001183    30.40   0.000     .0033552    .0038391
                  MA  |    .004073   .0001277    31.89   0.000     .0038118    .0043343
                  RI  |   .0043749   .0001427    30.66   0.000     .0040831    .0046667
                  CT  |   .0025276   .0001379    18.33   0.000     .0022457    .0028096
                  NY  |   .0028189   .0001034    27.26   0.000     .0026074    .0030304
                  NJ  |    .002972    .000115    25.85   0.000     .0027368    .0032072
                  PA  |   .0020205   .0000992    20.36   0.000     .0018176    .0022234
                  OH  |   .0020903    .000077    27.15   0.000     .0019329    .0022477
                  IN  |   .0035016   .0005094     6.87   0.000     .0024597    .0045434
                  IL  |   .0029962   .0001218    24.60   0.000     .0027471    .0032453
                  MI  |   .0020397    .000406     5.02   0.000     .0012093    .0028702
                  WI  |   .0050804   .0003789    13.41   0.000     .0043054    .0058553
                  MN  |   .0036486   .0001248    29.22   0.000     .0033932    .0039039
                  MO  |   .0013195   .0001212    10.88   0.000     .0010715    .0015675
                  DE  |   .0007781   .0002201     3.54   0.001      .000328    .0012283
                  MD  |   .0059488   .0001077    55.23   0.000     .0057285    .0061691
                  DC  |   .0061349   .0001696    36.17   0.000     .0057881    .0064818
                  WV  |   .0012352   .0002669     4.63   0.000     .0006893     .001781
                  KY  |   .0031833   .0002858    11.14   0.000     .0025987    .0037678
                  OK  |   .0044778    .000645     6.94   0.000     .0031586     .005797
                  MT  |   .0061432   .0000774    79.33   0.000     .0059848    .0063015
                  CO  |   .0038963   .0001403    27.78   0.000     .0036094    .0041831
                  NM  |   .0057525   .0002783    20.67   0.000     .0051833    .0063217
                  WA  |   .0054039   .0001663    32.50   0.000     .0050639    .0057439
                  OR  |   .0038096   .0001588    23.99   0.000     .0034848    .0041345
                  CA  |    .003895   .0001009    38.61   0.000     .0036887    .0041013
                  AK  |  -.0000312   .0000692    -0.45   0.656    -.0001727    .0001103
                  HI  |   .0039102   .0001115    35.06   0.000     .0036822    .0041383
                      |
                 nind |
                   2  |   .1124503   .0228959     4.91   0.000      .065623    .1592776
                   3  |   .1792886    .021702     8.26   0.000      .134903    .2236743
                   4  |  -.0421025    .022966    -1.83   0.077    -.0890733    .0048683
                   5  |   .1969474   .0213636     9.22   0.000      .153254    .2406408
                   6  |   .1368369   .0235716     5.81   0.000     .0886275    .1850463
                   7  |   .0815192   .0237192     3.44   0.002     .0330081    .1300304
                   8  |   .0291524   .0217915     1.34   0.191    -.0154163     .073721
                   9  |   -.008206   .0230572    -0.36   0.724    -.0553632    .0389513
                  10  |  -.0419061   .0218092    -1.92   0.065    -.0865109    .0026987
                  11  |   .1159381   .0234181     4.95   0.000     .0680427    .1638336
                      |
                 educ |   .0882988   .0029894    29.54   0.000     .0821847    .0944129
                exper |   .0479025   .0030349    15.78   0.000     .0416954    .0541097
               exper2 |  -.0016464   .0001234   -13.34   0.000    -.0018988   -.0013941
               exper3 |   .0000254   3.63e-06     6.99   0.000      .000018    .0000328
               exper4 |  -1.30e-07   3.82e-08    -3.39   0.002    -2.08e-07   -5.16e-08
                 edex |  -.0003875   .0001093    -3.54   0.001    -.0006111   -.0001638
                      |
                ee_cl |
                   2  |   -.125979   .0071044   -17.73   0.000    -.1405092   -.1114488
                   3  |  -.1640992   .0106433   -15.42   0.000    -.1858673   -.1423311
                   4  |  -.1694982   .0172228    -9.84   0.000    -.2047229   -.1342735
                   5  |  -.1681993   .0124838   -13.47   0.000    -.1937315   -.1426671
                   6  |  -.1687783   .0128405   -13.14   0.000    -.1950401   -.1425165
                   7  |  -.1760514   .0146204   -12.04   0.000    -.2059535   -.1461493
                   8  |  -.1103233   .0187922    -5.87   0.000    -.1487576   -.0718891
                   9  |  -.1571233   .0135106   -11.63   0.000    -.1847555    -.129491
                  10  |  -.1730061   .0161407   -10.72   0.000    -.2060176   -.1399947
                  11  |  -.1695515   .0161137   -10.52   0.000    -.2025077   -.1365954
                  12  |  -.1262457   .0152242    -8.29   0.000    -.1573827   -.0951087
                  13  |  -.0975949   .0201975    -4.83   0.000    -.1389033   -.0562864
                  14  |  -.1532158   .0170502    -8.99   0.000    -.1880873   -.1183443
                  15  |  -.1393417   .0171148    -8.14   0.000    -.1743454    -.104338
                  16  |  -.1198861    .014933    -8.03   0.000    -.1504276   -.0893447
                      |
                 marr |   .0348836   .0032311    10.80   0.000     .0282751     .041492
                partt |  -.1454982   .0037051   -39.27   0.000     -.153076   -.1379204
               public |    .070039    .007959     8.80   0.000      .053761    .0863171
                 cmsa |   .1519689   .0118091    12.87   0.000     .1278165    .1761212
                      |
                nocc2 |
                   2  |  -.1265826   .0045602   -27.76   0.000    -.1359092    -.117256
                   3  |  -.0458797   .0088417    -5.19   0.000    -.0639631   -.0277963
                   4  |  -.2702803   .0079161   -34.14   0.000    -.2864705     -.25409
                   5  |   .0601257   .0075147     8.00   0.000     .0447564     .075495
                   6  |  -.3255652   .0057325   -56.79   0.000    -.3372894    -.313841
                   7  |  -.3483726   .0054438   -63.99   0.000    -.3595063   -.3372388
                   8  |  -.1594012   .0095283   -16.73   0.000    -.1788888   -.1399135
                   9  |  -.4050505    .006982   -58.01   0.000    -.4193304   -.3907706
                  10  |   -.408251   .0138705   -29.43   0.000    -.4366193   -.3798827
                  11  |  -.1454909   .0103451   -14.06   0.000    -.1666489   -.1243328
                  12  |  -.3818688   .0114599   -33.32   0.000    -.4053069   -.3584308
                      |
                unemp |  -.0020778   .0006567    -3.16   0.004    -.0034209   -.0007346
                      |
              quarter |
                   2  |   .0084899   .0019044     4.46   0.000     .0045951    .0123848
                   3  |   .0156513   .0019869     7.88   0.000     .0115876     .019715
                   4  |    .020511   .0014089    14.56   0.000     .0176295    .0233926
                      |
                _cons |   .1677476   .0338856     4.95   0.000     .0984439    .2370514
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_fem_all_sltt

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 4,573,856,658)

Linear regression                               Number of obs     =    528,582
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5475
                                                Root MSE          =     .42213

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1564989   .0050375   -31.07   0.000    -.1668019    -.146196
             treat_st |  -.0260931   .0141812    -1.84   0.076     -.055097    .0029108
treat_stblackrelwhite |   .0025018   .0068458     0.37   0.717    -.0114994    .0165031
                      |
                state |
                  NH  |   .0953082   .0051131    18.64   0.000     .0848508    .1057657
                  VT  |   .0386533   .0008059    47.96   0.000      .037005    .0403016
                  MA  |   .1160374   .0119763     9.69   0.000     .0915432    .1405316
                  RI  |   .0252367   .0118618     2.13   0.042     .0009766    .0494968
                  CT  |   .1227261   .0118803    10.33   0.000     .0984282     .147024
                  NY  |   .0694516   .0113542     6.12   0.000     .0462295    .0926736
                  NJ  |   .1509701   .0126842    11.90   0.000     .1250279    .1769123
                  PA  |   .0014965   .0091301     0.16   0.871    -.0171768    .0201697
                  OH  |  -.0317393   .0089439    -3.55   0.001    -.0500316    -.013447
                  IN  |  -.0044334   .0066133    -0.67   0.508    -.0179591    .0090922
                  IL  |    .058222   .0102782     5.66   0.000     .0372008    .0792432
                  MI  |   .0164969   .0088761     1.86   0.073    -.0016567    .0346505
                  WI  |   .0140623   .0065161     2.16   0.039     .0007354    .0273891
                  MN  |    .057039   .0086537     6.59   0.000     .0393402    .0747377
                  MO  |  -.0360011   .0083389    -4.32   0.000     -.053056   -.0189463
                  DE  |    .058918   .0017576    33.52   0.000     .0553233    .0625126
                  MD  |   .1300696   .0121077    10.74   0.000     .1053066    .1548326
                  DC  |   .1849499   .0155666    11.88   0.000     .1531126    .2167872
                  WV  |  -.0595042    .003172   -18.76   0.000    -.0659917   -.0530167
                  KY  |  -.0417805   .0053393    -7.83   0.000    -.0527006   -.0308604
                  OK  |  -.0484257   .0099424    -4.87   0.000    -.0687602   -.0280911
                  MT  |  -.0376182   .0017106   -21.99   0.000    -.0411168   -.0341197
                  CO  |   .0437735   .0109258     4.01   0.000     .0214277    .0661193
                  NM  |  -.0225014   .0067892    -3.31   0.002     -.036387   -.0086159
                  WA  |   .0864926   .0103794     8.33   0.000     .0652645    .1077208
                  OR  |   .0175615   .0092278     1.90   0.067    -.0013114    .0364345
                  CA  |   .1450325   .0123616    11.73   0.000     .1197503    .1703147
                  AK  |   .2293553    .006122    37.46   0.000     .2168343    .2418763
                  HI  |   .1141488   .0088282    12.93   0.000     .0960931    .1322045
                      |
                 year |
                1990  |  -.0040268   .0035806    -1.12   0.270    -.0113499    .0032964
                1991  |   -.016232   .0052376    -3.10   0.004    -.0269442   -.0055198
                1992  |  -.0168694   .0052065    -3.24   0.003    -.0275179   -.0062209
                1993  |    -.02871   .0043804    -6.55   0.000    -.0376689   -.0197511
                1996  |  -.0269662   .0089402    -3.02   0.005    -.0452509   -.0086815
                1997  |  -.0161642   .0083295    -1.94   0.062       -.0332    .0008717
                1998  |   .0093028   .0075165     1.24   0.226    -.0060701    .0246758
                1999  |   .0351531   .0090626     3.88   0.001     .0166181    .0536882
                2000  |   .0494322   .0078559     6.29   0.000     .0333651    .0654993
                2001  |    .067379   .0090206     7.47   0.000     .0489298    .0858282
                2002  |   .0743554   .0070285    10.58   0.000     .0599806    .0887302
                2003  |   .0550472    .009907     5.56   0.000     .0347851    .0753094
                2004  |    .052799   .0085705     6.16   0.000     .0352704    .0703276
                2005  |   .0366823   .0093739     3.91   0.001     .0175105     .055854
                2006  |   .0314627   .0086654     3.63   0.001       .01374    .0491854
                2007  |   .0313792   .0097959     3.20   0.003     .0113443    .0514141
                2008  |   .0228672    .009565     2.39   0.024     .0033047    .0424297
                2009  |   .0373174    .010791     3.46   0.002     .0152473    .0593875
                2010  |   .0265339   .0104784     2.53   0.017     .0051032    .0479646
                2011  |   .0086542   .0092001     0.94   0.355    -.0101621    .0274705
                2012  |   .0034018   .0112415     0.30   0.764    -.0195896    .0263933
                2013  |   .0051179   .0094204     0.54   0.591    -.0141491    .0243849
                2014  |   .0035397   .0086887     0.41   0.687    -.0142308    .0213102
                2015  |   .0315977   .0077724     4.07   0.000     .0157014    .0474941
                2016  |   .0407699   .0099425     4.10   0.000     .0204352    .0611046
                2017  |   .0505649   .0110482     4.58   0.000     .0279688     .073161
                2018  |   .0590925   .0112258     5.26   0.000     .0361331    .0820519
                2019  |   .0824991   .0096646     8.54   0.000     .0627327    .1022655
                      |
                 nind |
                   2  |   .0716819   .0298094     2.40   0.023     .0107148     .132649
                   3  |   .1138114   .0273082     4.17   0.000     .0579599    .1696628
                   4  |  -.0557539   .0285391    -1.95   0.060    -.1141229    .0026151
                   5  |   .1023106   .0272585     3.75   0.001     .0465606    .1580606
                   6  |   .1231208   .0325229     3.79   0.001     .0566041    .1896376
                   7  |   .0227461   .0299271     0.76   0.453    -.0384617    .0839539
                   8  |  -.0354394   .0295715    -1.20   0.240    -.0959199    .0250412
                   9  |  -.0647009   .0275447    -2.35   0.026    -.1210361   -.0083656
                  10  |  -.0764114   .0295413    -2.59   0.015    -.1368301   -.0159926
                  11  |   .0833062   .0287498     2.90   0.007     .0245063    .1421061
                      |
                 educ |   .0624158   .0026293    23.74   0.000     .0570383    .0677932
                exper |   .0380045   .0023113    16.44   0.000     .0332775    .0427316
               exper2 |  -.0006985    .000094    -7.43   0.000    -.0008908   -.0005063
               exper3 |  -3.51e-06   2.67e-06    -1.32   0.198    -8.98e-06    1.95e-06
               exper4 |   1.26e-07   3.15e-08     3.99   0.000     6.13e-08    1.90e-07
                 edex |  -.0001467    .000083    -1.77   0.088    -.0003165    .0000231
                      |
                ee_cl |
                   2  |  -.0671755   .0057794   -11.62   0.000    -.0789958   -.0553553
                   3  |  -.0810268   .0067767   -11.96   0.000    -.0948866    -.067167
                   4  |  -.0306409   .0111253    -2.75   0.010    -.0533947   -.0078871
                   5  |  -.1286929   .0087991   -14.63   0.000    -.1466891   -.1106966
                   6  |  -.0988076   .0070343   -14.05   0.000    -.1131945   -.0844207
                   7  |  -.0860052   .0085389   -10.07   0.000    -.1034692   -.0685412
                   8  |   .0308894   .0115872     2.67   0.012     .0071909    .0545879
                   9  |  -.1477615   .0100476   -14.71   0.000    -.1683111   -.1272119
                  10  |  -.1099141    .009467   -11.61   0.000    -.1292763    -.090552
                  11  |  -.0712621   .0090764    -7.85   0.000    -.0898255   -.0526987
                  12  |    .028574   .0130627     2.19   0.037     .0018578    .0552902
                  13  |  -.0713444   .0130079    -5.48   0.000    -.0979485   -.0447403
                  14  |  -.0791741   .0117477    -6.74   0.000    -.1032009   -.0551474
                  15  |  -.0526318   .0103808    -5.07   0.000     -.073863   -.0314007
                  16  |    .019502   .0140604     1.39   0.176    -.0092548    .0482589
                      |
                 marr |   .1281589   .0038825    33.01   0.000     .1202184    .1360995
                partt |  -.2191843    .004296   -51.02   0.000    -.2279707    -.210398
               public |   .0059708   .0058302     1.02   0.314    -.0059532    .0178948
                 cmsa |   .1375629     .01158    11.88   0.000     .1138793    .1612466
                      |
                nocc2 |
                   2  |  -.1530561   .0045242   -33.83   0.000    -.1623092    -.143803
                   3  |   -.044687   .0083569    -5.35   0.000    -.0617788   -.0275953
                   4  |  -.3315855   .0115389   -28.74   0.000    -.3551851   -.3079859
                   5  |  -.0957915   .0118022    -8.12   0.000    -.1199296   -.0716534
                   6  |  -.3991232   .0073622   -54.21   0.000    -.4141806   -.3840658
                   7  |  -.2522594   .0083178   -30.33   0.000    -.2692713   -.2352475
                   8  |  -.1051732   .0137135    -7.67   0.000    -.1332203    -.077126
                   9  |  -.4447863   .0074494   -59.71   0.000    -.4600221   -.4295505
                  10  |  -.3823109   .0077555   -49.30   0.000    -.3981726   -.3664492
                  11  |  -.2762597   .0084252   -32.79   0.000    -.2934911   -.2590282
                  12  |  -.4516857   .0112567   -40.13   0.000    -.4747082   -.4286631
                      |
              quarter |
                   2  |   .0014583   .0021954     0.66   0.512    -.0030318    .0059483
                   3  |   .0020569   .0025916     0.79   0.434    -.0032437    .0073574
                   4  |   .0140268   .0025641     5.47   0.000     .0087825     .019271
                      |
                _cons |    .726975   .0384355    18.91   0.000     .6483655    .8055845
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 4,573,856,658)

Linear regression                               Number of obs     =    528,582
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5475
                                                Root MSE          =     .42211

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1565117    .005036   -31.08   0.000    -.1668115   -.1462119
             treat_st |  -.0271866   .0147653    -1.84   0.076    -.0573851    .0030119
treat_stblackrelwhite |   .0022859   .0068834     0.33   0.742    -.0117923    .0163641
                      |
                state |
                  NH  |   .0902774    .005343    16.90   0.000     .0793497    .1012051
                  VT  |   .0339815   .0026661    12.75   0.000     .0285288    .0394343
                  MA  |   .1163726   .0120225     9.68   0.000     .0917838    .1409613
                  RI  |    .030008   .0126647     2.37   0.025     .0041057    .0559102
                  CT  |   .1233491   .0119558    10.32   0.000     .0988968    .1478014
                  NY  |   .0728523   .0120091     6.07   0.000     .0482909    .0974137
                  NJ  |   .1535637   .0131064    11.72   0.000     .1267581    .1803694
                  PA  |   .0033256   .0093803     0.35   0.726    -.0158593    .0225104
                  OH  |  -.0288401   .0093236    -3.09   0.004    -.0479089   -.0097712
                  IN  |  -.0038343   .0067212    -0.57   0.573    -.0175807    .0099122
                  IL  |   .0627678   .0111298     5.64   0.000     .0400048    .0855307
                  MI  |   .0233788   .0107198     2.18   0.037     .0014542    .0453033
                  WI  |   .0124447   .0062255     2.00   0.055    -.0002879    .0251773
                  MN  |   .0534757   .0085348     6.27   0.000     .0360201    .0709314
                  MO  |  -.0350341   .0084505    -4.15   0.000    -.0523172   -.0177509
                  DE  |    .056074   .0026816    20.91   0.000     .0505895    .0615586
                  MD  |   .1287665   .0119626    10.76   0.000     .1043003    .1532327
                  DC  |   .1927998   .0175308    11.00   0.000     .1569452    .2286543
                  WV  |  -.0525328   .0055343    -9.49   0.000    -.0638517   -.0412138
                  KY  |  -.0379664   .0063361    -5.99   0.000    -.0509251   -.0250076
                  OK  |  -.0500509   .0094209    -5.31   0.000    -.0693188    -.030783
                  MT  |  -.0379953   .0016979   -22.38   0.000    -.0414678   -.0345228
                  CO  |   .0421745   .0107538     3.92   0.000     .0201805    .0641685
                  NM  |  -.0190363   .0073978    -2.57   0.015    -.0341666    -.003906
                  WA  |   .0903836   .0110202     8.20   0.000     .0678447    .1129225
                  OR  |   .0228939   .0101886     2.25   0.032      .002056    .0437318
                  CA  |   .1521004   .0138228    11.00   0.000     .1238297    .1803712
                  AK  |   .2385679   .0089488    26.66   0.000     .2202655    .2568703
                  HI  |    .109507   .0085373    12.83   0.000     .0920462    .1269679
                      |
                 year |
                1990  |  -.0020375   .0039138    -0.52   0.607    -.0100422    .0059671
                1991  |  -.0083775   .0082227    -1.02   0.317    -.0251948    .0084398
                1992  |  -.0062679   .0086555    -0.72   0.475    -.0239705    .0114346
                1993  |  -.0205284   .0060665    -3.38   0.002    -.0329357   -.0081211
                1996  |  -.0259729   .0082132    -3.16   0.004    -.0427707    -.009175
                1997  |  -.0172169   .0074432    -2.31   0.028    -.0324399   -.0019939
                1998  |   .0064071   .0064152     1.00   0.326    -.0067134    .0195276
                1999  |   .0309111   .0086183     3.59   0.001     .0132847    .0485375
                2000  |   .0443728   .0081445     5.45   0.000     .0277153    .0610302
                2001  |   .0653982   .0089022     7.35   0.000     .0471911    .0836053
                2002  |   .0771083   .0070242    10.98   0.000     .0627423    .0914744
                2003  |   .0591776   .0102052     5.80   0.000     .0383057    .0800495
                2004  |   .0551441   .0086961     6.34   0.000     .0373585    .0729297
                2005  |   .0370817   .0093871     3.95   0.000      .017883    .0562805
                2006  |   .0302775   .0085975     3.52   0.001     .0126935    .0478615
                2007  |   .0301722   .0098509     3.06   0.005     .0100249    .0503194
                2008  |   .0261275   .0094903     2.75   0.010     .0067177    .0455373
                2009  |    .055354   .0156711     3.53   0.001      .023303     .087405
                2010  |   .0458604   .0133543     3.43   0.002     .0185478    .0731731
                2011  |   .0245909   .0128873     1.91   0.066    -.0017666    .0509483
                2012  |   .0161324   .0141199     1.14   0.263     -.012746    .0450109
                2013  |    .015481   .0113948     1.36   0.185     -.007824     .038786
                2014  |   .0082682   .0088987     0.93   0.360    -.0099317    .0264681
                2015  |   .0321292   .0078493     4.09   0.000     .0160756    .0481829
                2016  |    .039751   .0099438     4.00   0.000     .0194136    .0600884
                2017  |   .0475385   .0109867     4.33   0.000     .0250682    .0700087
                2018  |   .0543004   .0114612     4.74   0.000     .0308597    .0777411
                2019  |   .0769836   .0106308     7.24   0.000     .0552411    .0987261
                      |
                 nind |
                   2  |   .0717047   .0297732     2.41   0.023     .0108117    .1325977
                   3  |   .1139038   .0272824     4.17   0.000     .0581051    .1697026
                   4  |  -.0556338   .0284958    -1.95   0.061    -.1139143    .0026466
                   5  |   .1024207   .0272077     3.76   0.001     .0467747    .1580667
                   6  |   .1232226   .0324666     3.80   0.001     .0568209    .1896242
                   7  |   .0228054   .0298912     0.76   0.452    -.0383289    .0839397
                   8  |  -.0353023   .0295267    -1.20   0.242    -.0956912    .0250866
                   9  |  -.0645944   .0274965    -2.35   0.026     -.120831   -.0083578
                  10  |  -.0763093   .0294931    -2.59   0.015    -.1366294   -.0159892
                  11  |   .0834327   .0287196     2.91   0.007     .0246945    .1421709
                      |
                 educ |   .0624261   .0026213    23.81   0.000      .057065    .0677873
                exper |   .0380528   .0022982    16.56   0.000     .0333523    .0427532
               exper2 |  -.0007007   .0000943    -7.43   0.000    -.0008937   -.0005078
               exper3 |  -3.44e-06   2.68e-06    -1.28   0.210    -8.93e-06    2.05e-06
               exper4 |   1.25e-07   3.17e-08     3.95   0.000     6.02e-08    1.90e-07
                 edex |  -.0001481   .0000823    -1.80   0.083    -.0003165    .0000203
                      |
                ee_cl |
                   2  |  -.0670624   .0058086   -11.55   0.000    -.0789424   -.0551824
                   3  |  -.0809766   .0067873   -11.93   0.000    -.0948583   -.0670949
                   4  |  -.0305782   .0111307    -2.75   0.010    -.0533431   -.0078134
                   5  |  -.1287825   .0087807   -14.67   0.000    -.1467411    -.110824
                   6  |  -.0987852   .0070222   -14.07   0.000    -.1131471   -.0844233
                   7  |  -.0859325   .0085451   -10.06   0.000    -.1034092   -.0684558
                   8  |   .0310015   .0116128     2.67   0.012     .0072506    .0547524
                   9  |  -.1477767    .010046   -14.71   0.000    -.1683232   -.1272303
                  10  |  -.1099745   .0094453   -11.64   0.000    -.1292923   -.0906567
                  11  |  -.0712059   .0090853    -7.84   0.000    -.0897873   -.0526244
                  12  |   .0286812   .0130862     2.19   0.037     .0019168    .0554456
                  13  |  -.0715124   .0129444    -5.52   0.000    -.0979868    -.045038
                  14  |  -.0792713   .0117005    -6.78   0.000    -.1032016    -.055341
                  15  |   -.052618   .0103663    -5.08   0.000    -.0738194   -.0314165
                  16  |    .019638   .0140987     1.39   0.174    -.0091971    .0484731
                      |
                 marr |   .1281672   .0038789    33.04   0.000     .1202339    .1361004
                partt |  -.2190653   .0042975   -50.98   0.000    -.2278546    -.210276
               public |   .0059508   .0058185     1.02   0.315    -.0059494    .0178511
                 cmsa |   .1374676   .0115821    11.87   0.000     .1137796    .1611556
                      |
                nocc2 |
                   2  |  -.1530532   .0045306   -33.78   0.000    -.1623194    -.143787
                   3  |  -.0446851   .0083598    -5.35   0.000    -.0617827   -.0275875
                   4  |   -.331574   .0115394   -28.73   0.000    -.3551748   -.3079733
                   5  |  -.0958144   .0118014    -8.12   0.000     -.119951   -.0716777
                   6  |  -.3990833   .0073826   -54.06   0.000    -.4141824   -.3839842
                   7  |    -.25225   .0083335   -30.27   0.000     -.269294    -.235206
                   8  |  -.1052642   .0137526    -7.65   0.000    -.1333915    -.077137
                   9  |  -.4447843    .007468   -59.56   0.000    -.4600582   -.4295104
                  10  |  -.3823222   .0077636   -49.25   0.000    -.3982006   -.3664437
                  11  |  -.2762614   .0084285   -32.78   0.000    -.2934996   -.2590231
                  12  |  -.4516983   .0112654   -40.10   0.000    -.4747387    -.428658
                      |
                unemp |  -.0042735     .00256    -1.67   0.106    -.0095094    .0009623
                      |
              quarter |
                   2  |   .0014582    .002201     0.66   0.513    -.0030433    .0059596
                   3  |   .0020939   .0026056     0.80   0.428    -.0032352     .007423
                   4  |   .0140645   .0025543     5.51   0.000     .0088403    .0192887
                      |
                _cons |     .74602   .0450746    16.55   0.000     .6538322    .8382079
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all_unemp 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  p
> ublic cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 4,573,856,658)

Linear regression                               Number of obs     =    528,582
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5468
                                                Root MSE          =     .42247

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1569657   .0049841   -31.49   0.000    -.1671593   -.1467722
             treat_st |  -.0209311   .0115836    -1.81   0.081    -.0446223    .0027601
treat_stblackrelwhite |   .0048968   .0072087     0.68   0.502    -.0098467    .0196403
                      |
                state |
                  NH  |   .2609206   .0124916    20.89   0.000     .2353723    .2864688
                  VT  |   .0966463   .0117842     8.20   0.000     .0725449    .1207477
                  MA  |   .0619231   .0189067     3.28   0.003     .0232546    .1005917
                  RI  |   .0378096   .0235398     1.61   0.119    -.0103348     .085954
                  CT  |   .1898055   .0207803     9.13   0.000     .1473049     .232306
                  NY  |   .2225382    .022359     9.95   0.000     .1768088    .2682676
                  NJ  |   .2549999   .0241698    10.55   0.000      .205567    .3044327
                  PA  |   .0162518   .0189941     0.86   0.399    -.0225955    .0550992
                  OH  |   .1168001   .0251374     4.65   0.000     .0653885    .1682118
                  IN  |   .1035804    .045129     2.30   0.029     .0112813    .1958796
                  IL  |   .1848952   .0197087     9.38   0.000     .1445865     .225204
                  MI  |   .3916889    .040654     9.63   0.000     .3085421    .4748356
                  WI  |  -.0601858   .0356609    -1.69   0.102    -.1331205     .012749
                  MN  |   -.098986   .0187827    -5.27   0.000     -.137401    -.060571
                  MO  |  -.0122236    .014549    -0.84   0.408    -.0419797    .0175325
                  DE  |   .2197708   .0173168    12.69   0.000     .1843539    .2551876
                  MD  |  -.0771262   .0250064    -3.08   0.004    -.1282701   -.0259824
                  DC  |  -.1365139   .0244215    -5.59   0.000    -.1864615   -.0865662
                  WV  |   .0257475   .0125619     2.05   0.050     .0000555    .0514394
                  KY  |   .1035851   .0199504     5.19   0.000     .0627818    .1443883
                  OK  |  -.1835111   .0524469    -3.50   0.002     -.290777   -.0762452
                  MT  |  -.4225819   .0143788   -29.39   0.000    -.4519899   -.3931739
                  CO  |  -.1011412   .0163458    -6.19   0.000    -.1345721   -.0677103
                  NM  |  -.1971015   .0174458   -11.30   0.000    -.2327821   -.1614209
                  WA  |  -.3056741   .0157393   -19.42   0.000    -.3378647   -.2734835
                  OR  |   .0488704   .0115457     4.23   0.000     .0252567     .072484
                  CA  |   .1297229   .0243651     5.32   0.000     .0798906    .1795552
                  AK  |   .7144947   .0199702    35.78   0.000      .673651    .7553384
                  HI  |  -.1545503   .0255391    -6.05   0.000    -.2067836    -.102317
                      |
        state#c.lyear |
                  ME  |   .0021818   .0001593    13.70   0.000      .001856    .0025076
                  NH  |   .0005473   .0003057     1.79   0.084    -.0000779    .0011724
                  VT  |   .0015495   .0000894    17.34   0.000     .0013667    .0017323
                  MA  |    .002714   .0001118    24.29   0.000     .0024854    .0029425
                  RI  |   .0021453   .0000975    22.00   0.000     .0019459    .0023447
                  CT  |   .0015525   .0001244    12.48   0.000      .001298     .001807
                  NY  |   .0007528   .0000863     8.73   0.000     .0005764    .0009292
                  NJ  |   .0012311   .0000819    15.03   0.000     .0010636    .0013986
                  PA  |   .0020729   .0000795    26.07   0.000     .0019103    .0022355
                  OH  |   .0008043   .0000638    12.61   0.000     .0006738    .0009348
                  IN  |    .001145   .0004766     2.40   0.023     .0001703    .0021198
                  IL  |   .0010272   .0000847    12.12   0.000     .0008539    .0012005
                  MI  |  -.0013606   .0003747    -3.63   0.001    -.0021269   -.0005943
                  WI  |    .002861   .0003451     8.29   0.000     .0021551    .0035669
                  MN  |   .0036339   .0000953    38.14   0.000     .0034391    .0038288
                  MO  |   .0019727   .0001071    18.43   0.000     .0017537    .0021916
                  DE  |   .0004843   .0001358     3.57   0.001     .0002065    .0007621
                  MD  |   .0041483   .0001156    35.89   0.000     .0039119    .0043847
                  DC  |   .0053741   .0001325    40.56   0.000     .0051031     .005645
                  WV  |   .0014451   .0002359     6.12   0.000     .0009625    .0019276
                  KY  |   .0008401   .0002415     3.48   0.002     .0003462    .0013341
                  OK  |   .0034495   .0005893     5.85   0.000     .0022441    .0046548
                  MT  |   .0058912   .0000987    59.72   0.000     .0056894     .006093
                  CO  |   .0035594   .0001184    30.05   0.000     .0033172    .0038016
                  NM  |   .0039147   .0003402    11.51   0.000     .0032189    .0046104
                  WA  |   .0059948   .0001169    51.26   0.000     .0057556     .006234
                  OR  |   .0019737   .0001533    12.88   0.000     .0016602    .0022872
                  CA  |   .0024496   .0000809    30.26   0.000     .0022841    .0026152
                  AK  |  -.0024227   .0000643   -37.65   0.000    -.0025543   -.0022911
                  HI  |   .0047375   .0000913    51.87   0.000     .0045506    .0049243
                      |
                 nind |
                   2  |   .0732333   .0296658     2.47   0.020     .0125599    .1339068
                   3  |    .114606   .0271179     4.23   0.000     .0591437    .1700683
                   4  |  -.0548064   .0283288    -1.93   0.063    -.1127454    .0031325
                   5  |   .1032045   .0269962     3.82   0.001     .0479912    .1584178
                   6  |   .1244507    .032126     3.87   0.001     .0587457    .1901557
                   7  |   .0238771   .0296886     0.80   0.428    -.0368429     .084597
                   8  |  -.0342177   .0293172    -1.17   0.253     -.094178    .0257427
                   9  |  -.0636101   .0272676    -2.33   0.027    -.1193786   -.0078415
                  10  |  -.0750691   .0293676    -2.56   0.016    -.1351326   -.0150056
                  11  |   .0838633   .0286521     2.93   0.007     .0252632    .1424633
                      |
                 educ |   .0624104   .0026081    23.93   0.000     .0570763    .0677445
                exper |   .0378704   .0022949    16.50   0.000     .0331767    .0425641
               exper2 |  -.0006745   .0000965    -6.99   0.000    -.0008719   -.0004771
               exper3 |  -4.30e-06   2.72e-06    -1.58   0.124    -9.86e-06    1.25e-06
               exper4 |   1.33e-07   3.14e-08     4.22   0.000     6.83e-08    1.97e-07
                 edex |  -.0001476   .0000822    -1.80   0.083    -.0003158    .0000205
                      |
                ee_cl |
                   2  |  -.0687814   .0058114   -11.84   0.000    -.0806671   -.0568957
                   3  |  -.0826447   .0068282   -12.10   0.000    -.0966099   -.0686794
                   4  |  -.0324508    .010866    -2.99   0.006    -.0546743   -.0102274
                   5  |  -.1321485   .0088102   -15.00   0.000    -.1501673   -.1141296
                   6  |  -.1016531   .0067314   -15.10   0.000    -.1154203   -.0878859
                   7  |  -.0877704   .0084332   -10.41   0.000    -.1050183   -.0705225
                   8  |   .0295326   .0113288     2.61   0.014     .0063627    .0527025
                   9  |  -.1499017   .0096885   -15.47   0.000     -.169717   -.1300864
                  10  |  -.1108965    .009134   -12.14   0.000    -.1295776   -.0922153
                  11  |  -.0725497    .008923    -8.13   0.000    -.0907992   -.0543001
                  12  |   .0265192   .0127999     2.07   0.047     .0003405    .0526979
                  13  |  -.0731548   .0127194    -5.75   0.000    -.0991688   -.0471408
                  14  |  -.0806975   .0113677    -7.10   0.000    -.1039472   -.0574479
                  15  |  -.0536072   .0100335    -5.34   0.000    -.0741281   -.0330863
                  16  |   .0173564   .0137004     1.27   0.215     -.010664    .0453768
                      |
                 marr |   .1278927   .0038934    32.85   0.000     .1199297    .1358556
                partt |  -.2190745   .0042421   -51.64   0.000    -.2277505   -.2103984
               public |    .005825   .0057687     1.01   0.321    -.0059733    .0176233
                 cmsa |   .1362492   .0116317    11.71   0.000     .1124598    .1600386
                      |
                nocc2 |
                   2  |  -.1539346   .0044051   -34.94   0.000     -.162944   -.1449252
                   3  |  -.0453672   .0082755    -5.48   0.000    -.0622925   -.0284419
                   4  |  -.3318051   .0114161   -29.06   0.000    -.3551536   -.3084567
                   5  |  -.0965887   .0119021    -8.12   0.000    -.1209312   -.0722463
                   6  |  -.3995664   .0073169   -54.61   0.000    -.4145312   -.3846016
                   7  |  -.2523242   .0082824   -30.46   0.000    -.2692636   -.2353847
                   8  |  -.1041124   .0135376    -7.69   0.000       -.1318   -.0764249
                   9  |  -.4453149    .007398   -60.19   0.000    -.4604455   -.4301843
                  10  |  -.3833452   .0075723   -50.62   0.000    -.3988322   -.3678582
                  11  |  -.2765119   .0083974   -32.93   0.000    -.2936865   -.2593373
                  12  |  -.4522228   .0111633   -40.51   0.000    -.4750544   -.4293912
                      |
                unemp |  -.0066641   .0010479    -6.36   0.000    -.0088073    -.004521
                      |
              quarter |
                   2  |   .0011799   .0022192     0.53   0.599    -.0033589    .0057188
                   3  |   .0017089    .002569     0.67   0.511    -.0035452    .0069631
                   4  |   .0135726   .0025399     5.34   0.000      .008378    .0187673
                      |
                _cons |   .5590948    .032381    17.27   0.000     .4928682    .6253215
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 4,706,063,449)

Linear regression                               Number of obs     =    561,535
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5112
                                                Root MSE          =     .39644

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0846514   .0070395   -12.03   0.000    -.0990488   -.0702541
             treat_st |  -.0320879   .0071919    -4.46   0.000    -.0467969   -.0173789
treat_stblackrelwhite |  -.0170151   .0087516    -1.94   0.062    -.0349141    .0008838
                      |
                state |
                  NH  |   .0583891   .0047428    12.31   0.000      .048689    .0680892
                  VT  |   .0450031   .0008469    53.14   0.000     .0432711    .0467352
                  MA  |   .0935874    .011658     8.03   0.000     .0697441    .1174307
                  RI  |  -.0018988   .0115815    -0.16   0.871    -.0255856     .021788
                  CT  |   .0978042   .0115023     8.50   0.000     .0742793    .1213291
                  NY  |   .0408517   .0108012     3.78   0.001     .0187609    .0629426
                  NJ  |   .1071246   .0122925     8.71   0.000     .0819836    .1322657
                  PA  |  -.0446813   .0091661    -4.87   0.000    -.0634281   -.0259346
                  OH  |  -.0756181   .0087377    -8.65   0.000    -.0934886   -.0577476
                  IN  |  -.0689431   .0064738   -10.65   0.000    -.0821834   -.0557027
                  IL  |  -.0035563   .0099024    -0.36   0.722     -.023809    .0166964
                  MI  |  -.0431104   .0089386    -4.82   0.000    -.0613919   -.0248288
                  WI  |   -.019832    .006354    -3.12   0.004    -.0328274   -.0068365
                  MN  |   .0371191   .0084822     4.38   0.000     .0197711    .0544671
                  MO  |  -.0829871   .0082958   -10.00   0.000    -.0999538   -.0660203
                  DE  |   .0389797   .0029014    13.43   0.000     .0330457    .0449138
                  MD  |   .0924255   .0120425     7.67   0.000     .0677959     .117055
                  DC  |   .1580423    .015157    10.43   0.000     .1270429    .1890418
                  WV  |  -.1569009   .0020103   -78.05   0.000    -.1610125   -.1527893
                  KY  |   -.090106   .0053993   -16.69   0.000    -.1011488   -.0790633
                  OK  |  -.1286421   .0078656   -16.36   0.000     -.144729   -.1125551
                  MT  |  -.0733705   .0010139   -72.37   0.000    -.0754441   -.0712969
                  CO  |  -.0009601   .0109674    -0.09   0.931     -.023391    .0214709
                  NM  |  -.0884569   .0064578   -13.70   0.000    -.1016645   -.0752492
                  WA  |   .0507049   .0104059     4.87   0.000     .0294224    .0719874
                  OR  |  -.0108437   .0094399    -1.15   0.260    -.0301505    .0084631
                  CA  |   .1091764   .0123288     8.86   0.000     .0839611    .1343916
                  AK  |   .1688006   .0061669    27.37   0.000     .1561879    .1814133
                  HI  |   .0715458   .0085893     8.33   0.000     .0539786     .089113
                      |
                 year |
                1990  |  -.0051764   .0036588    -1.41   0.168    -.0126594    .0023066
                1991  |   .0000972   .0031599     0.03   0.976    -.0063655      .00656
                1992  |   .0213906   .0039241     5.45   0.000     .0133649    .0294163
                1993  |   .0145428   .0050209     2.90   0.007     .0042739    .0248117
                1996  |   .0051342   .0047018     1.09   0.284    -.0044821    .0147505
                1997  |   .0120126   .0057078     2.10   0.044     .0003389    .0236863
                1998  |   .0498419    .005377     9.27   0.000     .0388447    .0608392
                1999  |   .0667316   .0069731     9.57   0.000       .05247    .0809933
                2000  |   .0805715   .0069945    11.52   0.000     .0662663    .0948768
                2001  |   .0966264   .0075764    12.75   0.000      .081131    .1121218
                2002  |   .1066709   .0069818    15.28   0.000     .0923915    .1209503
                2003  |   .1190155   .0073587    16.17   0.000     .1039653    .1340657
                2004  |    .109655   .0084688    12.95   0.000     .0923344    .1269757
                2005  |   .1043636   .0073614    14.18   0.000     .0893078    .1194194
                2006  |   .0929473   .0070182    13.24   0.000     .0785935    .1073011
                2007  |   .0926435   .0081516    11.37   0.000     .0759717    .1093153
                2008  |   .0848993   .0093549     9.08   0.000     .0657664    .1040323
                2009  |   .1044731    .008306    12.58   0.000     .0874855    .1214606
                2010  |   .1018791   .0061635    16.53   0.000     .0892734    .1144849
                2011  |   .0828625   .0069178    11.98   0.000      .068714     .097011
                2012  |   .0703611   .0070047    10.04   0.000     .0560349    .0846874
                2013  |   .0715053   .0071602     9.99   0.000      .056861    .0861496
                2014  |   .0720783   .0080598     8.94   0.000     .0555942    .0885625
                2015  |   .0849237   .0071413    11.89   0.000     .0703182    .0995292
                2016  |   .0973386   .0097896     9.94   0.000     .0773166    .1173605
                2017  |   .1146979   .0098395    11.66   0.000     .0945739     .134822
                2018  |   .1218378     .01012    12.04   0.000     .1011399    .1425356
                2019  |   .1313041    .008445    15.55   0.000     .1140321    .1485762
                      |
                 nind |
                   2  |   .0950756    .022365     4.25   0.000     .0493341    .1408172
                   3  |   .1683774   .0213341     7.89   0.000     .1247443    .2120105
                   4  |  -.0454815   .0226357    -2.01   0.054    -.0917767    .0008136
                   5  |   .1466083   .0218691     6.70   0.000     .1018809    .1913357
                   6  |   .1321822   .0239596     5.52   0.000     .0831794    .1811851
                   7  |   .0813287   .0239646     3.39   0.002     .0323157    .1303417
                   8  |   .0303947   .0214555     1.42   0.167    -.0134866    .0742761
                   9  |  -.0366274   .0223123    -1.64   0.111    -.0822611    .0090064
                  10  |  -.0400386   .0215355    -1.86   0.073    -.0840836    .0040064
                  11  |   .1387742   .0271718     5.11   0.000     .0832017    .1943468
                      |
                 educ |   .0842041   .0021361    39.42   0.000     .0798353    .0885728
                exper |   .0474554   .0032374    14.66   0.000     .0408343    .0540766
               exper2 |  -.0016125   .0001256   -12.84   0.000    -.0018693   -.0013557
               exper3 |   .0000247   3.69e-06     6.70   0.000     .0000172    .0000323
               exper4 |  -1.19e-07   3.81e-08    -3.13   0.004    -1.97e-07   -4.13e-08
                 edex |  -.0004682   .0001217    -3.85   0.001     -.000717   -.0002194
                      |
                ee_cl |
                   2  |  -.1177213   .0064439   -18.27   0.000    -.1309006   -.1045421
                   3  |  -.1501191   .0087535   -17.15   0.000     -.168022   -.1322161
                   4  |  -.1451715   .0148551    -9.77   0.000    -.1755536   -.1147894
                   5  |  -.1611348   .0126143   -12.77   0.000     -.186934   -.1353356
                   6  |  -.1587466   .0121869   -13.03   0.000    -.1836716   -.1338216
                   7  |  -.1602144   .0125317   -12.78   0.000    -.1858445   -.1345843
                   8  |  -.0699355    .014979    -4.67   0.000     -.100571   -.0393001
                   9  |  -.1608639   .0154035   -10.44   0.000    -.1923675   -.1293602
                  10  |  -.1640783   .0156733   -10.47   0.000    -.1961339   -.1320227
                  11  |  -.1501659   .0136605   -10.99   0.000    -.1781048    -.122227
                  12  |  -.0974989   .0120161    -8.11   0.000    -.1220746   -.0729231
                  13  |  -.1150748   .0236437    -4.87   0.000    -.1634315   -.0667181
                  14  |  -.1459253   .0175801    -8.30   0.000    -.1818807   -.1099698
                  15  |  -.1195951   .0155525    -7.69   0.000    -.1514035   -.0877867
                  16  |  -.0950152   .0150016    -6.33   0.000     -.125697   -.0643334
                      |
                 marr |   .0412741    .003603    11.46   0.000     .0339051     .048643
                partt |  -.1423872   .0030268   -47.04   0.000    -.1485777   -.1361967
               public |   .0089241   .0077558     1.15   0.259    -.0069384    .0247865
                 cmsa |   .1536448   .0116495    13.19   0.000     .1298189    .1774708
                      |
                nocc2 |
                   2  |  -.1346235   .0047136   -28.56   0.000    -.1442638   -.1249832
                   3  |  -.0453221   .0091475    -4.95   0.000    -.0640308   -.0266135
                   4  |  -.3303419   .0066342   -49.79   0.000    -.3439105   -.3167733
                   5  |   .0347366   .0084783     4.10   0.000     .0173965    .0520766
                   6  |  -.3412169     .00591   -57.74   0.000    -.3533043   -.3291295
                   7  |  -.3694563   .0058704   -62.94   0.000    -.3814627     -.35745
                   8  |  -.1726327   .0095406   -18.09   0.000    -.1921454     -.15312
                   9  |  -.4321636   .0075908   -56.93   0.000    -.4476885   -.4166387
                  10  |  -.4597915   .0121148   -37.95   0.000    -.4845691   -.4350139
                  11  |  -.2339156    .010981   -21.30   0.000    -.2563742   -.2114569
                  12  |   -.440073    .013972   -31.50   0.000    -.4686489   -.4114972
                      |
              quarter |
                   2  |   .0102187    .002156     4.74   0.000     .0058092    .0146281
                   3  |   .0161699   .0023678     6.83   0.000     .0113271    .0210126
                   4  |   .0220494   .0013842    15.93   0.000     .0192183    .0248804
                      |
                _cons |   .3839162   .0348292    11.02   0.000     .3126825    .4551499
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 4,706,063,449)

Linear regression                               Number of obs     =    561,535
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5112
                                                Root MSE          =     .39644

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0846516   .0070409   -12.02   0.000    -.0990518   -.0702514
             treat_st |  -.0320763   .0074527    -4.30   0.000    -.0473188   -.0168338
treat_stblackrelwhite |  -.0170118   .0087913    -1.94   0.063     -.034992    .0009683
                      |
                state |
                  NH  |   .0584448   .0046484    12.57   0.000     .0489377    .0679518
                  VT  |   .0450546   .0022422    20.09   0.000     .0404688    .0496403
                  MA  |   .0935842   .0116954     8.00   0.000     .0696644     .117504
                  RI  |  -.0019517   .0123569    -0.16   0.876    -.0272244    .0233209
                  CT  |   .0977981   .0115738     8.45   0.000     .0741271    .1214691
                  NY  |   .0408139   .0113202     3.61   0.001     .0176615    .0639663
                  NJ  |   .1070963   .0126499     8.47   0.000     .0812244    .1329682
                  PA  |  -.0447015   .0094233    -4.74   0.000    -.0639743   -.0254286
                  OH  |  -.0756501   .0091578    -8.26   0.000    -.0943798   -.0569203
                  IN  |  -.0689496   .0065878   -10.47   0.000    -.0824231    -.055476
                  IL  |   -.003606   .0106127    -0.34   0.736    -.0253114    .0180994
                  MI  |  -.0431861   .0103989    -4.15   0.000    -.0644543    -.021918
                  WI  |  -.0198145   .0061154    -3.24   0.003    -.0323219   -.0073071
                  MN  |   .0371585   .0081939     4.53   0.000     .0204002    .0539168
                  MO  |  -.0829977    .008419    -9.86   0.000    -.1002165   -.0657789
                  DE  |     .03901   .0031576    12.35   0.000      .032552     .045468
                  MD  |   .0924408   .0119238     7.75   0.000     .0680539    .1168277
                  DC  |   .1579558   .0162029     9.75   0.000     .1248171    .1910944
                  WV  |  -.1569715   .0038997   -40.25   0.000    -.1649472   -.1489958
                  KY  |  -.0901482   .0061826   -14.58   0.000    -.1027931   -.0775033
                  OK  |  -.1286239   .0074882   -17.18   0.000     -.143939   -.1133088
                  MT  |  -.0733654   .0010958   -66.95   0.000    -.0756067   -.0711242
                  CO  |  -.0009424   .0107964    -0.09   0.931    -.0230236    .0211387
                  NM  |  -.0884928   .0069385   -12.75   0.000    -.1026836    -.074302
                  WA  |   .0506621   .0109898     4.61   0.000     .0281854    .0731389
                  OR  |  -.0109024   .0103287    -1.06   0.300     -.032027    .0102222
                  CA  |   .1090982   .0135087     8.08   0.000     .0814698    .1367267
                  AK  |   .1686991   .0079946    21.10   0.000     .1523483    .1850499
                  HI  |   .0715968   .0082293     8.70   0.000     .0547659    .0884277
                      |
                 year |
                1990  |   -.005199   .0036411    -1.43   0.164    -.0126459     .002248
                1991  |   .0000102   .0049659     0.00   0.998    -.0101462    .0101665
                1992  |    .021273   .0069471     3.06   0.005     .0070645    .0354814
                1993  |   .0144515   .0070923     2.04   0.051    -.0000538    .0289569
                1996  |   .0051231   .0047021     1.09   0.285    -.0044938      .01474
                1997  |   .0120235   .0057481     2.09   0.045     .0002673    .0237797
                1998  |   .0498736   .0052332     9.53   0.000     .0391705    .0605767
                1999  |   .0667776   .0068498     9.75   0.000     .0527682     .080787
                2000  |   .0806265    .007069    11.41   0.000     .0661688    .0950842
                2001  |   .0966469   .0074646    12.95   0.000       .08138    .1119137
                2002  |   .1066402   .0072566    14.70   0.000     .0917988    .1214816
                2003  |   .1189693   .0079583    14.95   0.000     .1026928    .1352459
                2004  |    .109628   .0089309    12.28   0.000     .0913623    .1278937
                2005  |   .1043579   .0074119    14.08   0.000     .0891988    .1195169
                2006  |   .0929593   .0069461    13.38   0.000      .078753    .1071656
                2007  |   .0926553    .008105    11.43   0.000     .0760786    .1092319
                2008  |   .0848622   .0095188     8.92   0.000     .0653942    .1043303
                2009  |   .1042728    .012713     8.20   0.000     .0782717    .1302739
                2010  |   .1016649   .0110592     9.19   0.000     .0790462    .1242835
                2011  |   .0826868   .0096789     8.54   0.000     .0628912    .1024824
                2012  |   .0702202   .0085489     8.21   0.000     .0527356    .0877047
                2013  |     .07139   .0092351     7.73   0.000     .0525021    .0902778
                2014  |   .0720255    .008603     8.37   0.000     .0544303    .0896206
                2015  |   .0849168   .0071793    11.83   0.000     .0702335    .0996001
                2016  |   .0973483   .0097494     9.99   0.000     .0774085    .1172882
                2017  |   .1147296   .0096743    11.86   0.000     .0949435    .1345157
                2018  |   .1218897   .0100976    12.07   0.000     .1012379    .1425416
                2019  |   .1313633   .0082592    15.91   0.000     .1144714    .1482552
                      |
                 nind |
                   2  |   .0950773   .0223774     4.25   0.000     .0493104    .1408443
                   3  |   .1683786   .0213334     7.89   0.000     .1247468    .2120104
                   4  |  -.0454804   .0226418    -2.01   0.054    -.0917881    .0008272
                   5  |   .1466092   .0218724     6.70   0.000     .1018752    .1913433
                   6  |   .1321834   .0239682     5.51   0.000      .083163    .1812038
                   7  |   .0813304   .0239741     3.39   0.002     .0322979    .1303628
                   8  |   .0303958    .021456     1.42   0.167    -.0134867    .0742783
                   9  |  -.0366261   .0223183    -1.64   0.112    -.0822723      .00902
                  10  |  -.0400373   .0215406    -1.86   0.073    -.0840927    .0040181
                  11  |   .1387759   .0271687     5.11   0.000     .0832096    .1943422
                      |
                 educ |   .0842042   .0021382    39.38   0.000     .0798311    .0885773
                exper |   .0474552   .0032332    14.68   0.000     .0408426    .0540678
               exper2 |  -.0016125   .0001254   -12.86   0.000    -.0018689   -.0013561
               exper3 |   .0000247   3.69e-06     6.71   0.000     .0000172    .0000323
               exper4 |  -1.19e-07   3.81e-08    -3.13   0.004    -1.97e-07   -4.14e-08
                 edex |  -.0004682   .0001216    -3.85   0.001     -.000717   -.0002194
                      |
                ee_cl |
                   2  |  -.1177224   .0064589   -18.23   0.000    -.1309323   -.1045125
                   3  |  -.1501204    .008782   -17.09   0.000    -.1680816   -.1321592
                   4  |  -.1451732   .0148786    -9.76   0.000    -.1756034    -.114743
                   5  |  -.1611363   .0126369   -12.75   0.000    -.1869816    -.135291
                   6  |  -.1587477   .0122094   -13.00   0.000    -.1837188   -.1337766
                   7  |  -.1602164   .0125783   -12.74   0.000     -.185942   -.1344909
                   8  |  -.0699377   .0150199    -4.66   0.000    -.1006568   -.0392186
                   9  |  -.1608658   .0154215   -10.43   0.000    -.1924063   -.1293253
                  10  |  -.1640798   .0156988   -10.45   0.000    -.1961874   -.1319721
                  11  |  -.1501685   .0137156   -10.95   0.000    -.1782202   -.1221169
                  12  |  -.0975015   .0120606    -8.08   0.000    -.1221682   -.0728347
                  13  |  -.1150764   .0236616    -4.86   0.000    -.1634698   -.0666831
                  14  |  -.1459273   .0176163    -8.28   0.000    -.1819565    -.109898
                  15  |  -.1195982   .0156104    -7.66   0.000     -.151525   -.0876713
                  16  |   -.095018   .0150354    -6.32   0.000    -.1257688   -.0642671
                      |
                 marr |   .0412741    .003603    11.46   0.000      .033905    .0486431
                partt |  -.1423877     .00303   -46.99   0.000    -.1485846   -.1361907
               public |    .008924   .0077565     1.15   0.259    -.0069398    .0247878
                 cmsa |   .1536455   .0116573    13.18   0.000     .1298037    .1774874
                      |
                nocc2 |
                   2  |  -.1346231   .0047126   -28.57   0.000    -.1442614   -.1249848
                   3  |  -.0453216   .0091384    -4.96   0.000    -.0640118   -.0266315
                   4  |  -.3303418   .0066337   -49.80   0.000    -.3439091   -.3167744
                   5  |    .034737   .0084758     4.10   0.000      .017402    .0520719
                   6  |  -.3412169   .0059097   -57.74   0.000    -.3533036   -.3291302
                   7  |  -.3694561   .0058694   -62.95   0.000    -.3814603   -.3574519
                   8  |  -.1726333   .0095328   -18.11   0.000    -.1921302   -.1531365
                   9  |  -.4321634   .0075885   -56.95   0.000    -.4476836   -.4166431
                  10  |  -.4597908   .0121127   -37.96   0.000    -.4845641   -.4350175
                  11  |   -.233914   .0109617   -21.34   0.000    -.2563331   -.2114948
                  12  |  -.4400719   .0139635   -31.52   0.000    -.4686304   -.4115134
                      |
                unemp |   .0000472   .0018206     0.03   0.980    -.0036765    .0037708
                      |
              quarter |
                   2  |   .0102186    .002157     4.74   0.000     .0058069    .0146302
                   3  |   .0161695   .0023696     6.82   0.000     .0113232    .0210158
                   4  |   .0220487   .0013944    15.81   0.000     .0191969    .0249006
                      |
                _cons |   .3837013   .0385063     9.96   0.000      .304947    .4624555
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  p
> ublic cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 4,706,063,449)

Linear regression                               Number of obs     =    561,535
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5099
                                                Root MSE          =       .397

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0851936   .0068299   -12.47   0.000    -.0991624   -.0712248
             treat_st |  -.0573798   .0125189    -4.58   0.000    -.0829839   -.0317757
treat_stblackrelwhite |  -.0169032   .0081396    -2.08   0.047    -.0335506   -.0002558
                      |
                state |
                  NH  |   .1640641   .0127484    12.87   0.000     .1379908    .1901375
                  VT  |  -.1100572   .0112202    -9.81   0.000    -.1330052   -.0871092
                  MA  |  -.0979291    .019574    -5.00   0.000    -.1379624   -.0578957
                  RI  |  -.1657856   .0223197    -7.43   0.000    -.2114344   -.1201367
                  CT  |   .0483948    .023022     2.10   0.044     .0013094    .0954801
                  NY  |  -.0146086   .0232178    -0.63   0.534    -.0620943    .0328771
                  NJ  |   .0489853   .0252638     1.94   0.062    -.0026851    .1006556
                  PA  |  -.0391138   .0204982    -1.91   0.066    -.0810372    .0028097
                  OH  |  -.1148754   .0260735    -4.41   0.000    -.1682017   -.0615491
                  IN  |  -.2451812   .0468552    -5.23   0.000    -.3410109   -.1493515
                  IL  |   -.129604   .0192591    -6.73   0.000    -.1689933   -.0902146
                  MI  |  -.1281105    .042232    -3.03   0.005    -.2144846   -.0417364
                  WI  |  -.3967735   .0370375   -10.71   0.000    -.4725236   -.3210234
                  MN  |  -.1958281   .0188023   -10.42   0.000     -.234283   -.1573731
                  MO  |  -.0296843   .0150419    -1.97   0.058    -.0604484    .0010798
                  DE  |   .1498862   .0178522     8.40   0.000     .1133743    .1863981
                  MD  |   -.340112   .0264656   -12.85   0.000    -.3942402   -.2859838
                  DC  |  -.2357383   .0263341    -8.95   0.000    -.2895976   -.1818791
                  WV  |  -.0419981   .0128552    -3.27   0.003    -.0682898   -.0157063
                  KY  |  -.2221837   .0239995    -9.26   0.000    -.2712682   -.1730992
                  OK  |  -.4226891   .0553848    -7.63   0.000    -.5359637   -.3094145
                  MT  |  -.5794143   .0110926   -52.23   0.000    -.6021012   -.5567274
                  CO  |  -.2487994   .0175848   -14.15   0.000    -.2847643   -.2128344
                  NM  |  -.4880117   .0085356   -57.17   0.000    -.5054689   -.4705544
                  WA  |  -.4265251   .0134788   -31.64   0.000    -.4540924   -.3989577
                  OR  |  -.1900957   .0123177   -15.43   0.000    -.2152883   -.1649031
                  CA  |  -.1130514   .0246369    -4.59   0.000    -.1634394   -.0626633
                  AK  |   .3865171   .0208001    18.58   0.000     .3439761    .4290581
                  HI  |  -.1843812   .0265434    -6.95   0.000    -.2386685   -.1300938
                      |
        state#c.lyear |
                  ME  |   .0025523   .0001752    14.56   0.000     .0021939    .0029107
                  NH  |   .0015658   .0003192     4.91   0.000     .0009129    .0022186
                  VT  |    .004028    .000114    35.33   0.000     .0037949    .0042612
                  MA  |   .0043986   .0001215    36.21   0.000     .0041501     .004647
                  RI  |   .0041753   .0001309    31.89   0.000     .0039076    .0044431
                  CT  |   .0030382   .0001084    28.02   0.000     .0028164      .00326
                  NY  |   .0031055   .0000925    33.57   0.000     .0029163    .0032946
                  NJ  |   .0031413   .0000946    33.21   0.000     .0029478    .0033347
                  PA  |   .0025164   .0000987    25.49   0.000     .0023145    .0027182
                  OH  |   .0029608   .0000757    39.13   0.000     .0028061    .0031156
                  IN  |   .0043234   .0005107     8.47   0.000      .003279    .0053678
                  IL  |   .0037979   .0001142    33.26   0.000     .0035643    .0040314
                  MI  |   .0034649   .0004169     8.31   0.000     .0026123    .0043176
                  WI  |   .0062138   .0003907    15.90   0.000     .0054147    .0070129
                  MN  |   .0047887   .0001205    39.75   0.000     .0045423    .0050351
                  MO  |   .0020551   .0001205    17.05   0.000     .0018086    .0023015
                  DE  |   .0013175   .0001979     6.66   0.000     .0009128    .0017222
                  MD  |   .0066952   .0001089    61.46   0.000     .0064724     .006918
                  DC  |   .0063762    .000187    34.10   0.000     .0059937    .0067586
                  WV  |    .001499   .0002737     5.48   0.000     .0009392    .0020587
                  KY  |    .003882   .0002888    13.44   0.000     .0032913    .0044726
                  OK  |   .0055482   .0006548     8.47   0.000     .0042089    .0068875
                  MT  |   .0074418    .000103    72.25   0.000     .0072311    .0076524
                  CO  |   .0049382   .0001316    37.54   0.000     .0046691    .0052072
                  NM  |   .0064349   .0002893    22.25   0.000     .0058433    .0070266
                  WA  |   .0071685   .0001694    42.32   0.000     .0068221    .0075149
                  OR  |   .0043244   .0001578    27.41   0.000     .0040018    .0046471
                  CA  |   .0047529   .0000979    48.54   0.000     .0045526    .0049532
                  AK  |    .000451   .0000674     6.69   0.000     .0003131    .0005889
                  HI  |   .0050228   .0000767    65.45   0.000     .0048659    .0051798
                      |
                 nind |
                   2  |   .0966532   .0222544     4.34   0.000     .0511379    .1421685
                   3  |   .1680444   .0212578     7.91   0.000     .1245674    .2115215
                   4  |  -.0449853   .0226063    -1.99   0.056    -.0912203    .0012497
                   5  |   .1481769   .0217785     6.80   0.000     .1036349    .1927189
                   6  |   .1329891   .0238045     5.59   0.000     .0843034    .1816748
                   7  |   .0821267   .0238639     3.44   0.002     .0333194    .1309339
                   8  |   .0313755    .021426     1.46   0.154    -.0124457    .0751967
                   9  |  -.0357738    .022248    -1.61   0.119    -.0812761    .0097285
                  10  |  -.0406438   .0213853    -1.90   0.067    -.0843818    .0030941
                  11  |   .1399183    .027197     5.14   0.000     .0842941    .1955425
                      |
                 educ |   .0825305   .0021828    37.81   0.000     .0780661    .0869949
                exper |   .0467251   .0032034    14.59   0.000     .0401735    .0532768
               exper2 |  -.0015697   .0001248   -12.58   0.000    -.0018249   -.0013145
               exper3 |   .0000234   3.73e-06     6.28   0.000     .0000158     .000031
               exper4 |  -1.07e-07   3.86e-08    -2.78   0.009    -1.86e-07   -2.84e-08
                 edex |   -.000442   .0001223    -3.61   0.001    -.0006921   -.0001919
                      |
                ee_cl |
                   2  |  -.1184463   .0065988   -17.95   0.000    -.1319423   -.1049503
                   3  |  -.1479368   .0090112   -16.42   0.000    -.1663667   -.1295069
                   4  |  -.1396362   .0149946    -9.31   0.000    -.1703035   -.1089688
                   5  |   -.165292   .0125595   -13.16   0.000     -.190979    -.139605
                   6  |  -.1605091   .0121525   -13.21   0.000    -.1853638   -.1356543
                   7  |  -.1577966   .0128343   -12.29   0.000    -.1840458   -.1315475
                   8  |  -.0647884   .0152941    -4.24   0.000    -.0960683   -.0335084
                   9  |  -.1639443   .0152354   -10.76   0.000    -.1951043   -.1327843
                  10  |  -.1635774   .0157939   -10.36   0.000    -.1958797   -.1312752
                  11  |    -.14665   .0139186   -10.54   0.000    -.1751168   -.1181831
                  12  |  -.0926211   .0121647    -7.61   0.000    -.1175007   -.0677416
                  13  |  -.1179999   .0234383    -5.03   0.000    -.1659366   -.0700632
                  14  |  -.1444579   .0177004    -8.16   0.000    -.1806593   -.1082564
                  15  |  -.1171883   .0158978    -7.37   0.000    -.1497029   -.0846737
                  16  |  -.0928883   .0148786    -6.24   0.000    -.1233184   -.0624582
                      |
                 marr |   .0409528   .0035346    11.59   0.000     .0337236    .0481819
                partt |  -.1424798   .0030321   -46.99   0.000    -.1486811   -.1362784
               public |     .00838   .0076264     1.10   0.281    -.0072177    .0239778
                 cmsa |   .1529149   .0116438    13.13   0.000     .1291007    .1767292
                      |
                nocc2 |
                   2  |   -.134155   .0048555   -27.63   0.000    -.1440855   -.1242245
                   3  |  -.0444916   .0092151    -4.83   0.000    -.0633386   -.0256446
                   4  |  -.3295726   .0066457   -49.59   0.000    -.3431645   -.3159807
                   5  |   .0345238   .0085296     4.05   0.000     .0170788    .0519688
                   6  |  -.3415068   .0059928   -56.99   0.000    -.3537634   -.3292503
                   7  |  -.3696574   .0059441   -62.19   0.000    -.3818144   -.3575003
                   8  |  -.1715699   .0097957   -17.51   0.000    -.1916044   -.1515354
                   9  |  -.4320639   .0076257   -56.66   0.000    -.4476602   -.4164675
                  10  |  -.4603888   .0122684   -37.53   0.000    -.4854805    -.435297
                  11  |  -.2332108   .0110688   -21.07   0.000    -.2558491   -.2105726
                  12  |  -.4404251    .014182   -31.06   0.000    -.4694305   -.4114196
                      |
                unemp |  -.0025511   .0007654    -3.33   0.002    -.0041165   -.0009857
                      |
              quarter |
                   2  |    .009845   .0020861     4.72   0.000     .0055784    .0141116
                   3  |   .0158227   .0023013     6.88   0.000     .0111161    .0205294
                   4  |   .0215824   .0013782    15.66   0.000     .0187637    .0244011
                      |
                _cons |   .2214664   .0319211     6.94   0.000     .1561804    .2867524
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,284,071,771)

Linear regression                               Number of obs     =    147,301
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3495
                                                Root MSE          =     .35722

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1368319   .0123907   -11.04   0.000    -.1621738   -.1114901
             treat_st |  -.0539513   .0308943    -1.75   0.091    -.1171372    .0092347
treat_stblackrelwhite |  -.0255658   .0184612    -1.38   0.177    -.0633232    .0121915
                      |
                state |
                  NH  |   .0378492    .006807     5.56   0.000     .0239274     .051771
                  VT  |  -.0196658   .0039976    -4.92   0.000    -.0278418   -.0114898
                  MA  |   .0869742    .012263     7.09   0.000     .0618936    .1120548
                  RI  |   .0248143   .0132852     1.87   0.072     -.002357    .0519855
                  CT  |   .1340247   .0117915    11.37   0.000     .1099084     .158141
                  NY  |   .1030105   .0104266     9.88   0.000     .0816856    .1243353
                  NJ  |   .1730084   .0120374    14.37   0.000     .1483892    .1976276
                  PA  |   -.001231    .008533    -0.14   0.886    -.0186829     .016221
                  OH  |  -.0012733   .0081401    -0.16   0.877    -.0179216     .015375
                  IN  |   .0225537    .006294     3.58   0.001     .0096811    .0354263
                  IL  |   .0810955   .0087008     9.32   0.000     .0633004    .0988905
                  MI  |   .0815025   .0078182    10.42   0.000     .0655124    .0974926
                  WI  |   .0216052   .0063737     3.39   0.002     .0085696    .0346408
                  MN  |   .0597037   .0090008     6.63   0.000      .041295    .0781124
                  MO  |    .018729   .0082805     2.26   0.031     .0017934    .0356646
                  DE  |   .0579365   .0049079    11.80   0.000     .0478987    .0679743
                  MD  |   .1150451   .0105524    10.90   0.000      .093463    .1366271
                  DC  |   .1213054   .0109164    11.11   0.000     .0989787     .143632
                  WV  |   -.006356   .0065687    -0.97   0.341    -.0197905    .0070786
                  KY  |  -.0248363   .0058614    -4.24   0.000    -.0368242   -.0128483
                  OK  |   -.043696   .0143656    -3.04   0.005     -.073077    -.014315
                  MT  |  -.0433831   .0045019    -9.64   0.000    -.0525904   -.0341758
                  CO  |   .0069332   .0109483     0.63   0.532    -.0154585     .029325
                  NM  |  -.0453928   .0095624    -4.75   0.000      -.06495   -.0258355
                  WA  |   .0981136   .0100167     9.80   0.000     .0776272       .1186
                  OR  |   .0240545   .0095666     2.51   0.018     .0044885    .0436204
                  CA  |   .1685045   .0124772    13.50   0.000     .1429858    .1940233
                  AK  |   .2305123   .0077017    29.93   0.000     .2147606    .2462641
                  HI  |   .0845966   .0097753     8.65   0.000     .0646038    .1045895
                      |
                 year |
                1990  |  -.0164232   .0062268    -2.64   0.013    -.0291584    -.003688
                1991  |  -.0278377   .0049255    -5.65   0.000    -.0379114    -.017764
                1992  |  -.0265149   .0076036    -3.49   0.002     -.042066   -.0109638
                1993  |  -.0255998   .0052272    -4.90   0.000    -.0362905    -.014909
                1996  |  -.0117666   .0061207    -1.92   0.064    -.0242847    .0007516
                1997  |  -.0001006   .0064357    -0.02   0.988     -.013263    .0130618
                1998  |   .0042137   .0058474     0.72   0.477    -.0077456     .016173
                1999  |   .0151323   .0064453     2.35   0.026     .0019502    .0283145
                2000  |   .0141536   .0079985     1.77   0.087    -.0022051    .0305123
                2001  |   .0176746   .0067827     2.61   0.014     .0038025    .0315467
                2002  |   .0320698   .0084847     3.78   0.001     .0147166     .049423
                2003  |   .0401437   .0086935     4.62   0.000     .0223635     .057924
                2004  |   .0269213   .0073736     3.65   0.001     .0118407    .0420019
                2005  |   .0241918   .0076319     3.17   0.004     .0085828    .0398009
                2006  |   .0197055    .010476     1.88   0.070    -.0017203    .0411312
                2007  |   .0207125   .0129565     1.60   0.121    -.0057866    .0472116
                2008  |   .0039461    .009335     0.42   0.676    -.0151461    .0230383
                2009  |   .0142897   .0102795     1.39   0.175    -.0067341    .0353136
                2010  |   .0307007   .0121518     2.53   0.017     .0058475     .055554
                2011  |   .0106202   .0112801     0.94   0.354    -.0124503    .0336907
                2012  |  -.0046469   .0131776    -0.35   0.727     -.031598    .0223042
                2013  |  -.0050468    .008831    -0.57   0.572    -.0231081    .0130146
                2014  |   .0021848    .010111     0.22   0.830    -.0184945    .0228641
                2015  |   .0116258   .0091063     1.28   0.212    -.0069986    .0302502
                2016  |   .0076169    .010267     0.74   0.464    -.0133815    .0286152
                2017  |   .0307691    .009644     3.19   0.003      .011045    .0504932
                2018  |   .0305823    .011098     2.76   0.010     .0078843    .0532803
                2019  |   .0445082   .0121466     3.66   0.001     .0196657    .0693508
                      |
                 nind |
                   2  |   .0837976   .0311655     2.69   0.012      .020057    .1475382
                   3  |  -.0578667   .0305785    -1.89   0.068    -.1204067    .0046732
                   4  |  -.2196394   .0346445    -6.34   0.000    -.2904953   -.1487836
                   5  |   .0522901    .030272     1.73   0.095    -.0096232    .1142033
                   6  |  -.0869794   .0342812    -2.54   0.017    -.1570922   -.0168665
                   7  |  -.1030046   .0317662    -3.24   0.003    -.1679738   -.0380353
                   8  |  -.2032611   .0320233    -6.35   0.000    -.2687562    -.137766
                   9  |  -.1320139   .0308071    -4.29   0.000    -.1950216   -.0690063
                  10  |  -.1489977   .0522528    -2.85   0.008    -.2558667   -.0421286
                  11  |   .0854916   .0323399     2.64   0.013     .0193491    .1516341
                      |
                 educ |   .0695247   .0047639    14.59   0.000     .0597815    .0792679
                exper |   .0689567    .002933    23.51   0.000     .0629581    .0749553
               exper2 |  -.0025312   .0002037   -12.43   0.000    -.0029478   -.0021147
               exper3 |   .0000507   5.74e-06     8.82   0.000     .0000389    .0000624
               exper4 |  -4.10e-07   5.56e-08    -7.37   0.000    -5.24e-07   -2.96e-07
                 edex |  -.0006569   .0001179    -5.57   0.000    -.0008982   -.0004157
                      |
                ee_cl |
                   2  |   .0633419   .0181665     3.49   0.002     .0261873    .1004965
                   3  |   .0493927   .0186907     2.64   0.013     .0111659    .0876196
                   4  |   .0027176   .0243383     0.11   0.912    -.0470598     .052495
                   5  |   .0186088   .0244654     0.76   0.453    -.0314285    .0686461
                   6  |   .0449164   .0175962     2.55   0.016     .0089282    .0809046
                   7  |   .0509453   .0227442     2.24   0.033     .0044283    .0974624
                   8  |   .0025377   .0226262     0.11   0.911    -.0437381    .0488134
                   9  |   .0313518   .0253658     1.24   0.226     -.020527    .0832306
                  10  |   .0322214   .0210017     1.53   0.136    -.0107319    .0751748
                  11  |   .0431263   .0222511     1.94   0.062    -.0023822    .0886348
                  12  |   .0463927     .02394     1.94   0.062    -.0025702    .0953556
                  13  |   .0583544   .0230523     2.53   0.017     .0112071    .1055016
                  14  |   .0236142   .0220518     1.07   0.293    -.0214869    .0687152
                  15  |   .0384406   .0233827     1.64   0.111    -.0093823    .0862635
                  16  |     .05826   .0215163     2.71   0.011     .0142541    .1022659
                      |
                 marr |   .0638462    .003262    19.57   0.000     .0571746    .0705178
                partt |  -.1234793   .0155389    -7.95   0.000    -.1552599   -.0916987
               public |  -.0495996   .0103831    -4.78   0.000    -.0708355   -.0283637
                 cmsa |   .1157192   .0135281     8.55   0.000     .0880511    .1433873
                      |
                nocc2 |
                   2  |  -.0251535   .0118058    -2.13   0.042    -.0492991   -.0010079
                   3  |  -.0124364   .0154689    -0.80   0.428    -.0440738    .0192011
                   4  |  -.0481386    .011331    -4.25   0.000     -.071313   -.0249642
                   5  |   .0346451   .0156034     2.22   0.034     .0027325    .0665577
                   6  |  -.2404839   .0129082   -18.63   0.000    -.2668842   -.2140837
                   7  |  -.1880412   .0099859   -18.83   0.000    -.2084647   -.1676177
                   8  |  -.0850531   .0314155    -2.71   0.011     -.149305   -.0208013
                   9  |    -.20863    .008727   -23.91   0.000    -.2264788   -.1907812
                  10  |  -.1446689   .0072829   -19.86   0.000    -.1595641   -.1297738
                  11  |  -.0588078   .0088163    -6.67   0.000    -.0768391   -.0407765
                  12  |  -.1945322   .0078848   -24.67   0.000    -.2106585   -.1784059
                      |
              quarter |
                   2  |  -.0000916    .002713    -0.03   0.973    -.0056403    .0054571
                   3  |   .0070665   .0034094     2.07   0.047     .0000935    .0140396
                   4  |   .0124923   .0019252     6.49   0.000     .0085548    .0164297
                      |
                _cons |   .5597172   .0712578     7.85   0.000     .4139786    .7054559
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,284,071,771)

Linear regression                               Number of obs     =    147,301
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3495
                                                Root MSE          =     .35721

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1368093   .0124045   -11.03   0.000    -.1621794   -.1114393
             treat_st |  -.0545527   .0316863    -1.72   0.096    -.1193584    .0102529
treat_stblackrelwhite |  -.0255896   .0185292    -1.38   0.178     -.063486    .0123068
                      |
                state |
                  NH  |   .0345082   .0077607     4.45   0.000     .0186358    .0503806
                  VT  |  -.0230385   .0042337    -5.44   0.000    -.0316973   -.0143797
                  MA  |   .0871271   .0122114     7.13   0.000     .0621519    .1121022
                  RI  |   .0277239   .0125254     2.21   0.035     .0021066    .0533411
                  CT  |    .134129   .0117445    11.42   0.000     .1101087    .1581493
                  NY  |   .1050478   .0099341    10.57   0.000     .0847303    .1253653
                  NJ  |   .1743732    .011623    15.00   0.000     .1506014     .198145
                  PA  |  -.0002398   .0082109    -0.03   0.977    -.0170331    .0165534
                  OH  |   .0003011    .007542     0.04   0.968     -.015124    .0157262
                  IN  |   .0223082   .0063211     3.53   0.001       .00938    .0352363
                  IL  |   .0837951   .0081033    10.34   0.000      .067222    .1003683
                  MI  |   .0857201   .0077343    11.08   0.000     .0699017    .1015384
                  WI  |   .0200213   .0068206     2.94   0.006     .0060716     .033971
                  MN  |   .0571154    .009988     5.72   0.000     .0366877    .0775431
                  MO  |   .0192129   .0081408     2.36   0.025     .0025631    .0358626
                  DE  |   .0557607   .0050163    11.12   0.000     .0455012    .0660202
                  MD  |   .1138951   .0110888    10.27   0.000     .0912159    .1365743
                  DC  |   .1262238   .0097749    12.91   0.000     .1062318    .1462157
                  WV  |  -.0012457   .0091383    -0.14   0.893    -.0199356    .0174443
                  KY  |  -.0225998   .0063161    -3.58   0.001    -.0355177   -.0096819
                  OK  |  -.0448289   .0140787    -3.18   0.003    -.0736231   -.0160346
                  MT  |   -.043749   .0043414   -10.08   0.000    -.0526281   -.0348698
                  CO  |   .0055565   .0113826     0.49   0.629    -.0177236    .0288365
                  NM  |  -.0435061   .0093492    -4.65   0.000    -.0626273    -.024385
                  WA  |   .1003841   .0094405    10.63   0.000     .0810762     .119692
                  OR  |   .0272042   .0092036     2.96   0.006     .0083808    .0460276
                  CA  |   .1729191    .011878    14.56   0.000     .1486258    .1972123
                  AK  |   .2360988   .0090099    26.20   0.000     .2176714    .2545261
                  HI  |   .0808843   .0106251     7.61   0.000     .0591536     .102615
                      |
                 year |
                1990  |  -.0151501   .0056128    -2.70   0.011    -.0266296   -.0036706
                1991  |  -.0226109    .006445    -3.51   0.001    -.0357923   -.0094294
                1992  |  -.0192654   .0070435    -2.74   0.011    -.0336709     -.00486
                1993  |  -.0200409   .0057335    -3.50   0.002    -.0317672   -.0083147
                1996  |  -.0110785    .006031    -1.84   0.076    -.0234133    .0012564
                1997  |  -.0006596   .0061227    -0.11   0.915    -.0131819    .0118626
                1998  |   .0023467   .0067513     0.35   0.731    -.0114613    .0161547
                1999  |   .0124299   .0066606     1.87   0.072    -.0011925    .0260523
                2000  |   .0108908   .0073433     1.48   0.149    -.0041278    .0259095
                2001  |   .0165022   .0076842     2.15   0.040     .0007863    .0322181
                2002  |   .0340189   .0078491     4.33   0.000     .0179657    .0500721
                2003  |    .042952   .0084297     5.10   0.000     .0257114    .0601927
                2004  |   .0284996   .0072301     3.94   0.000     .0137123    .0432869
                2005  |   .0243687   .0075894     3.21   0.003     .0088466    .0398909
                2006  |   .0187694   .0111513     1.68   0.103    -.0040377    .0415764
                2007  |   .0198261   .0135986     1.46   0.156    -.0079862    .0476384
                2008  |    .006113   .0084944     0.72   0.478      -.01126    .0234859
                2009  |   .0260869   .0137631     1.90   0.068    -.0020618    .0542355
                2010  |   .0435078   .0143976     3.02   0.005     .0140614    .0729542
                2011  |     .02132   .0115501     1.85   0.075    -.0023027    .0449426
                2012  |   .0040456    .011594     0.35   0.730    -.0196668     .027758
                2013  |   .0019232   .0073547     0.26   0.796    -.0131188    .0169652
                2014  |   .0054297   .0104109     0.52   0.606    -.0158631    .0267224
                2015  |   .0120499   .0092034     1.31   0.201    -.0067732     .030873
                2016  |   .0068432   .0109723     0.62   0.538    -.0155976     .029284
                2017  |   .0287808   .0105628     2.72   0.011     .0071775    .0503842
                2018  |   .0273341   .0110293     2.48   0.019     .0047766    .0498916
                2019  |   .0407709   .0130264     3.13   0.004     .0141289    .0674129
                      |
                 nind |
                   2  |   .0835442   .0312993     2.67   0.012       .01953    .1475584
                   3  |  -.0581686   .0306723    -1.90   0.068    -.1209004    .0045632
                   4  |  -.2198942   .0347888    -6.32   0.000    -.2910454   -.1487431
                   5  |   .0520768   .0304226     1.71   0.098    -.0101445     .114298
                   6  |  -.0871508   .0344161    -2.53   0.017    -.1575396   -.0167619
                   7  |   -.103273   .0319152    -3.24   0.003    -.1685468   -.0379992
                   8  |  -.2035015   .0321747    -6.32   0.000    -.2693062   -.1376968
                   9  |  -.1322002   .0309062    -4.28   0.000    -.1954105   -.0689898
                  10  |   -.149169   .0523762    -2.85   0.008    -.2562903   -.0420477
                  11  |   .0852231   .0324911     2.62   0.014     .0187714    .1516748
                      |
                 educ |   .0695387   .0047671    14.59   0.000      .059789    .0792884
                exper |   .0689997   .0029308    23.54   0.000     .0630056    .0749938
               exper2 |  -.0025327   .0002033   -12.46   0.000    -.0029485   -.0021169
               exper3 |   .0000507   5.74e-06     8.84   0.000      .000039    .0000625
               exper4 |  -4.11e-07   5.57e-08    -7.38   0.000    -5.24e-07   -2.97e-07
                 edex |  -.0006587   .0001188    -5.54   0.000    -.0009018   -.0004157
                      |
                ee_cl |
                   2  |   .0633812   .0181637     3.49   0.002     .0262322    .1005302
                   3  |   .0494466   .0186802     2.65   0.013     .0112414    .0876518
                   4  |   .0027368   .0243493     0.11   0.911    -.0470631    .0525367
                   5  |   .0186584   .0245407     0.76   0.453    -.0315329    .0688497
                   6  |   .0449199   .0176169     2.55   0.016     .0088892    .0809505
                   7  |   .0510165   .0227415     2.24   0.033     .0045049    .0975281
                   8  |   .0025899   .0226066     0.11   0.910    -.0436458    .0488257
                   9  |   .0313745   .0254177     1.23   0.227    -.0206107    .0833596
                  10  |   .0321156   .0210436     1.53   0.138    -.0109234    .0751545
                  11  |   .0431373   .0222614     1.94   0.062    -.0023923    .0886669
                  12  |   .0465253   .0239041     1.95   0.061     -.002364    .0954146
                  13  |   .0582011   .0231173     2.52   0.018     .0109208    .1054813
                  14  |   .0235573    .022076     1.07   0.295    -.0215931    .0687077
                  15  |   .0384609   .0233802     1.65   0.111     -.009357    .0862788
                  16  |   .0583944   .0214856     2.72   0.011     .0144514    .1023373
                      |
                 marr |   .0638795   .0032486    19.66   0.000     .0572353    .0705236
                partt |   -.123316   .0154774    -7.97   0.000    -.1549709   -.0916612
               public |   -.049557   .0104116    -4.76   0.000    -.0708511   -.0282629
                 cmsa |   .1156498   .0134981     8.57   0.000     .0880431    .1432564
                      |
                nocc2 |
                   2  |  -.0251255   .0117919    -2.13   0.042    -.0492426   -.0010083
                   3  |  -.0124255   .0154828    -0.80   0.429    -.0440914    .0192403
                   4  |  -.0481547   .0113065    -4.26   0.000     -.071279   -.0250303
                   5  |   .0345645   .0156601     2.21   0.035     .0025359    .0665931
                   6  |  -.2404911   .0129379   -18.59   0.000    -.2669521   -.2140302
                   7  |  -.1879957        .01   -18.80   0.000     -.208448   -.1675434
                   8  |  -.0852636   .0313562    -2.72   0.011    -.1493943    -.021133
                   9  |  -.2085752   .0087399   -23.86   0.000    -.2264503   -.1907002
                  10  |  -.1446591   .0072823   -19.86   0.000     -.159553   -.1297651
                  11  |  -.0588265   .0088309    -6.66   0.000    -.0768876   -.0407653
                  12  |   -.194507   .0078984   -24.63   0.000    -.2106611   -.1783529
                      |
                unemp |  -.0028177   .0026939    -1.05   0.304    -.0083272    .0026919
                      |
              quarter |
                   2  |  -.0000851   .0027108    -0.03   0.975    -.0056293    .0054591
                   3  |   .0071299   .0033871     2.11   0.044     .0002025    .0140573
                   4  |   .0126523   .0019243     6.58   0.000     .0087167    .0165879
                      |
                _cons |   .5725943   .0701962     8.16   0.000      .429027    .7161617
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  p
> ublic cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,284,071,771)

Linear regression                               Number of obs     =    147,301
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3498
                                                Root MSE          =     .35715

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1378634   .0123239   -11.19   0.000    -.1630685   -.1126583
             treat_st |  -.0415163   .0202327    -2.05   0.049    -.0828969   -.0001357
treat_stblackrelwhite |  -.0175786   .0168992    -1.04   0.307    -.0521413    .0169841
                      |
                state |
                  NH  |  -.2868995   .0116196   -24.69   0.000    -.3106642   -.2631347
                  VT  |  -.3900779   .0197819   -19.72   0.000    -.4305364   -.3496193
                  MA  |   -.198368   .0241575    -8.21   0.000    -.2477756   -.1489603
                  RI  |  -.2897999   .0331307    -8.75   0.000    -.3575598     -.22204
                  CT  |   -.138469   .0263931    -5.25   0.000    -.1924489    -.084489
                  NY  |  -.1124147   .0307723    -3.65   0.001    -.1753511   -.0494782
                  NJ  |  -.1579699   .0257536    -6.13   0.000    -.2106421   -.1052978
                  PA  |  -.2186897    .024812    -8.81   0.000    -.2694359   -.1679434
                  OH  |   .0178858   .0278621     0.64   0.526    -.0390985    .0748701
                  IN  |  -.0921573   .0680129    -1.35   0.186    -.2312593    .0469446
                  IL  |  -.0286764   .0209304    -1.37   0.181    -.0714839    .0141312
                  MI  |   .3892948   .0692738     5.62   0.000      .247614    .5309756
                  WI  |  -.3042035   .0572244    -5.32   0.000    -.4212405   -.1871666
                  MN  |   -.138949    .027009    -5.14   0.000    -.1941886   -.0837094
                  MO  |   .0348282    .020009     1.74   0.092    -.0060948    .0757512
                  DE  |   .2868558   .0243412    11.78   0.000     .2370725    .3366391
                  MD  |  -.3306032   .0321892   -10.27   0.000    -.3964376   -.2647689
                  DC  |  -.3332132   .0247027   -13.49   0.000    -.3837358   -.2826906
                  WV  |     .08754   .0250971     3.49   0.002     .0362107    .1388693
                  KY  |   .1186937   .0400333     2.96   0.006     .0368164    .2005711
                  OK  |  -.4918402   .0991128    -4.96   0.000    -.6945486   -.2891319
                  MT  |  -.0268726   .0167205    -1.61   0.119    -.0610698    .0073247
                  CO  |  -.0459194   .0275599    -1.67   0.106    -.1022858     .010447
                  NM  |  -.4315944   .0320767   -13.46   0.000    -.4971987   -.3659901
                  WA  |  -.0385677    .021382    -1.80   0.082    -.0822988    .0051635
                  OR  |   .0084345   .0163806     0.51   0.611    -.0250676    .0419366
                  CA  |   .1330607   .0289231     4.60   0.000     .0739063    .1922151
                  AK  |   .6273781   .0262305    23.92   0.000     .5737306    .6810256
                  HI  |   -.135112   .0239503    -5.64   0.000    -.1840958   -.0861281
                      |
        state#c.lyear |
                  ME  |   .0003022   .0002871     1.05   0.301     -.000285    .0008895
                  NH  |   .0033703   .0003533     9.54   0.000     .0026478    .0040929
                  VT  |   .0038666   .0002312    16.73   0.000     .0033938    .0043394
                  MA  |   .0031073   .0002022    15.37   0.000     .0026938    .0035208
                  RI  |   .0034344    .000152    22.59   0.000     .0031235    .0037452
                  CT  |   .0029813   .0002413    12.36   0.000     .0024879    .0034748
                  NY  |   .0024569   .0001223    20.09   0.000     .0022068     .002707
                  NJ  |   .0035671   .0002341    15.24   0.000     .0030884    .0040458
                  PA  |   .0024589   .0001686    14.59   0.000     .0021142    .0028036
                  OH  |   .0001428   .0002156     0.66   0.513    -.0002982    .0005838
                  IN  |   .0014191   .0006584     2.16   0.040     .0000725    .0027657
                  IL  |   .0014301   .0002094     6.83   0.000     .0010017    .0018584
                  MI  |  -.0027333   .0006223    -4.39   0.000    -.0040061   -.0014606
                  WI  |   .0034955   .0004688     7.46   0.000     .0025368    .0044542
                  MN  |   .0022216   .0001345    16.52   0.000     .0019466    .0024966
                  MO  |   .0001719   .0001593     1.08   0.289    -.0001539    .0004978
                  DE  |  -.0022056   .0003341    -6.60   0.000    -.0028889   -.0015222
                  MD  |     .00463   .0001915    24.18   0.000     .0042383    .0050217
                  DC  |   .0048448   .0002563    18.90   0.000     .0043205    .0053691
                  WV  |  -.0005598   .0003521    -1.59   0.123      -.00128    .0001603
                  KY  |  -.0010525   .0003867    -2.72   0.011    -.0018433   -.0002617
                  OK  |   .0046517   .0010203     4.56   0.000     .0025649    .0067385
                  MT  |    .000138   .0001675     0.82   0.417    -.0002047    .0004806
                  CO  |   .0008191   .0001488     5.51   0.000     .0005148    .0011234
                  NM  |   .0040539   .0004521     8.97   0.000     .0031293    .0049785
                  WA  |   .0016849   .0001613    10.45   0.000      .001355    .0020148
                  OR  |   .0005162   .0002357     2.19   0.037     .0000342    .0009982
                  CA  |   .0007216   .0001499     4.82   0.000     .0004151    .0010281
                  AK  |  -.0035126   .0001355   -25.91   0.000    -.0037899   -.0032354
                  HI  |   .0024102   .0002398    10.05   0.000     .0019199    .0029006
                      |
                 nind |
                   2  |   .0851545   .0312097     2.73   0.011     .0213235    .1489856
                   3  |   -.058606   .0302377    -1.94   0.062    -.1204491    .0032372
                   4  |  -.2188726   .0347705    -6.29   0.000    -.2899863   -.1477588
                   5  |   .0534408   .0303092     1.76   0.088    -.0085485    .1154302
                   6  |  -.0862967   .0346354    -2.49   0.019    -.1571341   -.0154593
                   7  |  -.1029296   .0320177    -3.21   0.003     -.168413   -.0374461
                   8  |    -.20178   .0320604    -6.29   0.000    -.2673509   -.1362091
                   9  |  -.1299198   .0307783    -4.22   0.000    -.1928685   -.0669711
                  10  |  -.1488729   .0524407    -2.84   0.008    -.2561261   -.0416197
                  11  |   .0862334   .0325209     2.65   0.013     .0197207    .1527462
                      |
                 educ |   .0686675   .0047274    14.53   0.000      .058999    .0783361
                exper |   .0686743   .0028012    24.52   0.000     .0629451    .0744034
               exper2 |   -.002508   .0001969   -12.74   0.000    -.0029106   -.0021053
               exper3 |   .0000498   5.60e-06     8.89   0.000     .0000384    .0000613
               exper4 |  -4.01e-07   5.43e-08    -7.39   0.000    -5.12e-07   -2.90e-07
                 edex |   -.000648   .0001195    -5.42   0.000    -.0008925   -.0004036
                      |
                ee_cl |
                   2  |   .0629701   .0184166     3.42   0.002     .0253039    .1006363
                   3  |   .0498273   .0189049     2.64   0.013     .0111625    .0884921
                   4  |   .0042635   .0251294     0.17   0.866    -.0471318    .0556588
                   5  |   .0171595   .0248315     0.69   0.495    -.0336266    .0679456
                   6  |   .0431733   .0179998     2.40   0.023     .0063595    .0799871
                   7  |   .0506968   .0230788     2.20   0.036     .0034953    .0978983
                   8  |    .003839   .0232237     0.17   0.870    -.0436589    .0513368
                   9  |   .0286563   .0259733     1.10   0.279    -.0244651    .0817777
                  10  |   .0314491   .0216383     1.45   0.157    -.0128062    .0757045
                  11  |    .042964   .0227177     1.89   0.069     -.003499     .089427
                  12  |   .0477027   .0246083     1.94   0.062    -.0026269    .0980323
                  13  |   .0571611   .0241283     2.37   0.025     .0078131    .1065091
                  14  |   .0236676   .0226896     1.04   0.306    -.0227378     .070073
                  15  |   .0405667   .0239792     1.69   0.101    -.0084763    .0896098
                  16  |   .0606286   .0221892     2.73   0.011     .0152466    .1060105
                      |
                 marr |   .0639751   .0031941    20.03   0.000     .0574424    .0705077
                partt |  -.1227294   .0154012    -7.97   0.000    -.1542283   -.0912305
               public |   -.049593   .0104426    -4.75   0.000    -.0709505   -.0282356
                 cmsa |   .1151834   .0135006     8.53   0.000     .0875715    .1427954
                      |
                nocc2 |
                   2  |  -.0242482    .011792    -2.06   0.049    -.0483655    -.000131
                   3  |  -.0121015    .015494    -0.78   0.441    -.0437902    .0195873
                   4  |  -.0482738   .0114018    -4.23   0.000    -.0715931   -.0249544
                   5  |    .034857   .0155055     2.25   0.032     .0031447    .0665694
                   6  |  -.2402965    .012949   -18.56   0.000    -.2667803   -.2138127
                   7  |  -.1887414   .0100071   -18.86   0.000    -.2092084   -.1682745
                   8  |  -.0850392   .0315934    -2.69   0.012     -.149655   -.0204234
                   9  |  -.2086802   .0087472   -23.86   0.000    -.2265702   -.1907902
                  10  |  -.1446122   .0073053   -19.80   0.000    -.1595533   -.1296711
                  11  |  -.0589719   .0087693    -6.72   0.000    -.0769071   -.0410366
                  12  |  -.1946501   .0078153   -24.91   0.000     -.210634   -.1786661
                      |
                unemp |  -.0040837   .0013486    -3.03   0.005    -.0068419   -.0013255
                      |
              quarter |
                   2  |  -.0001855   .0026462    -0.07   0.945    -.0055975    .0052264
                   3  |   .0066721   .0035037     1.90   0.067    -.0004937     .013838
                   4  |   .0122713    .001915     6.41   0.000     .0083546     .016188
                      |
                _cons |   .5663517   .0702316     8.06   0.000     .4227119    .7099915
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,020,378,732)

Linear regression                               Number of obs     =    121,161
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4384
                                                Root MSE          =     .36837

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0496336   .0099882    -4.97   0.000    -.0700618   -.0292053
             treat_st |   -.069156   .0171615    -4.03   0.000    -.1042553   -.0340567
treat_stblackrelwhite |   .0400701   .0278042     1.44   0.160    -.0167959     .096936
                      |
                state |
                  NH  |   .0469181   .0051358     9.14   0.000     .0364141     .057422
                  VT  |   -.007402   .0019328    -3.83   0.001    -.0113551   -.0034489
                  MA  |   .1308668    .011097    11.79   0.000     .1081709    .1535627
                  RI  |   .1359724    .012129    11.21   0.000     .1111658    .1607791
                  CT  |    .168132   .0112487    14.95   0.000     .1451258    .1911383
                  NY  |   .1226576   .0099198    12.36   0.000     .1023693    .1429459
                  NJ  |   .2104002   .0112539    18.70   0.000     .1873833    .2334171
                  PA  |    .036528   .0092137     3.96   0.000     .0176839    .0553722
                  OH  |   .0158047   .0091911     1.72   0.096    -.0029931    .0346026
                  IN  |   .0020725   .0086344     0.24   0.812    -.0155868    .0197318
                  IL  |   .0365816   .0093603     3.91   0.001     .0174376    .0557256
                  MI  |   .0864834   .0097508     8.87   0.000     .0665406    .1064261
                  WI  |   .0452771   .0075213     6.02   0.000     .0298944    .0606598
                  MN  |   .0872407   .0088848     9.82   0.000     .0690691    .1054122
                  MO  |  -.0428995   .0094166    -4.56   0.000    -.0621587   -.0236403
                  DE  |   .1440595    .007299    19.74   0.000     .1291313    .1589876
                  MD  |   .1627772   .0109125    14.92   0.000     .1404586    .1850958
                  DC  |   .1847011   .0126196    14.64   0.000     .1588911    .2105112
                  WV  |  -.0632977   .0031753   -19.93   0.000    -.0697919   -.0568034
                  KY  |  -.0379962   .0076304    -4.98   0.000    -.0536022   -.0223902
                  OK  |  -.0975104   .0099676    -9.78   0.000    -.1178964   -.0771244
                  MT  |  -.0792789   .0033688   -23.53   0.000    -.0861688   -.0723891
                  CO  |   .0058237   .0111247     0.52   0.605    -.0169287    .0285762
                  NM  |  -.0692935   .0067563   -10.26   0.000    -.0831117   -.0554753
                  WA  |   .0857812   .0106175     8.08   0.000      .064066    .1074964
                  OR  |   .0155431   .0092453     1.68   0.103    -.0033657    .0344519
                  CA  |   .1900398   .0107992    17.60   0.000      .167953    .2121266
                  AK  |   .2260241   .0053745    42.06   0.000     .2150321    .2370161
                  HI  |   .0764527    .009267     8.25   0.000     .0574995    .0954059
                      |
                 year |
                1990  |  -.0006386   .0056797    -0.11   0.911     -.012255    .0109777
                1991  |  -.0039808   .0074684    -0.53   0.598    -.0192554    .0112938
                1992  |   .0062343   .0095887     0.65   0.521    -.0133767    .0258454
                1993  |   .0159099   .0083043     1.92   0.065    -.0010743    .0328941
                1996  |   .0253177   .0089452     2.83   0.008     .0070227    .0436127
                1997  |   .0292263   .0075946     3.85   0.001     .0136937     .044759
                1998  |   .0444752   .0069459     6.40   0.000     .0302694    .0586811
                1999  |   .0436699   .0072629     6.01   0.000     .0288156    .0585243
                2000  |   .0366226   .0080708     4.54   0.000      .020116    .0531292
                2001  |   .0541057   .0087471     6.19   0.000     .0362158    .0719956
                2002  |   .0636857   .0080948     7.87   0.000     .0471299    .0802414
                2003  |   .0519834   .0069631     7.47   0.000     .0377423    .0662246
                2004  |   .0527415   .0085015     6.20   0.000      .035354    .0701289
                2005  |   .0409294   .0106746     3.83   0.001     .0190974    .0627615
                2006  |    .039209   .0087135     4.50   0.000     .0213878    .0570302
                2007  |   .0325963   .0090466     3.60   0.001      .014094    .0510986
                2008  |    .029113   .0140788     2.07   0.048     .0003187    .0579073
                2009  |   .0563873   .0120029     4.70   0.000     .0318385    .0809361
                2010  |   .0620933   .0128103     4.85   0.000     .0358933    .0882932
                2011  |   .0339515   .0118251     2.87   0.008     .0097665    .0581365
                2012  |   .0108051    .011474     0.94   0.354    -.0126619     .034272
                2013  |   .0265707   .0091457     2.91   0.007     .0078657    .0452757
                2014  |   .0088672   .0204073     0.43   0.667    -.0328703    .0506047
                2015  |   .0238759   .0155559     1.53   0.136    -.0079396    .0556914
                2016  |   .0325523   .0092986     3.50   0.002     .0135345      .05157
                2017  |   .0218121    .012023     1.81   0.080    -.0027776    .0464018
                2018  |   .0234416   .0106717     2.20   0.036     .0016155    .0452677
                2019  |   .0276732   .0096576     2.87   0.008     .0079213    .0474252
                      |
                 nind |
                   2  |   .0789518   .0633121     1.25   0.222     -.050536    .2084396
                   3  |   .0581286   .0465577     1.25   0.222    -.0370925    .1533498
                   4  |  -.2239742   .0617718    -3.63   0.001    -.3503116   -.0976367
                   5  |   .1333569   .0529055     2.52   0.017     .0251529    .2415609
                   6  |  -.0363454   .0583832    -0.62   0.538    -.1557525    .0830616
                   7  |  -.0915893   .0562226    -1.63   0.114    -.2065774    .0233988
                   8  |  -.1208537   .0598562    -2.02   0.053    -.2432734     .001566
                   9  |  -.1544227   .0542431    -2.85   0.008    -.2653624    -.043483
                  10  |  -.1280096   .0762262    -1.68   0.104    -.2839097    .0278906
                  11  |   .0165261   .0572554     0.29   0.775    -.1005743    .1336265
                      |
                 educ |    .105207   .0063803    16.49   0.000     .0921577    .1182562
                exper |   .0508652   .0038246    13.30   0.000      .043043    .0586874
               exper2 |  -.0017347   .0002818    -6.16   0.000     -.002311   -.0011584
               exper3 |   .0000299   9.62e-06     3.11   0.004     .0000103    .0000496
               exper4 |  -1.98e-07   1.08e-07    -1.84   0.077    -4.18e-07    2.25e-08
                 edex |  -.0004443   .0001463    -3.04   0.005    -.0007435   -.0001451
                      |
                ee_cl |
                   2  |  -.0684605   .0153372    -4.46   0.000    -.0998285   -.0370925
                   3  |  -.1305549   .0195201    -6.69   0.000    -.1704781   -.0906318
                   4  |  -.1938664   .0353726    -5.48   0.000    -.2662116   -.1215212
                   5  |  -.0791497   .0264948    -2.99   0.006    -.1333377   -.0249617
                   6  |  -.1096605   .0184178    -5.95   0.000    -.1473292   -.0719918
                   7  |  -.1568785    .023509    -6.67   0.000    -.2049598   -.1087973
                   8  |  -.1867287   .0378344    -4.94   0.000    -.2641088   -.1093486
                   9  |  -.0634673   .0171288    -3.71   0.001    -.0984996   -.0284349
                  10  |  -.1356025   .0253029    -5.36   0.000    -.1873528   -.0838522
                  11  |    -.17635   .0261759    -6.74   0.000    -.2298857   -.1228142
                  12  |  -.1716781    .033323    -5.15   0.000    -.2398313    -.103525
                  13  |  -.0125434   .0235168    -0.53   0.598    -.0606408    .0355539
                  14  |  -.1300378   .0225655    -5.76   0.000    -.1761896   -.0838861
                  15  |  -.1431567   .0276805    -5.17   0.000    -.1997696   -.0865437
                  16  |  -.1469337   .0328466    -4.47   0.000    -.2141125   -.0797549
                      |
                 marr |   .0076582   .0043384     1.77   0.088    -.0012149    .0165313
                partt |  -.0740299   .0063426   -11.67   0.000     -.087002   -.0610579
               public |   .0205235   .0150393     1.36   0.183    -.0102353    .0512822
                 cmsa |   .1235306   .0117673    10.50   0.000     .0994638    .1475974
                      |
                nocc2 |
                   2  |  -.0357767    .010778    -3.32   0.002    -.0578202   -.0137331
                   3  |  -.0177241   .0160883    -1.10   0.280    -.0506283    .0151801
                   4  |  -.0920958   .0105938    -8.69   0.000    -.1137626   -.0704291
                   5  |   .1571135   .0170069     9.24   0.000     .1223306    .1918964
                   6  |  -.2264586    .011206   -20.21   0.000    -.2493774   -.2035397
                   7  |  -.2365839   .0269789    -8.77   0.000     -.291762   -.1814058
                   8  |  -.0933921   .0578652    -1.61   0.117    -.2117398    .0249557
                   9  |  -.2882568   .0166188   -17.35   0.000     -.322246   -.2542676
                  10  |  -.2588739   .0218184   -11.86   0.000    -.3034975   -.2142503
                  11  |   .0172882   .0235936     0.73   0.470    -.0309662    .0655426
                  12  |  -.2359106   .0157785   -14.95   0.000    -.2681813   -.2036399
                      |
              quarter |
                   2  |   .0042287    .003067     1.38   0.179    -.0020441    .0105014
                   3  |   .0148988   .0029671     5.02   0.000     .0088305    .0209672
                   4  |   .0194273   .0033906     5.73   0.000     .0124928    .0263619
                      |
                _cons |   .1459899   .0652151     2.24   0.033     .0126101    .2793698
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cms
> a i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,020,378,732)

Linear regression                               Number of obs     =    121,161
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4384
                                                Root MSE          =     .36837

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0496393   .0099839    -4.97   0.000    -.0700587   -.0292198
             treat_st |  -.0695856   .0176894    -3.93   0.000    -.1057645   -.0334068
treat_stblackrelwhite |    .039968   .0277857     1.44   0.161    -.0168601    .0967961
                      |
                state |
                  NH  |   .0451727   .0062917     7.18   0.000     .0323047    .0580406
                  VT  |  -.0090471   .0031741    -2.85   0.008    -.0155388   -.0025554
                  MA  |   .1309305   .0110774    11.82   0.000     .1082748    .1535862
                  RI  |   .1375395    .011915    11.54   0.000     .1131707    .1619083
                  CT  |   .1683813   .0111413    15.11   0.000     .1455947    .1911678
                  NY  |   .1237344   .0097313    12.72   0.000     .1038317    .1436372
                  NJ  |   .2111952    .010996    19.21   0.000      .188706    .2336845
                  PA  |   .0370978   .0091349     4.06   0.000     .0184148    .0557809
                  OH  |    .016732   .0091039     1.84   0.076    -.0018877    .0353517
                  IN  |   .0021336   .0086511     0.25   0.807      -.01556    .0198272
                  IL  |   .0380727   .0091905     4.14   0.000     .0192761    .0568694
                  MI  |   .0887834   .0104233     8.52   0.000     .0674654    .1101015
                  WI  |   .0446541   .0075355     5.93   0.000     .0292423     .060066
                  MN  |   .0860263   .0090776     9.48   0.000     .0674605     .104592
                  MO  |  -.0425812    .009382    -4.54   0.000    -.0617695   -.0233929
                  DE  |   .1431071   .0070918    20.18   0.000     .1286027    .1576114
                  MD  |   .1623568   .0111241    14.60   0.000     .1396055    .1851082
                  DC  |   .1872686   .0121595    15.40   0.000     .1623997    .2121375
                  WV  |  -.0609748   .0047594   -12.81   0.000    -.0707089   -.0512408
                  KY  |  -.0367511   .0078542    -4.68   0.000    -.0528148   -.0206875
                  OK  |  -.0980114   .0099607    -9.84   0.000    -.1183834   -.0776395
                  MT  |  -.0794647   .0033004   -24.08   0.000    -.0862147   -.0727147
                  CO  |   .0052424   .0113388     0.46   0.647    -.0179481    .0284329
                  NM  |  -.0683046   .0064683   -10.56   0.000    -.0815339   -.0550754
                  WA  |   .0870567   .0105943     8.22   0.000     .0653889    .1087246
                  OR  |   .0172864   .0091873     1.88   0.070    -.0015038    .0360766
                  CA  |   .1923802   .0105511    18.23   0.000     .1708008    .2139596
                  AK  |   .2289322   .0062923    36.38   0.000      .216063    .2418013
                  HI  |   .0747365   .0095743     7.81   0.000     .0551549     .094318
                      |
                 year |
                1990  |    .000016   .0062471     0.00   0.998    -.0127608    .0127929
                1991  |  -.0012715   .0096425    -0.13   0.896    -.0209927    .0184496
                1992  |   .0099785   .0137072     0.73   0.472    -.0180559     .038013
                1993  |   .0188575   .0116212     1.62   0.115    -.0049106    .0426256
                1996  |   .0258498   .0096438     2.68   0.012      .006126    .0455736
                1997  |   .0291379   .0077665     3.75   0.001     .0132536    .0450222
                1998  |   .0437428   .0068316     6.40   0.000     .0297706     .057715
                1999  |   .0424919   .0071256     5.96   0.000     .0279185    .0570654
                2000  |   .0351261   .0078452     4.48   0.000     .0190809    .0511713
                2001  |   .0535633   .0085668     6.25   0.000     .0360422    .0710845
                2002  |   .0647088   .0080022     8.09   0.000     .0483426    .0810751
                2003  |   .0534615   .0073283     7.30   0.000     .0384734    .0684495
                2004  |   .0535942   .0090061     5.95   0.000     .0351746    .0720138
                2005  |   .0410296   .0107398     3.82   0.001     .0190642    .0629951
                2006  |   .0388124   .0087765     4.42   0.000     .0208624    .0567625
                2007  |   .0322195   .0090603     3.56   0.001     .0136891    .0507499
                2008  |   .0303061   .0148986     2.03   0.051     -.000165    .0607771
                2009  |    .062351     .01819     3.43   0.002     .0251482    .0995538
                2010  |   .0685378   .0184277     3.72   0.001     .0308489    .1062268
                2011  |   .0393937   .0170077     2.32   0.028      .004609    .0741784
                2012  |   .0152704   .0147626     1.03   0.309    -.0149225    .0454632
                2013  |   .0301537   .0130907     2.30   0.029     .0033801    .0569272
                2014  |   .0105863   .0218171     0.49   0.631    -.0340346    .0552072
                2015  |   .0241825   .0158959     1.52   0.139    -.0083283    .0566932
                2016  |   .0322555    .009191     3.51   0.001     .0134579    .0510531
                2017  |    .020899   .0122872     1.70   0.100    -.0042311    .0460291
                2018  |   .0219386   .0098426     2.23   0.034     .0018081    .0420691
                2019  |   .0258636   .0088971     2.91   0.007     .0076671    .0440602
                      |
                 nind |
                   2  |   .0786401   .0633802     1.24   0.225     -.050987    .2082672
                   3  |   .0578739   .0466193     1.24   0.224    -.0374733    .1532211
                   4  |  -.2241829   .0618247    -3.63   0.001    -.3506285   -.0977373
                   5  |   .1331597   .0530086     2.51   0.018     .0247449    .2415744
                   6  |  -.0365787   .0584437    -0.63   0.536    -.1561095    .0829522
                   7  |  -.0918341   .0563242    -1.63   0.114      -.20703    .0233618
                   8  |  -.1210513   .0599548    -2.02   0.053    -.2436726    .0015699
                   9  |  -.1546441   .0543188    -2.85   0.008    -.2657386   -.0435496
                  10  |  -.1281519   .0763119    -1.68   0.104    -.2842273    .0279234
                  11  |   .0162735   .0573291     0.28   0.779    -.1009778    .1335247
                      |
                 educ |   .1052025   .0063825    16.48   0.000     .0921488    .1182563
                exper |   .0508853   .0038313    13.28   0.000     .0430494    .0587212
               exper2 |  -.0017359   .0002818    -6.16   0.000    -.0023122   -.0011596
               exper3 |     .00003   9.61e-06     3.12   0.004     .0000103    .0000496
               exper4 |  -1.98e-07   1.08e-07    -1.84   0.076    -4.18e-07    2.20e-08
                 edex |  -.0004445   .0001466    -3.03   0.005    -.0007443   -.0001447
                      |
                ee_cl |
                   2  |  -.0684339   .0153236    -4.47   0.000    -.0997742   -.0370936
                   3  |  -.1305198   .0194882    -6.70   0.000    -.1703777   -.0906618
                   4  |  -.1938089   .0353293    -5.49   0.000    -.2660655   -.1215523
                   5  |  -.0791956   .0264692    -2.99   0.006    -.1333311   -.0250601
                   6  |  -.1096426   .0183919    -5.96   0.000    -.1472583   -.0720269
                   7  |  -.1568604   .0234648    -6.68   0.000    -.2048513   -.1088696
                   8  |   -.186672   .0377825    -4.94   0.000     -.263946   -.1093981
                   9  |  -.0635607   .0171138    -3.71   0.001    -.0985623    -.028559
                  10  |  -.1356223   .0252809    -5.36   0.000    -.1873275    -.083917
                  11  |   -.176364    .026169    -6.74   0.000    -.2298858   -.1228423
                  12  |  -.1716341   .0332804    -5.16   0.000    -.2397001    -.103568
                  13  |  -.0125977   .0235246    -0.54   0.596     -.060711    .0355155
                  14  |  -.1300405   .0225496    -5.77   0.000    -.1761595   -.0839215
                  15  |  -.1431666   .0276704    -5.17   0.000     -.199759   -.0865742
                  16  |  -.1469012    .032817    -4.48   0.000    -.2140196   -.0797828
                      |
                 marr |   .0076551   .0043389     1.76   0.088    -.0012189     .016529
                partt |  -.0739863   .0063251   -11.70   0.000    -.0869226   -.0610499
               public |   .0205654    .015048     1.37   0.182    -.0102113     .051342
                 cmsa |   .1234879   .0117461    10.51   0.000     .0994644    .1475113
                      |
                nocc2 |
                   2  |   -.035746   .0107912    -3.31   0.002    -.0578164   -.0136756
                   3  |  -.0176621   .0160922    -1.10   0.281    -.0505743    .0152501
                   4  |  -.0920641   .0105825    -8.70   0.000    -.1137078   -.0704204
                   5  |   .1571332   .0169873     9.25   0.000     .1223902    .1918762
                   6  |   -.226429   .0112101   -20.20   0.000    -.2493561   -.2035018
                   7  |  -.2365543   .0269614    -8.77   0.000    -.2916965   -.1814121
                   8  |   -.093321   .0578552    -1.61   0.118    -.2116481    .0250062
                   9  |  -.2882276   .0166157   -17.35   0.000    -.3222106   -.2542446
                  10  |  -.2588641   .0218147   -11.87   0.000    -.3034802    -.214248
                  11  |   .0173889   .0235563     0.74   0.466    -.0307891    .0655669
                  12  |  -.2358828   .0157591   -14.97   0.000    -.2681137   -.2036519
                      |
                unemp |  -.0014055   .0019154    -0.73   0.469    -.0053228    .0025119
                      |
              quarter |
                   2  |   .0042535   .0030722     1.38   0.177    -.0020298    .0105368
                   3  |   .0149156   .0029752     5.01   0.000     .0088307    .0210004
                   4  |   .0194704   .0034174     5.70   0.000     .0124811    .0264597
                      |
                _cons |   .1523889   .0594383     2.56   0.016     .0308239    .2739538
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  p
> ublic cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,020,378,732)

Linear regression                               Number of obs     =    121,161
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4380
                                                Root MSE          =     .36851

                                          (Std. Err. adjusted for 30 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0507359   .0096677    -5.25   0.000    -.0705087   -.0309632
             treat_st |  -.0569309    .022361    -2.55   0.016    -.1026643   -.0111976
treat_stblackrelwhite |   .0464508   .0288575     1.61   0.118    -.0125693     .105471
                      |
                state |
                  NH  |  -.0951241   .0166842    -5.70   0.000    -.1292472   -.0610011
                  VT  |  -.2769135   .0189045   -14.65   0.000    -.3155775   -.2382494
                  MA  |  -.2535646   .0192486   -13.17   0.000    -.2929323   -.2141968
                  RI  |  -.3879386    .024207   -16.03   0.000    -.4374474   -.3384298
                  CT  |   .0614063   .0228616     2.69   0.012     .0146491    .1081636
                  NY  |  -.1611081   .0205463    -7.84   0.000    -.2031301   -.1190862
                  NJ  |  -.2246005   .0226239    -9.93   0.000    -.2708716   -.1783295
                  PA  |  -.1765272   .0213448    -8.27   0.000    -.2201822   -.1328723
                  OH  |  -.0261332   .0191522    -1.36   0.183    -.0653038    .0130374
                  IN  |  -.1863753   .0858384    -2.17   0.038    -.3619346   -.0108159
                  IL  |   .0199453   .0177401     1.12   0.270    -.0163373     .056228
                  MI  |   .2171853   .0662591     3.28   0.003     .0816702    .3527004
                  WI  |  -.1943973   .0478262    -4.06   0.000    -.2922129   -.0965818
                  MN  |   .0102891   .0199845     0.51   0.611    -.0305838    .0511619
                  MO  |   .1610126   .0219944     7.32   0.000     .1160289    .2059962
                  DE  |   .1099942   .0401103     2.74   0.010     .0279593     .192029
                  MD  |  -.3410525   .0249444   -13.67   0.000    -.3920695   -.2900355
                  DC  |  -.3942123   .0246061   -16.02   0.000    -.4445374   -.3438872
                  WV  |  -.2102074   .0205086   -10.25   0.000    -.2521521   -.1682626
                  KY  |   -.004058   .0398533    -0.10   0.920    -.0855672    .0774512
                  OK  |   .1507513    .107323     1.40   0.171    -.0687489    .3702516
                  MT  |    -.11467   .0255562    -4.49   0.000    -.1669382   -.0624017
                  CO  |   .1330125   .0238231     5.58   0.000     .0842889    .1817361
                  NM  |  -.0899163   .0228946    -3.93   0.000    -.1367411   -.0430915
                  WA  |   .0356963   .0183306     1.95   0.061     -.001794    .0731866
                  OR  |   -.236888   .0160482   -14.76   0.000    -.2697103   -.2040657
                  CA  |   .0395552   .0250665     1.58   0.125    -.0117116    .0908219
                  AK  |   .3206257   .0296343    10.82   0.000     .2600168    .3812347
                  HI  |  -.1248733   .0468198    -2.67   0.012    -.2206305   -.0291162
                      |
        state#c.lyear |
                  ME  |  -.0007381   .0002411    -3.06   0.005    -.0012313   -.0002449
                  NH  |   .0006252   .0003518     1.78   0.086    -.0000944    .0013448
                  VT  |   .0018518   .0001384    13.38   0.000     .0015688    .0021349
                  MA  |   .0029536   .0001692    17.45   0.000     .0026075    .0032996
                  RI  |   .0043108   .0001775    24.29   0.000     .0039479    .0046738
                  CT  |   .0002931   .0002599     1.13   0.269    -.0002385    .0008247
                  NY  |    .002012   .0001382    14.56   0.000     .0017294    .0022947
                  NJ  |    .003462   .0002578    13.43   0.000     .0029347    .0039892
                  PA  |   .0013304   .0002332     5.70   0.000     .0008534    .0018073
                  OH  |   -.000331   .0002264    -1.46   0.155    -.0007941    .0001321
                  IN  |   .0010911   .0009743     1.12   0.272    -.0009015    .0030837
                  IL  |  -.0005817   .0002513    -2.31   0.028    -.0010957   -.0000677
                  MI  |  -.0020489   .0007162    -2.86   0.008    -.0035136   -.0005842
                  WI  |   .0015943     .00056     2.85   0.008     .0004489    .0027397
                  MN  |   5.09e-06   .0002029     0.03   0.980    -.0004098      .00042
                  MO  |  -.0027195   .0003073    -8.85   0.000     -.003348   -.0020911
                  DE  |  -.0005018   .0005562    -0.90   0.374    -.0016394    .0006358
                  MD  |   .0041252   .0001924    21.44   0.000     .0037318    .0045187
                  DC  |   .0048971   .0001972    24.83   0.000     .0044938    .0053004
                  WV  |   .0006697   .0003307     2.03   0.052    -6.55e-06     .001346
                  KY  |  -.0010663   .0004951    -2.15   0.040    -.0020788   -.0000538
                  OK  |  -.0032583   .0012101    -2.69   0.012    -.0057333   -.0007834
                  MT  |  -.0003926   .0000691    -5.68   0.000     -.000534   -.0002512
                  CO  |  -.0019229   .0001413   -13.61   0.000    -.0022119   -.0016339
                  NM  |  -.0004709   .0001451    -3.24   0.003    -.0007677   -.0001741
                  WA  |  -.0002518   .0001522    -1.65   0.109     -.000563    .0000595
                  OR  |   .0017014   .0001546    11.00   0.000     .0013852    .0020177
                  CA  |   .0007151   .0001149     6.22   0.000     .0004801    .0009501
                  AK  |  -.0016695   .0001023   -16.32   0.000    -.0018787   -.0014603
                  HI  |   .0011995   .0004366     2.75   0.010     .0003066    .0020924
                      |
                 nind |
                   2  |   .0800801   .0643185     1.25   0.223    -.0514659    .2116261
                   3  |    .054846   .0467515     1.17   0.250    -.0407714    .1504635
                   4  |  -.2247294   .0626843    -3.59   0.001    -.3529333   -.0965255
                   5  |   .1319855   .0537159     2.46   0.020     .0221242    .2418468
                   6  |  -.0357814   .0586817    -0.61   0.547    -.1557991    .0842362
                   7  |  -.0916755   .0572341    -1.60   0.120    -.2087324    .0253813
                   8  |  -.1205701   .0608608    -1.98   0.057    -.2450445    .0039042
                   9  |  -.1536961   .0551231    -2.79   0.009    -.2664355   -.0409568
                  10  |  -.1277096    .077467    -1.65   0.110    -.2861473    .0307281
                  11  |   .0164535   .0581763     0.28   0.779    -.1025303    .1354374
                      |
                 educ |   .1037618   .0063203    16.42   0.000     .0908353    .1166883
                exper |   .0500536   .0037791    13.24   0.000     .0423245    .0577828
               exper2 |   -.001658   .0002849    -5.82   0.000    -.0022406   -.0010753
               exper3 |   .0000278   9.75e-06     2.86   0.008     7.90e-06    .0000478
               exper4 |  -1.81e-07   1.09e-07    -1.66   0.108    -4.05e-07    4.25e-08
                 edex |  -.0004467   .0001436    -3.11   0.004    -.0007403    -.000153
                      |
                ee_cl |
                   2  |  -.0705313   .0160809    -4.39   0.000    -.1034204   -.0376422
                   3  |  -.1285057   .0194175    -6.62   0.000     -.168219   -.0887924
                   4  |  -.1871077   .0353848    -5.29   0.000    -.2594777   -.1147377
                   5  |  -.0843532   .0256658    -3.29   0.003    -.1368456   -.0318608
                   6  |  -.1137531   .0185904    -6.12   0.000    -.1517748   -.0757314
                   7  |  -.1553045   .0233919    -6.64   0.000    -.2031464   -.1074626
                   8  |  -.1819195   .0377688    -4.82   0.000    -.2591654   -.1046737
                   9  |  -.0693319   .0182299    -3.80   0.001    -.1066162   -.0320477
                  10  |  -.1371102   .0252814    -5.42   0.000    -.1888164    -.085404
                  11  |  -.1734899   .0265393    -6.54   0.000    -.2277689    -.119211
                  12  |  -.1654537   .0337885    -4.90   0.000    -.2345589   -.0963484
                  13  |  -.0169822    .023482    -0.72   0.475    -.0650082    .0310438
                  14  |  -.1298853   .0228512    -5.68   0.000    -.1766213   -.0831494
                  15  |   -.140623   .0281711    -4.99   0.000    -.1982394   -.0830066
                  16  |  -.1412834   .0333394    -4.24   0.000    -.2094703   -.0730966
                      |
                 marr |   .0072538   .0042743     1.70   0.100    -.0014881    .0159957
                partt |  -.0728871   .0062706   -11.62   0.000    -.0857118   -.0600623
               public |   .0204734   .0150717     1.36   0.185    -.0103518    .0512985
                 cmsa |   .1239966   .0118743    10.44   0.000      .099711    .1482822
                      |
                nocc2 |
                   2  |  -.0342578   .0105651    -3.24   0.003    -.0558657   -.0126498
                   3  |  -.0166757   .0158126    -1.05   0.300     -.049016    .0156647
                   4  |  -.0911026   .0103858    -8.77   0.000    -.1123439   -.0698612
                   5  |   .1575626   .0163596     9.63   0.000     .1241035    .1910217
                   6  |  -.2260207   .0111623   -20.25   0.000    -.2488502   -.2031912
                   7  |  -.2364748   .0265163    -8.92   0.000    -.2907067   -.1822429
                   8  |  -.0961133   .0585318    -1.64   0.111    -.2158242    .0235976
                   9  |  -.2875345   .0161642   -17.79   0.000    -.3205941   -.2544749
                  10  |  -.2584597   .0215908   -11.97   0.000    -.3026178   -.2143016
                  11  |   .0185878     .02304     0.81   0.426    -.0285343    .0657098
                  12  |  -.2351443   .0151553   -15.52   0.000    -.2661403   -.2041483
                      |
                unemp |  -.0001357   .0009767    -0.14   0.890    -.0021333    .0018619
                      |
              quarter |
                   2  |   .0043542   .0029806     1.46   0.155    -.0017418    .0104503
                   3  |   .0149667   .0028771     5.20   0.000     .0090823     .020851
                   4  |   .0196553   .0034969     5.62   0.000     .0125035    .0268072
                      |
                _cons |   .2705654   .0615907     4.39   0.000     .1445982    .3965326
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_fem_all_sltt

. 
. ** RUST BELT ONLY BLACK-WHITE + WV, KY - IA
. ** keep if inrange(state, 31, 35) | inlist(state, 23, 41, 43) | inlist(state, 55, 61)
. 
. ** DROP ALWAYS RTW BLACK-WHITE
. ** drop if alwaysr2w == 1
. 
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public 
> cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo covstagdid_mal_cf 
.         
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public 
> cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo covstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public 
> cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo wagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public 
> cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo wagstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public 
> cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public 
> cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_fem_cf
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public 
> cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public 
> cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_fem_cf 
. 
. label variable blackrelwhite "$ Black $"

. label variable treat_st "$ Treat_{st} $"

. label variable treat_stblackrelwhite "$ Treat_{st} \times Black $"

. 
. ** FIXME ignore rust best stuff, dropping always rtw
. esttab covstagdid_mal_all covstagdid_mal_all_unemp covstagdid_mal_all_sltt covstagdid_fem_all covstagdid_fem_all_unemp covstagdid_fem_all_sltt us
> ing $tabs/covstagdid-wo-ar2w.tex, se title(Difference in Differences of Union Coverage on Right to Work Laws Treatment in State and Time - W/O Al
> ways RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr){@span})) keep(b
> lackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) scalars("unemp_level State Monthly Unempl
> oyment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time Trends")
(output written to /Users/amedeusdsouza/econ499/tabs/covstagdid-wo-ar2w.tex)

. 
. esttab wagstagdid_mal_all wagstagdid_mal_all_unemp wagstagdid_mal_all_sltt wagstagdid_fem_all wagstagdid_fem_all_unemp wagstagdid_fem_all_sltt us
> ing $tabs/wagstagdid1-wo-ar2w.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Time - W/O A
> lways RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr){@span})) keep(
> blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) 
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid1-wo-ar2w.tex)

. 
. esttab nwagstagdid_mal_all nwagstagdid_mal_all_unemp nwagstagdid_mal_all_sltt nwagstagdid_fem_all nwagstagdid_fem_all_unemp nwagstagdid_fem_all_s
> ltt using $tabs/wagstagdid2-wo-ar2w.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Time -
>  W/O Always RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr){@span}))
>  keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01)
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid2-wo-ar2w.tex)

. 
. esttab uwagstagdid_mal_all uwagstagdid_mal_all_unemp uwagstagdid_mal_all_sltt uwagstagdid_fem_all uwagstagdid_fem_all_unemp uwagstagdid_fem_all_s
> ltt using $tabs/wagstagdid3-wo-ar2w.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Time -
>  W/O Always RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr){@span}))
>  keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) scalars("unemp_level State Monthly
>  Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time Trends")
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid3-wo-ar2w.tex)

. 
. panelcombine, use($tabs/wagstagdid1-wo-ar2w.tex $tabs/wagstagdid2-wo-ar2w.tex $tabs/wagstagdid3-wo-ar2w.tex) paneltitles("All (Black and White) P
> eople" "People Not Covered by Union - Spillover Effect" "People Covered by Union - Direct Effect") columncount(3) save($tabs/wagstagdid-wo-ar2w.t
> ex)

. 
. *** esttab wagstagdid_mal_all wagstagdid_fem_all nwagstagdid_mal_all nwagstagdid_fem_all uwagstagdid_mal_all uwagstagdid_fem_all using $tabs/wags
> tagdid.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Time) nonumbers mtitles("men" "wome
> n" "men not covered by union" "women not covered by union" "men covered by union" "women covered by union") keep(blackrelwhite treat_st treat_stb
> lackrelwhite) replace
. 
. ** esttab wagstagdid_mal_cf wagstagdid_fem_cf nwagstagdid_mal_cf nwagstagdid_fem_cf uwagstagdid_mal_cf uwagstagdid_fem_cf using $tabs/wagstagdid_
> cf.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Time) nonumbers mtitles("men" "women" "
> men not covered by union" "women not covered by union" "men covered by union" "women covered by union") keep(blackrelwhite treat_st treat_stblack
> relwhite) replace
. 
. ** panelcombine, use($tabs/wagstagdid_all.tex $tabs/wagstagdid_cf.tex) paneltitles("All States" "W/O Always RTW States") columncount(3) save($tab
> s/wagstagdid.tex)
. 
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-wo-ar2w.log
  log type:  text
 closed on:  22 Mar 2021, 21:23:40
---------------------------------------------------------------------------------------------------------------------------------------------------
