------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 opened on:   8 Mar 2021, 14:47:03

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2
> 004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extende
> d to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
(2,109 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,113 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,737 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,612 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** NOTE in current draft we have not dropped <83, self empl + w/o pay
. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,451,221 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc
>  cmsa partt public marr hisprace hispracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_mo
> rg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,237,006  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,524 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472759 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786904 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,175 real changes made, 324,175 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,799 real changes made, 266,799 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,175 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,20
> 13(28 effective; signed Dec2012) Mar1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,201
> 7(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 
> 87, 47, 83, 72, 82) //incl Idaho which changed in 1985 and Texas which had since 47 but bolste
> red in 93
(1,149,231 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,267 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 
> 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,231 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,836 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 
> 88, 63, 64, 57, 87, 47, 83, 72)
(1,106,040 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,836 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,106,040 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,106,040 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would ne
> ed to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,175 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,799 missing values generated)

. 
. ** BLACK-WHITE
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper expe
> r2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 0, vce(cluster state) 
(sum of wgt is 9,210,046,331)

Linear regression                               Number of obs     =  1,068,211
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2229
                                                Root MSE          =     .33515

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0593647   .0076515     7.76   0.000     .0439961    .0747332
             treat_st |  -.0299519   .0103849    -2.88   0.006    -.0508106   -.0090933
treat_stblackrelwhite |  -.0608424    .008097    -7.51   0.000    -.0771058    -.044579
                      |
                state |
                  NH  |  -.0454457   .0036168   -12.57   0.000    -.0527102   -.0381812
                  VT  |   -.047235   .0017341   -27.24   0.000     -.050718    -.043752
                  MA  |  -.0017558   .0050639    -0.35   0.730     -.011927    .0084154
                  RI  |    .007384   .0048709     1.52   0.136    -.0023996    .0171676
                  CT  |   .0002814   .0048387     0.06   0.954    -.0094375    .0100002
                  NY  |   .0894157   .0043162    20.72   0.000     .0807463    .0980852
                  NJ  |   .0363297    .005308     6.84   0.000     .0256682    .0469911
                  PA  |   .0158212   .0037611     4.21   0.000     .0082667    .0233757
                  OH  |   .0057812   .0037792     1.53   0.132    -.0018095    .0133719
                  IN  |  -.0111279   .0039148    -2.84   0.006     -.018991   -.0032648
                  IL  |   .0350127   .0045861     7.63   0.000     .0258013    .0442241
                  MI  |   .0506138   .0050739     9.98   0.000     .0404226     .060805
                  WI  |  -.0045398   .0033402    -1.36   0.180    -.0112489    .0021692
                  MN  |   .0140162   .0042484     3.30   0.002     .0054829    .0225494
                  IA  |   .0040912   .0103671     0.39   0.695    -.0167318    .0249142
                  MO  |  -.0167412   .0037245    -4.49   0.000    -.0242221   -.0092603
                  ND  |  -.0565744   .0102641    -5.51   0.000    -.0771904   -.0359584
                  SD  |  -.0786359   .0102868    -7.64   0.000    -.0992976   -.0579741
                  NE  |  -.0332253   .0106111    -3.13   0.003    -.0545383   -.0119124
                  KS  |  -.0372678    .010727    -3.47   0.001    -.0588136   -.0157219
                  DE  |  -.0586196   .0021915   -26.75   0.000    -.0630213   -.0542179
                  MD  |  -.0561255   .0055137   -10.18   0.000    -.0672002   -.0450508
                  DC  |  -.0577035   .0071154    -8.11   0.000    -.0719953   -.0434117
                  VA  |  -.0874592   .0108772    -8.04   0.000    -.1093067   -.0656117
                  WV  |   -.017226   .0034298    -5.02   0.000    -.0241151    -.010337
                  NC  |  -.1163406   .0110334   -10.54   0.000    -.1385019   -.0941794
                  SC  |   -.125701   .0112008   -11.22   0.000    -.1481984   -.1032036
                  GA  |  -.0803325   .0114482    -7.02   0.000    -.1033268   -.0573382
                  FL  |  -.0629339   .0116819    -5.39   0.000    -.0863976   -.0394701
                  KY  |  -.0487794   .0030758   -15.86   0.000    -.0549574   -.0426015
                  TN  |  -.0643925   .0111533    -5.77   0.000    -.0867947   -.0419904
                  AL  |  -.0408686   .0111689    -3.66   0.001     -.063302   -.0184352
                  MS  |  -.0952318   .0112699    -8.45   0.000    -.1178681   -.0725955
                  AR  |   -.093658   .0109565    -8.55   0.000    -.1156648   -.0716512
                  LA  |  -.0736372   .0115664    -6.37   0.000    -.0968689   -.0504054
                  OK  |  -.0880201   .0065777   -13.38   0.000    -.1012317   -.0748084
                  TX  |  -.0726939   .0116493    -6.24   0.000    -.0960922   -.0492956
                  MT  |  -.0042528   .0022276    -1.91   0.062    -.0087271    .0002216
                  ID  |  -.0928745   .0021882   -42.44   0.000    -.0972697   -.0884793
                  WY  |  -.0584782   .0108007    -5.41   0.000     -.080172   -.0367844
                  CO  |   -.064237   .0052578   -12.22   0.000    -.0747976   -.0536764
                  NM  |  -.1082396   .0040719   -26.58   0.000    -.1164184   -.1000609
                  AZ  |  -.0693609   .0117463    -5.90   0.000     -.092954   -.0457679
                  UT  |  -.0702259    .011422    -6.15   0.000    -.0931677   -.0472841
                  NV  |   .0380911   .0118079     3.23   0.002     .0143742     .061808
                  WA  |   .0450497   .0044534    10.12   0.000     .0361049    .0539945
                  OR  |   .0087713   .0042958     2.04   0.046      .000143    .0173997
                  CA  |   .0245672   .0056206     4.37   0.000     .0132779    .0358566
                  AK  |   .0351917   .0055773     6.31   0.000     .0239895     .046394
                  HI  |   .0174562    .004005     4.36   0.000     .0094119    .0255005
                      |
                 year |
                1990  |  -.0056667    .002543    -2.23   0.030    -.0107745   -.0005589
                1991  |  -.0064415   .0033661    -1.91   0.061    -.0132025    .0003194
                1992  |  -.0109217   .0039145    -2.79   0.007    -.0187842   -.0030593
                1993  |  -.0132888   .0040481    -3.28   0.002    -.0214196   -.0051579
                1996  |   -.027601   .0036632    -7.53   0.000    -.0349588   -.0202433
                1997  |  -.0295281   .0041561    -7.10   0.000    -.0378758   -.0211804
                1998  |  -.0347423   .0043294    -8.02   0.000     -.043438   -.0260465
                1999  |  -.0353219   .0039581    -8.92   0.000     -.043272   -.0273718
                2000  |  -.0402473   .0044348    -9.08   0.000    -.0491549   -.0313397
                2001  |  -.0419941   .0047816    -8.78   0.000    -.0515983     -.03239
                2002  |  -.0411294    .005566    -7.39   0.000    -.0523091   -.0299497
                2003  |  -.0476772    .004607   -10.35   0.000    -.0569305   -.0384238
                2004  |  -.0521409   .0050451   -10.34   0.000    -.0622742   -.0420076
                2005  |  -.0604869   .0053749   -11.25   0.000    -.0712828    -.049691
                2006  |  -.0634664   .0061055   -10.39   0.000    -.0757296   -.0512032
                2007  |  -.0623516    .005953   -10.47   0.000    -.0743085   -.0503947
                2008  |   -.052501   .0058066    -9.04   0.000    -.0641638   -.0408382
                2009  |  -.0490947   .0074113    -6.62   0.000    -.0639807   -.0342087
                2010  |   -.052002   .0081476    -6.38   0.000     -.068367    -.035637
                2011  |  -.0575638   .0069274    -8.31   0.000    -.0714779   -.0436498
                2012  |  -.0564189   .0072592    -7.77   0.000    -.0709994   -.0418383
                2013  |  -.0577453   .0057133   -10.11   0.000    -.0692208   -.0462697
                2014  |  -.0606025   .0055906   -10.84   0.000    -.0718315   -.0493735
                2015  |  -.0629575   .0056979   -11.05   0.000    -.0744021    -.051513
                2016  |  -.0635451   .0057639   -11.02   0.000    -.0751222   -.0519681
                2017  |  -.0575298   .0051555   -11.16   0.000    -.0678849   -.0471747
                2018  |  -.0599617   .0045091   -13.30   0.000    -.0690186   -.0509049
                2019  |  -.0644766   .0057965   -11.12   0.000    -.0761192   -.0528341
                      |
                 nind |
                   2  |   .0954524   .0162402     5.88   0.000     .0628329    .1280718
                   3  |   .0903642    .010971     8.24   0.000     .0683282    .1124002
                   4  |   .0106256   .0082986     1.28   0.206    -.0060426    .0272937
                   5  |   .1770392   .0086484    20.47   0.000     .1596684      .19441
                   6  |   .0003832   .0079433     0.05   0.962    -.0155713    .0163377
                   7  |  -.0022631   .0069289    -0.33   0.745    -.0161802     .011654
                   8  |   .0125113   .0124049     1.01   0.318    -.0124047    .0374273
                   9  |   .1179026   .0142354     8.28   0.000     .0893099    .1464952
                  10  |   .0033968    .013641     0.25   0.804    -.0240019    .0307955
                  11  |   .0780781    .016303     4.79   0.000     .0453325    .1108237
                      |
                 educ |   .0067884   .0013757     4.93   0.000     .0040252    .0095515
                exper |   .0068962   .0011568     5.96   0.000     .0045726    .0092197
               exper2 |  -.0000657   .0000622    -1.06   0.296    -.0001907    .0000593
               exper3 |   1.88e-06   2.05e-06     0.92   0.363    -2.23e-06    6.00e-06
               exper4 |  -4.67e-08   2.31e-08    -2.02   0.049    -9.32e-08   -2.32e-10
                 edex |  -.0001791   .0000418    -4.28   0.000    -.0002631   -.0000951
                      |
                ee_cl |
                   2  |  -.0159243   .0047459    -3.36   0.002    -.0254568   -.0063919
                   3  |  -.0070282   .0053064    -1.32   0.191    -.0176863    .0036299
                   4  |  -.0181832   .0082086    -2.22   0.031    -.0346705   -.0016958
                   5  |  -.0699466   .0081661    -8.57   0.000    -.0863487   -.0535446
                   6  |  -.0028913   .0041514    -0.70   0.489    -.0112296    .0054471
                   7  |   .0160608   .0060201     2.67   0.010      .003969    .0281525
                   8  |  -.0282723   .0101391    -2.79   0.007    -.0486373   -.0079073
                   9  |  -.0611545   .0067844    -9.01   0.000    -.0747814   -.0475276
                  10  |   .0129288   .0059338     2.18   0.034     .0010104    .0248471
                  11  |   .0155453   .0075106     2.07   0.044     .0004598    .0306308
                  12  |  -.0400044   .0120535    -3.32   0.002    -.0642146   -.0157942
                  13  |    .001075   .0075142     0.14   0.887    -.0140177    .0161677
                  14  |   .0272048   .0066022     4.12   0.000      .013944    .0404657
                  15  |   .0079252   .0082898     0.96   0.344    -.0087254    .0245757
                  16  |  -.0477959    .013049    -3.66   0.001    -.0740055   -.0215863
                      |
                 marr |   .0173063   .0015953    10.85   0.000     .0141021    .0205105
                partt |  -.0584801   .0060725    -9.63   0.000    -.0706772   -.0462831
               public |    .266645   .0254055    10.50   0.000     .2156165    .3176734
                 cmsa |   .0435922   .0049363     8.83   0.000     .0336773    .0535071
                      |
                nocc2 |
                   2  |   .0519297   .0030303    17.14   0.000     .0458431    .0580162
                   3  |   .0326747   .0048356     6.76   0.000     .0229622    .0423872
                   4  |   .1657983   .0108257    15.32   0.000     .1440542    .1875425
                   5  |    .150004   .0165384     9.07   0.000     .1167856    .1832223
                   6  |   .1366742   .0066827    20.45   0.000     .1232516    .1500968
                   7  |   .0709844   .0047395    14.98   0.000     .0614647     .080504
                   8  |   .0689227   .0070424     9.79   0.000     .0547777    .0830677
                   9  |    .166146   .0107378    15.47   0.000     .1445786    .1877135
                  10  |   .1944818   .0136779    14.22   0.000     .1670089    .2219548
                  11  |   .2097381    .014808    14.16   0.000     .1799954    .2394807
                  12  |   .2077811   .0163276    12.73   0.000     .1749861    .2405762
                      |
                unemp |  -.0016312   .0014259    -1.14   0.258    -.0044952    .0012328
                _cons |  -.1592664   .0331196    -4.81   0.000    -.2257891   -.0927438
---------------------------------------------------------------------------------------

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper expe
> r2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 1, vce(cluster state)
(sum of wgt is 9,012,992,923)

Linear regression                               Number of obs     =  1,079,122
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2720
                                                Root MSE          =     .29792

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0795133    .011542     6.89   0.000     .0563305    .1026962
             treat_st |  -.0221295   .0113792    -1.94   0.057    -.0449853    .0007263
treat_stblackrelwhite |  -.0645876   .0122926    -5.25   0.000     -.089278   -.0398972
                      |
                state |
                  NH  |  -.0154414   .0015236   -10.14   0.000    -.0185016   -.0123813
                  VT  |  -.0063164    .001052    -6.00   0.000    -.0084294   -.0042034
                  MA  |   .0150614   .0030927     4.87   0.000     .0088495    .0212733
                  RI  |   .0340772   .0028377    12.01   0.000     .0283775    .0397769
                  CT  |   .0252049   .0028852     8.74   0.000     .0194098    .0310001
                  NY  |   .0954996    .003021    31.61   0.000     .0894317    .1015674
                  NJ  |   .0335289   .0030388    11.03   0.000     .0274253    .0396325
                  PA  |   .0087846   .0027597     3.18   0.003     .0032415    .0143277
                  OH  |  -.0047673   .0023888    -2.00   0.051    -.0095653    .0000307
                  IN  |  -.0430564   .0033379   -12.90   0.000    -.0497609    -.036352
                  IL  |   .0003847   .0031006     0.12   0.902    -.0058431    .0066125
                  MI  |   .0451843   .0034708    13.02   0.000     .0382129    .0521557
                  WI  |  -.0026493   .0026093    -1.02   0.315    -.0078902    .0025916
                  MN  |   .0361876   .0022783    15.88   0.000     .0316115    .0407637
                  IA  |   -.002858   .0111852    -0.26   0.799    -.0253242    .0196082
                  MO  |  -.0521443   .0025543   -20.41   0.000    -.0572748   -.0470139
                  ND  |  -.0424408   .0111716    -3.80   0.000    -.0648798   -.0200019
                  SD  |  -.0545162   .0112039    -4.87   0.000    -.0770199   -.0320126
                  NE  |  -.0220542   .0110906    -1.99   0.052    -.0443304    .0002221
                  KS  |  -.0565165   .0111699    -5.06   0.000    -.0789519   -.0340811
                  DE  |  -.0309024   .0029697   -10.41   0.000    -.0368673   -.0249375
                  MD  |  -.0427884   .0057743    -7.41   0.000    -.0543865   -.0311902
                  DC  |  -.0638021   .0065678    -9.71   0.000     -.076994   -.0506102
                  VA  |  -.0772944   .0111665    -6.92   0.000     -.099723   -.0548659
                  WV  |  -.0270779   .0023856   -11.35   0.000    -.0318695   -.0222864
                  NC  |  -.1016344   .0116278    -8.74   0.000    -.1249895   -.0782792
                  SC  |  -.1084474   .0116591    -9.30   0.000    -.1318654   -.0850295
                  GA  |  -.0864517   .0116592    -7.41   0.000    -.1098698   -.0630336
                  FL  |  -.0373992   .0114938    -3.25   0.002    -.0604852   -.0143133
                  KY  |  -.0580648    .002007   -28.93   0.000    -.0620959   -.0540337
                  TN  |  -.0667173     .01158    -5.76   0.000    -.0899765   -.0434582
                  AL  |  -.0353241   .0116346    -3.04   0.004    -.0586928   -.0119553
                  MS  |  -.0946628   .0118489    -7.99   0.000    -.1184621   -.0708635
                  AR  |    -.08087   .0114707    -7.05   0.000    -.1039096   -.0578303
                  LA  |  -.0663056   .0115482    -5.74   0.000    -.0895008   -.0431104
                  OK  |    -.06885   .0063539   -10.84   0.000    -.0816121   -.0560879
                  TX  |  -.0726307   .0114476    -6.34   0.000    -.0956238   -.0496375
                  MT  |   .0076828    .001812     4.24   0.000     .0040433    .0113224
                  ID  |  -.0742502   .0012031   -61.71   0.000    -.0766668   -.0718336
                  WY  |  -.0899546   .0116918    -7.69   0.000    -.1134383   -.0664709
                  CO  |  -.0472038   .0028378   -16.63   0.000    -.0529037    -.041504
                  NM  |  -.0770808   .0029172   -26.42   0.000    -.0829401   -.0712215
                  AZ  |  -.0527973   .0114904    -4.59   0.000    -.0758764   -.0297182
                  UT  |  -.0538452   .0110987    -4.85   0.000    -.0761375   -.0315528
                  NV  |   .0467579   .0115804     4.04   0.000     .0234981    .0700177
                  WA  |   .0611869   .0024517    24.96   0.000     .0562625    .0661112
                  OR  |   .0451385   .0024048    18.77   0.000     .0403083    .0499687
                  CA  |   .0447746   .0028757    15.57   0.000     .0389986    .0505507
                  AK  |   .0663392   .0034503    19.23   0.000     .0594091    .0732693
                  HI  |   .0502269    .002128    23.60   0.000     .0459527     .054501
                      |
                 year |
                1990  |  -.0020756   .0017218    -1.21   0.234    -.0055339    .0013827
                1991  |  -.0025849   .0025997    -0.99   0.325    -.0078064    .0026367
                1992  |    .001293   .0023638     0.55   0.587    -.0034549    .0060409
                1993  |   .0006916   .0026076     0.27   0.792    -.0045459    .0059292
                1996  |  -.0019483   .0025658    -0.76   0.451     -.007102    .0032053
                1997  |  -.0062049   .0024205    -2.56   0.013    -.0110668   -.0013431
                1998  |  -.0094988   .0029812    -3.19   0.002    -.0154868   -.0035109
                1999  |  -.0122009   .0027885    -4.38   0.000    -.0178018      -.0066
                2000  |  -.0100174   .0024673    -4.06   0.000    -.0149731   -.0050617
                2001  |   -.009259   .0024216    -3.82   0.000    -.0141229   -.0043951
                2002  |  -.0092574   .0036199    -2.56   0.014    -.0165282   -.0019866
                2003  |  -.0155323   .0030463    -5.10   0.000     -.021651   -.0094136
                2004  |  -.0189803   .0032976    -5.76   0.000    -.0256037   -.0123568
                2005  |  -.0207355   .0033926    -6.11   0.000    -.0275497   -.0139212
                2006  |  -.0230422   .0032248    -7.15   0.000    -.0295194    -.016565
                2007  |  -.0225371   .0044654    -5.05   0.000    -.0315062   -.0135681
                2008  |  -.0200144   .0045075    -4.44   0.000    -.0290679   -.0109609
                2009  |  -.0160489   .0057878    -2.77   0.008     -.027674   -.0044238
                2010  |  -.0188144   .0057531    -3.27   0.002    -.0303698    -.007259
                2011  |   -.018069   .0055223    -3.27   0.002    -.0291609   -.0069771
                2012  |  -.0233449   .0051341    -4.55   0.000    -.0336569   -.0130328
                2013  |  -.0200103   .0050862    -3.93   0.000    -.0302263   -.0097943
                2014  |  -.0244898   .0046323    -5.29   0.000    -.0337941   -.0151854
                2015  |  -.0240353    .004928    -4.88   0.000    -.0339335    -.014137
                2016  |   -.021654   .0044505    -4.87   0.000    -.0305931    -.012715
                2017  |  -.0276564   .0048938    -5.65   0.000    -.0374858   -.0178269
                2018  |  -.0303634   .0037832    -8.03   0.000    -.0379622   -.0227647
                2019  |  -.0297381   .0053437    -5.57   0.000    -.0404712   -.0190049
                      |
                 nind |
                   2  |   .0349389   .0104658     3.34   0.002     .0139177    .0559601
                   3  |   .0511511   .0109549     4.67   0.000     .0291475    .0731546
                   4  |   .0411072   .0098189     4.19   0.000     .0213854     .060829
                   5  |    .172285   .0099202    17.37   0.000     .1523597    .1922103
                   6  |   .0144634   .0091209     1.59   0.119    -.0038566    .0327833
                   7  |   .0055622   .0089855     0.62   0.539    -.0124858    .0236102
                   8  |   .0224356   .0115843     1.94   0.058    -.0008321    .0457033
                   9  |   .1415314   .0170731     8.29   0.000     .1072391    .1758236
                  10  |   .0084091   .0099687     0.84   0.403    -.0116136    .0284318
                  11  |   .0075741   .0157737     0.48   0.633    -.0241082    .0392565
                      |
                 educ |     .01464   .0020461     7.16   0.000     .0105303    .0187498
                exper |   .0083681   .0013683     6.12   0.000     .0056197    .0111165
               exper2 |  -.0003088   .0000704    -4.39   0.000    -.0004501   -.0001675
               exper3 |   7.04e-06   2.31e-06     3.05   0.004     2.41e-06    .0000117
               exper4 |  -6.55e-08   2.49e-08    -2.63   0.011    -1.16e-07   -1.54e-08
                 edex |  -.0001223   .0000475    -2.58   0.013    -.0002176    -.000027
                      |
                ee_cl |
                   2  |  -.0354438   .0043248    -8.20   0.000    -.0441304   -.0267571
                   3  |  -.0630837   .0065636    -9.61   0.000     -.076267   -.0499004
                   4  |  -.0940053   .0130631    -7.20   0.000    -.1202433   -.0677672
                   5  |  -.0379524   .0059056    -6.43   0.000    -.0498142   -.0260906
                   6  |  -.0426833    .005324    -8.02   0.000    -.0533768   -.0319898
                   7  |   -.063083   .0074875    -8.43   0.000    -.0781222   -.0480438
                   8  |  -.0864205   .0126999    -6.80   0.000     -.111929    -.060912
                   9  |  -.0266048    .005899    -4.51   0.000    -.0384533   -.0147562
                  10  |  -.0448958   .0065422    -6.86   0.000    -.0580361   -.0317555
                  11  |  -.0631162   .0083626    -7.55   0.000     -.079913   -.0463193
                  12  |  -.0779322   .0121845    -6.40   0.000    -.1024056   -.0534589
                  13  |  -.0032486   .0069169    -0.47   0.641    -.0171416    .0106444
                  14  |  -.0373669   .0072614    -5.15   0.000    -.0519518    -.022782
                  15  |  -.0575613   .0093427    -6.16   0.000    -.0763267   -.0387959
                  16  |  -.0714867   .0128961    -5.54   0.000    -.0973892   -.0455842
                      |
                 marr |  -.0006063   .0010131    -0.60   0.552    -.0026411    .0014285
                partt |  -.0559139   .0049512   -11.29   0.000    -.0658586   -.0459692
               public |   .2847621   .0282512    10.08   0.000     .2280178    .3415063
                 cmsa |    .023333   .0028527     8.18   0.000     .0176032    .0290627
                      |
                nocc2 |
                   2  |   .0225482   .0020709    10.89   0.000     .0183887    .0267077
                   3  |   .0314097   .0066927     4.69   0.000      .017967    .0448523
                   4  |   .1521337   .0072877    20.88   0.000      .137496    .1667715
                   5  |   .1365332   .0158001     8.64   0.000     .1047978    .1682685
                   6  |   .0640379   .0053788    11.91   0.000     .0532342    .0748415
                   7  |   .0836888   .0079984    10.46   0.000     .0676236    .0997541
                   8  |   .0566364   .0032489    17.43   0.000     .0501108     .063162
                   9  |   .0971145   .0091492    10.61   0.000     .0787378    .1154912
                  10  |   .1812937   .0151074    12.00   0.000     .1509496    .2116377
                  11  |   .2109276   .0157963    13.35   0.000     .1791999    .2426554
                  12  |   .1705149   .0179792     9.48   0.000     .1344026    .2066271
                      |
                unemp |  -.0008432   .0009055    -0.93   0.356     -.002662    .0009755
                _cons |  -.2144688   .0355306    -6.04   0.000     -.285834   -.1431036
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 0, vce(cluster state) 
(sum of wgt is 9,221,094,079)

Linear regression                               Number of obs     =  1,069,714
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5102
                                                Root MSE          =     .41765

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1439185   .0064545   -22.30   0.000    -.1568829   -.1309542
             treat_st |  -.0389948   .0187854    -2.08   0.043    -.0767263   -.0012633
treat_stblackrelwhite |  -.0221662    .008827    -2.51   0.015    -.0398957   -.0044367
                      |
                state |
                  NH  |   .0801348   .0048643    16.47   0.000     .0703645    .0899051
                  VT  |   .0192369   .0019245    10.00   0.000     .0153715    .0231023
                  MA  |   .1165121   .0086966    13.40   0.000     .0990444    .1339798
                  RI  |   .0349925   .0087633     3.99   0.000     .0173909     .052594
                  CT  |   .1303395   .0086078    15.14   0.000     .1130503    .1476287
                  NY  |   .1011601   .0080923    12.50   0.000     .0849063     .117414
                  NJ  |   .1709705   .0091825    18.62   0.000     .1525269    .1894142
                  PA  |    .011176   .0066803     1.67   0.101    -.0022418    .0245937
                  OH  |  -.0158249   .0064631    -2.45   0.018    -.0288064   -.0028434
                  IN  |   .0059008   .0054341     1.09   0.283     -.005014    .0168155
                  IL  |   .0843068    .007328    11.50   0.000     .0695882    .0990255
                  MI  |   .0535165   .0072478     7.38   0.000     .0389589    .0680741
                  WI  |   .0178003   .0051005     3.49   0.001     .0075556    .0280449
                  MN  |   .0606937   .0070161     8.65   0.000     .0466014     .074786
                  IA  |   .0148196   .0173659     0.85   0.398    -.0200608       .0497
                  MO  |  -.0210301   .0062738    -3.35   0.002    -.0336313   -.0084288
                  ND  |   .0214983   .0181266     1.19   0.241    -.0149101    .0579068
                  SD  |  -.0467481    .017329    -2.70   0.009    -.0815545   -.0119418
                  NE  |  -.0337364   .0170807    -1.98   0.054    -.0680439    .0005712
                  KS  |  -.0057942   .0178229    -0.33   0.746    -.0415926    .0300042
                  DE  |   .0503754    .002367    21.28   0.000     .0456211    .0551296
                  MD  |    .121206   .0092471    13.11   0.000     .1026327    .1397793
                  DC  |   .1797315   .0114355    15.72   0.000     .1567626    .2027004
                  VA  |   .1156291   .0181014     6.39   0.000     .0792713    .1519869
                  WV  |  -.0356904   .0045694    -7.81   0.000    -.0448684   -.0265125
                  NC  |   .0084157   .0187407     0.45   0.655    -.0292262    .0460576
                  SC  |  -.0095376   .0192117    -0.50   0.622    -.0481255    .0290503
                  GA  |    .057596   .0192985     2.98   0.004     .0188339    .0963582
                  FL  |  -.0100916   .0198838    -0.51   0.614    -.0500295    .0298462
                  KY  |  -.0392102   .0046909    -8.36   0.000     -.048632   -.0297883
                  TN  |  -.0282852   .0188333    -1.50   0.139    -.0661131    .0095427
                  AL  |  -.0032001   .0192527    -0.17   0.869    -.0418703    .0354702
                  MS  |  -.0255501   .0204283    -1.25   0.217    -.0665817    .0154814
                  AR  |   -.071679   .0191175    -3.75   0.000    -.1100776   -.0332805
                  LA  |   .0248527   .0199646     1.24   0.219    -.0152473    .0649528
                  OK  |   -.059807    .010557    -5.67   0.000    -.0810113   -.0386027
                  TX  |   .0611082   .0194654     3.14   0.003     .0220108    .1002057
                  MT  |  -.0353549   .0014409   -24.54   0.000    -.0382489   -.0324608
                  ID  |  -.0401797    .003494   -11.50   0.000    -.0471976   -.0331619
                  WY  |   .1587676   .0198604     7.99   0.000     .1188769    .1986584
                  CO  |   .0292366   .0086187     3.39   0.001     .0119255    .0465477
                  NM  |   -.033108    .005833    -5.68   0.000     -.044824   -.0213921
                  AZ  |   .0331476   .0197542     1.68   0.100    -.0065299    .0728252
                  UT  |  -.0016779   .0183435    -0.09   0.927     -.038522    .0351661
                  NV  |   .1139854   .0203207     5.61   0.000     .0731701    .1548008
                  WA  |   .1006142   .0076936    13.08   0.000     .0851611    .1160672
                  OR  |    .029688   .0070765     4.20   0.000     .0154745    .0439016
                  CA  |   .1658366   .0092685    17.89   0.000     .1472203    .1844529
                  AK  |   .2492137    .006636    37.55   0.000     .2358849    .2625426
                  HI  |   .1069353   .0067952    15.74   0.000     .0932868    .1205838
                      |
                 year |
                1990  |  -.0111033   .0027362    -4.06   0.000    -.0165991   -.0056074
                1991  |  -.0184051   .0046053    -4.00   0.000    -.0276552   -.0091551
                1992  |  -.0152125    .005346    -2.85   0.006    -.0259503   -.0044748
                1993  |  -.0265344   .0042206    -6.29   0.000    -.0350117    -.018057
                1996  |  -.0373191   .0049242    -7.58   0.000    -.0472098   -.0274285
                1997  |  -.0242753   .0046635    -5.21   0.000    -.0336421   -.0149085
                1998  |  -.0040228   .0040131    -1.00   0.321    -.0120834    .0040377
                1999  |   .0167929   .0052488     3.20   0.002     .0062503    .0273355
                2000  |   .0233688    .005383     4.34   0.000     .0125567    .0341809
                2001  |   .0425455   .0054338     7.83   0.000     .0316315    .0534596
                2002  |   .0555223   .0055344    10.03   0.000     .0444062    .0666385
                2003  |   .0471966   .0059006     8.00   0.000     .0353449    .0590482
                2004  |   .0367527   .0052629     6.98   0.000     .0261819    .0473235
                2005  |   .0205766   .0057558     3.57   0.001     .0090157    .0321376
                2006  |    .014554   .0059915     2.43   0.019     .0025197    .0265884
                2007  |   .0151773   .0071918     2.11   0.040     .0007321    .0296225
                2008  |   .0166838   .0070509     2.37   0.022     .0025217    .0308458
                2009  |   .0493337   .0107484     4.59   0.000     .0277449    .0709224
                2010  |   .0426141   .0092331     4.62   0.000     .0240688    .0611594
                2011  |   .0158924   .0090364     1.76   0.085    -.0022577    .0340424
                2012  |   .0090097   .0100769     0.89   0.376    -.0112304    .0292497
                2013  |    .003268   .0094505     0.35   0.731     -.015714    .0222499
                2014  |  -.0054771   .0085534    -0.64   0.525     -.022657    .0117029
                2015  |   .0102533   .0066618     1.54   0.130    -.0031275     .023634
                2016  |   .0225859   .0071371     3.16   0.003     .0082506    .0369213
                2017  |   .0256969   .0079893     3.22   0.002     .0096499    .0417439
                2018  |    .032485   .0079247     4.10   0.000     .0165678    .0484022
                2019  |    .051251   .0080726     6.35   0.000     .0350368    .0674652
                      |
                 nind |
                   2  |   .0847069   .0264239     3.21   0.002     .0316329    .1377809
                   3  |   .1047943    .022069     4.75   0.000     .0604674    .1491212
                   4  |  -.0792614   .0237765    -3.33   0.002    -.1270178   -.0315049
                   5  |   .1437074   .0232001     6.19   0.000     .0971087    .1903062
                   6  |    .098772   .0258336     3.82   0.000     .0468837    .1506602
                   7  |   .0021631   .0250438     0.09   0.932    -.0481388     .052465
                   8  |   -.056202    .024992    -2.25   0.029       -.1064    -.006004
                   9  |  -.0623903   .0275471    -2.26   0.028    -.1177203   -.0070604
                  10  |  -.0952582   .0260112    -3.66   0.001    -.1475032   -.0430131
                  11  |    .118013    .025788     4.58   0.000     .0662164    .1698097
                      |
                 educ |   .0679563   .0016871    40.28   0.000     .0645677    .0713449
                exper |   .0458173   .0017645    25.97   0.000     .0422731    .0493614
               exper2 |  -.0009621   .0000949   -10.14   0.000    -.0011526   -.0007715
               exper3 |   5.16e-06   2.77e-06     1.86   0.069    -4.13e-07    .0000107
               exper4 |   2.96e-08   2.95e-08     1.00   0.320    -2.97e-08    8.89e-08
                 edex |  -.0004569   .0000618    -7.39   0.000    -.0005811   -.0003327
                      |
                ee_cl |
                   2  |  -.0591078   .0045235   -13.07   0.000    -.0681935    -.050022
                   3  |  -.0678792   .0060576   -11.21   0.000    -.0800461   -.0557122
                   4  |  -.0266327   .0107303    -2.48   0.016    -.0481852   -.0050802
                   5  |  -.1339785   .0056849   -23.57   0.000     -.145397   -.1225601
                   6  |  -.0850509   .0054338   -15.65   0.000    -.0959649   -.0741368
                   7  |  -.0610614   .0067651    -9.03   0.000    -.0746494   -.0474733
                   8  |   .0279295   .0115811     2.41   0.020     .0046683    .0511907
                   9  |  -.1528708   .0072436   -21.10   0.000    -.1674199   -.1383216
                  10  |  -.0965505   .0076965   -12.54   0.000    -.1120093   -.0810917
                  11  |  -.0579616   .0081567    -7.11   0.000    -.0743449   -.0415783
                  12  |   .0305714   .0116624     2.62   0.012     .0071468     .053996
                  13  |  -.0776147   .0123934    -6.26   0.000    -.1025075   -.0527218
                  14  |   -.075546   .0094281    -8.01   0.000    -.0944829   -.0566091
                  15  |  -.0478754   .0093791    -5.10   0.000    -.0667139   -.0290369
                  16  |   .0294854   .0127087     2.32   0.024     .0039592    .0550117
                      |
                 marr |   .1234734   .0023317    52.95   0.000     .1187901    .1281567
                partt |  -.2093268   .0061144   -34.24   0.000    -.2216079   -.1970458
               public |   .0158375   .0073894     2.14   0.037     .0009954    .0306795
                 cmsa |   .1453347   .0089317    16.27   0.000     .1273948    .1632746
                      |
                nocc2 |
                   2  |  -.1400189   .0035628   -39.30   0.000     -.147175   -.1328628
                   3  |  -.0389569   .0059613    -6.53   0.000    -.0509306   -.0269833
                   4  |  -.2920035   .0093934   -31.09   0.000    -.3108707   -.2731362
                   5  |  -.0780777   .0068599   -11.38   0.000    -.0918561   -.0642993
                   6  |  -.3672895   .0062088   -59.16   0.000    -.3797602   -.3548188
                   7  |  -.2297725   .0052554   -43.72   0.000    -.2403284   -.2192166
                   8  |  -.1005315   .0107772    -9.33   0.000    -.1221781   -.0788849
                   9  |  -.3880218   .0035652  -108.84   0.000    -.3951827   -.3808609
                  10  |  -.3268977   .0049743   -65.72   0.000     -.336889   -.3169065
                  11  |  -.2229752   .0055034   -40.52   0.000     -.234029   -.2119213
                  12  |  -.3764561   .0054789   -68.71   0.000    -.3874609   -.3654514
                      |
                unemp |   -.005887   .0020219    -2.91   0.005    -.0099482   -.0018259
                _cons |   .6601022   .0331632    19.90   0.000      .593492    .7267124
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 1, vce(cluster state)
(sum of wgt is 9,024,398,313)

Linear regression                               Number of obs     =  1,080,778
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5035
                                                Root MSE          =     .39293

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0660321   .0065346   -10.10   0.000    -.0791572   -.0529069
             treat_st |  -.0315798   .0087098    -3.63   0.001    -.0490739   -.0140857
treat_stblackrelwhite |  -.0398985   .0079984    -4.99   0.000    -.0559637   -.0238332
                      |
                state |
                  NH  |   .0543701   .0037567    14.47   0.000     .0468245    .0619157
                  VT  |    .033588   .0016346    20.55   0.000     .0303048    .0368713
                  MA  |   .0996032   .0079804    12.48   0.000      .083574    .1156323
                  RI  |   .0261675   .0079289     3.30   0.002     .0102418    .0420932
                  CT  |   .1110585   .0079293    14.01   0.000      .095132     .126985
                  NY  |   .0659101   .0074026     8.90   0.000     .0510415    .0807786
                  NJ  |   .1287685   .0084891    15.17   0.000     .1117176    .1458194
                  PA  |  -.0302326   .0063266    -4.78   0.000      -.04294   -.0175252
                  OH  |   -.061283   .0060861   -10.07   0.000    -.0735073   -.0490587
                  IN  |  -.0651502   .0045424   -14.34   0.000    -.0742738   -.0560266
                  IL  |   .0037505   .0069307     0.54   0.591    -.0101702    .0176712
                  MI  |  -.0132854   .0064344    -2.06   0.044    -.0262092   -.0003616
                  WI  |  -.0132545   .0045028    -2.94   0.005    -.0222986   -.0042104
                  MN  |   .0453697    .005942     7.64   0.000     .0334349    .0573046
                  IA  |  -.0312318   .0080971    -3.86   0.000    -.0474953   -.0149682
                  MO  |  -.0822818   .0058652   -14.03   0.000    -.0940624   -.0705012
                  ND  |  -.0586551   .0086682    -6.77   0.000    -.0760657   -.0412445
                  SD  |  -.0793385   .0083783    -9.47   0.000    -.0961667   -.0625102
                  NE  |  -.0699568   .0082851    -8.44   0.000     -.086598   -.0533156
                  KS  |  -.0654939   .0084291    -7.77   0.000    -.0824243   -.0485635
                  DE  |   .0480051   .0026067    18.42   0.000     .0427694    .0532409
                  MD  |    .094549   .0089969    10.51   0.000     .0764782    .1126199
                  DC  |    .151892   .0115411    13.16   0.000      .128711    .1750729
                  VA  |   .0528203    .009416     5.61   0.000     .0339077    .0717329
                  WV  |  -.1437243   .0027642   -52.00   0.000    -.1492763   -.1381724
                  NC  |  -.0329951    .008841    -3.73   0.000    -.0507528   -.0152375
                  SC  |  -.0732722   .0090961    -8.06   0.000    -.0915424   -.0550021
                  GA  |  -.0040349   .0095718    -0.42   0.675    -.0232605    .0151907
                  FL  |  -.0332499   .0103197    -3.22   0.002    -.0539777   -.0125221
                  KY  |  -.0893217   .0040061   -22.30   0.000    -.0973682   -.0812752
                  TN  |  -.0756585   .0090775    -8.33   0.000    -.0938912   -.0574258
                  AL  |  -.0884484   .0090771    -9.74   0.000    -.1066804   -.0702164
                  MS  |  -.1114099   .0092989   -11.98   0.000    -.1300874   -.0927325
                  AR  |  -.1143394   .0086003   -13.29   0.000    -.1316137   -.0970652
                  LA  |  -.0944204   .0100076    -9.43   0.000    -.1145214   -.0743195
                  OK  |  -.1365596   .0063223   -21.60   0.000    -.1492583   -.1238609
                  TX  |  -.0049567   .0099316    -0.50   0.620    -.0249049    .0149914
                  MT  |  -.0784904    .000893   -87.90   0.000     -.080284   -.0766968
                  ID  |  -.0757034   .0029949   -25.28   0.000    -.0817189   -.0696879
                  WY  |   .0002026   .0086476     0.02   0.981    -.0171666    .0175719
                  CO  |  -.0072139   .0079089    -0.91   0.366    -.0230995    .0086717
                  NM  |  -.0961222   .0049826   -19.29   0.000    -.1061301   -.0861143
                  AZ  |   .0050544   .0102028     0.50   0.622    -.0154385    .0255474
                  UT  |  -.0520165   .0095063    -5.47   0.000    -.0711104   -.0329226
                  NV  |   .0685647   .0105796     6.48   0.000      .047315    .0898143
                  WA  |   .0594678   .0071054     8.37   0.000     .0451962    .0737394
                  OR  |  -.0031266   .0065815    -0.48   0.637    -.0163459    .0100927
                  CA  |    .127885   .0085953    14.88   0.000     .1106209    .1451491
                  AK  |    .185464   .0050779    36.52   0.000     .1752646    .1956633
                  HI  |   .0690187   .0060019    11.50   0.000     .0569635    .0810739
                      |
                 year |
                1990  |  -.0056529   .0027982    -2.02   0.049    -.0112732   -.0000325
                1991  |  -.0000297   .0031907    -0.01   0.993    -.0064384    .0063791
                1992  |   .0200653   .0041125     4.88   0.000     .0118052    .0283254
                1993  |   .0162378   .0039303     4.13   0.000     .0083436     .024132
                1996  |   .0028675    .004165     0.69   0.494    -.0054982    .0112332
                1997  |    .014341   .0036533     3.93   0.000     .0070031    .0216789
                1998  |   .0420654   .0038173    11.02   0.000     .0343981    .0497327
                1999  |   .0582216   .0037617    15.48   0.000     .0506659    .0657773
                2000  |    .070546   .0042019    16.79   0.000     .0621061    .0789858
                2001  |   .0834989   .0044564    18.74   0.000     .0745479    .0924499
                2002  |   .0985782   .0047195    20.89   0.000     .0890989    .1080576
                2003  |    .105008   .0046522    22.57   0.000     .0956637    .1143522
                2004  |   .0954826   .0047019    20.31   0.000     .0860386    .1049265
                2005  |   .0849339    .005013    16.94   0.000      .074865    .0950028
                2006  |   .0794138   .0044504    17.84   0.000     .0704749    .0883527
                2007  |   .0792244   .0053398    14.84   0.000      .068499    .0899497
                2008  |   .0740958   .0062257    11.90   0.000     .0615912    .0866004
                2009  |    .099139   .0072567    13.66   0.000     .0845636    .1137145
                2010  |   .0970811   .0066176    14.67   0.000     .0837893    .1103729
                2011  |   .0772185   .0055431    13.93   0.000     .0660848    .0883522
                2012  |   .0581872    .005947     9.78   0.000     .0462423    .0701321
                2013  |   .0594013   .0063569     9.34   0.000     .0466331    .0721696
                2014  |   .0523196    .005757     9.09   0.000     .0407564    .0638829
                2015  |   .0660733   .0052329    12.63   0.000     .0555627    .0765839
                2016  |   .0774032   .0062726    12.34   0.000     .0648042    .0900021
                2017  |   .0845894   .0073336    11.53   0.000     .0698595    .0993194
                2018  |   .0881259    .007278    12.11   0.000     .0735077    .1027441
                2019  |   .0987005   .0068088    14.50   0.000     .0850248    .1123763
                      |
                 nind |
                   2  |   .0608656   .0407834     1.49   0.142    -.0210503    .1427816
                   3  |   .1341837   .0382084     3.51   0.001     .0574399    .2109275
                   4  |  -.0825488   .0386875    -2.13   0.038    -.1602549   -.0048426
                   5  |   .1577357   .0373702     4.22   0.000     .0826755     .232796
                   6  |   .0901697   .0390348     2.31   0.025     .0117659    .1685734
                   7  |   .0355902   .0403968     0.88   0.383    -.0455492    .1167296
                   8  |  -.0177778   .0414202    -0.43   0.670    -.1009726    .0654171
                   9  |  -.0695044   .0446086    -1.56   0.126    -.1591033    .0200946
                  10  |  -.0797917   .0395254    -2.02   0.049    -.1591808   -.0004026
                  11  |   .0724012   .0412201     1.76   0.085    -.0103918    .1551942
                      |
                 educ |   .0914958   .0023385    39.13   0.000     .0867987    .0961929
                exper |   .0477438   .0021223    22.50   0.000     .0434811    .0520066
               exper2 |  -.0015632   .0000964   -16.21   0.000    -.0017568   -.0013695
               exper3 |   .0000242   2.71e-06     8.94   0.000     .0000188    .0000296
               exper4 |  -1.26e-07   2.75e-08    -4.58   0.000    -1.81e-07   -7.06e-08
                 edex |  -.0005246   .0000899    -5.84   0.000    -.0007052   -.0003441
                      |
                ee_cl |
                   2  |  -.1254384    .005112   -24.54   0.000    -.1357062   -.1151706
                   3  |  -.1636753   .0077434   -21.14   0.000    -.1792284   -.1481223
                   4  |  -.1680142   .0124825   -13.46   0.000    -.1930859   -.1429424
                   5  |  -.1524855   .0081726   -18.66   0.000    -.1689007   -.1360703
                   6  |   -.168024   .0087574   -19.19   0.000    -.1856137   -.1504343
                   7  |  -.1758713   .0101302   -17.36   0.000    -.1962183   -.1555243
                   8  |   -.110717   .0131056    -8.45   0.000    -.1370404   -.0843935
                   9  |   -.154187   .0100161   -15.39   0.000     -.174305    -.134069
                  10  |  -.1756838   .0108846   -16.14   0.000    -.1975462   -.1538215
                  11  |  -.1697963   .0112146   -15.14   0.000    -.1923216   -.1472711
                  12  |  -.1174325   .0118633    -9.90   0.000    -.1412607   -.0936044
                  13  |  -.1078405   .0146801    -7.35   0.000    -.1373264   -.0783546
                  14  |  -.1555813    .011541   -13.48   0.000     -.178762   -.1324006
                  15  |  -.1376028   .0118516   -11.61   0.000    -.1614073   -.1137982
                  16  |  -.1034843   .0123132    -8.40   0.000    -.1282161   -.0787525
                      |
                 marr |   .0337773   .0022017    15.34   0.000     .0293551    .0381996
                partt |  -.1406614   .0033217   -42.35   0.000    -.1473333   -.1339895
               public |   .0603057   .0060006    10.05   0.000     .0482532    .0723581
                 cmsa |   .1527499   .0080333    19.01   0.000     .1366145    .1688852
                      |
                nocc2 |
                   2  |  -.1309229    .003021   -43.34   0.000    -.1369907   -.1248552
                   3  |  -.0389376   .0068494    -5.68   0.000    -.0526951   -.0251801
                   4  |  -.2800923    .006601   -42.43   0.000    -.2933507   -.2668339
                   5  |    .050932   .0061944     8.22   0.000     .0384903    .0633738
                   6  |  -.3242445   .0043177   -75.10   0.000    -.3329168   -.3155722
                   7  |  -.3501557   .0042388   -82.61   0.000    -.3586695   -.3416419
                   8  |  -.1644713   .0077576   -21.20   0.000    -.1800529   -.1488898
                   9  |  -.4035481   .0051207   -78.81   0.000    -.4138333    -.393263
                  10  |  -.4086619   .0090402   -45.20   0.000    -.4268197    -.390504
                  11  |  -.1645645   .0086966   -18.92   0.000    -.1820321   -.1470969
                  12  |  -.3809416   .0077014   -49.46   0.000    -.3964103    -.365473
                      |
                unemp |  -.0021886   .0013582    -1.61   0.113    -.0049166    .0005393
                _cons |   .3525204   .0459222     7.68   0.000      .260283    .4447578
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 0 & covered == 0, vce(cluster state)
(sum of wgt is 7,596,225,671)

Linear regression                               Number of obs     =    878,887
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5397
                                                Root MSE          =     .42016

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1591033   .0049747   -31.98   0.000    -.1690953   -.1491113
             treat_st |  -.0283505   .0141247    -2.01   0.050    -.0567209    .0000199
treat_stblackrelwhite |  -.0032058   .0080929    -0.40   0.694    -.0194609    .0130494
                      |
                state |
                  NH  |    .087276   .0044778    19.49   0.000     .0782821    .0962698
                  VT  |   .0320879   .0018697    17.16   0.000     .0283325    .0358434
                  MA  |   .1157622   .0085517    13.54   0.000     .0985856    .1329388
                  RI  |   .0306013   .0083355     3.67   0.001     .0138589    .0473437
                  CT  |   .1236473   .0084763    14.59   0.000     .1066222    .1406725
                  NY  |   .0741724   .0080773     9.18   0.000     .0579488    .0903961
                  NJ  |   .1541468   .0091236    16.90   0.000     .1358214    .1724722
                  PA  |   .0031591   .0065288     0.48   0.631    -.0099544    .0162725
                  OH  |  -.0285676   .0063678    -4.49   0.000    -.0413578   -.0157775
                  IN  |   -.003931   .0050176    -0.78   0.437    -.0140091    .0061471
                  IL  |   .0638041   .0075066     8.50   0.000     .0487267    .0788815
                  MI  |    .025707   .0072006     3.57   0.001     .0112441    .0401699
                  WI  |   .0110294   .0047595     2.32   0.025     .0014696    .0205892
                  MN  |   .0502451   .0066921     7.51   0.000     .0368036    .0636867
                  IA  |    .003197   .0127593     0.25   0.803    -.0224308    .0288248
                  MO  |  -.0353072   .0059661    -5.92   0.000    -.0472905   -.0233239
                  ND  |    .022929   .0133561     1.72   0.092    -.0038975    .0497555
                  SD  |  -.0452639    .012614    -3.59   0.001    -.0705999   -.0199279
                  NE  |   -.037286   .0124773    -2.99   0.004    -.0623475   -.0122245
                  KS  |  -.0161592   .0131891    -1.23   0.226    -.0426503    .0103319
                  DE  |   .0566129   .0018522    30.57   0.000     .0528926    .0603331
                  MD  |   .1286191   .0090002    14.29   0.000     .1105417    .1466965
                  DC  |   .1972509   .0120784    16.33   0.000     .1729908    .2215111
                  VA  |   .1180281    .013536     8.72   0.000     .0908402     .145216
                  WV  |  -.0501592   .0037815   -13.26   0.000    -.0577546   -.0425639
                  NC  |   .0178416   .0141142     1.26   0.212    -.0105076    .0461909
                  SC  |   .0050778   .0145285     0.35   0.728    -.0241035    .0342591
                  GA  |   .0592278   .0146628     4.04   0.000     .0297766     .088679
                  FL  |  -.0095433   .0151162    -0.63   0.531    -.0399051    .0208185
                  KY  |   -.036951   .0043187    -8.56   0.000    -.0456253   -.0282766
                  TN  |  -.0289241   .0142635    -2.03   0.048    -.0575731   -.0002751
                  AL  |  -.0048268   .0145759    -0.33   0.742    -.0341033    .0244497
                  MS  |  -.0147112   .0156442    -0.94   0.352    -.0461335    .0167111
                  AR  |  -.0662705   .0142693    -4.64   0.000    -.0949311   -.0376098
                  LA  |   .0279946   .0151558     1.85   0.071    -.0024466    .0584359
                  OK  |  -.0512055   .0082694    -6.19   0.000    -.0678151   -.0345959
                  TX  |   .0626709   .0147729     4.24   0.000     .0329986    .0923431
                  MT  |   -.039045   .0013446   -29.04   0.000    -.0417457   -.0363442
                  ID  |  -.0305361   .0033217    -9.19   0.000    -.0372079   -.0238643
                  WY  |   .1572239   .0148029    10.62   0.000     .1274914    .1869563
                  CO  |   .0407992   .0081661     5.00   0.000     .0243971    .0572013
                  NM  |  -.0169752   .0054781    -3.10   0.003    -.0279782   -.0059721
                  AZ  |   .0321632   .0150405     2.14   0.037     .0019535     .062373
                  UT  |  -.0008813   .0136059    -0.06   0.949    -.0282096     .026447
                  NV  |   .0902365    .015436     5.85   0.000     .0592323    .1212407
                  WA  |   .0914352   .0076148    12.01   0.000     .0761403    .1067301
                  OR  |   .0239825   .0069083     3.47   0.001     .0101069    .0378582
                  CA  |   .1552682   .0092002    16.88   0.000      .136789    .1737473
                  AK  |   .2432519   .0059645    40.78   0.000     .2312719    .2552319
                  HI  |   .1076197   .0065284    16.48   0.000     .0945069    .1207325
                      |
                 year |
                1990  |  -.0079128   .0030727    -2.58   0.013    -.0140844   -.0017412
                1991  |  -.0138395    .005733    -2.41   0.019    -.0253547   -.0023244
                1992  |  -.0101062   .0053075    -1.90   0.063    -.0207667    .0005543
                1993  |  -.0224467   .0043395    -5.17   0.000    -.0311629   -.0137305
                1996  |  -.0356952   .0057202    -6.24   0.000    -.0471845   -.0242058
                1997  |  -.0213598   .0050005    -4.27   0.000    -.0314036    -.011316
                1998  |   .0024313   .0045891     0.53   0.599    -.0067863    .0116489
                1999  |   .0262528   .0060008     4.37   0.000     .0141999    .0383057
                2000  |   .0354325   .0059733     5.93   0.000     .0234348    .0474302
                2001  |   .0575013   .0059433     9.67   0.000     .0455637    .0694388
                2002  |   .0716424   .0048335    14.82   0.000     .0619341    .0813507
                2003  |   .0612905   .0066798     9.18   0.000     .0478737    .0747072
                2004  |   .0514532    .005792     8.88   0.000     .0398195    .0630868
                2005  |   .0353305   .0064343     5.49   0.000     .0224068    .0482542
                2006  |   .0293226   .0055777     5.26   0.000     .0181195    .0405258
                2007  |   .0289557   .0067758     4.27   0.000     .0153461    .0425653
                2008  |   .0318256   .0065252     4.88   0.000     .0187194    .0449319
                2009  |   .0674369   .0112996     5.97   0.000     .0447411    .0901327
                2010  |   .0579943   .0098116     5.91   0.000      .038287    .0777015
                2011  |   .0310217   .0094752     3.27   0.002     .0119902    .0500532
                2012  |    .025806   .0101151     2.55   0.014     .0054892    .0461228
                2013  |   .0187797   .0092478     2.03   0.048      .000205    .0373544
                2014  |   .0076671    .008593     0.89   0.377    -.0095924    .0249266
                2015  |   .0265996   .0065204     4.08   0.000      .013503    .0396961
                2016  |   .0404557   .0070072     5.77   0.000     .0263812    .0545301
                2017  |    .040174   .0081623     4.92   0.000     .0237796    .0565684
                2018  |   .0482485    .008312     5.80   0.000     .0315534    .0649436
                2019  |   .0686516   .0086721     7.92   0.000     .0512332      .08607
                      |
                 nind |
                   2  |   .0472349   .0233009     2.03   0.048     .0004337    .0940361
                   3  |   .1004138   .0219276     4.58   0.000      .056371    .1444566
                   4  |  -.0676934    .023956    -2.83   0.007    -.1158104   -.0195763
                   5  |   .0987231   .0234201     4.22   0.000     .0516825    .1457638
                   6  |   .1016164   .0263368     3.86   0.000     .0487173    .1545155
                   7  |   .0063404   .0252677     0.25   0.803    -.0444114    .0570921
                   8  |  -.0451003   .0256645    -1.76   0.085    -.0966489    .0064484
                   9  |  -.0779106   .0256989    -3.03   0.004    -.1295284   -.0262928
                  10  |   -.089469   .0254514    -3.52   0.001    -.1405897   -.0383484
                  11  |   .0874991   .0261348     3.35   0.002     .0350059    .1399924
                      |
                 educ |    .064872   .0017748    36.55   0.000     .0613072    .0684369
                exper |   .0404955   .0017653    22.94   0.000     .0369498    .0440412
               exper2 |    -.00072   .0000878    -8.20   0.000    -.0008963   -.0005436
               exper3 |  -2.54e-06   2.90e-06    -0.88   0.385    -8.36e-06    3.28e-06
               exper4 |   1.16e-07   3.31e-08     3.50   0.001     4.95e-08    1.83e-07
                 edex |  -.0003399   .0000768    -4.42   0.000    -.0004942   -.0001855
                      |
                ee_cl |
                   2  |  -.0633011    .004452   -14.22   0.000    -.0722433   -.0543589
                   3  |  -.0756555   .0055286   -13.68   0.000      -.08676   -.0645509
                   4  |  -.0265426   .0093154    -2.85   0.006    -.0452532    -.007832
                   5  |  -.1248914   .0052645   -23.72   0.000    -.1354654   -.1143173
                   6  |  -.0979429   .0056065   -17.47   0.000    -.1092038    -.086682
                   7  |  -.0787373   .0069268   -11.37   0.000    -.0926502   -.0648243
                   8  |   .0385483   .0100136     3.85   0.000     .0184354    .0586612
                   9  |  -.1497443   .0069349   -21.59   0.000    -.1636734   -.1358152
                  10  |  -.1144369   .0077937   -14.68   0.000     -.130091   -.0987828
                  11  |  -.0691671   .0080329    -8.61   0.000    -.0853016   -.0530327
                  12  |   .0410312   .0107387     3.82   0.000     .0194619    .0626005
                  13  |  -.0901005   .0129262    -6.97   0.000    -.1160635   -.0641375
                  14  |  -.0873411    .010061    -8.68   0.000    -.1075492    -.067133
                  15  |   -.050768   .0096158    -5.28   0.000    -.0700819   -.0314542
                  16  |   .0395251   .0119579     3.31   0.002     .0155069    .0635433
                      |
                 marr |   .1293353   .0025549    50.62   0.000     .1242036     .134467
                partt |  -.2074877   .0046863   -44.28   0.000    -.2169004   -.1980749
               public |  -.0105439   .0060365    -1.75   0.087    -.0226687    .0015808
                 cmsa |   .1386627   .0081631    16.99   0.000     .1222665    .1550588
                      |
                nocc2 |
                   2  |  -.1492861   .0038151   -39.13   0.000    -.1569489   -.1416233
                   3  |  -.0391288   .0063213    -6.19   0.000    -.0518256    -.026432
                   4  |  -.3320009   .0073705   -45.04   0.000    -.3468051   -.3171967
                   5  |  -.0968806   .0083444   -11.61   0.000    -.1136408   -.0801203
                   6  |  -.3919559   .0065992   -59.39   0.000    -.4052108   -.3787011
                   7  |  -.2478845   .0065391   -37.91   0.000    -.2610188   -.2347503
                   8  |  -.1115779   .0102557   -10.88   0.000     -.132177   -.0909787
                   9  |  -.4345873   .0057719   -75.29   0.000    -.4461806    -.422994
                  10  |  -.3738819   .0060706   -61.59   0.000     -.386075   -.3616887
                  11  |  -.2747385   .0063412   -43.33   0.000    -.2874751   -.2620019
                  12  |  -.4360912   .0086899   -50.18   0.000    -.4535454    -.418637
                      |
                unemp |  -.0064058   .0019084    -3.36   0.002    -.0102388   -.0025727
                _cons |   .7369086   .0290315    25.38   0.000     .6785971    .7952201
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,732,289,686)

Linear regression                               Number of obs     =    924,344
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5061
                                                Root MSE          =     .39331

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0836958   .0069344   -12.07   0.000    -.0976239   -.0697677
             treat_st |  -.0252819   .0072672    -3.48   0.001    -.0398785   -.0106852
treat_stblackrelwhite |   -.028531   .0082471    -3.46   0.001    -.0450959   -.0119661
                      |
                state |
                  NH  |   .0564847   .0037401    15.10   0.000     .0489724     .063997
                  VT  |   .0418218    .001909    21.91   0.000     .0379874    .0456562
                  MA  |    .093852   .0080648    11.64   0.000     .0776534    .1100506
                  RI  |   .0009293   .0080601     0.12   0.909    -.0152599    .0171184
                  CT  |   .0988136   .0079622    12.41   0.000      .082821    .1148063
                  NY  |   .0424029   .0075619     5.61   0.000     .0272143    .0575914
                  NJ  |   .1089324   .0086448    12.60   0.000     .0915688    .1262961
                  PA  |  -.0429943   .0063855    -6.73   0.000    -.0558199   -.0301687
                  OH  |  -.0733181   .0060951   -12.03   0.000    -.0855604   -.0610758
                  IN  |  -.0697529   .0045217   -15.43   0.000    -.0788349   -.0606709
                  IL  |  -.0013096   .0070592    -0.19   0.854    -.0154884    .0128692
                  MI  |  -.0404993   .0066498    -6.09   0.000    -.0538558   -.0271429
                  WI  |  -.0218275   .0044787    -4.87   0.000    -.0308233   -.0128317
                  MN  |   .0349966   .0060818     5.75   0.000      .022781    .0472122
                  IA  |  -.0416786   .0070277    -5.93   0.000    -.0557942    -.027563
                  MO  |  -.0816591   .0057428   -14.22   0.000    -.0931939   -.0701242
                  ND  |  -.0623208   .0077484    -8.04   0.000     -.077884   -.0467577
                  SD  |  -.0790373   .0075245   -10.50   0.000    -.0941507   -.0639238
                  NE  |  -.0732215    .007559    -9.69   0.000    -.0884042   -.0580388
                  KS  |  -.0678089   .0074506    -9.10   0.000     -.082774   -.0528439
                  DE  |   .0360459   .0025365    14.21   0.000     .0309512    .0411406
                  MD  |   .0923942   .0088931    10.39   0.000     .0745319    .1102564
                  DC  |   .1612611   .0117526    13.72   0.000     .1376553    .1848669
                  VA  |   .0522436   .0087582     5.97   0.000     .0346523    .0698349
                  WV  |  -.1534359    .002881   -53.26   0.000    -.1592226   -.1476491
                  NC  |  -.0278902   .0078507    -3.55   0.001    -.0436588   -.0121216
                  SC  |  -.0647316   .0080233    -8.07   0.000    -.0808469   -.0486163
                  GA  |   -.000267   .0086141    -0.03   0.975    -.0175688    .0170349
                  FL  |  -.0397247   .0093813    -4.23   0.000    -.0585676   -.0208819
                  KY  |  -.0880193   .0040084   -21.96   0.000    -.0960704   -.0799682
                  TN  |   -.078825   .0081006    -9.73   0.000    -.0950956   -.0625544
                  AL  |   -.090086   .0080007   -11.26   0.000     -.106156   -.0740161
                  MS  |  -.1040389   .0080822   -12.87   0.000    -.1202725   -.0878053
                  AR  |  -.1111052    .007388   -15.04   0.000    -.1259445    -.096266
                  LA  |  -.0959708   .0089359   -10.74   0.000     -.113919   -.0780225
                  OK  |  -.1332446   .0061071   -21.82   0.000    -.1455111   -.1209781
                  TX  |  -.0032048   .0090232    -0.36   0.724    -.0213285    .0149189
                  MT  |  -.0756954   .0011178   -67.72   0.000    -.0779406   -.0734503
                  ID  |  -.0700924     .00299   -23.44   0.000     -.076098   -.0640868
                  WY  |   .0022806   .0075584     0.30   0.764    -.0129009     .017462
                  CO  |  -.0019159   .0078667    -0.24   0.809    -.0177167    .0138849
                  NM  |  -.0875796   .0048961   -17.89   0.000    -.0974136   -.0777455
                  AZ  |   .0033801   .0092743     0.36   0.717    -.0152479    .0220081
                  UT  |  -.0537151   .0085743    -6.26   0.000    -.0709372   -.0364931
                  NV  |   .0505579   .0095692     5.28   0.000     .0313375    .0697783
                  WA  |   .0526824   .0074076     7.11   0.000     .0378039     .067561
                  OR  |  -.0082052   .0068815    -1.19   0.239     -.022027    .0056166
                  CA  |    .112944   .0089237    12.66   0.000     .0950203    .1308678
                  AK  |   .1732791   .0053897    32.15   0.000     .1624536    .1841047
                  HI  |   .0678486   .0063457    10.69   0.000     .0551028    .0805944
                      |
                 year |
                1990  |  -.0062283    .002572    -2.42   0.019    -.0113943   -.0010624
                1991  |   .0017696   .0035371     0.50   0.619    -.0053349    .0088742
                1992  |   .0227308   .0047471     4.79   0.000     .0131961    .0322656
                1993  |   .0167549   .0042809     3.91   0.000     .0081564    .0253535
                1996  |  -.0003337   .0040592    -0.08   0.935    -.0084868    .0078194
                1997  |   .0135886   .0039988     3.40   0.001     .0055568    .0216204
                1998  |   .0439452   .0042663    10.30   0.000     .0353762    .0525143
                1999  |   .0632315   .0045145    14.01   0.000     .0541639     .072299
                2000  |   .0775733   .0048053    16.14   0.000     .0679215    .0872251
                2001  |   .0904414   .0055424    16.32   0.000     .0793091    .1015737
                2002  |   .1065453    .005149    20.69   0.000     .0962032    .1168875
                2003  |    .116524   .0055567    20.97   0.000     .1053631    .1276849
                2004  |    .106722   .0056251    18.97   0.000     .0954236    .1180204
                2005  |   .0954561   .0060027    15.90   0.000     .0833992    .1075129
                2006  |   .0897809   .0050963    17.62   0.000     .0795447    .1000171
                2007  |   .0911282   .0055626    16.38   0.000     .0799554     .102301
                2008  |   .0854666   .0066772    12.80   0.000     .0720551    .0988781
                2009  |     .11004   .0083466    13.18   0.000     .0932753    .1268046
                2010  |   .1073014   .0073808    14.54   0.000     .0924767    .1221261
                2011  |   .0878556   .0064192    13.69   0.000     .0749623    .1007489
                2012  |   .0710839   .0062177    11.43   0.000     .0585953    .0835725
                2013  |   .0702882   .0066463    10.58   0.000     .0569387    .0836377
                2014  |   .0652688   .0065029    10.04   0.000     .0522074    .0783302
                2015  |   .0780164   .0055921    13.95   0.000     .0667843    .0892485
                2016  |   .0900328   .0070563    12.76   0.000     .0758598    .1042058
                2017  |   .1010352   .0078381    12.89   0.000     .0852919    .1167785
                2018  |   .1053742    .008435    12.49   0.000     .0884321    .1223163
                2019  |   .1165226    .008151    14.30   0.000     .1001509    .1328943
                      |
                 nind |
                   2  |   .0514185    .039717     1.29   0.201    -.0283555    .1311926
                   3  |    .126382   .0377036     3.35   0.002      .050652     .202112
                   4  |  -.0833918    .037849    -2.20   0.032    -.1594138   -.0073698
                   5  |   .1111076   .0372823     2.98   0.004     .0362239    .1859914
                   6  |   .0886019   .0387387     2.29   0.026      .010793    .1664109
                   7  |   .0372807   .0401676     0.93   0.358    -.0433983    .1179596
                   8  |  -.0140866   .0408792    -0.34   0.732    -.0961949    .0680216
                   9  |  -.0863408   .0425497    -2.03   0.048    -.1718045   -.0008772
                  10  |  -.0772683   .0387258    -2.00   0.051    -.1550514    .0005148
                  11  |    .088608    .042771     2.07   0.043        .0027     .174516
                      |
                 educ |   .0869671   .0019061    45.63   0.000     .0831386    .0907956
                exper |   .0470423   .0021978    21.40   0.000     .0426279    .0514568
               exper2 |  -.0015046   .0000958   -15.70   0.000    -.0016971    -.001312
               exper3 |   .0000229   2.87e-06     7.97   0.000     .0000171    .0000287
               exper4 |  -1.13e-07   3.01e-08    -3.76   0.000    -1.73e-07   -5.25e-08
                 edex |  -.0005877   .0000984    -5.97   0.000    -.0007855     -.00039
                      |
                ee_cl |
                   2  |  -.1198462   .0045079   -26.59   0.000    -.1289007   -.1107918
                   3  |   -.151363   .0062085   -24.38   0.000    -.1638331   -.1388929
                   4  |   -.143902   .0103292   -13.93   0.000    -.1646488   -.1231553
                   5  |  -.1495973     .00822   -18.20   0.000    -.1661078   -.1330869
                   6  |   -.162488   .0078106   -20.80   0.000     -.178176      -.1468
                   7  |  -.1619277   .0083774   -19.33   0.000    -.1787543   -.1451011
                   8  |  -.0744561   .0101869    -7.31   0.000    -.0949171   -.0539951
                   9  |  -.1597336   .0106331   -15.02   0.000    -.1810907   -.1383764
                  10  |   -.170102   .0100587   -16.91   0.000    -.1903055   -.1498986
                  11  |   -.152895   .0091484   -16.71   0.000    -.1712702   -.1345198
                  12  |  -.0900284   .0092088    -9.78   0.000    -.1085249   -.0715319
                  13  |  -.1250551   .0157901    -7.92   0.000    -.1567704   -.0933398
                  14  |  -.1512011   .0111325   -13.58   0.000    -.1735614   -.1288408
                  15  |  -.1218174   .0101344   -12.02   0.000     -.142173   -.1014618
                  16  |  -.0821337    .010935    -7.51   0.000    -.1040972   -.0601702
                      |
                 marr |   .0386685   .0024043    16.08   0.000     .0338393    .0434977
                partt |  -.1385741   .0028907   -47.94   0.000    -.1443803   -.1327679
               public |   .0150317   .0056834     2.64   0.011     .0036163    .0264472
                 cmsa |   .1527214   .0078699    19.41   0.000     .1369143    .1685285
                      |
                nocc2 |
                   2  |  -.1382132   .0031946   -43.26   0.000    -.1446298   -.1317966
                   3  |  -.0374661   .0070479    -5.32   0.000    -.0516222   -.0233099
                   4  |  -.3261354   .0044896   -72.64   0.000    -.3351531   -.3171178
                   5  |   .0306843   .0062608     4.90   0.000     .0181091    .0432595
                   6  |  -.3377583   .0046807   -72.16   0.000    -.3471597   -.3283568
                   7  |  -.3673521   .0045915   -80.01   0.000    -.3765744   -.3581297
                   8  |  -.1761536   .0076495   -23.03   0.000     -.191518   -.1607892
                   9  |  -.4257861   .0057254   -74.37   0.000    -.4372859   -.4142864
                  10  |  -.4500928    .008623   -52.20   0.000    -.4674125   -.4327731
                  11  |  -.2351165   .0072771   -32.31   0.000    -.2497329   -.2205001
                  12  |  -.4245154    .009397   -45.18   0.000    -.4433898    -.405641
                      |
                unemp |  -.0024022   .0015766    -1.52   0.134    -.0055689    .0007644
                _cons |   .4230877   .0425331     9.95   0.000     .3376574     .508518
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,613,820,660)

Linear regression                               Number of obs     =    189,324
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3403
                                                Root MSE          =     .36131

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1400559   .0122505   -11.43   0.000    -.1646617   -.1154501
             treat_st |  -.0565632   .0321293    -1.76   0.084    -.1210968    .0079703
treat_stblackrelwhite |  -.0149503   .0147067    -1.02   0.314    -.0444896    .0145889
                      |
                state |
                  NH  |   .0365621   .0059941     6.10   0.000     .0245225    .0486016
                  VT  |   -.021363   .0034195    -6.25   0.000    -.0282312   -.0144948
                  MA  |   .0925151   .0097927     9.45   0.000     .0728458    .1121844
                  RI  |    .034296   .0102389     3.35   0.002     .0137306    .0548614
                  CT  |   .1394969   .0094256    14.80   0.000      .120565    .1584288
                  NY  |   .1096172   .0079656    13.76   0.000     .0936178    .1256167
                  NJ  |   .1795658   .0092916    19.33   0.000     .1609031    .1982284
                  PA  |   .0025788   .0066847     0.39   0.701    -.0108478    .0160055
                  OH  |   .0020611   .0062568     0.33   0.743     -.010506    .0146282
                  IN  |   .0226732   .0058075     3.90   0.000     .0110085    .0343379
                  IL  |   .0871768   .0066659    13.08   0.000      .073788    .1005655
                  MI  |   .0880065   .0067691    13.00   0.000     .0744104    .1016027
                  WI  |   .0221205   .0057103     3.87   0.000     .0106511    .0335899
                  MN  |   .0601402   .0080156     7.50   0.000     .0440404    .0762399
                  IA  |   .0275641   .0299495     0.92   0.362    -.0325912    .0877194
                  MO  |   .0204149   .0068097     3.00   0.004     .0067372    .0340925
                  ND  |   .0391374   .0307663     1.27   0.209    -.0226585    .1009333
                  SD  |   -.005892   .0297538    -0.20   0.844    -.0656543    .0538703
                  NE  |  -.0142244   .0285259    -0.50   0.620    -.0715204    .0430717
                  KS  |   .0591984   .0294283     2.01   0.050     .0000899    .1183069
                  DE  |   .0569374   .0045599    12.49   0.000     .0477785    .0660962
                  MD  |    .119969   .0090477    13.26   0.000     .1017961    .1381419
                  DC  |   .1322227   .0087717    15.07   0.000     .1146041    .1498412
                  VA  |   .1569935    .029795     5.27   0.000     .0971484    .2168385
                  WV  |  -.0016011   .0072622    -0.22   0.826    -.0161876    .0129853
                  NC  |   .0510635   .0315928     1.62   0.112    -.0123925    .1145196
                  SC  |   .0051838   .0327388     0.16   0.875    -.0605741    .0709416
                  GA  |   .0959326   .0319022     3.01   0.004     .0318551    .1600102
                  FL  |   .0355282   .0325902     1.09   0.281    -.0299311    .1009876
                  KY  |  -.0248864   .0056147    -4.43   0.000    -.0361639   -.0136089
                  TN  |   .0137291   .0313501     0.44   0.663    -.0492395    .0766977
                  AL  |   .0183413   .0321075     0.57   0.570    -.0461485    .0828312
                  MS  |  -.0065089   .0339361    -0.19   0.849    -.0746716    .0616538
                  AR  |  -.0103212   .0324425    -0.32   0.752     -.075484    .0548415
                  LA  |   .0612925   .0322417     1.90   0.063    -.0034669     .126052
                  OK  |  -.0424159   .0140115    -3.03   0.004    -.0705589   -.0142729
                  TX  |   .0861136   .0316739     2.72   0.009     .0224947    .1497325
                  MT  |  -.0429515   .0035398   -12.13   0.000    -.0500614   -.0358416
                  ID  |   -.017168   .0030708    -5.59   0.000    -.0233358   -.0110002
                  WY  |   .1899069   .0330705     5.74   0.000     .1234828    .2563309
                  CO  |   .0062806   .0088618     0.71   0.482    -.0115189    .0240801
                  NM  |  -.0401033   .0074066    -5.41   0.000    -.0549798   -.0252268
                  AZ  |   .0774213   .0325786     2.38   0.021     .0119852    .1428574
                  UT  |   .0111023   .0300018     0.37   0.713    -.0491581    .0713628
                  NV  |   .1469125   .0343361     4.28   0.000     .0779465    .2158785
                  WA  |   .1026501      .0076    13.51   0.000      .087385    .1179152
                  OR  |   .0289547    .007419     3.90   0.000     .0140532    .0438563
                  CA  |   .1782178   .0096884    18.39   0.000      .158758    .1976776
                  AK  |   .2400685    .007661    31.34   0.000      .224681    .2554561
                  HI  |    .088004   .0088246     9.97   0.000     .0702792    .1057287
                      |
                 year |
                1990  |  -.0175196   .0048848    -3.59   0.001    -.0273311   -.0077082
                1991  |  -.0269695   .0061428    -4.39   0.000    -.0393077   -.0146313
                1992  |  -.0239721   .0074339    -3.22   0.002    -.0389035   -.0090407
                1993  |  -.0269034   .0068726    -3.91   0.000    -.0407074   -.0130994
                1996  |  -.0143408   .0059286    -2.42   0.019    -.0262488   -.0024329
                1997  |  -.0066994   .0066369    -1.01   0.318    -.0200299    .0066311
                1998  |   .0031643   .0066012     0.48   0.634    -.0100945    .0164231
                1999  |   .0133707    .006621     2.02   0.049     .0000721    .0266694
                2000  |   .0100489   .0058948     1.70   0.094    -.0017911    .0218889
                2001  |   .0169886   .0067053     2.53   0.014     .0035205    .0304567
                2002  |   .0282656   .0086811     3.26   0.002     .0108292     .045702
                2003  |   .0368426   .0081846     4.50   0.000     .0204034    .0532819
                2004  |   .0276384   .0063371     4.36   0.000       .01491    .0403669
                2005  |   .0227503   .0079384     2.87   0.006     .0068056    .0386951
                2006  |   .0184904   .0105316     1.76   0.085     -.002663    .0396438
                2007  |   .0228921    .012392     1.85   0.071    -.0019979    .0477822
                2008  |   .0096113   .0073265     1.31   0.196    -.0051043    .0243269
                2009  |   .0300666   .0117329     2.56   0.013     .0065004    .0536328
                2010  |   .0400634    .011683     3.43   0.001     .0165974    .0635293
                2011  |    .018889   .0119514     1.58   0.120    -.0051162    .0428941
                2012  |   .0019026   .0121764     0.16   0.876    -.0225544    .0263597
                2013  |   .0029838   .0104586     0.29   0.777    -.0180228    .0239905
                2014  |   .0087385   .0112782     0.77   0.442    -.0139145    .0313915
                2015  |   .0101704   .0096232     1.06   0.296    -.0091584    .0294991
                2016  |   .0108641   .0104272     1.04   0.302    -.0100795    .0318077
                2017  |    .026901    .009637     2.79   0.007     .0075445    .0462576
                2018  |   .0268945   .0097957     2.75   0.008     .0072192    .0465698
                2019  |   .0398493   .0106988     3.72   0.000     .0183602    .0613384
                      |
                 nind |
                   2  |   .0687552   .0246902     2.78   0.008     .0191634    .1183469
                   3  |  -.0531374   .0228794    -2.32   0.024    -.0990921   -.0071828
                   4  |   -.226326   .0267666    -8.46   0.000    -.2800883   -.1725637
                   5  |    .069392   .0227662     3.05   0.004     .0236648    .1151192
                   6  |  -.0817361   .0256168    -3.19   0.002    -.1331889   -.0302833
                   7  |  -.0952858   .0233791    -4.08   0.000    -.1422442   -.0483274
                   8  |  -.1945211   .0245181    -7.93   0.000    -.2437673    -.145275
                   9  |  -.1466943   .0253189    -5.79   0.000    -.1975489   -.0958397
                  10  |  -.1637812   .0425379    -3.85   0.000    -.2492212   -.0783412
                  11  |   .0804678    .024674     3.26   0.002     .0309085     .130027
                      |
                 educ |   .0724683   .0040659    17.82   0.000     .0643017    .0806349
                exper |   .0716135   .0024774    28.91   0.000     .0666375    .0765894
               exper2 |  -.0025658   .0001683   -15.25   0.000    -.0029038   -.0022278
               exper3 |   .0000515   4.79e-06    10.74   0.000     .0000418    .0000611
               exper4 |  -4.18e-07   4.68e-08    -8.94   0.000    -5.12e-07   -3.24e-07
                 edex |  -.0007865   .0001051    -7.48   0.000    -.0009976   -.0005754
                      |
                ee_cl |
                   2  |   .0704373   .0167664     4.20   0.000     .0367611    .1041136
                   3  |   .0568815   .0183045     3.11   0.003     .0201157    .0936472
                   4  |   .0126643   .0256561     0.49   0.624    -.0388675    .0641961
                   5  |   .0124983   .0210817     0.59   0.556    -.0298456    .0548421
                   6  |   .0455946   .0160569     2.84   0.007     .0133434    .0778458
                   7  |   .0535839   .0206718     2.59   0.012     .0120634    .0951043
                   8  |    .013677   .0237225     0.58   0.567    -.0339709     .061325
                   9  |   .0069534   .0224241     0.31   0.758    -.0380868    .0519936
                  10  |   .0308444   .0188026     1.64   0.107    -.0069217    .0686105
                  11  |   .0434437   .0204489     2.12   0.039      .002371    .0845165
                  12  |   .0575644   .0235903     2.44   0.018     .0101818     .104947
                  13  |   .0426316   .0206882     2.06   0.045     .0010781    .0841852
                  14  |   .0219738   .0198119     1.11   0.273    -.0178197    .0617673
                  15  |   .0385395   .0214793     1.79   0.079    -.0046028    .0816819
                  16  |   .0747609   .0219259     3.41   0.001     .0307214    .1188004
                      |
                 marr |   .0638185   .0027451    23.25   0.000     .0583049    .0693322
                partt |  -.0947044   .0176348    -5.37   0.000    -.1301249    -.059284
               public |  -.0523122   .0082543    -6.34   0.000    -.0688916   -.0357329
                 cmsa |   .1107106   .0109041    10.15   0.000     .0888091    .1326121
                      |
                nocc2 |
                   2  |  -.0359077    .010503    -3.42   0.001    -.0570036   -.0148117
                   3  |  -.0199134    .011813    -1.69   0.098    -.0436406    .0038137
                   4  |  -.0701169   .0137353    -5.10   0.000     -.097705   -.0425288
                   5  |    .009021   .0173353     0.52   0.605     -.025798    .0438399
                   6  |  -.2390866   .0097111   -24.62   0.000    -.2585918   -.2195813
                   7  |  -.1917152   .0105478   -18.18   0.000    -.2129011   -.1705293
                   8  |  -.0850205   .0269691    -3.15   0.003    -.1391896   -.0308514
                   9  |  -.2188432   .0098885   -22.13   0.000    -.2387048   -.1989816
                  10  |   -.142359   .0064027   -22.23   0.000    -.1552193   -.1294987
                  11  |  -.0668831   .0079391    -8.42   0.000    -.0828292   -.0509369
                  12  |  -.1868637   .0071217   -26.24   0.000    -.2011682   -.1725593
                      |
                unemp |  -.0029097   .0023274    -1.25   0.217    -.0075845     .001765
                _cons |   .5348974   .0571172     9.36   0.000     .4201742    .6496206
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,280,703,237)

Linear regression                               Number of obs     =    154,778
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4293
                                                Root MSE          =      .3655

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0554943   .0099993    -5.55   0.000    -.0755786   -.0354101
             treat_st |  -.0598669   .0191903    -3.12   0.003    -.0984116   -.0213221
treat_stblackrelwhite |  -.0000514   .0155829    -0.00   0.997    -.0313506    .0312478
                      |
                state |
                  NH  |   .0464882   .0050236     9.25   0.000     .0363981    .0565784
                  VT  |   -.008045   .0024447    -3.29   0.002    -.0129552   -.0031347
                  MA  |   .1315931   .0087949    14.96   0.000     .1139281    .1492581
                  RI  |   .1391983   .0094895    14.67   0.000      .120138    .1582586
                  CT  |    .170282   .0089391    19.05   0.000     .1523272    .1882367
                  NY  |   .1244549   .0077359    16.09   0.000     .1089169     .139993
                  NJ  |   .2139527   .0087625    24.42   0.000     .1963528    .2315526
                  PA  |   .0373962   .0072945     5.13   0.000     .0227448    .0520477
                  OH  |   .0170979   .0073449     2.33   0.024     .0023452    .0318506
                  IN  |   .0004768   .0070234     0.07   0.946    -.0136301    .0145837
                  IL  |   .0385811    .007375     5.23   0.000      .023768    .0533942
                  MI  |    .088821   .0083644    10.62   0.000     .0720206    .1056213
                  WI  |   .0425307   .0061395     6.93   0.000     .0301991    .0548623
                  MN  |   .0850279    .007305    11.64   0.000     .0703554    .0997005
                  IA  |   .0415905   .0181152     2.30   0.026     .0052051    .0779759
                  MO  |  -.0433799   .0075782    -5.72   0.000    -.0586011   -.0281587
                  ND  |   .0049825   .0185485     0.27   0.789    -.0322733    .0422383
                  SD  |  -.0428874   .0177435    -2.42   0.019    -.0785262   -.0072486
                  NE  |  -.0401716   .0171647    -2.34   0.023    -.0746479   -.0056954
                  KS  |   .0034815   .0173946     0.20   0.842    -.0314565    .0384196
                  DE  |   .1407991   .0062534    22.52   0.000     .1282387    .1533595
                  MD  |   .1642578     .00923    17.80   0.000     .1457188    .1827968
                  DC  |   .1854643   .0108318    17.12   0.000      .163708    .2072205
                  VA  |   .1433763   .0182252     7.87   0.000       .10677    .1799826
                  WV  |  -.0594965    .003788   -15.71   0.000    -.0671048   -.0518881
                  NC  |   .0501368   .0186595     2.69   0.010      .012658    .0876156
                  SC  |    -.02971   .0191651    -1.55   0.127    -.0682043    .0087843
                  GA  |   .0567062   .0191093     2.97   0.005     .0183241    .0950883
                  FL  |   .0483544   .0190658     2.54   0.014     .0100597    .0866492
                  KY  |  -.0378685   .0063137    -6.00   0.000      -.05055    -.025187
                  TN  |    .024486   .0184567     1.33   0.191    -.0125854    .0615574
                  AL  |  -.0510357   .0184997    -2.76   0.008    -.0881934   -.0138779
                  MS  |  -.0693029   .0197526    -3.51   0.001    -.1089771   -.0296286
                  AR  |  -.0626452   .0188989    -3.31   0.002    -.1006048   -.0246857
                  LA  |  -.0154411   .0193859    -0.80   0.429    -.0543788    .0234965
                  OK  |  -.0983285   .0093459   -10.52   0.000    -.1171004   -.0795566
                  TX  |   .0524856   .0187299     2.80   0.007     .0148654    .0901057
                  MT  |  -.0807137   .0029245   -27.60   0.000    -.0865878   -.0748397
                  ID  |  -.0648887   .0029942   -21.67   0.000    -.0709027   -.0588747
                  WY  |   .0933519   .0192669     4.85   0.000     .0546533    .1320506
                  CO  |   .0052825    .009042     0.58   0.562    -.0128789    .0234438
                  NM  |  -.0656031   .0052156   -12.58   0.000     -.076079   -.0551271
                  AZ  |   .0589782    .019966     2.95   0.005     .0188753     .099081
                  UT  |   .0017734   .0189544     0.09   0.926    -.0362977    .0398444
                  NV  |   .1498218   .0221067     6.78   0.000     .1054192    .1942243
                  WA  |   .0854044   .0085618     9.98   0.000     .0682075    .1026012
                  OR  |   .0178961   .0073359     2.44   0.018     .0031614    .0326307
                  CA  |   .1926495   .0083798    22.99   0.000     .1758181    .2094808
                  AK  |   .2271575   .0048601    46.74   0.000     .2173957    .2369193
                  HI  |   .0724657   .0075235     9.63   0.000     .0573543    .0875771
                      |
                 year |
                1990  |   -.001043   .0052337    -0.20   0.843    -.0115551    .0094691
                1991  |  -.0062815   .0081272    -0.77   0.443    -.0226054    .0100424
                1992  |   .0066087   .0107992     0.61   0.543    -.0150821    .0282996
                1993  |   .0145608   .0092374     1.58   0.121    -.0039931    .0331148
                1996  |   .0232762    .008434     2.76   0.008      .006336    .0402164
                1997  |   .0238732    .006971     3.42   0.001     .0098716    .0378748
                1998  |   .0405907   .0068052     5.96   0.000      .026922    .0542593
                1999  |   .0421743   .0066417     6.35   0.000     .0288341    .0555145
                2000  |   .0365265   .0074758     4.89   0.000      .021511     .051542
                2001  |   .0516104   .0074033     6.97   0.000     .0367404    .0664803
                2002  |   .0616655   .0072212     8.54   0.000     .0471612    .0761697
                2003  |   .0516309   .0064718     7.98   0.000     .0386319    .0646299
                2004  |   .0464833   .0091693     5.07   0.000     .0280663    .0649003
                2005  |   .0404517    .008843     4.57   0.000       .02269    .0582133
                2006  |   .0386504   .0076451     5.06   0.000     .0232948    .0540061
                2007  |   .0320448   .0084166     3.81   0.000     .0151397      .04895
                2008  |   .0285038   .0124843     2.28   0.027     .0034285    .0535792
                2009  |   .0592196   .0144849     4.09   0.000     .0301258    .0883135
                2010  |   .0657655   .0145994     4.50   0.000     .0364418    .0950891
                2011  |   .0420707   .0132104     3.18   0.002     .0155369    .0686045
                2012  |   .0126941   .0118475     1.07   0.289    -.0111023    .0364905
                2013  |   .0240242    .011284     2.13   0.038     .0013597    .0466888
                2014  |   .0074987    .018186     0.41   0.682    -.0290289    .0440264
                2015  |   .0220725   .0132365     1.67   0.102    -.0045138    .0486588
                2016  |   .0301476    .008639     3.49   0.001     .0127956    .0474996
                2017  |   .0135317   .0123829     1.09   0.280    -.0113401    .0384035
                2018  |   .0138043   .0105797     1.30   0.198    -.0074456    .0350542
                2019  |   .0202619   .0091093     2.22   0.031     .0019654    .0385584
                      |
                 nind |
                   2  |   .0561889   .0518094     1.08   0.283    -.0478734    .1602512
                   3  |   .0448543   .0389242     1.15   0.255    -.0333272    .1230357
                   4  |  -.2342428   .0502418    -4.66   0.000    -.3351564   -.1333291
                   5  |   .1414533   .0428243     3.30   0.002     .0554382    .2274685
                   6  |  -.0435347   .0476045    -0.91   0.365    -.1391512    .0520818
                   7  |  -.1000757    .045867    -2.18   0.034    -.1922022   -.0079492
                   8  |  -.1349363    .049354    -2.73   0.009    -.2340668   -.0358059
                   9  |  -.1828832   .0451146    -4.05   0.000    -.2734985   -.0922679
                  10  |  -.1467439   .0601844    -2.44   0.018    -.2676278     -.02586
                  11  |   .0039548   .0461875     0.09   0.932    -.0888154    .0967251
                      |
                 educ |   .1048811   .0056665    18.51   0.000     .0934995    .1162627
                exper |    .050391   .0033808    14.90   0.000     .0436004    .0571816
               exper2 |  -.0017452   .0002621    -6.66   0.000    -.0022716   -.0012188
               exper3 |    .000031   9.06e-06     3.42   0.001     .0000128    .0000492
               exper4 |  -2.12e-07   1.01e-07    -2.09   0.041    -4.16e-07   -8.57e-09
                 edex |   -.000465    .000123    -3.78   0.000    -.0007121   -.0002179
                      |
                ee_cl |
                   2  |  -.0588789   .0138278    -4.26   0.000    -.0866528   -.0311049
                   3  |  -.1201893   .0178148    -6.75   0.000    -.1559713   -.0844073
                   4  |  -.1691649   .0331767    -5.10   0.000    -.2358023   -.1025275
                   5  |  -.0718389   .0206266    -3.48   0.001    -.1132686   -.0304092
                   6  |  -.0914783   .0171406    -5.34   0.000    -.1259062   -.0570505
                   7  |  -.1371197   .0219353    -6.25   0.000    -.1811779   -.0930614
                   8  |  -.1653969   .0346392    -4.77   0.000    -.2349717    -.095822
                   9  |  -.0472123   .0164268    -2.87   0.006    -.0802064   -.0142182
                  10  |  -.1118306   .0230449    -4.85   0.000    -.1581177   -.0655436
                  11  |  -.1512038   .0243674    -6.21   0.000    -.2001471   -.1022605
                  12  |     -.1443   .0313162    -4.61   0.000    -.2072004   -.0813997
                  13  |   .0001262   .0209199     0.01   0.995    -.0418926    .0421451
                  14  |  -.1029026   .0218002    -4.72   0.000    -.1466896   -.0591156
                  15  |  -.1160859   .0257748    -4.50   0.000     -.167856   -.0643157
                  16  |   -.112522   .0320834    -3.51   0.001    -.1769635   -.0480806
                      |
                 marr |   .0058906   .0034514     1.71   0.094    -.0010417    .0128229
                partt |  -.0643553   .0070377    -9.14   0.000    -.0784909   -.0502198
               public |   .0232616   .0120786     1.93   0.060     -.000999    .0475222
                 cmsa |   .1209266   .0095728    12.63   0.000     .1016991    .1401542
                      |
                nocc2 |
                   2  |   -.039355    .010718    -3.67   0.001    -.0608826   -.0178273
                   3  |  -.0221853    .013585    -1.63   0.109    -.0494715     .005101
                   4  |  -.1070193    .010981    -9.75   0.000    -.1290753   -.0849634
                   5  |   .1404044   .0162649     8.63   0.000     .1077354    .1730734
                   6  |  -.2347566   .0095291   -24.64   0.000    -.2538964   -.2156168
                   7  |  -.2426754   .0232968   -10.42   0.000    -.2894684   -.1958824
                   8  |  -.0911463   .0463268    -1.97   0.055    -.1841964    .0019038
                   9  |  -.2887221   .0152811   -18.89   0.000    -.3194151   -.2580291
                  10  |  -.2596006   .0174784   -14.85   0.000    -.2947071   -.2244941
                  11  |   .0068396   .0185768     0.37   0.714     -.030473    .0441521
                  12  |   -.241642   .0131369   -18.39   0.000    -.2680282   -.2152558
                      |
                unemp |  -.0017729   .0014944    -1.19   0.241    -.0047744    .0012287
                _cons |   .1881014   .0534851     3.52   0.001     .0806733    .2955294
---------------------------------------------------------------------------------------

. 
. ** HISP-WHITE
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2
>  exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen [aw = finalwt1] if fe
> male == 0, vce(cluster state) 
(sum of wgt is 7,768,999,613)

Linear regression                               Number of obs     =    834,372
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2115
                                                Root MSE          =     .31669

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0021998     .00544    -0.40   0.688    -.0131264    .0087267
            treat_st |  -.0252263   .0082408    -3.06   0.004    -.0417785   -.0086741
treat_sthisprelwhite |   .0082886   .0091877     0.90   0.371    -.0101655    .0267427
                     |
               state |
                 NH  |  -.0425821    .003011   -14.14   0.000    -.0486298   -.0365344
                 VT  |  -.0448913   .0015625   -28.73   0.000    -.0480297   -.0417529
                 MA  |   .0060823   .0045879     1.33   0.191    -.0031327    .0152973
                 RI  |   .0109479   .0048858     2.24   0.030     .0011346    .0207613
                 CT  |   .0101741   .0045113     2.26   0.029     .0011128    .0192354
                 NY  |   .0960154   .0042793    22.44   0.000     .0874202    .1046107
                 NJ  |   .0430764    .004957     8.69   0.000       .03312    .0530329
                 PA  |   .0124405   .0036398     3.42   0.001     .0051298    .0197512
                 OH  |   .0054258   .0036694     1.48   0.145    -.0019443     .012796
                 IN  |  -.0189843   .0043656    -4.35   0.000    -.0277529   -.0102158
                 IL  |   .0352845   .0047996     7.35   0.000     .0256443    .0449248
                 MI  |   .0407502   .0052396     7.78   0.000     .0302262    .0512742
                 WI  |  -.0081647   .0036014    -2.27   0.028    -.0153983    -.000931
                 MN  |   .0133525     .00355     3.76   0.000     .0062222    .0204829
                 IA  |  -.0005411   .0086482    -0.06   0.950    -.0179116    .0168293
                 MO  |  -.0104008   .0034832    -2.99   0.004    -.0173969   -.0034047
                 ND  |  -.0643739   .0081271    -7.92   0.000    -.0806977   -.0480502
                 SD  |  -.0875681   .0083329   -10.51   0.000    -.1043052    -.070831
                 NE  |  -.0404598    .008806    -4.59   0.000    -.0581472   -.0227725
                 KS  |  -.0457487   .0090062    -5.08   0.000    -.0638382   -.0276593
                 DE  |  -.0561144   .0016284   -34.46   0.000    -.0593851   -.0528437
                 MD  |  -.0527126     .00436   -12.09   0.000    -.0614699   -.0439552
                 DC  |  -.0585542   .0076516    -7.65   0.000     -.073923   -.0431855
                 VA  |  -.0879579    .009181    -9.58   0.000    -.1063985   -.0695173
                 WV  |   -.025142   .0031936    -7.87   0.000    -.0315565   -.0187274
                 NC  |  -.1087468   .0097636   -11.14   0.000    -.1283577    -.089136
                 SC  |  -.1106662   .0097812   -11.31   0.000    -.1303123     -.09102
                 GA  |  -.0742535   .0100476    -7.39   0.000    -.0944346   -.0540724
                 FL  |  -.0612222    .010416    -5.88   0.000    -.0821433   -.0403012
                 KY  |  -.0463622   .0034226   -13.55   0.000    -.0532367   -.0394878
                 TN  |  -.0716044   .0096707    -7.40   0.000    -.0910285   -.0521803
                 AL  |  -.0509879   .0095696    -5.33   0.000    -.0702089   -.0317668
                 MS  |  -.0888906   .0095358    -9.32   0.000    -.1080438   -.0697373
                 AR  |  -.1004975   .0093262   -10.78   0.000    -.1192298   -.0817652
                 LA  |   -.069936   .0101221    -6.91   0.000    -.0902668   -.0496051
                 OK  |  -.0838856   .0073042   -11.48   0.000    -.0985565   -.0692147
                 TX  |  -.0759806   .0103197    -7.36   0.000    -.0967082   -.0552529
                 MT  |  -.0141007   .0020954    -6.73   0.000    -.0183095    -.009892
                 ID  |  -.0909684    .002094   -43.44   0.000    -.0951742   -.0867626
                 WY  |  -.0651111   .0085661    -7.60   0.000    -.0823167   -.0479055
                 CO  |  -.0577325   .0041971   -13.76   0.000    -.0661626   -.0493023
                 NM  |  -.0857744   .0048582   -17.66   0.000    -.0955323   -.0760164
                 AZ  |  -.0705607   .0105712    -6.67   0.000    -.0917935   -.0493279
                 UT  |  -.0753512   .0097101    -7.76   0.000    -.0948545   -.0558479
                 NV  |   .0463573   .0109591     4.23   0.000     .0243454    .0683692
                 WA  |   .0416649   .0043419     9.60   0.000     .0329439     .050386
                 OR  |   .0024831   .0044871     0.55   0.582    -.0065296    .0114958
                 CA  |   .0244743   .0058938     4.15   0.000     .0126362    .0363123
                 AK  |   .0488809   .0069168     7.07   0.000     .0349881    .0627738
                 HI  |   .0398285   .0039704    10.03   0.000     .0318536    .0478034
                     |
                year |
               1997  |  -.0014228   .0024382    -0.58   0.562      -.00632    .0034744
               1998  |  -.0076627   .0028396    -2.70   0.009    -.0133662   -.0019592
               1999  |   -.007219    .003904    -1.85   0.070    -.0150603    .0006224
               2000  |   -.010921   .0040588    -2.69   0.010    -.0190733   -.0027687
               2001  |  -.0124566   .0038037    -3.27   0.002    -.0200966   -.0048167
               2002  |  -.0142112   .0038229    -3.72   0.001    -.0218898   -.0065326
               2003  |  -.0185736   .0039142    -4.75   0.000    -.0264356   -.0107117
               2004  |    -.02433   .0035145    -6.92   0.000     -.031389    -.017271
               2005  |  -.0299534   .0048672    -6.15   0.000    -.0397296   -.0201773
               2006  |  -.0357796   .0050859    -7.04   0.000    -.0459949   -.0255643
               2007  |  -.0346715   .0055459    -6.25   0.000    -.0458107   -.0235323
               2008  |  -.0242016   .0048416    -5.00   0.000    -.0339261    -.014477
               2009  |  -.0219195   .0048787    -4.49   0.000    -.0317185   -.0121204
               2010  |   -.026399   .0056259    -4.69   0.000     -.037699    -.015099
               2011  |  -.0296715   .0046755    -6.35   0.000    -.0390626   -.0202803
               2012  |  -.0289712   .0049137    -5.90   0.000    -.0388406   -.0191018
               2013  |  -.0337745   .0041138    -8.21   0.000    -.0420373   -.0255118
               2014  |  -.0336099   .0052202    -6.44   0.000    -.0440951   -.0231248
               2015  |  -.0371965   .0051591    -7.21   0.000    -.0475589    -.026834
               2016  |  -.0383987   .0053006    -7.24   0.000    -.0490452   -.0277521
               2017  |  -.0354927   .0046343    -7.66   0.000    -.0448011   -.0261844
               2018  |  -.0360363   .0051732    -6.97   0.000    -.0464269   -.0256457
               2019  |   -.036716   .0068133    -5.39   0.000    -.0504008   -.0230311
                     |
                nind |
                  2  |   .0845095   .0156354     5.41   0.000     .0531048    .1159142
                  3  |   .0684457   .0084692     8.08   0.000     .0514347    .0854567
                  4  |   .0076313   .0074267     1.03   0.309    -.0072858    .0225483
                  5  |   .1530987    .006884    22.24   0.000     .1392718    .1669256
                  6  |   .0043088   .0082821     0.52   0.605    -.0123263    .0209439
                  7  |  -.0018582   .0059078    -0.31   0.754    -.0137244     .010008
                  8  |   .0141591   .0118062     1.20   0.236    -.0095542    .0378725
                  9  |   .1147975   .0145832     7.87   0.000     .0855062    .1440887
                 10  |   .0054904   .0151589     0.36   0.719    -.0249571     .035938
                 11  |   .0768418    .013556     5.67   0.000     .0496137    .1040699
                     |
                educ |   .0094735   .0016765     5.65   0.000     .0061061    .0128408
               exper |     .00661   .0007968     8.30   0.000     .0050095    .0082105
              exper2 |   -.000035   .0000438    -0.80   0.428    -.0001229    .0000529
              exper3 |   2.78e-07   1.91e-06     0.15   0.885    -3.57e-06    4.12e-06
              exper4 |  -1.81e-08   2.49e-08    -0.73   0.471    -6.82e-08    3.20e-08
                edex |  -.0002251   .0000343    -6.57   0.000     -.000294   -.0001562
                     |
               ee_cl |
                  2  |  -.0156946   .0045461    -3.45   0.001    -.0248257   -.0065635
                  3  |  -.0141433   .0057238    -2.47   0.017    -.0256399   -.0026466
                  4  |  -.0280766   .0104062    -2.70   0.009     -.048978   -.0071752
                  5  |  -.0464542   .0078729    -5.90   0.000    -.0622675    -.030641
                  6  |  -.0091517   .0038546    -2.37   0.021    -.0168939   -.0014094
                  7  |    .016684   .0067184     2.48   0.016     .0031898    .0301783
                  8  |  -.0320542   .0120094    -2.67   0.010    -.0561759   -.0079325
                  9  |  -.0560651    .006706    -8.36   0.000    -.0695345   -.0425957
                 10  |    .006585   .0062196     1.06   0.295    -.0059074    .0190773
                 11  |   .0197688   .0080735     2.45   0.018     .0035526     .035985
                 12  |  -.0400739     .01289    -3.11   0.003    -.0659643   -.0141835
                 13  |  -.0264922   .0067876    -3.90   0.000    -.0401256   -.0128588
                 14  |   .0246918   .0067709     3.65   0.001      .011092    .0382916
                 15  |   .0159368    .009135     1.74   0.087    -.0024113    .0342849
                 16  |  -.0420458   .0136736    -3.07   0.003      -.06951   -.0145817
                     |
                marr |   .0155397   .0021547     7.21   0.000     .0112118    .0198676
               partt |  -.0523013   .0055255    -9.47   0.000    -.0633996   -.0412031
              public |   .2723527   .0288924     9.43   0.000     .2143206    .3303848
                cmsa |   .0359388   .0053081     6.77   0.000     .0252772    .0466003
                     |
               nocc2 |
                  2  |   .0461945   .0029295    15.77   0.000     .0403104    .0520785
                  3  |   .0301723   .0049704     6.07   0.000     .0201889    .0401557
                  4  |   .1520044   .0094218    16.13   0.000     .1330802    .1709286
                  5  |   .1366653   .0161148     8.48   0.000     .1042979    .1690328
                  6  |   .1292217   .0078208    16.52   0.000     .1135132    .1449303
                  7  |   .0702574   .0054336    12.93   0.000     .0593437    .0811712
                  8  |    .058969   .0089752     6.57   0.000     .0409417    .0769962
                  9  |   .1571915   .0107958    14.56   0.000     .1355074    .1788755
                 10  |   .1707287    .012386    13.78   0.000     .1458507    .1956068
                 11  |   .1897004   .0155791    12.18   0.000     .1584089    .2209918
                 12  |   .1884007   .0157561    11.96   0.000     .1567537    .2200478
                     |
               unemp |  -.0015168   .0013878    -1.09   0.280    -.0043043    .0012706
             citizen |  -.0167536   .0026948    -6.22   0.000    -.0221663   -.0113409
               _cons |  -.1678801   .0363717    -4.62   0.000    -.2409349   -.0948253
--------------------------------------------------------------------------------------

.         
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2
>  exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen [aw = finalwt1] if fe
> male == 1, vce(cluster state)
(sum of wgt is 7,117,480,992)

Linear regression                               Number of obs     =    805,753
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2766
                                                Root MSE          =     .28781

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |   .0097863   .0085239     1.15   0.256    -.0073344    .0269071
            treat_st |  -.0279593   .0115313    -2.42   0.019    -.0511206   -.0047979
treat_sthisprelwhite |   .0066845   .0129291     0.52   0.607    -.0192844    .0326534
                     |
               state |
                 NH  |  -.0116941   .0016385    -7.14   0.000    -.0149852   -.0084031
                 VT  |  -.0050181   .0011098    -4.52   0.000    -.0072473    -.002789
                 MA  |   .0210432   .0030214     6.96   0.000     .0149745     .027112
                 RI  |   .0381571    .002845    13.41   0.000     .0324428    .0438714
                 CT  |   .0313293   .0026591    11.78   0.000     .0259883    .0366703
                 NY  |   .1024095   .0028875    35.47   0.000     .0966098    .1082093
                 NJ  |   .0332088   .0032387    10.25   0.000     .0267036    .0397139
                 PA  |   .0064637   .0025269     2.56   0.014     .0013882    .0115391
                 OH  |  -.0016812   .0021003    -0.80   0.427    -.0058996    .0025373
                 IN  |  -.0427581   .0041735   -10.25   0.000    -.0511408   -.0343753
                 IL  |  -.0004029   .0033713    -0.12   0.905    -.0071744    .0063687
                 MI  |   .0434339   .0037575    11.56   0.000     .0358868     .050981
                 WI  |  -.0048272   .0033795    -1.43   0.159    -.0116152    .0019607
                 MN  |     .03332   .0020955    15.90   0.000     .0291111    .0375289
                 IA  |   .0051889   .0116888     0.44   0.659    -.0182887    .0286665
                 MO  |  -.0502748   .0020892   -24.06   0.000    -.0544711   -.0460786
                 ND  |  -.0434782   .0115752    -3.76   0.000    -.0667277   -.0202286
                 SD  |  -.0530184   .0116881    -4.54   0.000    -.0764948   -.0295421
                 NE  |  -.0220318   .0116842    -1.89   0.065    -.0455003    .0014366
                 KS  |  -.0520901   .0115781    -4.50   0.000    -.0753453   -.0288348
                 DE  |  -.0303563   .0011552   -26.28   0.000    -.0326766   -.0280359
                 MD  |  -.0317585   .0028878   -11.00   0.000    -.0375587   -.0259582
                 DC  |  -.0622611   .0039123   -15.91   0.000    -.0701192    -.054403
                 VA  |  -.0743817     .01155    -6.44   0.000    -.0975806   -.0511828
                 WV  |  -.0305155   .0025136   -12.14   0.000    -.0355642   -.0254669
                 NC  |  -.0914648   .0118013    -7.75   0.000    -.1151683   -.0677612
                 SC  |  -.0967171   .0116612    -8.29   0.000    -.1201392   -.0732949
                 GA  |  -.0763719   .0117824    -6.48   0.000    -.1000376   -.0527062
                 FL  |  -.0336357   .0119127    -2.82   0.007     -.057563   -.0097083
                 KY  |  -.0567067   .0020269   -27.98   0.000    -.0607778   -.0526356
                 TN  |  -.0635897   .0117921    -5.39   0.000    -.0872749   -.0399044
                 AL  |  -.0312081   .0116421    -2.68   0.010    -.0545919   -.0078242
                 MS  |  -.0844679   .0116469    -7.25   0.000    -.1078615   -.0610743
                 AR  |  -.0773402   .0116281    -6.65   0.000    -.1006959   -.0539845
                 LA  |  -.0607689   .0116591    -5.21   0.000    -.0841869   -.0373509
                 OK  |   -.061089   .0084889    -7.20   0.000    -.0781394   -.0440385
                 TX  |  -.0663854   .0118504    -5.60   0.000    -.0901876   -.0425833
                 MT  |   .0026973    .001607     1.68   0.099    -.0005305    .0059251
                 ID  |  -.0755076   .0013412   -56.30   0.000    -.0782015   -.0728138
                 WY  |  -.0874244   .0119334    -7.33   0.000    -.1113934   -.0634554
                 CO  |   -.041287   .0029317   -14.08   0.000    -.0471755   -.0353984
                 NM  |  -.0671144   .0048749   -13.77   0.000    -.0769058   -.0573229
                 AZ  |  -.0520682   .0117844    -4.42   0.000    -.0757379   -.0283986
                 UT  |  -.0549315   .0116889    -4.70   0.000    -.0784094   -.0314536
                 NV  |   .0639029   .0119583     5.34   0.000     .0398839    .0879219
                 WA  |     .05753   .0022791    25.24   0.000     .0529523    .0621077
                 OR  |   .0446062   .0022271    20.03   0.000     .0401329    .0490795
                 CA  |   .0438144   .0047697     9.19   0.000     .0342341    .0533946
                 AK  |   .0789056   .0043925    17.96   0.000     .0700829    .0877282
                 HI  |    .058277   .0027871    20.91   0.000      .052679     .063875
                     |
                year |
               1997  |  -.0046984    .001497    -3.14   0.003    -.0077052   -.0016916
               1998  |  -.0071179   .0027798    -2.56   0.014    -.0127014   -.0015344
               1999  |  -.0094822   .0018695    -5.07   0.000    -.0132372   -.0057272
               2000  |  -.0092823   .0018347    -5.06   0.000    -.0129674   -.0055972
               2001  |  -.0073104   .0023761    -3.08   0.003    -.0120829   -.0025379
               2002  |  -.0090293   .0032373    -2.79   0.007    -.0155316   -.0025269
               2003  |  -.0137924   .0029468    -4.68   0.000    -.0197112   -.0078736
               2004  |  -.0157041   .0031216    -5.03   0.000     -.021974   -.0094343
               2005  |  -.0174616    .002728    -6.40   0.000    -.0229409   -.0119822
               2006  |  -.0192555   .0027421    -7.02   0.000    -.0247631   -.0137478
               2007  |  -.0206687   .0033768    -6.12   0.000    -.0274513   -.0138862
               2008  |  -.0163486   .0041087    -3.98   0.000    -.0246011    -.008096
               2009  |  -.0137887   .0042443    -3.25   0.002    -.0223136   -.0052638
               2010  |  -.0175186   .0047364    -3.70   0.001    -.0270319   -.0080052
               2011  |  -.0167381   .0043388    -3.86   0.000    -.0254528   -.0080234
               2012  |  -.0222873   .0044824    -4.97   0.000    -.0312904   -.0132842
               2013  |  -.0189098   .0038653    -4.89   0.000    -.0266736    -.011146
               2014  |     -.0223   .0036135    -6.17   0.000    -.0295579   -.0150422
               2015  |  -.0226241   .0034258    -6.60   0.000     -.029505   -.0157433
               2016  |   -.021871   .0034844    -6.28   0.000    -.0288697   -.0148724
               2017  |  -.0249255   .0035186    -7.08   0.000    -.0319928   -.0178582
               2018  |  -.0265206   .0029715    -8.92   0.000    -.0324891   -.0205521
               2019  |  -.0271879   .0048636    -5.59   0.000    -.0369566   -.0174192
                     |
                nind |
                  2  |   .0326894   .0089138     3.67   0.001     .0147855    .0505934
                  3  |   .0350731   .0085918     4.08   0.000     .0178159    .0523303
                  4  |   .0378052   .0099455     3.80   0.000      .017829    .0577814
                  5  |   .1292416   .0091383    14.14   0.000     .1108868    .1475965
                  6  |   .0165229   .0080249     2.06   0.045     .0004044    .0326413
                  7  |   .0053617   .0076989     0.70   0.489     -.010102    .0208255
                  8  |   .0204134   .0121223     1.68   0.098     -.003935    .0447618
                  9  |   .1395391   .0177153     7.88   0.000     .1039568    .1751214
                 10  |   .0102551   .0109306     0.94   0.353    -.0116997    .0322099
                 11  |   .0028893   .0190894     0.15   0.880    -.0354529    .0412315
                     |
                educ |   .0160009   .0022182     7.21   0.000     .0115454    .0204564
               exper |   .0096499   .0011558     8.35   0.000     .0073283    .0119714
              exper2 |  -.0003035    .000067    -4.53   0.000     -.000438   -.0001689
              exper3 |   6.34e-06   2.09e-06     3.04   0.004     2.15e-06    .0000105
              exper4 |  -5.51e-08   2.22e-08    -2.47   0.017    -9.97e-08   -1.04e-08
                edex |  -.0002087   .0000452    -4.62   0.000    -.0002995   -.0001179
                     |
               ee_cl |
                  2  |  -.0355696   .0044421    -8.01   0.000    -.0444918   -.0266474
                  3  |  -.0667238   .0069065    -9.66   0.000    -.0805959   -.0528517
                  4  |  -.0945065   .0148713    -6.35   0.000    -.1243763   -.0646367
                  5  |  -.0391904   .0091785    -4.27   0.000    -.0576259   -.0207549
                  6  |  -.0520663   .0059437    -8.76   0.000    -.0640047    -.040128
                  7  |  -.0669794   .0090431    -7.41   0.000     -.085143   -.0488158
                  8  |  -.0876855   .0145944    -6.01   0.000    -.1169991   -.0583719
                  9  |  -.0373784   .0078949    -4.73   0.000    -.0532358   -.0215211
                 10  |  -.0522882   .0076426    -6.84   0.000    -.0676388   -.0369377
                 11  |   -.066375   .0092926    -7.14   0.000    -.0850397   -.0477103
                 12  |   -.078013   .0143502    -5.44   0.000    -.1068363   -.0491898
                 13  |  -.0147666   .0099771    -1.48   0.145    -.0348061    .0052729
                 14  |  -.0383973   .0076829    -5.00   0.000    -.0538288   -.0229657
                 15  |  -.0538881   .0113196    -4.76   0.000    -.0766243    -.031152
                 16  |   -.066857   .0151308    -4.42   0.000    -.0972481   -.0364659
                     |
                marr |  -.0014715   .0009568    -1.54   0.130    -.0033933    .0004502
               partt |  -.0502862   .0049075   -10.25   0.000    -.0601432   -.0404293
              public |   .2890986   .0302663     9.55   0.000     .2283069    .3498903
                cmsa |   .0203312   .0028321     7.18   0.000     .0146428    .0260196
                     |
               nocc2 |
                  2  |   .0206617   .0018993    10.88   0.000      .016847    .0244765
                  3  |   .0326969   .0071676     4.56   0.000     .0183003    .0470935
                  4  |   .1449641   .0066452    21.81   0.000     .1316169    .1583113
                  5  |   .1316107   .0161877     8.13   0.000     .0990968    .1641246
                  6  |   .0602289   .0054251    11.10   0.000     .0493323    .0711255
                  7  |    .077471   .0076492    10.13   0.000     .0621072    .0928347
                  8  |   .0531935   .0030202    17.61   0.000     .0471271    .0592598
                  9  |   .0923361   .0086208    10.71   0.000     .0750208    .1096514
                 10  |   .1465652   .0116153    12.62   0.000     .1232352    .1698952
                 11  |    .177197   .0155548    11.39   0.000     .1459543    .2084396
                 12  |   .1635695   .0150564    10.86   0.000     .1333279    .1938112
                     |
               unemp |  -.0005499   .0008103    -0.68   0.500    -.0021774    .0010775
             citizen |  -.0070076   .0019065    -3.68   0.001    -.0108369   -.0031783
               _cons |  -.2150369   .0345425    -6.23   0.000    -.2844176   -.1456562
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen [aw = finalwt1] if fe
> male == 0, vce(cluster state) 
(sum of wgt is 7,769,055,819)

Linear regression                               Number of obs     =    834,380
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5287
                                                Root MSE          =     .41543

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1286046   .0121942   -10.55   0.000    -.1530975   -.1041118
            treat_st |  -.0365005   .0159323    -2.29   0.026    -.0685016   -.0044995
treat_sthisprelwhite |   .0188891   .0280564     0.67   0.504    -.0374637     .075242
                     |
               state |
                 NH  |   .0837411   .0047713    17.55   0.000     .0741576    .0933247
                 VT  |   .0196574     .00217     9.06   0.000     .0152988    .0240159
                 MA  |    .138553   .0086789    15.96   0.000     .1211208    .1559851
                 RI  |   .0537516   .0089256     6.02   0.000     .0358239    .0716792
                 CT  |   .1468633   .0087233    16.84   0.000     .1293421    .1643845
                 NY  |   .1182018   .0088062    13.42   0.000     .1005142    .1358895
                 NJ  |    .184958   .0098004    18.87   0.000     .1652732    .2046428
                 PA  |   .0231255   .0066326     3.49   0.001     .0098035    .0364475
                 OH  |  -.0065499   .0064537    -1.01   0.315    -.0195126    .0064128
                 IN  |   .0170159   .0067017     2.54   0.014     .0035551    .0304767
                 IL  |   .1083286   .0086522    12.52   0.000       .09095    .1257071
                 MI  |   .0554246   .0085596     6.48   0.000     .0382321    .0726171
                 WI  |   .0384058   .0057667     6.66   0.000     .0268231    .0499885
                 MN  |   .0799283   .0063997    12.49   0.000     .0670742    .0927824
                 IA  |   .0277117   .0147228     1.88   0.066      -.00186    .0572834
                 MO  |  -.0080278   .0061619    -1.30   0.199    -.0204044    .0043488
                 ND  |   .0360552   .0146179     2.47   0.017     .0066943     .065416
                 SD  |  -.0376851   .0142692    -2.64   0.011    -.0663457   -.0090245
                 NE  |  -.0134737    .014525    -0.93   0.358    -.0426479    .0157006
                 KS  |   .0040243     .01594     0.25   0.802    -.0279922    .0360407
                 DE  |   .0448913   .0020777    21.61   0.000     .0407181    .0490645
                 MD  |   .1447956   .0092496    15.65   0.000     .1262171     .163374
                 DC  |   .2443203   .0130853    18.67   0.000     .2180378    .2706028
                 VA  |   .1445465    .016072     8.99   0.000     .1122649    .1768281
                 WV  |  -.0474406   .0044247   -10.72   0.000    -.0563278   -.0385534
                 NC  |   .0113487   .0180191     0.63   0.532    -.0248437     .047541
                 SC  |   -.005934   .0180718    -0.33   0.744    -.0422323    .0303643
                 GA  |   .0601274   .0181084     3.32   0.002     .0237557    .0964992
                 FL  |   .0059203    .019287     0.31   0.760    -.0328188    .0446594
                 KY  |  -.0350863   .0058452    -6.00   0.000    -.0468267   -.0233458
                 TN  |  -.0249351   .0174981    -1.43   0.160     -.060081    .0102108
                 AL  |   .0159611   .0176428     0.90   0.370    -.0194756    .0513977
                 MS  |   -.011884   .0187249    -0.63   0.529     -.049494     .025726
                 AR  |  -.0630628   .0172223    -3.66   0.001    -.0976548   -.0284708
                 LA  |   .0469367    .018485     2.54   0.014     .0098085    .0840649
                 OK  |  -.0477471   .0124556    -3.83   0.000     -.072765   -.0227292
                 TX  |   .0540181   .0197435     2.74   0.009     .0143621    .0936741
                 MT  |  -.0327164   .0011678   -28.02   0.000     -.035062   -.0303707
                 ID  |  -.0263432   .0054083    -4.87   0.000     -.037206   -.0154804
                 WY  |   .1684895   .0167335    10.07   0.000     .1348793    .2020997
                 CO  |   .0634519   .0087185     7.28   0.000     .0459402    .0809635
                 NM  |   .0208622   .0087747     2.38   0.021     .0032378    .0384867
                 AZ  |   .0586308   .0201489     2.91   0.005     .0181606     .099101
                 UT  |   .0181833   .0164131     1.11   0.273    -.0147834      .05115
                 NV  |   .1454022   .0203527     7.14   0.000     .1045227    .1862817
                 WA  |   .1292579    .007899    16.36   0.000     .1133922    .1451236
                 OR  |   .0522148   .0080844     6.46   0.000     .0359768    .0684529
                 CA  |   .1660637   .0126738    13.10   0.000     .1406077    .1915197
                 AK  |   .2337085   .0071567    32.66   0.000     .2193338    .2480831
                 HI  |   .1505353   .0065598    22.95   0.000     .1373594    .1637111
                     |
                year |
               1997  |   .0100334   .0036414     2.76   0.008     .0027194    .0173474
               1998  |   .0308624   .0048125     6.41   0.000     .0211963    .0405285
               1999  |    .050397   .0063411     7.95   0.000     .0376606    .0631334
               2000  |   .0588996   .0071844     8.20   0.000     .0444693      .07333
               2001  |   .0790809   .0067279    11.75   0.000     .0655676    .0925942
               2002  |   .0957724   .0056689    16.89   0.000     .0843861    .1071588
               2003  |   .0878675   .0064275    13.67   0.000     .0749576    .1007775
               2004  |   .0748321   .0058243    12.85   0.000     .0631337    .0865306
               2005  |   .0582746   .0070692     8.24   0.000     .0440757    .0724734
               2006  |   .0501147   .0081219     6.17   0.000     .0338013     .066428
               2007  |    .053249   .0093254     5.71   0.000     .0345184    .0719796
               2008  |   .0580638     .00866     6.70   0.000     .0406696    .0754579
               2009  |   .0983972   .0093489    10.52   0.000     .0796193    .1171751
               2010  |   .0894428   .0085859    10.42   0.000     .0721974    .1066882
               2011  |   .0613821   .0080966     7.58   0.000     .0451196    .0776446
               2012  |   .0519825    .009263     5.61   0.000     .0333772    .0705877
               2013  |   .0443244    .008341     5.31   0.000      .027571    .0610778
               2014  |   .0348276   .0087429     3.98   0.000      .017267    .0523883
               2015  |   .0480433   .0086071     5.58   0.000     .0307554    .0653312
               2016  |   .0618122   .0096248     6.42   0.000     .0424801    .0811442
               2017  |   .0648139   .0104625     6.19   0.000     .0437994    .0858284
               2018  |   .0724567   .0103836     6.98   0.000     .0516006    .0933127
               2019  |   .0874818   .0099659     8.78   0.000     .0674648    .1074988
                     |
                nind |
                  2  |   .0767178    .036275     2.11   0.039     .0038574    .1495782
                  3  |   .0926881   .0252847     3.67   0.001     .0419023    .1434739
                  4  |  -.0791593   .0312746    -2.53   0.015    -.1419762   -.0163424
                  5  |   .1328025   .0288935     4.60   0.000     .0747683    .1908368
                  6  |   .0955629   .0311245     3.07   0.003     .0330476    .1580782
                  7  |    .007185   .0288055     0.25   0.804    -.0506725    .0650424
                  8  |  -.0459477    .029257    -1.57   0.123    -.1047122    .0128168
                  9  |  -.0670237   .0313167    -2.14   0.037    -.1299251   -.0041222
                 10  |  -.0845104   .0334848    -2.52   0.015    -.1517665   -.0172542
                 11  |   .1167663   .0325643     3.59   0.001      .051359    .1821735
                     |
                educ |   .0597519   .0024455    24.43   0.000       .05484    .0646638
               exper |   .0490078   .0021673    22.61   0.000     .0446545     .053361
              exper2 |    -.00103   .0001182    -8.71   0.000    -.0012675   -.0007925
              exper3 |   7.66e-06   3.38e-06     2.27   0.028     8.75e-07    .0000144
              exper4 |  -9.47e-10   3.36e-08    -0.03   0.978    -6.85e-08    6.66e-08
                edex |  -.0006638   .0000658   -10.09   0.000     -.000796   -.0005317
                     |
               ee_cl |
                  2  |  -.0426261   .0051082    -8.34   0.000    -.0528863   -.0323659
                  3  |  -.0399407   .0104459    -3.82   0.000    -.0609219   -.0189596
                  4  |   .0369934   .0211448     1.75   0.086    -.0054772    .0794639
                  5  |  -.1021907   .0059149   -17.28   0.000    -.1140712   -.0903102
                  6  |  -.0800699    .006124   -13.07   0.000    -.0923703   -.0677695
                  7  |  -.0262203   .0127858    -2.05   0.046    -.0519013   -.0005393
                  8  |   .1072537   .0213779     5.02   0.000     .0643151    .1501924
                  9  |  -.1387002   .0088474   -15.68   0.000    -.1564707   -.1209297
                 10  |  -.0907959    .008738   -10.39   0.000    -.1083467   -.0732451
                 11  |  -.0217221   .0144613    -1.50   0.139    -.0507685    .0073243
                 12  |   .1095281   .0220039     4.98   0.000     .0653321    .1537242
                 13  |  -.1189273   .0129367    -9.19   0.000    -.1449114   -.0929432
                 14  |  -.0684121   .0094364    -7.25   0.000    -.0873656   -.0494586
                 15  |  -.0118687   .0146419    -0.81   0.421    -.0412778    .0175405
                 16  |   .1127076   .0238324     4.73   0.000     .0648387    .1605765
                     |
                marr |   .1231929   .0020999    58.67   0.000     .1189751    .1274106
               partt |  -.1898113   .0081782   -23.21   0.000    -.2062378   -.1733848
              public |   .0148808   .0083382     1.78   0.080     -.001867    .0316286
                cmsa |   .1377871   .0088103    15.64   0.000     .1200911    .1554832
                     |
               nocc2 |
                  2  |  -.1523851   .0041646   -36.59   0.000      -.16075   -.1440202
                  3  |  -.0361989   .0065067    -5.56   0.000    -.0492679   -.0231298
                  4  |  -.3008725   .0087636   -34.33   0.000    -.3184747   -.2832704
                  5  |  -.0889133   .0098285    -9.05   0.000    -.1086545   -.0691722
                  6  |  -.3926507   .0067294   -58.35   0.000    -.4061671   -.3791342
                  7  |  -.2418158   .0079279   -30.50   0.000    -.2577394   -.2258922
                  8  |  -.0944951   .0135196    -6.99   0.000      -.12165   -.0673402
                  9  |  -.3931421   .0043481   -90.42   0.000    -.4018756   -.3844087
                 10  |  -.3556774   .0086918   -40.92   0.000    -.3731354   -.3382194
                 11  |  -.2411127   .0082788   -29.12   0.000    -.2577412   -.2244841
                 12  |  -.3983431   .0076523   -52.06   0.000    -.4137133    -.382973
                     |
               unemp |  -.0082247   .0022211    -3.70   0.001    -.0126859   -.0037635
             citizen |  -.0412701   .0039738   -10.39   0.000    -.0492518   -.0332884
               _cons |   .7690988   .0422169    18.22   0.000     .6843038    .8538939
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen if female == 1, vce(c
> luster state)

Linear regression                               Number of obs     =    805,759
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5098
                                                Root MSE          =     .39343

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0926121   .0154556    -5.99   0.000    -.1236557   -.0615686
            treat_st |  -.0344589   .0109571    -3.14   0.003    -.0564669    -.012451
treat_sthisprelwhite |   .0248944   .0302588     0.82   0.415    -.0358821     .085671
                     |
               state |
                 NH  |   .0594682     .00397    14.98   0.000     .0514943    .0674421
                 VT  |   .0392161   .0017582    22.30   0.000     .0356846    .0427476
                 MA  |    .119218   .0079219    15.05   0.000     .1033065    .1351295
                 RI  |   .0459804     .00813     5.66   0.000     .0296508    .0623099
                 CT  |   .1325258   .0077844    17.02   0.000     .1168903    .1481612
                 NY  |   .0836974   .0081499    10.27   0.000     .0673279    .1000669
                 NJ  |   .1444608   .0090927    15.89   0.000     .1261975     .162724
                 PA  |  -.0242933   .0062643    -3.88   0.000    -.0368754   -.0117112
                 OH  |  -.0508237    .006166    -8.24   0.000    -.0632084    -.038439
                 IN  |  -.0483003    .005557    -8.69   0.000    -.0594618   -.0371389
                 IL  |   .0301012   .0079553     3.78   0.000     .0141226    .0460799
                 MI  |  -.0013154    .007272    -0.18   0.857    -.0159217    .0132909
                 WI  |   .0070683   .0049099     1.44   0.156    -.0027935      .01693
                 MN  |   .0601377   .0053133    11.32   0.000     .0494657    .0708098
                 IA  |  -.0159602   .0103104    -1.55   0.128    -.0366692    .0047489
                 MO  |  -.0747386   .0055805   -13.39   0.000    -.0859474   -.0635299
                 ND  |  -.0534133   .0098462    -5.42   0.000    -.0731899   -.0336367
                 SD  |  -.0705719   .0099871    -7.07   0.000    -.0906316   -.0505122
                 NE  |  -.0513355   .0103296    -4.97   0.000    -.0720831   -.0305879
                 KS  |  -.0519609   .0111674    -4.65   0.000    -.0743913   -.0295306
                 DE  |   .0394458   .0013516    29.18   0.000     .0367309    .0421606
                 MD  |   .1242187   .0083028    14.96   0.000      .107542    .1408954
                 DC  |   .2233796   .0128252    17.42   0.000     .1976194    .2491398
                 VA  |    .092292   .0120897     7.63   0.000     .0680092    .1165749
                 WV  |  -.1496959   .0027563   -54.31   0.000     -.155232   -.1441597
                 NC  |  -.0159329    .012402    -1.28   0.205    -.0408432    .0089773
                 SC  |  -.0627865   .0127263    -4.93   0.000    -.0883481   -.0372249
                 GA  |   .0006974   .0127525     0.05   0.957    -.0249169    .0263116
                 FL  |  -.0241084   .0135382    -1.78   0.081    -.0513007    .0030839
                 KY  |  -.0793537   .0045519   -17.43   0.000    -.0884964   -.0702109
                 TN  |  -.0683057   .0122673    -5.57   0.000    -.0929452   -.0436661
                 AL  |  -.0678536   .0122017    -5.56   0.000    -.0923613   -.0433458
                 MS  |  -.0955813   .0123553    -7.74   0.000    -.1203976   -.0707649
                 AR  |  -.1040665   .0114783    -9.07   0.000    -.1271215   -.0810116
                 LA  |  -.0734809   .0130299    -5.64   0.000    -.0996522   -.0473095
                 OK  |  -.1291173   .0086775   -14.88   0.000    -.1465467   -.1116879
                 TX  |  -.0085536   .0139255    -0.61   0.542    -.0365237    .0194165
                 MT  |  -.0669375   .0008987   -74.48   0.000    -.0687426   -.0651325
                 ID  |  -.0639236       .004   -15.98   0.000    -.0719578   -.0558894
                 WY  |    .012691   .0104965     1.21   0.232    -.0083918    .0337739
                 CO  |   .0291945   .0078868     3.70   0.001     .0133533    .0450357
                 NM  |  -.0596065   .0084987    -7.01   0.000    -.0766767   -.0425364
                 AZ  |   .0220859   .0136304     1.62   0.111    -.0052914    .0494633
                 UT  |  -.0318944   .0119972    -2.66   0.011    -.0559915   -.0077974
                 NV  |   .0983407   .0136763     7.19   0.000      .070871    .1258105
                 WA  |   .0846182   .0071241    11.88   0.000     .0703091    .0989273
                 OR  |   .0161394   .0069679     2.32   0.025     .0021438    .0301349
                 CA  |   .1383219   .0118227    11.70   0.000     .1145752    .1620685
                 AK  |   .1852568   .0054566    33.95   0.000      .174297    .1962167
                 HI  |   .0989436   .0060839    16.26   0.000     .0867238    .1111634
                     |
                year |
               1997  |   .0077466   .0029086     2.66   0.010     .0019044    .0135887
               1998  |   .0336183   .0030384    11.06   0.000     .0275154    .0397212
               1999  |   .0501241   .0039963    12.54   0.000     .0420973     .058151
               2000  |   .0602874   .0051171    11.78   0.000     .0500094    .0705655
               2001  |   .0761303   .0051585    14.76   0.000     .0657691    .0864916
               2002  |    .090926   .0053555    16.98   0.000     .0801692    .1016827
               2003  |   .0974428   .0060411    16.13   0.000     .0853088    .1095767
               2004  |   .0908558   .0049547    18.34   0.000     .0809041    .1008075
               2005  |   .0813759   .0047366    17.18   0.000     .0718621    .0908898
               2006  |   .0752361   .0047183    15.95   0.000     .0657592     .084713
               2007  |    .076359   .0051274    14.89   0.000     .0660604    .0866577
               2008  |   .0748261   .0062001    12.07   0.000     .0623728    .0872794
               2009  |   .1040357   .0086827    11.98   0.000     .0865959    .1214755
               2010  |   .1003671   .0082063    12.23   0.000     .0838842      .11685
               2011  |   .0802461   .0078015    10.29   0.000     .0645764    .0959159
               2012  |   .0650539   .0075441     8.62   0.000     .0499011    .0802068
               2013  |   .0609802   .0073496     8.30   0.000     .0462181    .0757423
               2014  |   .0572316   .0063219     9.05   0.000     .0445337    .0699296
               2015  |   .0733525   .0066942    10.96   0.000     .0599069    .0867981
               2016  |   .0856689   .0074953    11.43   0.000     .0706141    .1007236
               2017  |   .0891189   .0071711    12.43   0.000     .0747154    .1035224
               2018  |   .0941797    .007136    13.20   0.000     .0798467    .1085127
               2019  |   .1034019   .0073014    14.16   0.000     .0887367    .1180671
                     |
                nind |
                  2  |   .0347448   .0253554     1.37   0.177     -.016183    .0856725
                  3  |   .0885933   .0247371     3.58   0.001     .0389074    .1382792
                  4  |  -.1102068   .0256119    -4.30   0.000    -.1616498   -.0587638
                  5  |    .102395   .0253259     4.04   0.000     .0515264    .1532637
                  6  |   .0568215   .0266487     2.13   0.038      .003296    .1103471
                  7  |  -.0008068    .026461    -0.03   0.976    -.0539552    .0523417
                  8  |  -.0414502   .0263598    -1.57   0.122    -.0943954    .0114951
                  9  |  -.0998676    .028836    -3.46   0.001    -.1577864   -.0419488
                 10  |  -.0945167   .0266556    -3.55   0.001     -.148056   -.0409774
                 11  |   .0368986   .0276036     1.34   0.187    -.0185448     .092342
                     |
                educ |    .091356   .0029722    30.74   0.000     .0853863    .0973258
               exper |   .0519685   .0020792    24.99   0.000     .0477922    .0561448
              exper2 |  -.0014125    .000107   -13.20   0.000    -.0016275   -.0011975
              exper3 |    .000021   2.97e-06     7.08   0.000     .0000151     .000027
              exper4 |  -1.11e-07   2.91e-08    -3.82   0.000    -1.70e-07   -5.29e-08
                edex |  -.0009628   .0000719   -13.38   0.000    -.0011072   -.0008183
                     |
               ee_cl |
                  2  |  -.1305476   .0066349   -19.68   0.000    -.1438742    -.117221
                  3  |    -.16774   .0108069   -15.52   0.000    -.1894464   -.1460336
                  4  |  -.1752888   .0213984    -8.19   0.000    -.2182688   -.1323088
                  5  |  -.1407539   .0091886   -15.32   0.000    -.1592098   -.1222981
                  6  |  -.1921947   .0093338   -20.59   0.000    -.2109422   -.1734473
                  7  |  -.1867791   .0136495   -13.68   0.000    -.2141949   -.1593633
                  8  |  -.1002596   .0231348    -4.33   0.000    -.1467273   -.0537919
                  9  |  -.1633585   .0113268   -14.42   0.000    -.1861091    -.140608
                 10  |  -.2080478   .0100966   -20.61   0.000    -.2283274   -.1877682
                 11  |  -.1910344   .0135673   -14.08   0.000    -.2182851   -.1637838
                 12  |  -.1040001   .0232277    -4.48   0.000    -.1506544   -.0573458
                 13  |  -.1608128   .0128095   -12.55   0.000    -.1865413   -.1350842
                 14  |  -.1934434   .0090901   -21.28   0.000    -.2117014   -.1751854
                 15  |  -.1592296   .0140271   -11.35   0.000    -.1874038   -.1310554
                 16  |  -.0784597   .0262841    -2.99   0.004    -.1312529   -.0256665
                     |
                marr |   .0369749   .0020929    17.67   0.000     .0327713    .0411786
               partt |  -.1306246   .0034506   -37.86   0.000    -.1375554   -.1236938
              public |   .0495323     .00524     9.45   0.000     .0390075    .0600571
                cmsa |   .1491541   .0073635    20.26   0.000     .1343641    .1639442
                     |
               nocc2 |
                  2  |  -.1511794   .0036031   -41.96   0.000    -.1584164   -.1439423
                  3  |  -.0508996   .0060388    -8.43   0.000    -.0630288   -.0387703
                  4  |  -.3047959   .0049842   -61.15   0.000     -.314807   -.2947848
                  5  |   .0370956   .0062842     5.90   0.000     .0244735    .0497177
                  6  |  -.3505052   .0044833   -78.18   0.000    -.3595102   -.3415002
                  7  |   -.375237   .0050352   -74.52   0.000    -.3853506   -.3651235
                  8  |   -.175108   .0077159   -22.69   0.000    -.1906058   -.1596101
                  9  |  -.4153384   .0059026   -70.37   0.000    -.4271941   -.4034827
                 10  |  -.4469225   .0121953   -36.65   0.000    -.4714174   -.4224276
                 11  |  -.1963021   .0116395   -16.87   0.000    -.2196807   -.1729235
                 12  |  -.4212952   .0114552   -36.78   0.000    -.4443037   -.3982866
                     |
               unemp |   -.003145   .0013719    -2.29   0.026    -.0059005   -.0003895
             citizen |  -.0292635   .0036061    -8.11   0.000    -.0365066   -.0220204
               _cons |   .4429544   .0406168    10.91   0.000     .3613731    .5245357
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen if female == 0 & cove
> red == 0, vce(cluster state)

Linear regression                               Number of obs     =    708,498
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5445
                                                Root MSE          =     .41558

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1430648    .017763    -8.05   0.000    -.1787428   -.1073868
            treat_st |  -.0316585   .0166158    -1.91   0.062    -.0650323    .0017154
treat_sthisprelwhite |   .0356381   .0327325     1.09   0.281    -.0301071    .1013833
                     |
               state |
                 NH  |    .095663   .0047047    20.33   0.000     .0862133    .1051127
                 VT  |    .028469   .0023294    12.22   0.000     .0237903    .0331477
                 MA  |      .1406   .0085098    16.52   0.000     .1235076    .1576924
                 RI  |   .0538866   .0086703     6.22   0.000     .0364719    .0713013
                 CT  |    .151701   .0083101    18.26   0.000     .1350098    .1683923
                 NY  |   .0922992   .0090999    10.14   0.000     .0740216    .1105769
                 NJ  |    .173434   .0099081    17.50   0.000      .153533    .1933349
                 PA  |   .0209978   .0067581     3.11   0.003     .0074238    .0345718
                 OH  |  -.0099734   .0067005    -1.49   0.143    -.0234317    .0034848
                 IN  |   .0106139   .0067823     1.56   0.124    -.0030087    .0242365
                 IL  |   .0966494   .0092042    10.50   0.000     .0781623    .1151365
                 MI  |   .0449577   .0084765     5.30   0.000     .0279322    .0619831
                 WI  |   .0352099   .0055961     6.29   0.000     .0239697      .04645
                 MN  |    .071231    .005991    11.89   0.000     .0591978    .0832642
                 IA  |   .0223483   .0155254     1.44   0.156    -.0088353     .053532
                 MO  |  -.0201893   .0057826    -3.49   0.001     -.031804   -.0085746
                 ND  |   .0313455   .0154798     2.02   0.048     .0002534    .0624375
                 SD  |  -.0362426   .0151163    -2.40   0.020    -.0666047   -.0058806
                 NE  |  -.0149943   .0153737    -0.98   0.334    -.0458732    .0158847
                 KS  |   .0017707   .0164311     0.11   0.915    -.0312321    .0347734
                 DE  |   .0500985   .0024897    20.12   0.000     .0450977    .0550992
                 MD  |   .1622523   .0086585    18.74   0.000     .1448612    .1796433
                 DC  |   .2705412   .0127097    21.29   0.000      .245013    .2960694
                 VA  |   .1616512   .0166875     9.69   0.000     .1281334    .1951691
                 WV  |  -.0603616   .0044006   -13.72   0.000    -.0692005   -.0515227
                 NC  |   .0296053   .0177942     1.66   0.102    -.0061354    .0653461
                 SC  |   .0143451   .0181545     0.79   0.433    -.0221193    .0508095
                 GA  |   .0698044   .0180796     3.86   0.000     .0334904    .1061183
                 FL  |    .011968   .0186834     0.64   0.525    -.0255586    .0494946
                 KY  |  -.0314582   .0050997    -6.17   0.000    -.0417013   -.0212151
                 TN  |  -.0172591   .0176148    -0.98   0.332    -.0526395    .0181212
                 AL  |   .0220181   .0176116     1.25   0.217    -.0133559     .057392
                 MS  |  -.0014598   .0182044    -0.08   0.936    -.0380244    .0351047
                 AR  |  -.0510713   .0170038    -3.00   0.004    -.0852245   -.0169181
                 LA  |   .0551322   .0182268     3.02   0.004     .0185225    .0917418
                 OK  |   -.039931   .0120852    -3.30   0.002    -.0642049    -.015657
                 TX  |   .0594894   .0190003     3.13   0.003     .0213261    .0976526
                 MT  |  -.0302703   .0014502   -20.87   0.000    -.0331831   -.0273575
                 ID  |  -.0154565   .0052969    -2.92   0.005    -.0260957   -.0048173
                 WY  |   .1626584    .017305     9.40   0.000     .1279003    .1974165
                 CO  |   .0795894   .0083384     9.54   0.000     .0628412    .0963376
                 NM  |   .0295512   .0097771     3.02   0.004     .0099133    .0491891
                 AZ  |   .0627615   .0191112     3.28   0.002     .0243755    .1011474
                 UT  |   .0271266   .0167246     1.62   0.111    -.0064656    .0607189
                 NV  |   .1214724   .0190447     6.38   0.000     .0832201    .1597248
                 WA  |   .1268123   .0076686    16.54   0.000     .1114093    .1422152
                 OR  |   .0550659   .0078894     6.98   0.000     .0392196    .0709122
                 CA  |   .1528755   .0143445    10.66   0.000     .1240638    .1816873
                 AK  |    .227721   .0062248    36.58   0.000     .2152181     .240224
                 HI  |   .1534831   .0059962    25.60   0.000     .1414395    .1655268
                     |
                year |
               1997  |   .0093479   .0030605     3.05   0.004     .0032006    .0154951
               1998  |   .0331963    .004316     7.69   0.000     .0245274    .0418652
               1999  |   .0554995   .0052459    10.58   0.000     .0449627    .0660363
               2000  |   .0615996   .0063601     9.69   0.000     .0488249    .0743742
               2001  |   .0842916   .0059376    14.20   0.000     .0723655    .0962177
               2002  |   .1021732   .0051733    19.75   0.000     .0917823    .1125642
               2003  |   .0947615   .0058964    16.07   0.000     .0829182    .1066047
               2004  |   .0869218    .005213    16.67   0.000     .0764513    .0973924
               2005  |   .0719841   .0062607    11.50   0.000     .0594092    .0845591
               2006  |   .0686827   .0070853     9.69   0.000     .0544515    .0829139
               2007  |   .0700174   .0076569     9.14   0.000     .0546381    .0853967
               2008  |   .0745203   .0080103     9.30   0.000     .0584311    .0906095
               2009  |   .1169748   .0113096    10.34   0.000     .0942588    .1396908
               2010  |   .1059923    .010867     9.75   0.000     .0841652    .1278194
               2011  |   .0795645   .0101092     7.87   0.000     .0592596    .0998695
               2012  |   .0695905   .0100284     6.94   0.000     .0494477    .0897332
               2013  |   .0621494   .0087955     7.07   0.000     .0444831    .0798157
               2014  |   .0539852   .0083147     6.49   0.000     .0372847    .0706857
               2015  |   .0697711   .0081392     8.57   0.000     .0534231    .0861191
               2016  |   .0874851   .0093079     9.40   0.000     .0687895    .1061806
               2017  |   .0856476   .0092633     9.25   0.000     .0670416    .1042535
               2018  |   .0957804   .0097082     9.87   0.000      .076281    .1152798
               2019  |   .1116504   .0097358    11.47   0.000     .0920955    .1312053
                     |
                nind |
                  2  |    .002287   .0333277     0.07   0.946    -.0646536    .0692277
                  3  |   .0503127   .0281142     1.79   0.080    -.0061562    .1067817
                  4  |  -.1108965   .0317483    -3.49   0.001    -.1746647   -.0471282
                  5  |   .0470358   .0300945     1.56   0.124    -.0134107    .1074823
                  6  |   .0563158   .0313985     1.79   0.079      -.00675    .1193815
                  7  |  -.0347444   .0308147    -1.13   0.265    -.0966376    .0271488
                  8  |  -.0774107   .0306198    -2.53   0.015    -.1389123   -.0159091
                  9  |   -.112881   .0300693    -3.75   0.000    -.1732769   -.0524851
                 10  |  -.1194356   .0316801    -3.77   0.000    -.1830668   -.0558043
                 11  |   .0421299   .0305765     1.38   0.174    -.0192848    .1035446
                     |
                educ |   .0579938   .0019042    30.46   0.000     .0541691    .0618185
               exper |   .0438989   .0020347    21.58   0.000     .0398121    .0479856
              exper2 |  -.0008067    .000117    -6.90   0.000    -.0010416   -.0005717
              exper3 |   1.36e-06   3.40e-06     0.40   0.690    -5.46e-06    8.18e-06
              exper4 |   6.36e-08   3.43e-08     1.85   0.070    -5.30e-09    1.33e-07
                edex |  -.0005791   .0000655    -8.84   0.000    -.0007106   -.0004476
                     |
               ee_cl |
                  2  |  -.0492134   .0049716    -9.90   0.000    -.0591991   -.0392277
                  3  |  -.0555071   .0089116    -6.23   0.000    -.0734066   -.0376077
                  4  |   .0099025   .0179152     0.55   0.583    -.0260813    .0458863
                  5  |  -.1001151   .0060423   -16.57   0.000    -.1122514   -.0879789
                  6  |  -.0951788   .0065417   -14.55   0.000    -.1083181   -.0820394
                  7  |  -.0574891   .0107891    -5.33   0.000    -.0791597   -.0358185
                  8  |   .0922297   .0182468     5.05   0.000     .0555799    .1288795
                  9  |  -.1387177   .0075939   -18.27   0.000    -.1539705   -.1234648
                 10  |  -.1120118   .0080293   -13.95   0.000    -.1281392   -.0958844
                 11  |  -.0497279   .0114591    -4.34   0.000    -.0727442   -.0267117
                 12  |    .095698   .0179699     5.33   0.000     .0596045    .1317916
                 13  |  -.1182799   .0117246   -10.09   0.000    -.1418295   -.0947303
                 14  |   -.087439   .0083665   -10.45   0.000    -.1042436   -.0706343
                 15  |  -.0312381   .0114348    -2.73   0.009    -.0542055   -.0082706
                 16  |   .1021922   .0189447     5.39   0.000     .0641407    .1402438
                     |
                marr |   .1275512   .0028307    45.06   0.000     .1218655    .1332369
               partt |  -.1927499   .0067002   -28.77   0.000    -.2062076   -.1792921
              public |  -.0190074   .0059312    -3.20   0.002    -.0309205   -.0070942
                cmsa |    .132014   .0077143    17.11   0.000     .1165194    .1475087
                     |
               nocc2 |
                  2  |  -.1676202   .0047043   -35.63   0.000    -.1770691   -.1581713
                  3  |  -.0432931   .0061464    -7.04   0.000    -.0556384   -.0309477
                  4  |  -.3460928   .0079745   -43.40   0.000    -.3621102   -.3300755
                  5  |  -.0942764   .0103943    -9.07   0.000    -.1151539   -.0733988
                  6  |  -.4173273   .0065748   -63.47   0.000    -.4305332   -.4041214
                  7  |  -.2602893    .007769   -33.50   0.000    -.2758938   -.2446847
                  8  |  -.1044214   .0123492    -8.46   0.000    -.1292256   -.0796173
                  9  |  -.4383818   .0057271   -76.54   0.000    -.4498851   -.4268785
                 10  |  -.4036522   .0096943   -41.64   0.000    -.4231238   -.3841806
                 11  |  -.2809032   .0098067   -28.64   0.000    -.3006005   -.2612059
                 12  |  -.4450808   .0102106   -43.59   0.000    -.4655894   -.4245723
                     |
               unemp |  -.0087608   .0020945    -4.18   0.000    -.0129676   -.0045539
             citizen |  -.0339336   .0033969    -9.99   0.000    -.0407565   -.0271108
               _cons |   .8715664   .0338328    25.76   0.000     .8036112    .9395216
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen if female == 1 & cove
> red == 0, vce(cluster state)

Linear regression                               Number of obs     =    698,882
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5111
                                                Root MSE          =     .39418

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0995711   .0171347    -5.81   0.000    -.1339872    -.065155
            treat_st |  -.0278565   .0094827    -2.94   0.005    -.0469031     -.00881
treat_sthisprelwhite |    .020066   .0305455     0.66   0.514    -.0412865    .0814185
                     |
               state |
                 NH  |   .0599773   .0040459    14.82   0.000     .0518508    .0681038
                 VT  |   .0479247   .0017738    27.02   0.000     .0443618    .0514875
                 MA  |   .1122245   .0081192    13.82   0.000     .0959165    .1285324
                 RI  |   .0157477   .0084746     1.86   0.069     -.001274    .0327695
                 CT  |   .1176539   .0079757    14.75   0.000     .1016342    .1336737
                 NY  |   .0573394   .0085761     6.69   0.000     .0401139     .074565
                 NJ  |    .121827   .0095815    12.71   0.000     .1025819    .1410721
                 PA  |  -.0384932   .0064186    -6.00   0.000    -.0513853   -.0256012
                 OH  |   -.061835   .0062387    -9.91   0.000    -.0743657   -.0493043
                 IN  |  -.0524579   .0054008    -9.71   0.000    -.0633058   -.0416101
                 IL  |   .0258089   .0082496     3.13   0.003     .0092391    .0423787
                 MI  |  -.0255829    .007406    -3.45   0.001    -.0404582   -.0107075
                 WI  |   .0008202   .0049071     0.17   0.868     -.009036    .0106764
                 MN  |   .0529741   .0054744     9.68   0.000     .0419784    .0639698
                 IA  |  -.0257166   .0089858    -2.86   0.006     -.043765   -.0076682
                 MO  |  -.0722961   .0055756   -12.97   0.000    -.0834951   -.0610971
                 ND  |  -.0559999   .0085705    -6.53   0.000    -.0732142   -.0387856
                 SD  |  -.0689248   .0087409    -7.89   0.000    -.0864814   -.0513682
                 NE  |  -.0542848   .0091808    -5.91   0.000     -.072725   -.0358446
                 KS  |  -.0530431   .0099282    -5.34   0.000    -.0729845   -.0331016
                 DE  |   .0269971   .0013958    19.34   0.000     .0241935    .0298007
                 MD  |   .1192601   .0084623    14.09   0.000     .1022631    .1362571
                 DC  |   .2300869   .0129496    17.77   0.000     .2040769     .256097
                 VA  |   .0914764   .0111207     8.23   0.000     .0691399     .113813
                 WV  |  -.1587416   .0026354   -60.23   0.000     -.164035   -.1534483
                 NC  |  -.0115086   .0112352    -1.02   0.311    -.0340753    .0110581
                 SC  |  -.0559746   .0115077    -4.86   0.000    -.0790884   -.0328608
                 GA  |    .003454   .0116069     0.30   0.767    -.0198591    .0267672
                 FL  |  -.0282153   .0124378    -2.27   0.028    -.0531975   -.0032332
                 KY  |  -.0757418   .0045368   -16.70   0.000    -.0848541   -.0666294
                 TN  |  -.0695634   .0110421    -6.30   0.000    -.0917421   -.0473847
                 AL  |  -.0692382   .0109828    -6.30   0.000    -.0912978   -.0471785
                 MS  |  -.0905348   .0110388    -8.20   0.000    -.1127068   -.0683628
                 AR  |  -.1013914   .0101587    -9.98   0.000    -.1217958   -.0809871
                 LA  |  -.0745611   .0117881    -6.33   0.000    -.0982382   -.0508841
                 OK  |  -.1246429   .0080981   -15.39   0.000    -.1409084   -.1083774
                 TX  |  -.0060096   .0126273    -0.48   0.636    -.0313723    .0193532
                 MT  |  -.0635592   .0010375   -61.26   0.000    -.0656432   -.0614753
                 ID  |  -.0569762    .004135   -13.78   0.000    -.0652817   -.0486707
                 WY  |    .016814   .0091843     1.83   0.073    -.0016333    .0352613
                 CO  |   .0354385   .0080271     4.41   0.000     .0193155    .0515614
                 NM  |  -.0504803   .0092633    -5.45   0.000    -.0690862   -.0318743
                 AZ  |    .022609   .0123791     1.83   0.074    -.0022552    .0474732
                 UT  |  -.0320432   .0108706    -2.95   0.005    -.0538775    -.010209
                 NV  |   .0774076   .0122996     6.29   0.000     .0527032    .1021121
                 WA  |   .0822221   .0074672    11.01   0.000     .0672238    .0972204
                 OR  |   .0124032   .0073091     1.70   0.096    -.0022775     .027084
                 CA  |   .1191271    .012956     9.19   0.000     .0931042      .14515
                 AK  |   .1727592   .0057401    30.10   0.000     .1612298    .1842886
                 HI  |   .1017529   .0063311    16.07   0.000     .0890364    .1144693
                     |
                year |
               1997  |   .0099403   .0030986     3.21   0.002     .0037166    .0161639
               1998  |   .0389035   .0027254    14.27   0.000     .0334292    .0443777
               1999  |   .0570067   .0038497    14.81   0.000     .0492743    .0647391
               2000  |   .0700579   .0045517    15.39   0.000     .0609155    .0792003
               2001  |   .0855789   .0047881    17.87   0.000     .0759618    .0951961
               2002  |   .1005934   .0046852    21.47   0.000      .091183    .1100039
               2003  |   .1115487   .0054816    20.35   0.000     .1005385    .1225589
               2004  |   .1040234   .0047159    22.06   0.000     .0945512    .1134956
               2005  |   .0950109   .0044478    21.36   0.000     .0860772    .1039446
               2006  |   .0878502   .0043626    20.14   0.000     .0790876    .0966128
               2007  |   .0892496   .0046035    19.39   0.000     .0800033     .098496
               2008  |   .0880785   .0061153    14.40   0.000     .0757955    .1003615
               2009  |   .1173072   .0090923    12.90   0.000     .0990448    .1355695
               2010  |   .1128577   .0089742    12.58   0.000     .0948326    .1308828
               2011  |   .0937872   .0082118    11.42   0.000     .0772932    .1102812
               2012  |   .0798279    .007464    10.70   0.000      .064836    .0948197
               2013  |   .0746708   .0073317    10.18   0.000     .0599446    .0893969
               2014  |   .0730465   .0066596    10.97   0.000     .0596704    .0864227
               2015  |   .0882175   .0066915    13.18   0.000     .0747772    .1016577
               2016  |   .1011136   .0073143    13.82   0.000     .0864225    .1158047
               2017  |   .1067025   .0066937    15.94   0.000     .0932578    .1201473
               2018  |   .1121401   .0067713    16.56   0.000     .0985395    .1257406
               2019  |   .1227423   .0073246    16.76   0.000     .1080305    .1374541
                     |
                nind |
                  2  |   .0287261   .0241986     1.19   0.241    -.0198781    .0773304
                  3  |    .085311   .0242823     3.51   0.001     .0365386    .1340834
                  4  |  -.1092815   .0247562    -4.41   0.000    -.1590057   -.0595573
                  5  |   .0656844   .0254897     2.58   0.013     .0144868     .116882
                  6  |    .056574   .0262302     2.16   0.036      .003889    .1092589
                  7  |   .0026862   .0259436     0.10   0.918     -.049423    .0547954
                  8  |  -.0364528   .0257275    -1.42   0.163     -.088128    .0152224
                  9  |  -.1127579   .0269601    -4.18   0.000    -.1669088    -.058607
                 10  |  -.0923101   .0254918    -3.62   0.001    -.1435119   -.0411082
                 11  |   .0550954   .0295197     1.87   0.068    -.0041966    .1143874
                     |
                educ |   .0847334   .0026522    31.95   0.000     .0794064    .0900604
               exper |   .0503526   .0019222    26.19   0.000     .0464917    .0542136
              exper2 |  -.0013379   .0001075   -12.45   0.000    -.0015538    -.001122
              exper3 |    .000019   3.09e-06     6.14   0.000     .0000128    .0000252
              exper4 |  -9.03e-08   3.13e-08    -2.88   0.006    -1.53e-07   -2.74e-08
                edex |  -.0009655   .0000702   -13.75   0.000    -.0011065   -.0008244
                     |
               ee_cl |
                  2  |  -.1208005    .005952   -20.30   0.000    -.1327553   -.1088456
                  3  |  -.1494251   .0101457   -14.73   0.000    -.1698033   -.1290468
                  4  |  -.1416821    .020389    -6.95   0.000    -.1826347   -.1007295
                  5  |  -.1388946   .0090138   -15.41   0.000    -.1569993     -.12079
                  6  |  -.1792695    .008828   -20.31   0.000    -.1970012   -.1615379
                  7  |  -.1652776   .0131816   -12.54   0.000    -.1917537   -.1388015
                  8  |  -.0553125   .0221132    -2.50   0.016    -.0997281   -.0108968
                  9  |  -.1662731   .0098141   -16.94   0.000    -.1859853    -.146561
                 10  |  -.1937187   .0097605   -19.85   0.000    -.2133232   -.1741142
                 11  |  -.1660921    .013023   -12.75   0.000    -.1922496   -.1399346
                 12  |  -.0660956   .0216809    -3.05   0.004    -.1096429   -.0225482
                 13  |  -.1698781     .01171   -14.51   0.000    -.1933983   -.1463578
                 14  |  -.1788466   .0091733   -19.50   0.000    -.1972716   -.1604216
                 15  |  -.1328915   .0135393    -9.82   0.000     -.160086   -.1056969
                 16  |  -.0489453   .0247626    -1.98   0.054    -.0986825    .0007919
                     |
                marr |   .0419361   .0022274    18.83   0.000     .0374622      .04641
               partt |  -.1274472   .0028861   -44.16   0.000    -.1332441   -.1216503
              public |   .0056366   .0058026     0.97   0.336    -.0060183    .0172914
                cmsa |   .1510389   .0073141    20.65   0.000     .1363481    .1657298
                     |
               nocc2 |
                  2  |  -.1582381   .0035566   -44.49   0.000    -.1653817   -.1510945
                  3  |  -.0504563   .0063665    -7.93   0.000    -.0632437   -.0376689
                  4  |  -.3497065   .0050511   -69.23   0.000    -.3598519    -.339561
                  5  |   .0163576   .0076244     2.15   0.037     .0010436    .0316716
                  6  |  -.3649761   .0049375   -73.92   0.000    -.3748934   -.3550588
                  7  |  -.3915714    .005785   -67.69   0.000    -.4031909    -.379952
                  8  |  -.1870356     .00763   -24.51   0.000    -.2023609   -.1717103
                  9  |  -.4369382   .0064746   -67.48   0.000    -.4499429   -.4239336
                 10  |  -.4819152    .012765   -37.75   0.000    -.5075545   -.4562759
                 11  |  -.2630115   .0106464   -24.70   0.000    -.2843954   -.2416277
                 12  |   -.463996   .0142912   -32.47   0.000    -.4927007   -.4352914
                     |
               unemp |  -.0034807    .001448    -2.40   0.020    -.0063891   -.0005723
             citizen |  -.0275721   .0034787    -7.93   0.000    -.0345592    -.020585
               _cons |     .52495   .0380508    13.80   0.000     .4485227    .6013773
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen if female == 0 & cove
> red == 1, vce(cluster state)

Linear regression                               Number of obs     =    125,874
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3503
                                                Root MSE          =     .36001

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0820179   .0078726   -10.42   0.000    -.0978305   -.0662053
            treat_st |  -.0480654   .0318496    -1.51   0.138    -.1120373    .0159065
treat_sthisprelwhite |   .0273409   .0274348     1.00   0.324    -.0277634    .0824452
                     |
               state |
                 NH  |   .0529929   .0079852     6.64   0.000     .0369543    .0690316
                 VT  |   .0002332   .0051519     0.05   0.964    -.0101147    .0105812
                 MA  |   .1177114   .0103331    11.39   0.000     .0969568    .1384661
                 RI  |   .0688567   .0102939     6.69   0.000     .0481809    .0895325
                 CT  |   .1644507   .0100746    16.32   0.000     .1442153     .184686
                 NY  |     .14096   .0084263    16.73   0.000     .1240353    .1578847
                 NJ  |   .2145016   .0099106    21.64   0.000     .1945956    .2344077
                 PA  |   .0122616   .0075567     1.62   0.111    -.0029165    .0274396
                 OH  |   .0094489    .006972     1.36   0.181    -.0045548    .0234526
                 IN  |   .0325154   .0084882     3.83   0.000     .0154663    .0495646
                 IL  |    .124188   .0084241    14.74   0.000     .1072677    .1411082
                 MI  |   .0963203   .0087752    10.98   0.000     .0786947    .1139458
                 WI  |   .0466547   .0064035     7.29   0.000     .0337929    .0595166
                 MN  |   .0692618   .0082771     8.37   0.000     .0526367    .0858868
                 IA  |   .0172271   .0296665     0.58   0.564    -.0423598     .076814
                 MO  |   .0353626    .007874     4.49   0.000     .0195472     .051178
                 ND  |   .0263154   .0295635     0.89   0.378    -.0330645    .0856953
                 SD  |  -.0126286   .0294536    -0.43   0.670     -.071788    .0465308
                 NE  |  -.0074776   .0289221    -0.26   0.797    -.0655693    .0506142
                 KS  |   .0729632   .0303763     2.40   0.020     .0119506    .1339758
                 DE  |    .081317   .0028689    28.34   0.000     .0755547    .0870793
                 MD  |   .1487363   .0110782    13.43   0.000     .1264851    .1709874
                 DC  |    .258102   .0116413    22.17   0.000     .2347196    .2814843
                 VA  |   .1838376   .0302099     6.09   0.000     .1231592     .244516
                 WV  |  -.0230156   .0113855    -2.02   0.049     -.045884   -.0001472
                 NC  |    .050512   .0327876     1.54   0.130    -.0153438    .1163678
                 SC  |   .0050299   .0339482     0.15   0.883     -.063157    .0732169
                 GA  |   .0842706   .0332842     2.53   0.015     .0174173     .151124
                 FL  |   .0458588   .0330473     1.39   0.171    -.0205186    .1122362
                 KY  |  -.0207047   .0078206    -2.65   0.011    -.0364129   -.0049965
                 TN  |   .0217584   .0327613     0.66   0.510    -.0440446    .0875615
                 AL  |   .0348343   .0331258     1.05   0.298    -.0317008    .1013693
                 MS  |    .009033   .0349145     0.26   0.797    -.0610948    .0791608
                 AR  |  -.0029918    .032879    -0.09   0.928    -.0690313    .0630477
                 LA  |   .0670497   .0333867     2.01   0.050    -9.56e-06    .1341089
                 OK  |  -.0228869   .0199962    -1.14   0.258    -.0630505    .0172767
                 TX  |   .0627662    .032889     1.91   0.062    -.0032933    .1288256
                 MT  |   -.046075   .0041337   -11.15   0.000    -.0543779   -.0377721
                 ID  |  -.0053776   .0047921    -1.12   0.267    -.0150029    .0042477
                 WY  |   .1848408   .0346643     5.33   0.000     .1152155     .254466
                 CO  |   .0287778    .009444     3.05   0.004     .0098091    .0477466
                 NM  |  -.0180431   .0088837    -2.03   0.048    -.0358866   -.0001996
                 AZ  |   .0834217   .0339799     2.46   0.018     .0151711    .1516723
                 UT  |   .0269003    .031138     0.86   0.392    -.0356424    .0894429
                 NV  |   .1633434   .0354135     4.61   0.000     .0922133    .2344734
                 WA  |   .1238349   .0077781    15.92   0.000      .108212    .1394577
                 OR  |   .0437108   .0082371     5.31   0.000     .0271661    .0602555
                 CA  |   .1985689   .0106252    18.69   0.000     .1772275    .2199103
                 AK  |   .2269204    .008926    25.42   0.000     .2089921    .2448488
                 HI  |   .1145587   .0095836    11.95   0.000     .0953095    .1338078
                     |
                year |
               1997  |    .001927   .0049392     0.39   0.698    -.0079936    .0118476
               1998  |    .010995   .0066649     1.65   0.105    -.0023919    .0243819
               1999  |   .0185473   .0074824     2.48   0.017     .0035184    .0335761
               2000  |   .0201182    .007652     2.63   0.011     .0047488    .0354876
               2001  |   .0217448   .0082135     2.65   0.011     .0052475     .038242
               2002  |   .0331638   .0061371     5.40   0.000     .0208372    .0454905
               2003  |   .0449049   .0083429     5.38   0.000     .0281476    .0616621
               2004  |   .0381271   .0060174     6.34   0.000     .0260408    .0502134
               2005  |   .0333377   .0074724     4.46   0.000      .018329    .0483465
               2006  |   .0211441   .0103747     2.04   0.047     .0003058    .0419824
               2007  |   .0268685   .0114928     2.34   0.023     .0037845    .0499524
               2008  |     .02647   .0088681     2.98   0.004     .0086579     .044282
               2009  |   .0558423   .0114728     4.87   0.000     .0327984    .0788861
               2010  |   .0586395   .0124094     4.73   0.000     .0337144    .0835645
               2011  |   .0454529   .0115016     3.95   0.000     .0223514    .0685545
               2012  |   .0292323     .00994     2.94   0.005     .0092672    .0491975
               2013  |   .0222739   .0095189     2.34   0.023     .0031545    .0413932
               2014  |    .022191   .0109972     2.02   0.049     .0001024    .0442795
               2015  |   .0308049   .0106032     2.91   0.005     .0095078    .0521021
               2016  |   .0379676   .0122545     3.10   0.003     .0133536    .0625815
               2017  |   .0462702   .0121179     3.82   0.000     .0219307    .0706097
               2018  |   .0521101   .0128931     4.04   0.000     .0262135    .0780067
               2019  |   .0483163   .0127977     3.78   0.000     .0226114    .0740211
                     |
                nind |
                  2  |   .0467662   .0538023     0.87   0.389    -.0612988    .1548313
                  3  |  -.0836589   .0511464    -1.64   0.108    -.1863895    .0190718
                  4  |  -.2576396   .0548224    -4.70   0.000    -.3677536   -.1475256
                  5  |   .0599065   .0475834     1.26   0.214    -.0356677    .1554806
                  6  |  -.0994087   .0555514    -1.79   0.080    -.2109869    .0121695
                  7  |  -.0903586   .0478916    -1.89   0.065    -.1865517    .0058346
                  8  |  -.2000318   .0494701    -4.04   0.000    -.2993955   -.1006681
                  9  |   -.174698   .0489251    -3.57   0.001    -.2729668   -.0764291
                 10  |  -.1947843    .065784    -2.96   0.005    -.3269154   -.0626532
                 11  |   .0588231   .0522889     1.12   0.266    -.0462021    .1638484
                     |
                educ |    .077065   .0046244    16.66   0.000     .0677765    .0863534
               exper |   .0750903   .0031367    23.94   0.000     .0687901    .0813905
              exper2 |  -.0025964   .0002547   -10.20   0.000    -.0031079   -.0020849
              exper3 |   .0000511   8.06e-06     6.34   0.000     .0000349    .0000673
              exper4 |  -4.06e-07   8.38e-08    -4.85   0.000    -5.75e-07   -2.38e-07
                edex |  -.0009655   .0001083    -8.92   0.000     -.001183   -.0007479
                     |
               ee_cl |
                  2  |   .0400036   .0157292     2.54   0.014     .0084105    .0715967
                  3  |   .0226724   .0176862     1.28   0.206    -.0128513    .0581962
                  4  |   -.048882   .0300323    -1.63   0.110    -.1092037    .0114397
                  5  |  -.0064601    .024714    -0.26   0.795    -.0560996    .0431795
                  6  |    .004209   .0158448     0.27   0.792    -.0276162    .0360343
                  7  |   .0161863   .0211514     0.77   0.448    -.0262977    .0586702
                  8  |  -.0422696   .0284569    -1.49   0.144    -.0994269    .0148877
                  9  |  -.0214636   .0239284    -0.90   0.374    -.0695252    .0265981
                 10  |  -.0153382   .0194961    -0.79   0.435    -.0544973    .0238208
                 11  |   -.001733   .0236397    -0.07   0.942    -.0492148    .0457487
                 12  |   .0007653   .0316594     0.02   0.981    -.0628245    .0643552
                 13  |  -.0299821   .0241221    -1.24   0.220    -.0784328    .0184686
                 14  |    -.02308   .0209624    -1.10   0.276    -.0651843    .0190243
                 15  |  -.0117413    .023353    -0.50   0.617    -.0586473    .0351646
                 16  |   .0245484    .031031     0.79   0.433    -.0377792     .086876
                     |
                marr |   .0672033   .0038323    17.54   0.000     .0595059    .0749006
               partt |  -.0952522   .0137367    -6.93   0.000    -.1228432   -.0676612
              public |  -.0649669   .0070973    -9.15   0.000    -.0792223   -.0507115
                cmsa |   .1058565    .010608     9.98   0.000     .0845497    .1271633
                     |
               nocc2 |
                  2  |  -.0426531   .0097681    -4.37   0.000     -.062273   -.0230332
                  3  |  -.0186281   .0098536    -1.89   0.064    -.0384197    .0011635
                  4  |  -.0770076   .0133705    -5.76   0.000     -.103863   -.0501521
                  5  |   .0037701   .0172186     0.22   0.828    -.0308144    .0383546
                  6  |  -.2546578   .0091416   -27.86   0.000    -.2730193   -.2362964
                  7  |  -.2238532   .0142109   -15.75   0.000    -.2523967   -.1953097
                  8  |  -.0191383   .0446872    -0.43   0.670    -.1088951    .0706186
                  9  |  -.2206634    .011356   -19.43   0.000    -.2434726   -.1978542
                 10  |  -.1503278   .0092532   -16.25   0.000    -.1689133   -.1317422
                 11  |  -.0680598   .0085484    -7.96   0.000    -.0852297   -.0508898
                 12  |  -.1997383   .0097052   -20.58   0.000    -.2192317   -.1802449
                     |
               unemp |  -.0049523   .0032873    -1.51   0.138    -.0115551    .0016505
             citizen |  -.0421395   .0032098   -13.13   0.000    -.0485865   -.0356924
               _cons |   .5753325   .0741794     7.76   0.000     .4263387    .7243263
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen if female == 1 & cove
> red == 1, vce(cluster state)

Linear regression                               Number of obs     =    106,871
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4397
                                                Root MSE          =     .36255

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0571273   .0105398    -5.42   0.000     -.078297   -.0359576
            treat_st |  -.0566874   .0212854    -2.66   0.010    -.0994404   -.0139345
treat_sthisprelwhite |   .0776318   .0285285     2.72   0.009     .0203307     .134933
                     |
               state |
                 NH  |    .056774   .0058167     9.76   0.000     .0450907    .0684573
                 VT  |  -.0036657   .0026784    -1.37   0.177    -.0090453     .001714
                 MA  |   .1512881   .0089296    16.94   0.000     .1333525    .1692236
                 RI  |   .1765237   .0085871    20.56   0.000      .159276    .1937714
                 CT  |   .1959249   .0089551    21.88   0.000      .177938    .2139119
                 NY  |   .1406734   .0077453    18.16   0.000     .1251165    .1562302
                 NJ  |   .2428534   .0087503    27.75   0.000      .225278    .2604288
                 PA  |   .0532391   .0070023     7.60   0.000     .0391747    .0673036
                 OH  |   .0207445   .0073418     2.83   0.007     .0059982    .0354909
                 IN  |   .0210885   .0075275     2.80   0.007     .0059692    .0362078
                 IL  |   .0587343   .0075618     7.77   0.000     .0435461    .0739226
                 MI  |   .0945994    .008638    10.95   0.000     .0772494    .1119494
                 WI  |   .0497041   .0059233     8.39   0.000     .0378068    .0616013
                 MN  |   .0860288    .006708    12.82   0.000     .0725555    .0995022
                 IA  |   .0430339   .0199775     2.15   0.036     .0029079      .08316
                 MO  |  -.0515283   .0073018    -7.06   0.000    -.0661945   -.0368622
                 ND  |    .014187   .0194882     0.73   0.470    -.0249563    .0533302
                 SD  |  -.0355386   .0193918    -1.83   0.073    -.0744881     .003411
                 NE  |  -.0237798   .0191415    -1.24   0.220    -.0622267    .0146671
                 KS  |   .0066413   .0200076     0.33   0.741    -.0335452    .0468278
                 DE  |   .1492101   .0026112    57.14   0.000     .1439655    .1544548
                 MD  |   .1985231    .009787    20.28   0.000     .1788653    .2181809
                 DC  |   .2579825   .0112409    22.95   0.000     .2354044    .2805605
                 VA  |    .194575   .0207389     9.38   0.000     .1529196    .2362304
                 WV  |  -.0630499   .0043669   -14.44   0.000    -.0718212   -.0542787
                 NC  |   .0733389   .0214983     3.41   0.001     .0301583    .1165195
                 SC  |  -.0200175   .0223061    -0.90   0.374    -.0648207    .0247856
                 GA  |   .0643811   .0216696     2.97   0.005     .0208564    .1079058
                 FL  |   .0455274   .0216466     2.10   0.041     .0020488    .0890059
                 KY  |  -.0435277    .006403    -6.80   0.000    -.0563884    -.030667
                 TN  |   .0133477   .0211309     0.63   0.530    -.0290949    .0557904
                 AL  |  -.0391812    .021187    -1.85   0.070    -.0817365     .003374
                 MS  |  -.0358776   .0225362    -1.59   0.118    -.0811429    .0093877
                 AR  |  -.0387923   .0214746    -1.81   0.077    -.0819253    .0043407
                 LA  |   .0039868   .0222599     0.18   0.859    -.0407236    .0486971
                 OK  |  -.1088226   .0135944    -8.00   0.000    -.1361278   -.0815174
                 TX  |   .0428625   .0219709     1.95   0.057    -.0012673    .0869924
                 MT  |  -.0725369   .0031216   -23.24   0.000    -.0788069   -.0662669
                 ID  |   -.057877   .0040179   -14.40   0.000    -.0659471   -.0498069
                 WY  |   .0958025   .0206501     4.64   0.000     .0543255    .1372795
                 CO  |   .0271993   .0089949     3.02   0.004     .0091326    .0452661
                 NM  |  -.0416887   .0071571    -5.82   0.000    -.0560641   -.0273132
                 AZ  |   .0636392    .022925     2.78   0.008     .0175929    .1096855
                 UT  |   .0127682   .0211074     0.60   0.548    -.0296272    .0551637
                 NV  |   .1794348   .0250828     7.15   0.000     .1290545     .229815
                 WA  |   .0918413   .0079891    11.50   0.000     .0757947    .1078878
                 OR  |   .0293333   .0071078     4.13   0.000     .0150569    .0436097
                 CA  |   .2205565    .009073    24.31   0.000     .2023328    .2387802
                 AK  |   .2153691   .0055556    38.77   0.000     .2042103    .2265279
                 HI  |   .0809534   .0069202    11.70   0.000     .0670538     .094853
                     |
                year |
               1997  |  -.0025851    .008168    -0.32   0.753    -.0189911    .0138209
               1998  |   .0077855   .0083471     0.93   0.355    -.0089802    .0245512
               1999  |    .017144   .0096526     1.78   0.082    -.0022439    .0365319
               2000  |   .0069933   .0099079     0.71   0.484    -.0129072    .0268938
               2001  |   .0247095   .0100998     2.45   0.018     .0044234    .0449957
               2002  |   .0406011   .0094572     4.29   0.000     .0216058    .0595964
               2003  |   .0272764   .0094128     2.90   0.006     .0083703    .0461826
               2004  |    .026248   .0074801     3.51   0.001     .0112237    .0412723
               2005  |   .0152817   .0097443     1.57   0.123    -.0042903    .0348537
               2006  |    .016425   .0105356     1.56   0.125    -.0047364    .0375864
               2007  |   .0172134   .0106017     1.62   0.111    -.0040807    .0385076
               2008  |   .0112468   .0086238     1.30   0.198    -.0060747    .0285683
               2009  |   .0435991   .0096333     4.53   0.000       .02425    .0629482
               2010  |   .0481562   .0096479     4.99   0.000     .0287778    .0675346
               2011  |   .0194672   .0086734     2.24   0.029     .0020462    .0368882
               2012  |   .0027208   .0096921     0.28   0.780    -.0167463    .0221879
               2013  |   .0024102   .0095046     0.25   0.801    -.0166803    .0215007
               2014  |  -.0143457   .0101918    -1.41   0.165    -.0348166    .0061252
               2015  |   .0034726   .0078252     0.44   0.659    -.0122447    .0191899
               2016  |   .0160902   .0104833     1.53   0.131    -.0049662    .0371466
               2017  |   .0046489   .0128605     0.36   0.719    -.0211821      .03048
               2018  |   .0066456    .011931     0.56   0.580    -.0173185    .0306096
               2019  |   .0064293   .0128836     0.50   0.620    -.0194482    .0323068
                     |
                nind |
                  2  |   .0485744    .051068     0.95   0.346    -.0539987    .1511474
                  3  |   .0170689   .0457764     0.37   0.711    -.0748756    .1090135
                  4  |  -.2440201    .049398    -4.94   0.000    -.3432389   -.1448014
                  5  |   .1197444   .0440714     2.72   0.009     .0312244    .2082644
                  6  |  -.0568602   .0421763    -1.35   0.184    -.1415739    .0278534
                  7  |  -.1067622   .0430382    -2.48   0.017    -.1932071   -.0203174
                  8  |  -.1333437   .0477027    -2.80   0.007    -.2291575     -.03753
                  9  |  -.2028346   .0467567    -4.34   0.000    -.2967481   -.1089211
                 10  |  -.1436173   .0470806    -3.05   0.004    -.2381815   -.0490532
                 11  |  -.0113577   .0472364    -0.24   0.811    -.1062349    .0835194
                     |
                educ |   .1144245   .0059556    19.21   0.000     .1024623    .1263866
               exper |   .0569535   .0040587    14.03   0.000     .0488013    .0651057
              exper2 |  -.0018195   .0002258    -8.06   0.000     -.002273    -.001366
              exper3 |   .0000362   7.47e-06     4.85   0.000     .0000212    .0000512
              exper4 |  -2.87e-07   8.24e-08    -3.48   0.001    -4.53e-07   -1.22e-07
                edex |  -.0009301   .0001324    -7.02   0.000     -.001196   -.0006641
                     |
               ee_cl |
                  2  |  -.0690906   .0226869    -3.05   0.004    -.1146586   -.0235225
                  3  |  -.1241107   .0219175    -5.66   0.000    -.1681332   -.0800881
                  4  |  -.1976759    .039962    -4.95   0.000     -.277942   -.1174097
                  5  |  -.0237915   .0230271    -1.03   0.306    -.0700429    .0224598
                  6  |  -.1166873   .0229832    -5.08   0.000    -.1628503   -.0705243
                  7  |  -.1568081   .0246026    -6.37   0.000    -.2062238   -.1073924
                  8  |  -.1776272    .040182    -4.42   0.000    -.2583353   -.0969192
                  9  |  -.0190644   .0266838    -0.71   0.478    -.0726603    .0345315
                 10  |  -.1465727    .027121    -5.40   0.000    -.2010467   -.0920987
                 11  |  -.1802969   .0291809    -6.18   0.000    -.2389084   -.1216854
                 12  |  -.1636735   .0389061    -4.21   0.000    -.2418188   -.0855283
                 13  |  -.0375309   .0292135    -1.28   0.205    -.0962079    .0211461
                 14  |  -.1506257   .0274295    -5.49   0.000    -.2057196   -.0955318
                 15  |  -.1649487   .0314442    -5.25   0.000    -.2281061   -.1017912
                 16  |  -.1246057   .0419788    -2.97   0.005    -.2089226   -.0402888
                     |
                marr |    .006636   .0025702     2.58   0.013     .0014736    .0117984
               partt |  -.0693169   .0084437    -8.21   0.000    -.0862766   -.0523573
              public |    .010572   .0109619     0.96   0.339    -.0114456    .0325895
                cmsa |   .1083784    .009449    11.47   0.000     .0893996    .1273573
                     |
               nocc2 |
                  2  |   -.058252   .0117899    -4.94   0.000    -.0819328   -.0345713
                  3  |  -.0284311   .0117754    -2.41   0.019    -.0520825   -.0047796
                  4  |  -.1313751   .0107931   -12.17   0.000    -.1530537   -.1096966
                  5  |   .1368699   .0138864     9.86   0.000     .1089783    .1647616
                  6  |  -.2437188    .009733   -25.04   0.000    -.2632682   -.2241694
                  7  |  -.2687558   .0159398   -16.86   0.000    -.3007718   -.2367399
                  8  |  -.0923169   .0509627    -1.81   0.076    -.1946785    .0100447
                  9  |  -.2962412   .0162072   -18.28   0.000    -.3287945    -.263688
                 10  |  -.2649354   .0201353   -13.16   0.000    -.3053784   -.2244924
                 11  |   .0292349    .027063     1.08   0.285    -.0251227    .0835925
                 12  |  -.2582818   .0135731   -19.03   0.000    -.2855441   -.2310196
                     |
               unemp |  -.0020745   .0019168    -1.08   0.284    -.0059245    .0017756
             citizen |  -.0313334   .0041293    -7.59   0.000    -.0396273   -.0230396
               _cons |   .1599018   .0633127     2.53   0.015     .0327345    .2870691
--------------------------------------------------------------------------------------

. 
. ** RUST BELT ONLY BLACK-WHITE + WV, KY - IA
. keep if inrange(state, 31, 35) | inlist(state, 23, 41, 43) | inlist(state, 55, 61)
(2,305,190 observations deleted)

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper expe
> r2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 0, vce(cluster state) 
(sum of wgt is 2,898,944,040)

Linear regression                               Number of obs     =    292,705
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2306
                                                Root MSE          =     .36084

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0661052   .0109448     6.04   0.000     .0413463    .0908641
             treat_st |  -.0223839   .0063603    -3.52   0.007     -.036772   -.0079958
treat_stblackrelwhite |  -.0286323   .0129488    -2.21   0.054    -.0579246      .00066
                      |
                state |
                  OH  |  -.0115488   .0007178   -16.09   0.000    -.0131726   -.0099251
                  IN  |  -.0331954   .0029545   -11.24   0.000    -.0398789    -.026512
                  IL  |   .0219233   .0010603    20.68   0.000     .0195248    .0243218
                  MI  |   .0314015   .0025042    12.54   0.000     .0257366    .0370664
                  WI  |  -.0231604   .0031607    -7.33   0.000    -.0303103   -.0160105
                  MN  |   .0042325   .0016443     2.57   0.030     .0005129    .0079521
                  MO  |  -.0322695   .0008088   -39.90   0.000    -.0340993   -.0304398
                  WV  |  -.0387538   .0090155    -4.30   0.002    -.0591483   -.0183593
                  KY  |  -.0661496   .0034584   -19.13   0.000    -.0739731   -.0583262
                      |
                 year |
                1990  |  -.0044509   .0048187    -0.92   0.380    -.0153515    .0064497
                1991  |  -.0042271   .0046007    -0.92   0.382    -.0146346    .0061804
                1992  |  -.0115299   .0059636    -1.93   0.085    -.0250204    .0019607
                1993  |  -.0161952   .0061537    -2.63   0.027     -.030116   -.0022745
                1996  |  -.0318729   .0086131    -3.70   0.005     -.051357   -.0123888
                1997  |  -.0364404   .0081328    -4.48   0.002     -.054838   -.0180427
                1998  |   -.045344   .0085657    -5.29   0.000     -.064721    -.025967
                1999  |  -.0445431   .0072554    -6.14   0.000    -.0609559   -.0281303
                2000  |   -.050116   .0087074    -5.76   0.000    -.0698135   -.0304184
                2001  |  -.0535312   .0099673    -5.37   0.000    -.0760788   -.0309836
                2002  |  -.0591769   .0122108    -4.85   0.001    -.0867996   -.0315541
                2003  |  -.0638215   .0101865    -6.27   0.000    -.0868649   -.0407781
                2004  |   -.066785   .0106764    -6.26   0.000    -.0909367   -.0426333
                2005  |  -.0820412   .0106583    -7.70   0.000    -.1061519   -.0579305
                2006  |  -.0861812   .0127967    -6.73   0.000    -.1151293    -.057233
                2007  |  -.0849105   .0098139    -8.65   0.000    -.1071111   -.0627099
                2008  |  -.0768629   .0126498    -6.08   0.000    -.1054787   -.0482471
                2009  |   -.070472   .0083418    -8.45   0.000    -.0893426   -.0516015
                2010  |  -.0785712   .0086403    -9.09   0.000    -.0981169   -.0590254
                2011  |  -.0787911   .0076627   -10.28   0.000    -.0961253   -.0614569
                2012  |  -.0849632   .0081429   -10.43   0.000    -.1033837   -.0665426
                2013  |  -.0810499   .0080565   -10.06   0.000     -.099275   -.0628248
                2014  |  -.0846297    .009687    -8.74   0.000    -.1065432   -.0627162
                2015  |  -.0917715   .0086383   -10.62   0.000    -.1113126   -.0722304
                2016  |  -.0921568   .0098012    -9.40   0.000    -.1143287   -.0699849
                2017  |  -.0775809    .009111    -8.52   0.000    -.0981915   -.0569703
                2018  |  -.0789684   .0084553    -9.34   0.000    -.0980955   -.0598412
                2019  |  -.0884314   .0097715    -9.05   0.000    -.1105361   -.0663267
                      |
                 nind |
                   2  |   .1625817   .0271677     5.98   0.000      .101124    .2240394
                   3  |   .1154091   .0208517     5.53   0.000     .0682392     .162579
                   4  |   .0112256   .0197359     0.57   0.583    -.0334202    .0558714
                   5  |   .1816853   .0232707     7.81   0.000     .1290434    .2343272
                   6  |   .0028154   .0188724     0.15   0.885     -.039877    .0455078
                   7  |  -.0144467   .0187431    -0.77   0.461    -.0568466    .0279531
                   8  |   .0074477   .0229409     0.32   0.753    -.0444481    .0593435
                   9  |   .1417075   .0210949     6.72   0.000     .0939875    .1894275
                  10  |  -.0248677    .019463    -1.28   0.233    -.0688961    .0191608
                  11  |   .1143983   .0268169     4.27   0.002     .0537342    .1750624
                      |
                 educ |   .0119785   .0029717     4.03   0.003      .005256     .018701
                exper |   .0065347    .002024     3.23   0.010      .001956    .0111133
               exper2 |   .0001451   .0001031     1.41   0.193    -.0000881    .0003783
               exper3 |  -3.08e-06   3.48e-06    -0.89   0.398    -.0000109    4.78e-06
               exper4 |  -2.12e-08   3.78e-08    -0.56   0.588    -1.07e-07    6.43e-08
                 edex |  -.0002616    .000095    -2.75   0.022    -.0004766   -.0000467
                      |
                ee_cl |
                   2  |  -.0371756   .0076436    -4.86   0.001    -.0544666   -.0198847
                   3  |  -.0257225   .0087876    -2.93   0.017    -.0456014   -.0058435
                   4  |  -.0422373   .0155299    -2.72   0.024    -.0773684   -.0071062
                   5  |  -.0943711   .0131238    -7.19   0.000    -.1240591   -.0646831
                   6  |  -.0176421   .0084786    -2.08   0.067     -.036822    .0015379
                   7  |  -.0004916   .0103435    -0.05   0.963    -.0238902     .022907
                   8  |  -.0620808   .0176116    -3.53   0.006    -.1019209   -.0222407
                   9  |  -.0651082   .0132215    -4.92   0.001    -.0950172   -.0351992
                  10  |   .0082942   .0121896     0.68   0.513    -.0192805    .0358689
                  11  |  -.0044317   .0134597    -0.33   0.749    -.0348796    .0260163
                  12  |  -.0906734    .018479    -4.91   0.001    -.1324757    -.048871
                  13  |   .0199264   .0163702     1.22   0.254    -.0171056    .0569583
                  14  |   .0159233   .0121911     1.31   0.224    -.0116549    .0435015
                  15  |  -.0082806   .0139726    -0.59   0.568    -.0398888    .0233275
                  16  |  -.1039835    .020818    -4.99   0.001    -.1510771   -.0568898
                      |
                 marr |   .0200222   .0021714     9.22   0.000     .0151102    .0249342
                partt |  -.0709158   .0058955   -12.03   0.000    -.0842524   -.0575792
               public |   .2886053   .0307624     9.38   0.000     .2190158    .3581947
                 cmsa |   .0528745   .0102531     5.16   0.001     .0296803    .0760687
                      |
                nocc2 |
                   2  |   .0605937   .0036076    16.80   0.000     .0524328    .0687546
                   3  |   .0317911   .0031666    10.04   0.000     .0246278    .0389544
                   4  |   .2057399   .0065179    31.57   0.000     .1909953    .2204845
                   5  |   .1547611   .0081372    19.02   0.000     .1363534    .1731688
                   6  |   .1639441   .0049561    33.08   0.000     .1527326    .1751556
                   7  |   .0815683   .0034363    23.74   0.000      .073795    .0893417
                   8  |   .0851903   .0119622     7.12   0.000       .05813    .1122507
                   9  |   .1962488   .0078376    25.04   0.000     .1785188    .2139787
                  10  |   .2429921   .0086969    27.94   0.000     .2233184    .2626658
                  11  |   .2705889   .0110518    24.48   0.000     .2455881    .2955897
                  12  |   .2619115   .0119242    21.96   0.000     .2349371    .2888858
                      |
                unemp |  -.0020228   .0012793    -1.58   0.148    -.0049167    .0008711
                _cons |  -.2473594   .0374922    -6.60   0.000    -.3321726   -.1625462
---------------------------------------------------------------------------------------

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper expe
> r2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 1, vce(cluster state)
(sum of wgt is 2,842,234,791)

Linear regression                               Number of obs     =    292,654
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2837
                                                Root MSE          =     .30353

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0757688   .0112035     6.76   0.000     .0504247    .1011128
             treat_st |  -.0179941   .0122186    -1.47   0.175    -.0456344    .0096463
treat_stblackrelwhite |  -.0149536   .0192879    -0.78   0.458    -.0585859    .0286788
                      |
                state |
                  OH  |  -.0153891   .0008554   -17.99   0.000    -.0173242    -.013454
                  IN  |  -.0584521   .0033956   -17.21   0.000    -.0661334   -.0507708
                  IL  |  -.0094673   .0014536    -6.51   0.000    -.0127556   -.0061791
                  MI  |   .0322668    .002952    10.93   0.000     .0255889    .0389448
                  WI  |  -.0159125   .0034135    -4.66   0.001    -.0236343   -.0081907
                  MN  |   .0264958   .0034045     7.78   0.000     .0187942    .0341973
                  MO  |  -.0621357   .0008437   -73.64   0.000    -.0640444    -.060227
                  WV  |  -.0409138   .0058545    -6.99   0.000    -.0541575     -.02767
                  KY  |  -.0723916   .0032141   -22.52   0.000    -.0796624   -.0651208
                      |
                 year |
                1990  |  -.0038711   .0023362    -1.66   0.132     -.009156    .0014137
                1991  |  -.0035866   .0034862    -1.03   0.330    -.0114729    .0042998
                1992  |   .0002881    .002385     0.12   0.907    -.0051072    .0056834
                1993  |   .0003015   .0035735     0.08   0.935    -.0077823    .0083853
                1996  |  -.0057628   .0043903    -1.31   0.222    -.0156944    .0041688
                1997  |  -.0083975   .0063489    -1.32   0.219    -.0227597    .0059648
                1998  |  -.0147844   .0075761    -1.95   0.083    -.0319227    .0023539
                1999  |  -.0200584   .0059413    -3.38   0.008    -.0334986   -.0066183
                2000  |  -.0108631   .0055987    -1.94   0.084    -.0235284    .0018021
                2001  |  -.0113829   .0034484    -3.30   0.009    -.0191838    -.003582
                2002  |  -.0162403   .0056094    -2.90   0.018    -.0289295    -.003551
                2003  |  -.0214627   .0042084    -5.10   0.001    -.0309828   -.0119426
                2004  |  -.0257415   .0049056    -5.25   0.001    -.0368388   -.0146441
                2005  |  -.0302041   .0060229    -5.01   0.001    -.0438288   -.0165794
                2006  |  -.0326462   .0075107    -4.35   0.002    -.0496366   -.0156557
                2007  |  -.0350723   .0059071    -5.94   0.000    -.0484351   -.0217095
                2008  |  -.0296379    .003458    -8.57   0.000    -.0374605   -.0218153
                2009  |  -.0250265   .0073062    -3.43   0.008    -.0415542   -.0084987
                2010  |  -.0289258   .0078395    -3.69   0.005      -.04666   -.0111916
                2011  |  -.0236011   .0057639    -4.09   0.003      -.03664   -.0105623
                2012  |  -.0325721   .0018648   -17.47   0.000    -.0367906   -.0283536
                2013  |   -.032502   .0041516    -7.83   0.000    -.0418937   -.0231103
                2014  |  -.0360434   .0058413    -6.17   0.000    -.0492572   -.0228295
                2015  |  -.0406369   .0062618    -6.49   0.000    -.0548021   -.0264716
                2016  |  -.0384714   .0057582    -6.68   0.000    -.0514973   -.0254455
                2017  |   -.044756   .0066597    -6.72   0.000    -.0598213   -.0296908
                2018  |  -.0457113   .0066927    -6.83   0.000    -.0608513   -.0305714
                2019  |    -.04633   .0065723    -7.05   0.000    -.0611976   -.0314623
                      |
                 nind |
                   2  |   .0852739    .012604     6.77   0.000     .0567617    .1137861
                   3  |   .1015906   .0072499    14.01   0.000     .0851902    .1179909
                   4  |   .0722337   .0074905     9.64   0.000      .055289    .0891783
                   5  |   .2225136   .0164079    13.56   0.000     .1853964    .2596309
                   6  |    .050496   .0105606     4.78   0.001     .0266063    .0743858
                   7  |   .0378168   .0088392     4.28   0.002     .0178211    .0578124
                   8  |   .0491613   .0108289     4.54   0.001     .0246646    .0736579
                   9  |   .2033004   .0160413    12.67   0.000     .1670123    .2395884
                  10  |   .0271966   .0089874     3.03   0.014     .0068658    .0475275
                  11  |    .051366   .0284378     1.81   0.104    -.0129647    .1156967
                      |
                 educ |   .0183431   .0021389     8.58   0.000     .0135045    .0231818
                exper |   .0094491   .0020768     4.55   0.001      .004751    .0141471
               exper2 |  -.0003845   .0001548    -2.48   0.035    -.0007347   -.0000343
               exper3 |   9.70e-06   4.95e-06     1.96   0.082    -1.49e-06    .0000209
               exper4 |  -9.44e-08   5.21e-08    -1.81   0.103    -2.12e-07    2.35e-08
                 edex |  -.0001587   .0000661    -2.40   0.040    -.0003081   -9.21e-06
                      |
                ee_cl |
                   2  |  -.0448477   .0055878    -8.03   0.000    -.0574882   -.0322071
                   3  |  -.0765178   .0054731   -13.98   0.000     -.088899   -.0641367
                   4  |  -.1140457   .0105522   -10.81   0.000    -.1379163    -.090175
                   5  |  -.0419768   .0120083    -3.50   0.007    -.0691413   -.0148122
                   6  |  -.0424776   .0064941    -6.54   0.000    -.0571683   -.0277868
                   7  |   -.070437    .008141    -8.65   0.000    -.0888533   -.0520208
                   8  |  -.1015996    .010459    -9.71   0.000    -.1252595   -.0779397
                   9  |  -.0229603   .0125892    -1.82   0.101    -.0514391    .0055185
                  10  |  -.0393308   .0077102    -5.10   0.001    -.0567725   -.0218891
                  11  |  -.0643515   .0105192    -6.12   0.000    -.0881476   -.0405554
                  12  |  -.0902838   .0111711    -8.08   0.000    -.1155546    -.065013
                  13  |   .0147057   .0111454     1.32   0.220    -.0105068    .0399183
                  14  |  -.0347389   .0104655    -3.32   0.009    -.0584135   -.0110643
                  15  |  -.0608981    .010521    -5.79   0.000    -.0846982    -.037098
                  16  |  -.0885721   .0157643    -5.62   0.000    -.1242334   -.0529108
                      |
                 marr |  -.0011836   .0017821    -0.66   0.523    -.0052149    .0028477
                partt |  -.0648459   .0058459   -11.09   0.000    -.0780704   -.0516215
               public |   .3138694   .0264647    11.86   0.000     .2540021    .3737367
                 cmsa |   .0221837   .0044361     5.00   0.001     .0121485    .0322189
                      |
                nocc2 |
                   2  |   .0199537   .0024296     8.21   0.000     .0144575      .02545
                   3  |   .0280312   .0058906     4.76   0.001     .0147058    .0413566
                   4  |   .1799024   .0050504    35.62   0.000     .1684777    .1913272
                   5  |   .1456204   .0154987     9.40   0.000       .11056    .1806808
                   6  |   .0700452   .0045382    15.43   0.000      .059779    .0803114
                   7  |   .1018399   .0067977    14.98   0.000     .0864624    .1172173
                   8  |   .0666021   .0050525    13.18   0.000     .0551725    .0780317
                   9  |   .1186785   .0083694    14.18   0.000     .0997457    .1376113
                  10  |   .2359471   .0103355    22.83   0.000     .2125665    .2593277
                  11  |   .2580154   .0158066    16.32   0.000     .2222583    .2937725
                  12  |   .2159036   .0188319    11.46   0.000     .1733029    .2585043
                      |
                unemp |  -.0012225   .0017735    -0.69   0.508    -.0052343    .0027893
                _cons |  -.2926501   .0358465    -8.16   0.000    -.3737406   -.2115596
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 0, vce(cluster state) 
(sum of wgt is 2,902,766,793)

Linear regression                               Number of obs     =    293,193
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5104
                                                Root MSE          =     .39985

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1297721   .0121551   -10.68   0.000    -.1572688   -.1022754
             treat_st |  -.0351929   .0187074    -1.88   0.093    -.0775119    .0071261
treat_stblackrelwhite |  -.0253081   .0124081    -2.04   0.072    -.0533773     .002761
                      |
                state |
                  OH  |  -.0284561   .0012983   -21.92   0.000    -.0313929   -.0255192
                  IN  |  -.0079825   .0054013    -1.48   0.174    -.0202012    .0042361
                  IL  |   .0724325   .0015453    46.87   0.000     .0689368    .0759282
                  MI  |    .036986   .0057575     6.42   0.000     .0239617    .0500104
                  WI  |   .0075215    .004727     1.59   0.146    -.0031717    .0182146
                  MN  |   .0553681    .004249    13.03   0.000     .0457562      .06498
                  MO  |  -.0323952   .0007571   -42.79   0.000    -.0341079   -.0306824
                  WV  |  -.0526094   .0133435    -3.94   0.003    -.0827946   -.0224243
                  KY  |  -.0525441   .0062335    -8.43   0.000    -.0666453   -.0384428
                      |
                 year |
                1990  |  -.0070253   .0063104    -1.11   0.294    -.0213004    .0072499
                1991  |  -.0166396    .007095    -2.35   0.044    -.0326896   -.0005895
                1992  |  -.0151467   .0076848    -1.97   0.080     -.032531    .0022376
                1993  |  -.0255515    .007017    -3.64   0.005     -.041425    -.009678
                1996  |  -.0218125   .0091105    -2.39   0.040    -.0424218   -.0012032
                1997  |  -.0102534   .0083215    -1.23   0.249     -.029078    .0085712
                1998  |   .0060762   .0098155     0.62   0.551     -.016128    .0282804
                1999  |   .0323224   .0128843     2.51   0.033     .0031761    .0614688
                2000  |   .0421243   .0137781     3.06   0.014     .0109561    .0732926
                2001  |    .055753   .0134046     4.16   0.002     .0254297    .0860764
                2002  |   .0530887   .0114484     4.64   0.001     .0271906    .0789869
                2003  |   .0452416   .0114994     3.93   0.003     .0192281    .0712552
                2004  |   .0383485   .0118504     3.24   0.010     .0115411    .0651558
                2005  |   .0170661   .0121428     1.41   0.193    -.0104028    .0445351
                2006  |   .0046671   .0109396     0.43   0.680    -.0200798    .0294141
                2007  |   .0002368   .0144297     0.02   0.987    -.0324054    .0328791
                2008  |  -.0143959   .0152752    -0.94   0.371    -.0489508     .020159
                2009  |   .0216649   .0139596     1.55   0.155    -.0099139    .0532437
                2010  |   .0081129   .0184213     0.44   0.670    -.0335589    .0497848
                2011  |  -.0117053   .0131994    -0.89   0.398    -.0415645    .0181539
                2012  |   -.011053   .0131192    -0.84   0.421    -.0407308    .0186247
                2013  |  -.0156035   .0150353    -1.04   0.326    -.0496158    .0184087
                2014  |  -.0156086   .0114393    -1.36   0.206     -.041486    .0102688
                2015  |  -.0003217   .0119966    -0.03   0.979    -.0274599    .0268165
                2016  |   .0054618   .0137287     0.40   0.700    -.0255946    .0365183
                2017  |   .0170075   .0140705     1.21   0.258    -.0148221     .048837
                2018  |   .0265684   .0162893     1.63   0.137    -.0102807    .0634175
                2019  |   .0516038   .0166524     3.10   0.013     .0139334    .0892742
                      |
                 nind |
                   2  |   .1296064   .0474591     2.73   0.023     .0222465    .2369664
                   3  |    .117246   .0430305     2.72   0.023     .0199043    .2145877
                   4  |  -.0809831   .0441456    -1.83   0.100    -.1808474    .0188813
                   5  |   .1457339   .0413375     3.53   0.006     .0522219    .2392458
                   6  |   .0943717   .0430578     2.19   0.056    -.0030318    .1917752
                   7  |  -.0107703    .044365    -0.24   0.814     -.111131    .0895904
                   8  |  -.0399342   .0440554    -0.91   0.388    -.1395945     .059726
                   9  |  -.0385433   .0407082    -0.95   0.368    -.1306315     .053545
                  10  |  -.1087928    .043942    -2.48   0.035    -.2081965   -.0093892
                  11  |    .113998    .041768     2.73   0.023     .0195122    .2084837
                      |
                 educ |   .0660408   .0021913    30.14   0.000     .0610837     .070998
                exper |   .0420226   .0023472    17.90   0.000      .036713    .0473323
               exper2 |  -.0009007    .000128    -7.04   0.000    -.0011903   -.0006111
               exper3 |   5.98e-06   2.54e-06     2.35   0.043     2.32e-07    .0000117
               exper4 |   8.01e-10   2.26e-08     0.04   0.973    -5.04e-08    5.20e-08
                 edex |  -.0003339   .0000978    -3.41   0.008    -.0005551   -.0001127
                      |
                ee_cl |
                   2  |  -.0633044   .0065923    -9.60   0.000    -.0782172   -.0483916
                   3  |  -.0747199    .005392   -13.86   0.000    -.0869174   -.0625224
                   4  |  -.0342391   .0120865    -2.83   0.020    -.0615807   -.0068975
                   5  |   -.146713     .01174   -12.50   0.000    -.1732706   -.1201554
                   6  |  -.0833861   .0072655   -11.48   0.000    -.0998217   -.0669505
                   7  |  -.0624884   .0082533    -7.57   0.000    -.0811588   -.0438181
                   8  |   .0228369   .0096177     2.37   0.042     .0010802    .0445936
                   9  |    -.14745   .0137242   -10.74   0.000    -.1784963   -.1164036
                  10  |  -.0905795   .0088276   -10.26   0.000     -.110549   -.0706099
                  11  |  -.0550341   .0109412    -5.03   0.001    -.0797849   -.0302833
                  12  |   .0296958   .0120118     2.47   0.035     .0025233    .0568684
                  13  |  -.0519404   .0143368    -3.62   0.006    -.0843724   -.0195083
                  14  |  -.0717266   .0084735    -8.46   0.000    -.0908951   -.0525582
                  15  |  -.0515735   .0108674    -4.75   0.001    -.0761573   -.0269898
                  16  |   .0060559   .0152646     0.40   0.701    -.0284751    .0405869
                      |
                 marr |   .1242047   .0023888    52.00   0.000      .118801    .1296085
                partt |  -.2290437   .0080492   -28.46   0.000    -.2472523   -.2108351
               public |     .02865   .0110235     2.60   0.029     .0037131    .0535869
                 cmsa |   .1466356   .0178291     8.22   0.000     .1063034    .1869677
                      |
                nocc2 |
                   2  |   -.141726   .0070607   -20.07   0.000    -.1576984   -.1257535
                   3  |  -.0454918   .0070881    -6.42   0.000    -.0615262   -.0294574
                   4  |  -.3076535   .0154168   -19.96   0.000    -.3425288   -.2727782
                   5  |  -.0735571   .0133007    -5.53   0.000    -.1036453   -.0434689
                   6  |  -.3588703   .0108298   -33.14   0.000    -.3833691   -.3343715
                   7  |  -.2213627   .0077028   -28.74   0.000    -.2387876   -.2039377
                   8  |  -.1291632    .017407    -7.42   0.000    -.1685406   -.0897858
                   9  |  -.3931186   .0102503   -38.35   0.000    -.4163065   -.3699307
                  10  |  -.3218973   .0100224   -32.12   0.000    -.3445695    -.299225
                  11  |  -.2034017   .0089839   -22.64   0.000    -.2237248   -.1830787
                  12  |  -.3691087   .0119801   -30.81   0.000    -.3962096   -.3420079
                      |
                unemp |  -.0034604   .0033029    -1.05   0.322    -.0109321    .0040113
                _cons |   .6886428   .0536755    12.83   0.000     .5672202    .8100653
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 1, vce(cluster state)
(sum of wgt is 2,846,325,247)

Linear regression                               Number of obs     =    293,187
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5013
                                                Root MSE          =     .37792

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |     -.0583    .007762    -7.51   0.000    -.0758589    -.040741
             treat_st |  -.0234747   .0094835    -2.48   0.035    -.0449279   -.0020216
treat_stblackrelwhite |  -.0291427   .0063882    -4.56   0.001    -.0435937   -.0146917
                      |
                state |
                  OH  |   -.034551   .0009529   -36.26   0.000    -.0367066   -.0323955
                  IN  |  -.0374972   .0046184    -8.12   0.000    -.0479447   -.0270498
                  IL  |   .0295266   .0017723    16.66   0.000     .0255174    .0335359
                  MI  |   .0050573    .004435     1.14   0.284    -.0049753    .0150899
                  WI  |   .0195964   .0051674     3.79   0.004     .0079069     .031286
                  MN  |   .0845425   .0047397    17.84   0.000     .0738206    .0952644
                  MO  |  -.0515046   .0014689   -35.06   0.000    -.0548275   -.0481818
                  WV  |   -.122603   .0102996   -11.90   0.000    -.1459024   -.0993036
                  KY  |  -.0656051   .0052801   -12.42   0.000    -.0775496   -.0536606
                      |
                 year |
                1990  |  -.0128266   .0030392    -4.22   0.002    -.0197017   -.0059516
                1991  |  -.0104867   .0065309    -1.61   0.143    -.0252606    .0042872
                1992  |   .0058833   .0078071     0.75   0.470    -.0117775    .0235441
                1993  |   .0077878   .0069672     1.12   0.293     -.007973    .0235487
                1996  |   .0090837   .0076009     1.20   0.263    -.0081107    .0262781
                1997  |   .0219486   .0107757     2.04   0.072    -.0024276    .0463249
                1998  |   .0568778   .0102505     5.55   0.000     .0336895    .0800661
                1999  |   .0736962   .0105054     7.02   0.000     .0499313    .0974612
                2000  |   .0859996   .0122137     7.04   0.000     .0583703    .1136289
                2001  |   .0946712   .0106613     8.88   0.000     .0705537    .1187887
                2002  |   .0981573   .0091771    10.70   0.000     .0773972    .1189174
                2003  |   .1048495    .006514    16.10   0.000      .090114    .1195851
                2004  |   .0926503   .0099422     9.32   0.000     .0701596    .1151411
                2005  |   .0823946   .0085646     9.62   0.000     .0630202    .1017689
                2006  |   .0725225   .0081728     8.87   0.000     .0540344    .0910105
                2007  |   .0635677   .0095795     6.64   0.000     .0418974    .0852379
                2008  |   .0520442     .00798     6.52   0.000     .0339922    .0700962
                2009  |   .0572213   .0134963     4.24   0.002     .0266904    .0877521
                2010  |   .0536049   .0122887     4.36   0.002     .0258058    .0814039
                2011  |   .0447015    .007591     5.89   0.000     .0275295    .0618735
                2012  |   .0352632   .0069192     5.10   0.001     .0196109    .0509155
                2013  |   .0413436   .0078064     5.30   0.000     .0236844    .0590029
                2014  |   .0412191   .0068652     6.00   0.000      .025689    .0567492
                2015  |   .0536346   .0084781     6.33   0.000     .0344557    .0728135
                2016  |   .0678204   .0131489     5.16   0.001     .0380756    .0975652
                2017  |   .0801771   .0114568     7.00   0.000     .0542599    .1060942
                2018  |    .090899   .0144884     6.27   0.000      .058124     .123674
                2019  |   .1017445   .0099573    10.22   0.000     .0792196    .1242694
                      |
                 nind |
                   2  |    .126887   .0198189     6.40   0.000     .0820537    .1717204
                   3  |   .2025338   .0156476    12.94   0.000     .1671364    .2379312
                   4  |   -.039294   .0208567    -1.88   0.092    -.0864752    .0078872
                   5  |    .209277   .0172212    12.15   0.000       .17032     .248234
                   6  |   .1355499   .0167382     8.10   0.000     .0976854    .1734143
                   7  |   .0764067    .020248     3.77   0.004     .0306025    .1222108
                   8  |   .0468067   .0201914     2.32   0.046     .0011307    .0924828
                   9  |  -.0009898   .0141958    -0.07   0.946     -.033103    .0311234
                  10  |  -.0360406    .015736    -2.29   0.048    -.0716379   -.0004432
                  11  |   .1129804   .0191023     5.91   0.000     .0697679    .1561929
                      |
                 educ |   .0920737   .0022739    40.49   0.000     .0869297    .0972177
                exper |   .0430539   .0030464    14.13   0.000     .0361626    .0499453
               exper2 |  -.0015393   .0002105    -7.31   0.000    -.0020155    -.001063
               exper3 |   .0000248   6.55e-06     3.79   0.004       .00001    .0000397
               exper4 |  -1.38e-07   6.88e-08    -2.01   0.075    -2.94e-07    1.73e-08
                 edex |  -.0003231   .0001125    -2.87   0.018    -.0005776   -.0000685
                      |
                ee_cl |
                   2  |  -.1293142   .0101005   -12.80   0.000    -.1521631   -.1064654
                   3  |  -.1731694   .0103504   -16.73   0.000    -.1965837   -.1497551
                   4  |   -.186529   .0160645   -11.61   0.000    -.2228694   -.1501885
                   5  |  -.1548977   .0187267    -8.27   0.000    -.1972605   -.1125348
                   6  |  -.1634741   .0136657   -11.96   0.000    -.1943881   -.1325601
                   7  |  -.1765652   .0149793   -11.79   0.000    -.2104508   -.1426797
                   8  |  -.1259883   .0141859    -8.88   0.000     -.158079   -.0938977
                   9  |  -.1428552    .022001    -6.49   0.000    -.1926249   -.0930855
                  10  |   -.161378   .0170306    -9.48   0.000     -.199904   -.1228521
                  11  |  -.1689624   .0152477   -11.08   0.000     -.203455   -.1344698
                  12  |  -.1325652   .0116901   -11.34   0.000    -.1590101   -.1061204
                  13  |  -.0601502   .0285626    -2.11   0.064    -.1247632    .0044629
                  14  |  -.1388872   .0208625    -6.66   0.000    -.1860815   -.0916928
                  15  |   -.138735   .0181351    -7.65   0.000    -.1797594   -.0977106
                  16  |  -.1431242   .0131356   -10.90   0.000    -.1728391   -.1134093
                      |
                 marr |   .0415607   .0028893    14.38   0.000     .0350247    .0480967
                partt |  -.1477685   .0037465   -39.44   0.000    -.1562437   -.1392933
               public |   .0831115   .0068666    12.10   0.000     .0675783    .0986447
                 cmsa |   .1535523   .0163175     9.41   0.000     .1166395    .1904652
                      |
                nocc2 |
                   2  |  -.1228069    .008294   -14.81   0.000    -.1415692   -.1040447
                   3  |  -.0381435   .0133047    -2.87   0.019    -.0682409   -.0080462
                   4  |  -.2832115   .0080768   -35.06   0.000    -.3014824   -.2649405
                   5  |   .0672972   .0114979     5.85   0.000     .0412872    .0933071
                   6  |  -.3115059   .0097385   -31.99   0.000     -.333536   -.2894758
                   7  |  -.3380011   .0083239   -40.61   0.000    -.3568311   -.3191712
                   8  |  -.1584647   .0107996   -14.67   0.000     -.182895   -.1340344
                   9  |   -.389185   .0089877   -43.30   0.000    -.4095167   -.3688533
                  10  |  -.3851256   .0183179   -21.02   0.000    -.4265635   -.3436876
                  11  |  -.1182962   .0141285    -8.37   0.000    -.1502571   -.0863352
                  12  |  -.3575889   .0150093   -23.82   0.000    -.3915422   -.3236355
                      |
                unemp |   .0045424   .0031932     1.42   0.189    -.0026813     .011766
                _cons |    .234888   .0558246     4.21   0.002      .108604     .361172
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 0 & covered == 0, vce(cluster state)
(sum of wgt is 2,273,656,610)

Linear regression                               Number of obs     =    227,227
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5490
                                                Root MSE          =     .40357

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1530963   .0079597   -19.23   0.000    -.1711023   -.1350903
             treat_st |  -.0256324   .0145604    -1.76   0.112    -.0585703    .0073056
treat_stblackrelwhite |  -.0043113   .0099286    -0.43   0.674    -.0267713    .0181487
                      |
                state |
                  OH  |  -.0336341   .0012351   -27.23   0.000    -.0364282     -.03084
                  IN  |  -.0089796   .0048387    -1.86   0.096    -.0199255    .0019663
                  IL  |   .0590805   .0018761    31.49   0.000     .0548366    .0633244
                  MI  |   .0163207   .0053164     3.07   0.013     .0042942    .0283473
                  WI  |    .009127   .0045421     2.01   0.075    -.0011479     .019402
                  MN  |   .0518315   .0045943    11.28   0.000     .0414384    .0622246
                  MO  |  -.0382661   .0012801   -29.89   0.000    -.0411619   -.0353704
                  WV  |   -.056446   .0126644    -4.46   0.002    -.0850948   -.0277972
                  KY  |  -.0421794   .0060914    -6.92   0.000    -.0559592   -.0283997
                      |
                 year |
                1990  |  -.0019044   .0068798    -0.28   0.788    -.0174676    .0136587
                1991  |  -.0047345   .0090665    -0.52   0.614    -.0252442    .0157753
                1992  |   -.003593   .0096767    -0.37   0.719    -.0254833    .0182973
                1993  |  -.0174732   .0070763    -2.47   0.036     -.033481   -.0014655
                1996  |   -.012545   .0112264    -1.12   0.293    -.0379408    .0128508
                1997  |   .0013238   .0092648     0.14   0.890    -.0196346    .0222821
                1998  |   .0230858   .0109565     2.11   0.064    -.0016995    .0478711
                1999  |   .0514865   .0142642     3.61   0.006     .0192185    .0837544
                2000  |   .0624406   .0149101     4.19   0.002     .0287116    .0961697
                2001  |   .0839131    .014171     5.92   0.000      .051856    .1159701
                2002  |    .078692   .0104196     7.55   0.000     .0551212    .1022627
                2003  |   .0678631   .0132605     5.12   0.001     .0378657    .0978604
                2004  |    .062762   .0115125     5.45   0.000     .0367188    .0888051
                2005  |   .0437946   .0141608     3.09   0.013     .0117606    .0758285
                2006  |   .0283946   .0105518     2.69   0.025     .0045249    .0522644
                2007  |    .025996   .0140681     1.85   0.098    -.0058282    .0578202
                2008  |   .0083911   .0133878     0.63   0.546    -.0218942    .0386763
                2009  |   .0456468   .0160314     2.85   0.019     .0093813    .0819122
                2010  |   .0320662   .0177457     1.81   0.104    -.0080773    .0722098
                2011  |   .0114875   .0135798     0.85   0.420     -.019232    .0422071
                2012  |   .0135716   .0137662     0.99   0.350    -.0175697     .044713
                2013  |    .008283   .0139728     0.59   0.568    -.0233258    .0398917
                2014  |     .00836   .0089249     0.94   0.373    -.0118295    .0285495
                2015  |   .0284582   .0103898     2.74   0.023     .0049548    .0519616
                2016  |   .0343858   .0126918     2.71   0.024      .005675    .0630965
                2017  |   .0403977   .0149972     2.69   0.025     .0064718    .0743237
                2018  |    .050945   .0175781     2.90   0.018     .0111806    .0907093
                2019  |   .0798109   .0175104     4.56   0.001     .0401996    .1194222
                      |
                 nind |
                   2  |   .0695127   .0444814     1.56   0.153    -.0311112    .1701365
                   3  |   .1221225   .0397027     3.08   0.013     .0323087    .2119364
                   4  |   -.057296   .0421513    -1.36   0.207    -.1526488    .0380567
                   5  |   .1067325   .0381711     2.80   0.021     .0203834    .1930816
                   6  |   .1092124   .0404814     2.70   0.024     .0176372    .2007876
                   7  |   .0099132   .0425559     0.23   0.821     -.086355    .1061814
                   8  |  -.0143262    .042155    -0.34   0.742    -.1096875     .081035
                   9  |  -.0531995   .0364677    -1.46   0.179    -.1356952    .0292962
                  10  |  -.0872707   .0419586    -2.08   0.067    -.1821877    .0076463
                  11  |   .0762608   .0392997     1.94   0.084    -.0126413    .1651629
                      |
                 educ |   .0607236   .0021916    27.71   0.000      .055766    .0656813
                exper |   .0351683   .0024364    14.43   0.000     .0296568    .0406799
               exper2 |  -.0006401   .0001052    -6.08   0.000    -.0008781   -.0004021
               exper3 |  -2.95e-06   2.96e-06    -1.00   0.345    -9.65e-06    3.75e-06
               exper4 |   1.06e-07   3.92e-08     2.69   0.025     1.67e-08    1.94e-07
                 edex |  -.0001241    .000121    -1.03   0.332    -.0003978    .0001496
                      |
                ee_cl |
                   2  |  -.0612155   .0041603   -14.71   0.000    -.0706268   -.0518042
                   3  |   -.077597   .0055334   -14.02   0.000    -.0901144   -.0650796
                   4  |  -.0236782   .0125064    -1.89   0.091    -.0519696    .0046132
                   5  |  -.1326123   .0098597   -13.45   0.000    -.1549165    -.110308
                   6  |  -.0947871   .0076853   -12.33   0.000    -.1121725   -.0774017
                   7  |  -.0741655    .009122    -8.13   0.000     -.094801     -.05353
                   8  |   .0445139   .0114896     3.87   0.004     .0185225    .0705052
                   9  |  -.1553583   .0120477   -12.90   0.000    -.1826122   -.1281044
                  10  |   -.105731   .0077193   -13.70   0.000    -.1231933   -.0882687
                  11  |  -.0589982   .0111166    -5.31   0.000    -.0841458   -.0338507
                  12  |   .0531378   .0149411     3.56   0.006     .0193387    .0869369
                  13  |   -.065014   .0121598    -5.35   0.000    -.0925213   -.0375067
                  14  |  -.0737443       .006   -12.29   0.000    -.0873172   -.0601713
                  15  |  -.0436257   .0099887    -4.37   0.002    -.0662217   -.0210298
                  16  |   .0309111   .0196273     1.57   0.150    -.0134889     .075311
                      |
                 marr |   .1328786   .0028016    47.43   0.000     .1265409    .1392162
                partt |  -.2221198    .006609   -33.61   0.000    -.2370704   -.2071691
               public |   .0066809    .008893     0.75   0.472    -.0134365    .0267982
                 cmsa |    .140017   .0164235     8.53   0.000     .1028645    .1771696
                      |
                nocc2 |
                   2  |  -.1519596   .0065905   -23.06   0.000    -.1668684   -.1370509
                   3  |  -.0477406   .0084515    -5.65   0.000    -.0668591   -.0286221
                   4  |  -.3547205   .0159594   -22.23   0.000    -.3908233   -.3186178
                   5  |  -.0922868    .013411    -6.88   0.000    -.1226246    -.061949
                   6  |  -.3871092   .0106431   -36.37   0.000    -.4111855   -.3630329
                   7  |  -.2385252    .007363   -32.40   0.000    -.2551814   -.2218689
                   8  |  -.1393667   .0153743    -9.06   0.000    -.1741458   -.1045875
                   9  |  -.4403398   .0109202   -40.32   0.000     -.465043   -.4156367
                  10  |  -.3728238   .0088755   -42.01   0.000    -.3929015   -.3527461
                  11  |  -.2651353   .0092354   -28.71   0.000    -.2860272   -.2442434
                  12  |  -.4326204   .0126129   -34.30   0.000    -.4611528    -.404088
                      |
                unemp |  -.0032054   .0033657    -0.95   0.366    -.0108192    .0044083
                _cons |   .7699722   .0568317    13.55   0.000     .6414099    .8985344
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 1 & covered == 0, vce(cluster state)
(sum of wgt is 2,411,505,356)

Linear regression                               Number of obs     =    246,746
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5079
                                                Root MSE          =     .37735

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0827988   .0102391    -8.09   0.000    -.1059613   -.0596364
             treat_st |   -.019478   .0080871    -2.41   0.039    -.0377722   -.0011837
treat_stblackrelwhite |  -.0257328   .0082588    -3.12   0.012    -.0444156   -.0070501
                      |
                state |
                  OH  |  -.0332684   .0011072   -30.05   0.000    -.0357731   -.0307638
                  IN  |  -.0275742   .0045152    -6.11   0.000    -.0377884     -.01736
                  IL  |   .0385068   .0020159    19.10   0.000     .0339465     .043067
                  MI  |  -.0076237   .0046419    -1.64   0.135    -.0181244     .002877
                  WI  |   .0255393   .0051967     4.91   0.001     .0137836     .037295
                  MN  |   .0878989   .0047729    18.42   0.000     .0771018     .098696
                  MO  |  -.0376752   .0018817   -20.02   0.000    -.0419319   -.0334185
                  WV  |  -.1176599    .010444   -11.27   0.000     -.141286   -.0940338
                  KY  |  -.0499806    .005531    -9.04   0.000    -.0624927   -.0374685
                      |
                 year |
                1990  |  -.0126323   .0037104    -3.40   0.008    -.0210258   -.0042388
                1991  |  -.0044269   .0071777    -0.62   0.553     -.020664    .0118101
                1992  |   .0145507   .0091067     1.60   0.145    -.0060502    .0351516
                1993  |   .0117508     .00757     1.55   0.155    -.0053738    .0288754
                1996  |   .0116618   .0090589     1.29   0.230    -.0088309    .0321545
                1997  |   .0257316   .0125448     2.05   0.070    -.0026467      .05411
                1998  |    .064398   .0117656     5.47   0.000     .0377824    .0910137
                1999  |   .0845483   .0121332     6.97   0.000      .057101    .1119956
                2000  |   .0979815   .0135948     7.21   0.000     .0672279    .1287352
                2001  |   .1090986   .0138147     7.90   0.000     .0778477    .1403495
                2002  |   .1129224   .0109152    10.35   0.000     .0882306    .1376142
                2003  |   .1221064   .0086054    14.19   0.000     .1026397    .1415731
                2004  |   .1110284   .0132014     8.41   0.000     .0811647    .1408921
                2005  |   .1014548   .0088977    11.40   0.000     .0813269    .1215827
                2006  |   .0893104   .0108338     8.24   0.000     .0648026    .1138181
                2007  |   .0821801   .0100616     8.17   0.000     .0594191     .104941
                2008  |   .0725445   .0099234     7.31   0.000     .0500963    .0949927
                2009  |   .0763349   .0144988     5.26   0.001     .0435364    .1091334
                2010  |   .0717748    .014551     4.93   0.001     .0388582    .1046914
                2011  |   .0622136   .0085248     7.30   0.000     .0429292     .081498
                2012  |   .0537812   .0074869     7.18   0.000     .0368446    .0707178
                2013  |   .0580047    .009463     6.13   0.000     .0365979    .0794115
                2014  |   .0658567   .0096185     6.85   0.000     .0440982    .0876151
                2015  |   .0781488   .0101156     7.73   0.000     .0552656    .1010319
                2016  |   .0902954   .0147629     6.12   0.000     .0568993    .1236914
                2017  |   .1046599   .0135055     7.75   0.000     .0741084    .1352114
                2018  |   .1173929   .0153413     7.65   0.000     .0826885    .1520974
                2019  |   .1290519   .0112818    11.44   0.000     .1035307    .1545731
                      |
                 nind |
                   2  |   .1102402   .0162948     6.77   0.000     .0733787    .1471016
                   3  |   .1885642   .0125042    15.08   0.000     .1602777    .2168508
                   4  |  -.0385273    .019322    -1.99   0.077    -.0822367    .0051822
                   5  |   .1521222   .0151438    10.05   0.000     .1178645    .1863799
                   6  |   .1328743   .0148871     8.93   0.000     .0991974    .1665513
                   7  |   .0785396   .0184714     4.25   0.002     .0367545    .1203247
                   8  |   .0531632   .0178279     2.98   0.015     .0128337    .0934927
                   9  |  -.0231459   .0129557    -1.79   0.108    -.0524537    .0061618
                  10  |  -.0291031   .0133542    -2.18   0.057    -.0593124    .0011062
                  11  |   .1292224   .0163965     7.88   0.000      .092131    .1663137
                      |
                 educ |   .0868387   .0030966    28.04   0.000     .0798337    .0938437
                exper |   .0427054   .0031656    13.49   0.000     .0355443    .0498664
               exper2 |  -.0015111    .000209    -7.23   0.000    -.0019838   -.0010384
               exper3 |   .0000242   6.44e-06     3.76   0.004     9.66e-06    .0000388
               exper4 |  -1.28e-07   6.68e-08    -1.92   0.087    -2.79e-07    2.29e-08
                 edex |  -.0004047     .00011    -3.68   0.005    -.0006537   -.0001558
                      |
                ee_cl |
                   2  |  -.1191175   .0112126   -10.62   0.000    -.1444822   -.0937528
                   3  |  -.1578103   .0125994   -12.53   0.000     -.186312   -.1293085
                   4  |  -.1571058   .0215663    -7.28   0.000    -.2058922   -.1083194
                   5  |  -.1492293   .0189097    -7.89   0.000    -.1920061   -.1064525
                   6  |  -.1544685    .015745    -9.81   0.000    -.1900862   -.1188508
                   7  |  -.1574881   .0180814    -8.71   0.000    -.1983912   -.1165851
                   8  |   -.085526   .0198429    -4.31   0.002    -.1304137   -.0406383
                   9  |  -.1445151   .0218264    -6.62   0.000    -.1938898   -.0951405
                  10  |  -.1509428   .0197373    -7.65   0.000    -.1955917   -.1062939
                  11  |  -.1447165   .0183176    -7.90   0.000    -.1861539   -.1032792
                  12  |   -.097688   .0164116    -5.95   0.000    -.1348137   -.0605624
                  13  |   -.077396   .0277684    -2.79   0.021    -.1402126   -.0145794
                  14  |  -.1277326   .0233681    -5.47   0.000    -.1805949   -.0748702
                  15  |  -.1145043   .0220489    -5.19   0.001    -.1643824   -.0646261
                  16  |  -.1153302   .0188352    -6.12   0.000    -.1579384    -.072722
                      |
                 marr |   .0481379   .0028608    16.83   0.000     .0416662    .0546095
                partt |   -.143303   .0035622   -40.23   0.000    -.1513613   -.1352447
               public |   .0251817   .0091751     2.74   0.023     .0044261    .0459373
                 cmsa |   .1555749   .0159629     9.75   0.000     .1194644    .1916853
                      |
                nocc2 |
                   2  |  -.1299204   .0086298   -15.05   0.000    -.1494423   -.1103985
                   3  |  -.0373825   .0134927    -2.77   0.022    -.0679051   -.0068599
                   4  |  -.3406026   .0098004   -34.75   0.000    -.3627726   -.3184327
                   5  |    .049285   .0121518     4.06   0.003     .0217958    .0767743
                   6  |  -.3266889   .0094635   -34.52   0.000    -.3480968   -.3052811
                   7  |  -.3574145   .0081862   -43.66   0.000    -.3759329   -.3388961
                   8  |  -.1743058   .0116124   -15.01   0.000    -.2005749   -.1480367
                   9  |  -.4162546   .0089532   -46.49   0.000    -.4365082   -.3960011
                  10  |  -.4390167   .0169038   -25.97   0.000    -.4772558   -.4007776
                  11  |  -.2158881   .0157457   -13.71   0.000    -.2515074   -.1802689
                  12  |   -.407688   .0170249   -23.95   0.000     -.446201   -.3691749
                      |
                unemp |   .0044923   .0034609     1.30   0.227    -.0033369    .0123215
                _cons |   .2981746   .0659271     4.52   0.001     .1490372     .447312
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 0 & covered == 1, vce(cluster state)
(sum of wgt is 625,287,430)

Linear regression                               Number of obs     =     65,478
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3339
                                                Root MSE          =     .33789

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1103234   .0191502    -5.76   0.000    -.1536441   -.0670027
             treat_st |  -.0587625    .034164    -1.72   0.120    -.1360468    .0185218
treat_stblackrelwhite |    -.04543   .0251291    -1.81   0.104    -.1022759    .0114159
                      |
                state |
                  OH  |  -.0007246   .0021348    -0.34   0.742    -.0055538    .0041047
                  IN  |   .0176979   .0075939     2.33   0.045     .0005193    .0348765
                  IL  |   .0824757   .0021733    37.95   0.000     .0775593    .0873921
                  MI  |   .0864229   .0065081    13.28   0.000     .0717007    .1011452
                  WI  |   .0191242   .0042287     4.52   0.001     .0095581    .0286902
                  MN  |   .0584017   .0038128    15.32   0.000     .0497764    .0670269
                  MO  |   .0141653   .0021513     6.58   0.000     .0092986     .019032
                  WV  |  -.0097663   .0143666    -0.68   0.514    -.0422657    .0227331
                  KY  |  -.0253646   .0066608    -3.81   0.004    -.0404323   -.0102968
                      |
                 year |
                1990  |  -.0140659   .0093802    -1.50   0.168    -.0352853    .0071535
                1991  |  -.0348052   .0056028    -6.21   0.000    -.0474797   -.0221306
                1992  |  -.0306577   .0061075    -5.02   0.001     -.044474   -.0168415
                1993  |  -.0272312   .0072483    -3.76   0.005    -.0436279   -.0108344
                1996  |  -.0153882   .0093494    -1.65   0.134    -.0365379    .0057615
                1997  |  -.0103703   .0076581    -1.35   0.209    -.0276942    .0069536
                1998  |  -.0046584   .0093193    -0.50   0.629    -.0257402    .0164235
                1999  |   .0116532   .0101521     1.15   0.281    -.0113124    .0346187
                2000  |   .0228552   .0086102     2.65   0.026     .0033776    .0423329
                2001  |   .0129811   .0104002     1.25   0.243    -.0105458     .036508
                2002  |   .0253217   .0130052     1.95   0.083     -.004098    .0547414
                2003  |   .0293539   .0138372     2.12   0.063    -.0019479    .0606558
                2004  |   .0209486   .0114733     1.83   0.101    -.0050059    .0469031
                2005  |   .0075749   .0098549     0.77   0.462    -.0147185    .0298684
                2006  |    .008703   .0111584     0.78   0.455    -.0165391    .0339451
                2007  |  -.0072524   .0152215    -0.48   0.645    -.0416859    .0271811
                2008  |  -.0156951   .0140762    -1.12   0.294    -.0475377    .0161475
                2009  |   .0163517   .0173181     0.94   0.370    -.0228245    .0555278
                2010  |   .0163282   .0174192     0.94   0.373    -.0230768    .0557332
                2011  |  -.0055787   .0110163    -0.51   0.625    -.0304994     .019342
                2012  |  -.0046213   .0192915    -0.24   0.816    -.0482618    .0390192
                2013  |  -.0092471    .013585    -0.68   0.513    -.0399786    .0214843
                2014  |  -.0093261   .0212635    -0.44   0.671    -.0574276    .0387753
                2015  |   -.009896   .0174965    -0.57   0.585    -.0494759    .0296839
                2016  |    -.00639   .0206807    -0.31   0.764    -.0531729    .0403929
                2017  |   .0155445   .0175389     0.89   0.399    -.0241312    .0552203
                2018  |    .022068   .0157673     1.40   0.195    -.0136001     .057736
                2019  |   .0368235   .0193612     1.90   0.090    -.0069746    .0806215
                      |
                 nind |
                   2  |   .0589671   .0406802     1.45   0.181    -.0330579    .1509921
                   3  |  -.0927704   .0374539    -2.48   0.035    -.1774971   -.0080438
                   4  |  -.2602336   .0436502    -5.96   0.000    -.3589773   -.1614899
                   5  |   .0283484    .040942     0.69   0.506    -.0642688    .1209656
                   6  |  -.1426369   .0415513    -3.43   0.007    -.2366324   -.0486415
                   7  |  -.1555247   .0383412    -4.06   0.003    -.2422584    -.068791
                   8  |  -.2305263   .0430458    -5.36   0.000    -.3279026     -.13315
                   9  |  -.1497663   .0456257    -3.28   0.009    -.2529787   -.0465538
                  10  |  -.2071262   .0575581    -3.60   0.006    -.3373317   -.0769207
                  11  |   .0473386   .0408819     1.16   0.277    -.0451427    .1398198
                      |
                 educ |   .0684076   .0089987     7.60   0.000     .0480511    .0887642
                exper |   .0694818   .0034617    20.07   0.000     .0616508    .0773128
               exper2 |  -.0026172   .0003636    -7.20   0.000    -.0034398   -.0017946
               exper3 |   .0000562   .0000102     5.52   0.000     .0000332    .0000792
               exper4 |  -4.80e-07   9.64e-08    -4.98   0.001    -6.98e-07   -2.62e-07
                 edex |  -.0007873    .000232    -3.39   0.008    -.0013121   -.0002625
                      |
                ee_cl |
                   2  |   .0751542   .0368746     2.04   0.072    -.0082618    .1585703
                   3  |   .0650043   .0368814     1.76   0.112    -.0184272    .1484359
                   4  |   .0018525   .0489103     0.04   0.971    -.1087903    .1124952
                   5  |   .0116718   .0457943     0.25   0.805    -.0919221    .1152656
                   6  |   .0641148   .0325871     1.97   0.081    -.0096025     .137832
                   7  |   .0652867   .0439041     1.49   0.171    -.0340313    .1646046
                   8  |   .0107534   .0454212     0.24   0.818    -.0919965    .1135034
                   9  |   .0464074   .0481347     0.96   0.360    -.0624809    .1552957
                  10  |    .048238   .0408171     1.18   0.268    -.0440968    .1405727
                  11  |   .0670132    .042126     1.59   0.146    -.0282824    .1623089
                  12  |   .0665032   .0465604     1.43   0.187    -.0388237    .1718301
                  13  |   .0512325   .0436939     1.17   0.271    -.0476098    .1500749
                  14  |   .0358156   .0415218     0.86   0.411    -.0581133    .1297444
                  15  |   .0558792   .0464781     1.20   0.260    -.0492616    .1610201
                  16  |   .0671984   .0427137     1.57   0.150    -.0294267    .1638234
                      |
                 marr |   .0614199   .0047929    12.81   0.000     .0505776    .0722621
                partt |  -.1380357   .0212082    -6.51   0.000    -.1860121   -.0900593
               public |  -.0556772   .0131587    -4.23   0.002    -.0854442   -.0259101
                 cmsa |   .1087523   .0152025     7.15   0.000     .0743619    .1431427
                      |
                nocc2 |
                   2  |   .0000542   .0201407     0.00   0.998    -.0455072    .0456156
                   3  |   .0074825   .0194699     0.38   0.710    -.0365616    .0515266
                   4  |  -.0470576   .0161563    -2.91   0.017    -.0836057   -.0105095
                   5  |   .0163772   .0205407     0.80   0.446    -.0300891    .0628435
                   6  |  -.2055331   .0096415   -21.32   0.000    -.2273438   -.1837225
                   7  |  -.1877038   .0178699   -10.50   0.000    -.2281284   -.1472792
                   8  |  -.1152569   .0494048    -2.33   0.045    -.2270183   -.0034954
                   9  |   -.223676   .0100228   -22.32   0.000    -.2463491   -.2010028
                  10  |  -.1349833   .0160499    -8.41   0.000    -.1712906   -.0986759
                  11  |  -.0409683    .017045    -2.40   0.040    -.0795267   -.0024099
                  12  |  -.1846323   .0159588   -11.57   0.000    -.2207336   -.1485309
                      |
                unemp |  -.0041001   .0031554    -1.30   0.226    -.0112382     .003038
                _cons |    .641055   .0880291     7.28   0.000     .4419195    .8401906
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper
> 2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp [aw = finalwt1] if female =
> = 1 & covered == 1, vce(cluster state)
(sum of wgt is 430,729,435)

Linear regression                               Number of obs     =     45,908
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4311
                                                Root MSE          =     .35073

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0191327    .007025    -2.72   0.023    -.0350243   -.0032411
             treat_st |  -.0432225   .0193332    -2.24   0.052    -.0869572    .0005122
treat_stblackrelwhite |   .0065157   .0317886     0.20   0.842    -.0653951    .0784265
                      |
                state |
                  OH  |  -.0239943   .0016205   -14.81   0.000    -.0276602   -.0203284
                  IN  |  -.0442851   .0062237    -7.12   0.000    -.0583641   -.0302061
                  IL  |   -.007944   .0021155    -3.76   0.005    -.0127297   -.0031584
                  MI  |   .0395718   .0073759     5.36   0.000     .0228863    .0562573
                  WI  |   .0043034   .0037128     1.16   0.276    -.0040956    .0127024
                  MN  |   .0598306   .0057194    10.46   0.000     .0468924    .0727688
                  MO  |  -.0823021   .0018095   -45.48   0.000    -.0863954   -.0782087
                  WV  |   -.105711    .010749    -9.83   0.000    -.1300269    -.081395
                  KY  |  -.0790386   .0048032   -16.46   0.000    -.0899043   -.0681729
                      |
                 year |
                1990  |  -.0056386   .0059006    -0.96   0.364    -.0189868    .0077095
                1991  |  -.0336961   .0099064    -3.40   0.008    -.0561059   -.0112862
                1992  |  -.0256612   .0108856    -2.36   0.043    -.0502861   -.0010362
                1993  |  -.0060128   .0143435    -0.42   0.685    -.0384601    .0264345
                1996  |   .0087253   .0090124     0.97   0.358    -.0116621    .0291128
                1997  |    .016809   .0118161     1.42   0.189    -.0099209    .0435389
                1998  |   .0381152   .0090776     4.20   0.002     .0175803    .0586501
                1999  |   .0443277   .0085196     5.20   0.001     .0250549    .0636004
                2000  |   .0344058   .0133012     2.59   0.029     .0043163    .0644953
                2001  |   .0348716   .0142067     2.45   0.036     .0027339    .0670094
                2002  |   .0431616   .0086941     4.96   0.001     .0234942    .0628289
                2003  |   .0430699   .0125983     3.42   0.008     .0145706    .0715693
                2004  |    .028909   .0093358     3.10   0.013     .0077901     .050028
                2005  |   .0160839   .0131442     1.22   0.252    -.0136503    .0458181
                2006  |   .0178165   .0152082     1.17   0.271    -.0165869    .0522198
                2007  |   .0095776   .0175284     0.55   0.598    -.0300745    .0492296
                2008  |   -.020663   .0187482    -1.10   0.299    -.0630744    .0217484
                2009  |   .0010568   .0230199     0.05   0.964    -.0510178    .0531314
                2010  |   .0061736   .0189208     0.33   0.752    -.0366283    .0489755
                2011  |   -.007711   .0202108    -0.38   0.712    -.0534311    .0380091
                2012  |   -.020276   .0186563    -1.09   0.305    -.0624794    .0219274
                2013  |   .0063117   .0192778     0.33   0.751    -.0372977     .049921
                2014  |  -.0430624   .0191637    -2.25   0.051    -.0864137    .0002889
                2015  |  -.0285676   .0096474    -2.96   0.016    -.0503916   -.0067437
                2016  |  -.0045538   .0127871    -0.36   0.730    -.0334801    .0243725
                2017  |  -.0081869   .0166057    -0.49   0.634    -.0457516    .0293778
                2018  |   -.004316   .0103306    -0.42   0.686    -.0276854    .0190535
                2019  |   .0001052   .0078628     0.01   0.990    -.0176816     .017892
                      |
                 nind |
                   2  |  -.0728038   .0623508    -1.17   0.273    -.2138511    .0682435
                   3  |  -.0873515   .0442323    -1.97   0.080    -.1874119     .012709
                   4  |  -.4233982   .0542661    -7.80   0.000    -.5461567   -.3006397
                   5  |  -.0140655    .047257    -0.30   0.773    -.1209683    .0928373
                   6  |  -.2146905   .0470689    -4.56   0.001    -.3211678   -.1082133
                   7  |  -.2631888   .0428211    -6.15   0.000    -.3600568   -.1663208
                   8  |  -.3010314   .0450829    -6.68   0.000     -.403016   -.1990468
                   9  |  -.3390905   .0448998    -7.55   0.000     -.440661     -.23752
                  10  |  -.3619091   .0475019    -7.62   0.000    -.4693659   -.2544523
                  11  |  -.1625141   .0411014    -3.95   0.003    -.2554919   -.0695363
                      |
                 educ |   .1069265   .0049497    21.60   0.000     .0957294    .1181235
                exper |   .0476012   .0027497    17.31   0.000     .0413809    .0538215
               exper2 |    -.00164   .0002216    -7.40   0.000    -.0021412   -.0011387
               exper3 |   .0000303   8.70e-06     3.48   0.007     .0000106      .00005
               exper4 |  -2.30e-07   9.93e-08    -2.31   0.046    -4.54e-07   -4.95e-09
                 edex |  -.0003767   .0001642    -2.29   0.047    -.0007482   -5.16e-06
                      |
                ee_cl |
                   2  |  -.0907316   .0196101    -4.63   0.001    -.1350928   -.0463705
                   3  |  -.1359775    .021555    -6.31   0.000    -.1847384   -.0872166
                   4  |  -.2053724   .0280115    -7.33   0.000    -.2687388   -.1420059
                   5  |  -.0791929   .0300089    -2.64   0.027    -.1470778   -.0113079
                   6  |  -.1165918   .0193617    -6.02   0.000    -.1603911   -.0727925
                   7  |  -.1664808   .0253276    -6.57   0.000    -.2237759   -.1091857
                   8  |  -.1984547   .0330546    -6.00   0.000    -.2732293   -.1236801
                   9  |   -.084526   .0249129    -3.39   0.008     -.140883   -.0281691
                  10  |  -.1403534    .031821    -4.41   0.002    -.2123375   -.0683693
                  11  |  -.1902881   .0294398    -6.46   0.000    -.2568856   -.1236907
                  12  |  -.1925436    .035288    -5.46   0.000    -.2723707   -.1127166
                  13  |  -.0114821   .0322334    -0.36   0.730    -.0843992     .061435
                  14  |  -.1403386   .0275261    -5.10   0.001     -.202607   -.0780702
                  15  |  -.1610324   .0354416    -4.54   0.001    -.2412068   -.0808581
                  16  |  -.1746631   .0372066    -4.69   0.001    -.2588302    -.090496
                      |
                 marr |   .0070255   .0047535     1.48   0.174    -.0037276    .0177787
                partt |  -.0687483   .0129478    -5.31   0.000    -.0980382   -.0394584
               public |   .0489819    .010603     4.62   0.001     .0249963    .0729676
                 cmsa |   .1175644   .0165215     7.12   0.000     .0801902    .1549386
                      |
                nocc2 |
                   2  |  -.0146841   .0189018    -0.78   0.457    -.0574429    .0280748
                   3  |   .0024139   .0360437     0.07   0.948    -.0791226    .0839505
                   4  |  -.0732238   .0228264    -3.21   0.011    -.1248608   -.0215869
                   5  |   .1555572   .0282949     5.50   0.000     .0915497    .2195647
                   6  |  -.1915311   .0241551    -7.93   0.000    -.2461737   -.1368885
                   7  |  -.2185326   .0225917    -9.67   0.000    -.2696385   -.1674267
                   8  |    .025604   .0641222     0.40   0.699    -.1194506    .1706585
                   9  |  -.2432891   .0251679    -9.67   0.000    -.3002227   -.1863554
                  10  |  -.2303917   .0347315    -6.63   0.000    -.3089599   -.1518234
                  11  |   .0788082     .02814     2.80   0.021     .0151511    .1424653
                  12  |  -.2041288   .0273132    -7.47   0.000    -.2659155   -.1423421
                      |
                unemp |   .0036011   .0032511     1.11   0.297    -.0037534    .0109556
                _cons |   .3272326   .0751918     4.35   0.002      .157137    .4973283
---------------------------------------------------------------------------------------

. 
. ** RUST BELT ONLY HISP-WHITE + WV, KY - IA
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2
>  exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen [aw = finalwt1] if fe
> male == 0, vce(cluster state) 
(sum of wgt is 2,172,961,165)

Linear regression                               Number of obs     =    203,950
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2207
                                                Root MSE          =     .34481

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |   .0059501   .0062747     0.95   0.368    -.0082442    .0201444
            treat_st |  -.0157525   .0069151    -2.28   0.049    -.0313954   -.0001096
treat_sthisprelwhite |  -.0139308   .0067848    -2.05   0.070    -.0292789    .0014174
                     |
               state |
                 OH  |  -.0085666   .0005171   -16.57   0.000    -.0097364   -.0073968
                 IN  |  -.0384511   .0029004   -13.26   0.000    -.0450123     -.03189
                 IL  |   .0231818   .0015574    14.89   0.000     .0196587    .0267049
                 MI  |   .0255139   .0023235    10.98   0.000     .0202577    .0307701
                 WI  |  -.0238674    .002961    -8.06   0.000    -.0305656   -.0171692
                 MN  |   .0037888   .0021544     1.76   0.113    -.0010848    .0086623
                 MO  |  -.0243107    .000891   -27.28   0.000    -.0263263   -.0222951
                 WV  |  -.0420787   .0078077    -5.39   0.000     -.059741   -.0244165
                 KY  |  -.0601572   .0030109   -19.98   0.000    -.0669683   -.0533461
                     |
                year |
               1997  |  -.0023165   .0060008    -0.39   0.708    -.0158912    .0112581
               1998  |  -.0130708   .0064458    -2.03   0.073    -.0276522    .0015106
               1999  |  -.0141954     .00861    -1.65   0.134    -.0336726    .0052817
               2000  |  -.0199062   .0076207    -2.61   0.028    -.0371454    -.002667
               2001  |  -.0220582   .0079584    -2.77   0.022    -.0400613   -.0040551
               2002  |  -.0251158   .0078927    -3.18   0.011    -.0429702   -.0072613
               2003  |  -.0325189   .0077668    -4.19   0.002    -.0500886   -.0149491
               2004  |  -.0335665   .0083176    -4.04   0.003    -.0523822   -.0147507
               2005  |  -.0490251   .0084583    -5.80   0.000     -.068159   -.0298911
               2006  |   -.055055   .0100856    -5.46   0.000    -.0778702   -.0322398
               2007  |  -.0555609   .0088893    -6.25   0.000    -.0756698    -.035452
               2008  |    -.04674   .0061873    -7.55   0.000    -.0607366   -.0327434
               2009  |  -.0363677    .005878    -6.19   0.000    -.0496648   -.0230707
               2010  |  -.0431835    .008233    -5.25   0.001     -.061808   -.0245591
               2011  |   -.045869   .0080666    -5.69   0.000    -.0641168   -.0276211
               2012  |  -.0538798   .0048178   -11.18   0.000    -.0647783   -.0429812
               2013  |   -.054807   .0060086    -9.12   0.000    -.0683995   -.0412145
               2014  |  -.0581188   .0077282    -7.52   0.000    -.0756012   -.0406364
               2015  |  -.0628537    .006982    -9.00   0.000    -.0786482   -.0470593
               2016  |  -.0647537   .0087882    -7.37   0.000     -.084634   -.0448733
               2017  |  -.0543725   .0086704    -6.27   0.000    -.0739864   -.0347586
               2018  |  -.0535932    .007934    -6.75   0.000    -.0715412   -.0356452
               2019  |  -.0626912   .0086008    -7.29   0.000    -.0821476   -.0432348
                     |
                nind |
                  2  |   .1673207   .0273971     6.11   0.000     .1053441    .2292974
                  3  |   .0950411   .0134217     7.08   0.000      .064679    .1254032
                  4  |   .0110962   .0136865     0.81   0.438    -.0198648    .0420571
                  5  |   .1674267     .01822     9.19   0.000     .1262102    .2086432
                  6  |   .0064634   .0139325     0.46   0.654    -.0250541    .0379809
                  7  |  -.0095989   .0143311    -0.67   0.520    -.0420181    .0228204
                  8  |   .0093729   .0177053     0.53   0.609    -.0306792    .0494249
                  9  |    .144877    .016777     8.64   0.000     .1069249    .1828292
                 10  |  -.0295053    .014984    -1.97   0.080    -.0634016    .0043909
                 11  |   .1259855   .0214437     5.88   0.000     .0774766    .1744944
                     |
                educ |   .0154014   .0023041     6.68   0.000     .0101891    .0206137
               exper |   .0088327   .0014489     6.10   0.000     .0055551    .0121103
              exper2 |  -.0001546   .0000752    -2.06   0.070    -.0003247    .0000154
              exper3 |   7.31e-06   3.18e-06     2.30   0.047     1.19e-07    .0000145
              exper4 |  -1.23e-07   4.17e-08    -2.96   0.016    -2.18e-07   -2.91e-08
                edex |  -.0003394   .0000587    -5.78   0.000    -.0004722   -.0002065
                     |
               ee_cl |
                  2  |  -.0379623    .007748    -4.90   0.001    -.0554895   -.0204352
                  3  |  -.0373489    .008173    -4.57   0.001    -.0558374   -.0188604
                  4  |   -.058399   .0135272    -4.32   0.002    -.0889995   -.0277984
                  5  |  -.0765977   .0160517    -4.77   0.001    -.1129091   -.0402863
                  6  |  -.0203203   .0080225    -2.53   0.032    -.0384685    -.002172
                  7  |   .0017783   .0109306     0.16   0.874    -.0229484     .026505
                  8  |   -.062576   .0146151    -4.28   0.002    -.0956377   -.0295143
                  9  |  -.0684277   .0150685    -4.54   0.001    -.1025151   -.0343403
                 10  |   .0041331   .0080424     0.51   0.620      -.01406    .0223262
                 11  |   .0049515   .0103608     0.48   0.644    -.0184863    .0283892
                 12  |  -.0782603   .0126776    -6.17   0.000    -.1069392   -.0495815
                 13  |  -.0185737   .0120497    -1.54   0.158     -.045832    .0086845
                 14  |   .0182259   .0065045     2.80   0.021     .0035118    .0329401
                 15  |   .0048285   .0084733     0.57   0.583    -.0143395    .0239965
                 16  |  -.0909962   .0113244    -8.04   0.000    -.1166138   -.0653786
                     |
                marr |   .0181788   .0031863     5.71   0.000      .010971    .0253866
               partt |  -.0599681   .0050742   -11.82   0.000    -.0714468   -.0484895
              public |   .2922545   .0324742     9.00   0.000     .2187927    .3657164
                cmsa |   .0474493   .0106993     4.43   0.002     .0232457    .0716529
                     |
               nocc2 |
                  2  |   .0546972   .0031694    17.26   0.000     .0475274    .0618669
                  3  |   .0293714   .0029699     9.89   0.000     .0226531    .0360898
                  4  |   .1928719   .0079287    24.33   0.000      .174936    .2108079
                  5  |   .1403461   .0089424    15.69   0.000     .1201171    .1605752
                  6  |   .1567442   .0065671    23.87   0.000     .1418883    .1716001
                  7  |   .0768325   .0036577    21.01   0.000     .0685584    .0851067
                  8  |   .0733249   .0077462     9.47   0.000     .0558019     .090848
                  9  |   .1790145    .007452    24.02   0.000      .162157     .195872
                 10  |   .2189568   .0091273    23.99   0.000     .1983093    .2396043
                 11  |    .254093   .0112672    22.55   0.000     .2286049    .2795811
                 12  |   .2406823   .0115431    20.85   0.000     .2145699    .2667946
                     |
               unemp |  -.0027229   .0015974    -1.70   0.122    -.0063364    .0008906
             citizen |  -.0152511   .0021572    -7.07   0.000     -.020131   -.0103712
               _cons |  -.2637358    .030341    -8.69   0.000    -.3323718   -.1950997
--------------------------------------------------------------------------------------

.         
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2
>  exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen [aw = finalwt1] if fe
> male == 1, vce(cluster state)
(sum of wgt is 2,090,984,505)

Linear regression                               Number of obs     =    201,890
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2922
                                                Root MSE          =     .28994

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |    .020182   .0034084     5.92   0.000     .0124717    .0278923
            treat_st |  -.0193645   .0127114    -1.52   0.162    -.0481196    .0093906
treat_sthisprelwhite |   -.009539   .0102111    -0.93   0.375    -.0326381    .0135601
                     |
               state |
                 OH  |  -.0100702   .0007793   -12.92   0.000     -.011833   -.0083074
                 IN  |  -.0553273   .0039305   -14.08   0.000    -.0642187   -.0464359
                 IL  |  -.0093953   .0015199    -6.18   0.000    -.0128335   -.0059571
                 MI  |   .0319173   .0030497    10.47   0.000     .0250183    .0388163
                 WI  |  -.0143377   .0036548    -3.92   0.003    -.0226054     -.00607
                 MN  |   .0275263   .0031982     8.61   0.000     .0202915    .0347612
                 MO  |  -.0576668    .000844   -68.33   0.000    -.0595761   -.0557576
                 WV  |  -.0410743    .005583    -7.36   0.000     -.053704   -.0284446
                 KY  |  -.0685528   .0029739   -23.05   0.000    -.0752802   -.0618255
                     |
                year |
               1997  |  -.0021308   .0036291    -0.59   0.572    -.0103405    .0060789
               1998  |  -.0065032   .0063824    -1.02   0.335    -.0209412    .0079349
               1999  |  -.0115657   .0038006    -3.04   0.014    -.0201634   -.0029681
               2000  |  -.0070448   .0045438    -1.55   0.155    -.0173236     .003234
               2001  |  -.0056523   .0045462    -1.24   0.245    -.0159364    .0046319
               2002  |  -.0119315   .0042058    -2.84   0.020    -.0214458   -.0024173
               2003  |    -.01877   .0052198    -3.60   0.006    -.0305781    -.006962
               2004  |  -.0201625    .002557    -7.89   0.000    -.0259469   -.0143781
               2005  |  -.0234199   .0035911    -6.52   0.000    -.0315435   -.0152963
               2006  |   -.025529   .0030166    -8.46   0.000     -.032353   -.0187051
               2007  |  -.0280782    .004044    -6.94   0.000    -.0372264   -.0189301
               2008  |  -.0239511   .0052727    -4.54   0.001    -.0358787   -.0120235
               2009  |  -.0254011   .0115038    -2.21   0.055    -.0514245    .0006222
               2010  |  -.0310685   .0129625    -2.40   0.040    -.0603916   -.0017453
               2011  |  -.0220362   .0100737    -2.19   0.056    -.0448244     .000752
               2012  |  -.0315655   .0067473    -4.68   0.001    -.0468289   -.0163021
               2013  |  -.0304891   .0044939    -6.78   0.000     -.040655   -.0203231
               2014  |  -.0323548   .0043803    -7.39   0.000    -.0422637   -.0224459
               2015  |  -.0328416    .005991    -5.48   0.000    -.0463943    -.019289
               2016  |  -.0350821   .0048364    -7.25   0.000    -.0460228   -.0241413
               2017  |  -.0383964   .0036195   -10.61   0.000    -.0465842   -.0302086
               2018  |  -.0370539   .0063212    -5.86   0.000    -.0513534   -.0227544
               2019  |  -.0394909   .0047839    -8.25   0.000    -.0503128    -.028669
                     |
                nind |
                  2  |   .0680374   .0136207     5.00   0.001     .0372252    .0988496
                  3  |   .0650538   .0054731    11.89   0.000     .0526729    .0774347
                  4  |   .0520662   .0076538     6.80   0.000      .034752    .0693803
                  5  |   .1625086   .0165908     9.80   0.000     .1249775    .2000397
                  6  |   .0338546   .0099768     3.39   0.008     .0112854    .0564237
                  7  |    .018713   .0085327     2.19   0.056    -.0005894    .0380154
                  8  |   .0273133   .0094132     2.90   0.018     .0060193    .0486073
                  9  |   .1868667   .0169952    11.00   0.000     .1484209    .2253126
                 10  |   .0062271   .0090231     0.69   0.508    -.0141847    .0266388
                 11  |   .0176636    .031089     0.57   0.584    -.0526645    .0879917
                     |
                educ |   .0205026   .0026158     7.84   0.000     .0145853    .0264199
               exper |   .0114184   .0027195     4.20   0.002     .0052664    .0175704
              exper2 |  -.0004132   .0001917    -2.16   0.060    -.0008469    .0000204
              exper3 |   9.31e-06   6.64e-06     1.40   0.194    -5.70e-06    .0000243
              exper4 |  -7.95e-08   7.37e-08    -1.08   0.309    -2.46e-07    8.73e-08
                edex |  -.0002642   .0000958    -2.76   0.022    -.0004808   -.0000475
                     |
               ee_cl |
                  2  |  -.0462306   .0065396    -7.07   0.000    -.0610242    -.031437
                  3  |  -.0827198   .0069314   -11.93   0.000    -.0983998   -.0670398
                  4  |  -.1211006   .0125948    -9.62   0.000     -.149592   -.0926092
                  5  |  -.0452852   .0069639    -6.50   0.000    -.0610386   -.0295318
                  6  |  -.0587078   .0051821   -11.33   0.000    -.0704305   -.0469852
                  7  |  -.0791578   .0085221    -9.29   0.000    -.0984362   -.0598795
                  8  |   -.110758    .013263    -8.35   0.000    -.1407609   -.0807551
                  9  |  -.0447644   .0160748    -2.78   0.021    -.0811283   -.0084006
                 10  |  -.0557293   .0081295    -6.86   0.000    -.0741194   -.0373392
                 11  |  -.0702416   .0102912    -6.83   0.000    -.0935219   -.0469612
                 12  |  -.0936024   .0138077    -6.78   0.000    -.1248376   -.0623672
                 13  |   .0037848   .0104091     0.36   0.725    -.0197623    .0273319
                 14  |   -.034652   .0109562    -3.16   0.011    -.0594366   -.0098674
                 15  |  -.0594755   .0130372    -4.56   0.001    -.0889676   -.0299835
                 16  |  -.0854415    .018741    -4.56   0.001    -.1278365   -.0430465
                     |
                marr |  -.0027088   .0018065    -1.50   0.168    -.0067954    .0013777
               partt |  -.0602869    .005129   -11.75   0.000    -.0718895   -.0486844
              public |   .3138206   .0286112    10.97   0.000     .2490976    .3785435
                cmsa |   .0200716   .0038398     5.23   0.001     .0113854    .0287578
                     |
               nocc2 |
                  2  |    .018478   .0026721     6.92   0.000     .0124334    .0245227
                  3  |   .0280341   .0059952     4.68   0.001      .014472    .0415962
                  4  |   .1727748   .0057279    30.16   0.000     .1598173    .1857323
                  5  |   .1409149   .0160456     8.78   0.000     .1046171    .1772127
                  6  |   .0680847   .0038487    17.69   0.000     .0593784     .076791
                  7  |   .0946606   .0058358    16.22   0.000     .0814591    .1078621
                  8  |   .0647016   .0057972    11.16   0.000     .0515876    .0778157
                  9  |   .1130917   .0077946    14.51   0.000      .095459    .1307244
                 10  |   .1999089   .0093163    21.46   0.000     .1788341    .2209837
                 11  |   .2305662   .0138171    16.69   0.000     .1993096    .2618227
                 12  |   .2036281   .0189066    10.77   0.000     .1608583    .2463978
                     |
               unemp |   .0004612   .0019184     0.24   0.815    -.0038785    .0048008
             citizen |  -.0097714   .0013625    -7.17   0.000    -.0128535   -.0066892
               _cons |  -.2878596   .0399135    -7.21   0.000    -.3781502   -.1975689
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen [aw = finalwt1] if fe
> male == 0, vce(cluster state) 
(sum of wgt is 2,172,977,984)

Linear regression                               Number of obs     =    203,952
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5244
                                                Root MSE          =     .39679

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0881485   .0040344   -21.85   0.000    -.0972751    -.079022
            treat_st |  -.0305609   .0152631    -2.00   0.076    -.0650885    .0039667
treat_sthisprelwhite |   .0068144   .0171317     0.40   0.700    -.0319401     .045569
                     |
               state |
                 OH  |   -.029644   .0017031   -17.41   0.000    -.0334968   -.0257913
                 IN  |  -.0124385   .0053529    -2.32   0.045    -.0245477   -.0003294
                 IL  |   .0803067   .0028099    28.58   0.000     .0739502    .0866633
                 MI  |   .0299561   .0063522     4.72   0.001     .0155864    .0443258
                 WI  |   .0121882   .0045868     2.66   0.026     .0018121    .0225642
                 MN  |   .0565401   .0053425    10.58   0.000     .0444546    .0686256
                 MO  |  -.0322645   .0005056   -63.82   0.000    -.0334082   -.0311207
                 WV  |  -.0704034   .0104343    -6.75   0.000    -.0940073   -.0467994
                 KY  |  -.0581486   .0061378    -9.47   0.000    -.0720332    -.044264
                     |
                year |
               1997  |   .0065543   .0082083     0.80   0.445    -.0120141    .0251228
               1998  |    .020999    .009644     2.18   0.057    -.0008173    .0428153
               1999  |   .0446769   .0141506     3.16   0.012     .0126661    .0766877
               2000  |   .0548415   .0147617     3.72   0.005     .0214482    .0882347
               2001  |   .0733691   .0132208     5.55   0.000     .0434616    .1032765
               2002  |   .0821123   .0095029     8.64   0.000     .0606153    .1036092
               2003  |   .0739102    .012054     6.13   0.000     .0466422    .1011783
               2004  |   .0638323   .0111689     5.72   0.000     .0385664    .0890981
               2005  |   .0437665    .012317     3.55   0.006     .0159036    .0716294
               2006  |   .0244699   .0114212     2.14   0.061    -.0013666    .0503064
               2007  |   .0196464    .014008     1.40   0.194    -.0120418    .0513347
               2008  |   .0131193   .0119786     1.10   0.302    -.0139782    .0402167
               2009  |     .07241   .0179693     4.03   0.003     .0317606    .1130594
               2010  |   .0573406   .0189617     3.02   0.014     .0144463    .1002348
               2011  |   .0305378   .0166911     1.83   0.101    -.0072201    .0682956
               2012  |   .0261339   .0169886     1.54   0.158     -.012297    .0645648
               2013  |   .0221479   .0167105     1.33   0.218    -.0156539    .0599498
               2014  |   .0135667   .0137353     0.99   0.349    -.0175047    .0446381
               2015  |   .0182915   .0154987     1.18   0.268     -.016769     .053352
               2016  |   .0260572   .0158001     1.65   0.134    -.0096852    .0617996
               2017  |   .0289771   .0131928     2.20   0.056    -.0008671    .0588212
               2018  |   .0353855   .0182863     1.94   0.085    -.0059809     .076752
               2019  |   .0565704   .0168721     3.35   0.008      .018403    .0947378
                     |
                nind |
                  2  |    .124203   .0421136     2.95   0.016     .0289354    .2194707
                  3  |   .1034458   .0367248     2.82   0.020     .0203685    .1865231
                  4  |  -.0892973    .038567    -2.32   0.046     -.176542   -.0020527
                  5  |    .129888    .035691     3.64   0.005     .0491493    .2106266
                  6  |   .0974438   .0386627     2.52   0.033     .0099827    .1849049
                  7  |   .0003583   .0393684     0.01   0.993    -.0886992    .0894158
                  8  |  -.0369625   .0383195    -0.96   0.360    -.1236473    .0497222
                  9  |  -.0455131   .0360225    -1.26   0.238    -.1270018    .0359755
                 10  |  -.1100369   .0389959    -2.82   0.020    -.1982518   -.0218219
                 11  |   .1142283    .038569     2.96   0.016     .0269791    .2014775
                     |
                educ |    .066914   .0018921    35.37   0.000     .0626339    .0711941
               exper |   .0431028   .0036663    11.76   0.000      .034809    .0513965
              exper2 |  -.0008376   .0001895    -4.42   0.002    -.0012663   -.0004089
              exper3 |   4.35e-06   4.70e-06     0.92   0.380    -6.30e-06     .000015
              exper4 |   1.36e-08   4.20e-08     0.32   0.754    -8.15e-08    1.09e-07
                edex |  -.0005056   .0001031    -4.90   0.001     -.000739   -.0002723
                     |
               ee_cl |
                  2  |  -.0613345   .0053748   -11.41   0.000    -.0734931   -.0491759
                  3  |  -.0754372   .0057262   -13.17   0.000    -.0883908   -.0624836
                  4  |  -.0320065   .0114062    -2.81   0.021    -.0578091   -.0062039
                  5  |  -.1199507   .0130042    -9.22   0.000    -.1493683   -.0905332
                  6  |  -.0948874   .0098544    -9.63   0.000    -.1171797   -.0725951
                  7  |  -.0621605   .0078619    -7.91   0.000    -.0799453   -.0443757
                  8  |   .0391552   .0135941     2.88   0.018     .0084033    .0699071
                  9  |  -.1445754   .0202954    -7.12   0.000    -.1904868   -.0986639
                 10  |  -.1052767   .0103942   -10.13   0.000    -.1287899   -.0817635
                 11  |  -.0577731   .0119737    -4.82   0.001    -.0848596   -.0306867
                 12  |   .0446762   .0143426     3.11   0.012      .012231    .0771215
                 13  |    -.09049   .0167163    -5.41   0.000    -.1283049   -.0526752
                 14  |  -.0813075   .0115602    -7.03   0.000    -.1074586   -.0551564
                 15  |  -.0480768   .0124573    -3.86   0.004    -.0762572   -.0198964
                 16  |   .0262027   .0149805     1.75   0.114    -.0076855     .060091
                     |
                marr |   .1285928   .0025561    50.31   0.000     .1228105    .1343751
               partt |  -.2176718   .0070848   -30.72   0.000    -.2336986   -.2016449
              public |   .0184312   .0111856     1.65   0.134    -.0068722    .0437347
                cmsa |   .1424845   .0182148     7.82   0.000     .1012797    .1836893
                     |
               nocc2 |
                  2  |  -.1530511   .0071808   -21.31   0.000    -.1692951   -.1368071
                  3  |   -.046996   .0070436    -6.67   0.000    -.0629297   -.0310623
                  4  |  -.3179601   .0165362   -19.23   0.000    -.3553675   -.2805527
                  5  |  -.0745512   .0111546    -6.68   0.000    -.0997847   -.0493177
                  6  |  -.3802647   .0123298   -30.84   0.000    -.4081566   -.3523728
                  7  |  -.2227318   .0096102   -23.18   0.000    -.2444715    -.200992
                  8  |  -.1260612   .0157714    -7.99   0.000    -.1617386   -.0903837
                  9  |  -.3882911   .0094493   -41.09   0.000    -.4096668   -.3669154
                 10  |   -.335261   .0095439   -35.13   0.000    -.3568509   -.3136712
                 11  |  -.2090996   .0092213   -22.68   0.000    -.2299596   -.1882396
                 12  |  -.3802803   .0134398   -28.30   0.000    -.4106833   -.3498773
                     |
               unemp |  -.0101699   .0039743    -2.56   0.031    -.0191604   -.0011794
             citizen |  -.0365564   .0071871    -5.09   0.001    -.0528147    -.020298
               _cons |   .7542592    .053564    14.08   0.000     .6330889    .8754295
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen if female == 1, vce(c
> luster state)

Linear regression                               Number of obs     =    201,891
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5057
                                                Root MSE          =     .38149

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0475091   .0044206   -10.75   0.000    -.0575093   -.0375089
            treat_st |  -.0280768   .0068001    -4.13   0.003    -.0434598   -.0126938
treat_sthisprelwhite |   .0138035   .0243953     0.57   0.585    -.0413825    .0689894
                     |
               state |
                 OH  |  -.0278844   .0012661   -22.02   0.000    -.0307486   -.0250202
                 IN  |  -.0245393   .0040511    -6.06   0.000    -.0337035   -.0153752
                 IL  |    .045714   .0020899    21.87   0.000     .0409862    .0504418
                 MI  |   .0148587   .0038675     3.84   0.004     .0061098    .0236076
                 WI  |   .0342751   .0047726     7.18   0.000     .0234786    .0450715
                 MN  |   .0929591   .0058768    15.82   0.000     .0796649    .1062532
                 MO  |  -.0471069   .0015781   -29.85   0.000    -.0506768   -.0435369
                 WV  |   -.121139    .009359   -12.94   0.000    -.1423106   -.0999675
                 KY  |  -.0563752   .0049153   -11.47   0.000    -.0674944   -.0452559
                     |
                year |
               1997  |   .0101919   .0039752     2.56   0.030     .0011995    .0191844
               1998  |   .0423666   .0051965     8.15   0.000     .0306114    .0541218
               1999  |   .0593811    .005014    11.84   0.000     .0480387    .0707235
               2000  |   .0701525   .0073002     9.61   0.000     .0536384    .0866667
               2001  |    .083117    .004518    18.40   0.000     .0728967    .0933374
               2002  |   .0907278   .0083585    10.85   0.000     .0718195    .1096361
               2003  |   .0962014   .0073047    13.17   0.000     .0796769    .1127258
               2004  |   .0835917   .0072731    11.49   0.000     .0671388    .1000446
               2005  |   .0743615   .0061828    12.03   0.000     .0603751     .088348
               2006  |   .0637446   .0056327    11.32   0.000     .0510026    .0764866
               2007  |   .0553799   .0074363     7.45   0.000     .0385577    .0722021
               2008  |   .0460633    .007961     5.79   0.000     .0280544    .0640723
               2009  |   .0634822   .0158352     4.01   0.003     .0276605    .0993039
               2010  |   .0568125   .0177222     3.21   0.011     .0167221    .0969028
               2011  |   .0432073   .0129055     3.35   0.009     .0140131    .0724016
               2012  |   .0325895   .0092292     3.53   0.006     .0117116    .0534674
               2013  |   .0339428   .0102843     3.30   0.009     .0106781    .0572076
               2014  |   .0374302   .0064958     5.76   0.000     .0227357    .0521247
               2015  |   .0520257   .0055275     9.41   0.000     .0395216    .0645299
               2016  |   .0621422   .0075369     8.25   0.000     .0450926    .0791918
               2017  |   .0722528   .0065166    11.09   0.000     .0575113    .0869943
               2018  |   .0814264   .0094017     8.66   0.000     .0601582    .1026945
               2019  |   .0884927   .0061376    14.42   0.000     .0746084    .1023769
                     |
                nind |
                  2  |   .1109744   .0202693     5.47   0.000      .065122    .1568268
                  3  |   .1635575   .0209631     7.80   0.000     .1161356    .2109794
                  4  |  -.0648875   .0218357    -2.97   0.016    -.1142832   -.0154917
                  5  |   .1625894   .0190109     8.55   0.000     .1195838    .2055951
                  6  |   .1072808    .021523     4.98   0.001     .0585924    .1559691
                  7  |     .04768   .0242335     1.97   0.081      -.00714       .1025
                  8  |   .0195259   .0243152     0.80   0.443     -.035479    .0745308
                  9  |   -.035425    .019951    -1.78   0.110    -.0805572    .0097072
                 10  |  -.0522001     .01936    -2.70   0.025    -.0959955   -.0084047
                 11  |   .0824315   .0239077     3.45   0.007     .0283486    .1365144
                     |
                educ |   .1005188   .0024906    40.36   0.000     .0948846     .106153
               exper |   .0472134   .0030658    15.40   0.000      .040278    .0541487
              exper2 |   -.001416      .0002    -7.08   0.000    -.0018684   -.0009636
              exper3 |   .0000209   6.10e-06     3.43   0.008     7.09e-06    .0000347
              exper4 |  -1.02e-07   6.11e-08    -1.67   0.129    -2.40e-07    3.60e-08
                edex |  -.0006887   .0001334    -5.16   0.001    -.0009906   -.0003868
                     |
               ee_cl |
                  2  |  -.1457436   .0095824   -15.21   0.000    -.1674205   -.1240668
                  3  |  -.2009116   .0081094   -24.78   0.000    -.2192563   -.1825669
                  4  |  -.2309974   .0201001   -11.49   0.000    -.2764669   -.1855279
                  5  |  -.1466389   .0193862    -7.56   0.000    -.1904934   -.1027843
                  6  |  -.1934384   .0121414   -15.93   0.000    -.2209041   -.1659726
                  7  |  -.2125199   .0130946   -16.23   0.000    -.2421419   -.1828979
                  8  |  -.1592822   .0181504    -8.78   0.000    -.2003413   -.1182231
                  9  |  -.1653595   .0234242    -7.06   0.000    -.2183488   -.1123703
                 10  |  -.2038626   .0156281   -13.04   0.000    -.2392158   -.1685094
                 11  |  -.2079084   .0140767   -14.77   0.000     -.239752   -.1760647
                 12  |  -.1624952    .019756    -8.23   0.000    -.2071863   -.1178041
                 13  |  -.1103438   .0223886    -4.93   0.001    -.1609904   -.0596972
                 14  |  -.1777182   .0160464   -11.08   0.000    -.2140178   -.1414186
                 15  |  -.1700189   .0177679    -9.57   0.000    -.2102128    -.129825
                 16  |  -.1607171   .0213711    -7.52   0.000    -.2090619   -.1123724
                     |
                marr |   .0439435   .0032478    13.53   0.000     .0365965    .0512904
               partt |  -.1457468   .0040461   -36.02   0.000    -.1548998   -.1365938
              public |   .0700185    .007641     9.16   0.000     .0527335    .0873036
                cmsa |   .1552466   .0160281     9.69   0.000     .1189884    .1915048
                     |
               nocc2 |
                  2  |  -.1469311   .0083319   -17.63   0.000    -.1657792    -.128083
                  3  |  -.0510495   .0140424    -3.64   0.005    -.0828156   -.0192834
                  4  |   -.309254   .0064168   -48.19   0.000    -.3237699   -.2947382
                  5  |     .04922   .0102245     4.81   0.001     .0260906    .0723494
                  6  |  -.3380127   .0089525   -37.76   0.000    -.3582647   -.3177607
                  7  |  -.3584138    .008628   -41.54   0.000    -.3779318   -.3388958
                  8  |   -.166457   .0122161   -13.63   0.000    -.1940917   -.1388223
                  9  |  -.4039416   .0077484   -52.13   0.000    -.4214697   -.3864135
                 10  |  -.4163436   .0203301   -20.48   0.000    -.4623335   -.3703536
                 11  |  -.1507699   .0160683    -9.38   0.000    -.1871189   -.1144209
                 12  |  -.3906794   .0164024   -23.82   0.000    -.4277842   -.3535746
                     |
               unemp |    .001632   .0034086     0.48   0.644    -.0060788    .0093429
             citizen |   -.023991   .0042747    -5.61   0.000     -.033661   -.0143211
               _cons |   .2399079   .0446344     5.37   0.000     .1389379    .3408779
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen if female == 0 & cove
> red == 0, vce(cluster state)

Linear regression                               Number of obs     =    165,049
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5553
                                                Root MSE          =     .40198

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0977211   .0044766   -21.83   0.000    -.1078479   -.0875944
            treat_st |  -.0225665   .0123306    -1.83   0.100    -.0504603    .0053273
treat_sthisprelwhite |   .0066283   .0214796     0.31   0.765     -.041962    .0552187
                     |
               state |
                 OH  |  -.0308965   .0019304   -16.01   0.000    -.0352635   -.0265296
                 IN  |  -.0114705    .004955    -2.31   0.046    -.0226795   -.0002615
                 IL  |   .0681129   .0028513    23.89   0.000     .0616629     .074563
                 MI  |    .018241   .0051598     3.54   0.006     .0065687    .0299133
                 WI  |   .0164356   .0049644     3.31   0.009     .0052053     .027666
                 MN  |   .0550583   .0064239     8.57   0.000     .0405265    .0695901
                 MO  |  -.0363941   .0014448   -25.19   0.000    -.0396624   -.0331257
                 WV  |   -.070624   .0116177    -6.08   0.000     -.096905   -.0443429
                 KY  |   -.048134   .0057817    -8.33   0.000    -.0612132   -.0350549
                     |
                year |
               1997  |   .0089998   .0066361     1.36   0.208    -.0060121    .0240117
               1998  |   .0259744   .0092654     2.80   0.021     .0050146    .0469341
               1999  |   .0555704   .0127056     4.37   0.002     .0268283    .0843125
               2000  |   .0635112   .0133303     4.76   0.001     .0333559    .0936664
               2001  |   .0873385   .0129542     6.74   0.000     .0580341    .1166429
               2002  |   .0923335   .0099479     9.28   0.000     .0698297    .1148373
               2003  |   .0846892   .0101655     8.33   0.000     .0616933    .1076851
               2004  |   .0749644   .0092464     8.11   0.000     .0540475    .0958813
               2005  |    .056008   .0119438     4.69   0.001     .0289893    .0830267
               2006  |    .035355   .0114331     3.09   0.013     .0094917    .0612184
               2007  |    .036488   .0134341     2.72   0.024      .006098     .066878
               2008  |   .0220803   .0112777     1.96   0.082    -.0034316    .0475922
               2009  |   .0780256   .0223887     3.49   0.007      .027379    .1286723
               2010  |   .0610676   .0221995     2.75   0.022     .0108489    .1112863
               2011  |   .0340425   .0171972     1.98   0.079    -.0048604    .0729453
               2012  |   .0339858   .0185873     1.83   0.101    -.0080614    .0760331
               2013  |   .0296606   .0155523     1.91   0.089    -.0055212    .0648423
               2014  |    .026811   .0115828     2.31   0.046     .0006088    .0530131
               2015  |   .0390004   .0144336     2.70   0.024     .0063492    .0716515
               2016  |   .0448724   .0170075     2.64   0.027     .0063987    .0833461
               2017  |    .042942   .0135212     3.18   0.011      .012355    .0735291
               2018  |   .0503335    .018957     2.66   0.026     .0074498    .0932172
               2019  |    .073994   .0174249     4.25   0.002      .034576    .1134119
                     |
                nind |
                  2  |   .0205964   .0650082     0.32   0.759    -.1264624    .1676551
                  3  |   .0666914   .0601824     1.11   0.297    -.0694508    .2028335
                  4  |  -.1097222   .0629938    -1.74   0.116    -.2522241    .0327798
                  5  |   .0497927   .0579088     0.86   0.412    -.0812061    .1807916
                  6  |   .0648283   .0619663     1.05   0.323    -.0753491    .2050058
                  7  |  -.0271257   .0635399    -0.43   0.679    -.1708629    .1166116
                  8  |  -.0572302   .0621267    -0.92   0.381    -.1977705    .0833101
                  9  |  -.0914559   .0542122    -1.69   0.126    -.2140924    .0311805
                 10  |  -.1320067   .0638841    -2.07   0.069    -.2765225    .0125091
                 11  |   .0324901   .0555569     0.58   0.573    -.0931884    .1581686
                     |
                educ |   .0618175   .0024587    25.14   0.000     .0562555    .0673796
               exper |   .0367177   .0032617    11.26   0.000     .0293393    .0440961
              exper2 |  -.0004699   .0001555    -3.02   0.014    -.0008218   -.0001181
              exper3 |  -7.35e-06   4.14e-06    -1.77   0.110    -.0000167    2.03e-06
              exper4 |   1.39e-07   4.35e-08     3.20   0.011     4.07e-08    2.38e-07
                edex |  -.0003991   .0001191    -3.35   0.009    -.0006685   -.0001297
                     |
               ee_cl |
                  2  |  -.0602595   .0052257   -11.53   0.000    -.0720809   -.0484381
                  3  |  -.0756335   .0080929    -9.35   0.000     -.093941    -.057326
                  4  |  -.0209592   .0150947    -1.39   0.198    -.0551058    .0131874
                  5  |  -.1124957   .0134403    -8.37   0.000    -.1428997   -.0820917
                  6  |  -.1036406   .0124581    -8.32   0.000    -.1318228   -.0754584
                  7  |  -.0763561    .010656    -7.17   0.000    -.1004617   -.0522504
                  8  |   .0618668   .0145092     4.26   0.002     .0290448    .0946889
                  9  |  -.1600071   .0135413   -11.82   0.000    -.1906397   -.1293745
                 10  |  -.1225256   .0138632    -8.84   0.000    -.1538864   -.0911649
                 11  |  -.0712823   .0108269    -6.58   0.000    -.0957744   -.0467902
                 12  |   .0637134    .011599     5.49   0.000     .0374746    .0899523
                 13  |  -.1089503   .0154582    -7.05   0.000    -.1439191   -.0739815
                 14  |  -.0966898   .0147097    -6.57   0.000    -.1299653   -.0634143
                 15  |  -.0477957   .0131785    -3.63   0.006    -.0776076   -.0179837
                 16  |   .0525647   .0121061     4.34   0.002     .0251787    .0799507
                     |
                marr |   .1375629    .003655    37.64   0.000     .1292948     .145831
               partt |  -.2160187   .0058904   -36.67   0.000    -.2293438   -.2026937
              public |  -.0063568   .0111749    -0.57   0.583    -.0316361    .0189226
                cmsa |   .1405237   .0166053     8.46   0.000     .1029598    .1780876
                     |
               nocc2 |
                  2  |  -.1675579   .0056903   -29.45   0.000    -.1804302   -.1546856
                  3  |  -.0562102   .0073245    -7.67   0.000    -.0727793    -.039641
                  4  |  -.3697695   .0159047   -23.25   0.000    -.4057485   -.3337904
                  5  |  -.0935627   .0115261    -8.12   0.000    -.1196366   -.0674887
                  6  |  -.4115086     .00987   -41.69   0.000    -.4338361   -.3891811
                  7  |  -.2393778   .0088968   -26.91   0.000    -.2595036   -.2192519
                  8  |  -.1287283   .0144151    -8.93   0.000    -.1613375   -.0961192
                  9  |  -.4405208   .0094037   -46.85   0.000    -.4617934   -.4192482
                 10  |  -.3910438   .0105566   -37.04   0.000    -.4149246    -.367163
                 11  |  -.2726623   .0105962   -25.73   0.000    -.2966324   -.2486921
                 12  |  -.4434508   .0123989   -35.77   0.000    -.4714991   -.4154025
                     |
               unemp |  -.0081096   .0042387    -1.91   0.088    -.0176982    .0014791
             citizen |   -.030489    .005825    -5.23   0.001     -.043666    -.017312
               _cons |   .8660112   .0764416    11.33   0.000     .6930884    1.038934
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen if female == 1 & cove
> red == 0, vce(cluster state)

Linear regression                               Number of obs     =    173,412
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5110
                                                Root MSE          =     .38199

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0578642   .0076008    -7.61   0.000    -.0750585     -.04067
            treat_st |  -.0241277   .0052611    -4.59   0.001    -.0360291   -.0122262
treat_sthisprelwhite |   .0180446   .0275296     0.66   0.529    -.0442316    .0803208
                     |
               state |
                 OH  |  -.0244353   .0014039   -17.41   0.000    -.0276111   -.0212596
                 IN  |  -.0132087   .0039117    -3.38   0.008    -.0220577   -.0043598
                 IL  |    .056054    .002047    27.38   0.000     .0514233    .0606847
                 MI  |   .0059782   .0038074     1.57   0.151    -.0026347    .0145911
                 WI  |   .0435787   .0048208     9.04   0.000     .0326733    .0544841
                 MN  |   .1010053   .0057473    17.57   0.000     .0880041    .1140066
                 MO  |  -.0305974   .0017931   -17.06   0.000    -.0346537   -.0265411
                 WV  |  -.1148008   .0092806   -12.37   0.000     -.135795   -.0938066
                 KY  |  -.0378511   .0050839    -7.45   0.000    -.0493517   -.0263505
                     |
                year |
               1997  |   .0103232   .0050622     2.04   0.072    -.0011282    .0217747
               1998  |   .0465177   .0054073     8.60   0.000     .0342855    .0587499
               1999  |   .0661536   .0057834    11.44   0.000     .0530708    .0792365
               2000  |   .0815751   .0069083    11.81   0.000     .0659475    .0972027
               2001  |   .0951623   .0058294    16.32   0.000     .0819754    .1083492
               2002  |   .1012513   .0083936    12.06   0.000     .0822638    .1202389
               2003  |   .1094387   .0069475    15.75   0.000     .0937224     .125155
               2004  |   .0980036   .0086117    11.38   0.000     .0785226    .1174847
               2005  |   .0891721   .0051933    17.17   0.000     .0774241    .1009201
               2006  |   .0761762   .0055503    13.72   0.000     .0636206    .0887319
               2007  |   .0682097   .0059921    11.38   0.000     .0546546    .0817648
               2008  |   .0628656   .0074978     8.38   0.000     .0459044    .0798267
               2009  |   .0776421   .0157155     4.94   0.001     .0420912    .1131929
               2010  |    .069504   .0199712     3.48   0.007     .0243261    .1146819
               2011  |    .056323   .0131078     4.30   0.002     .0266712    .0859749
               2012  |   .0474988   .0085766     5.54   0.000     .0280972    .0669005
               2013  |   .0481256   .0105583     4.56   0.001      .024241    .0720103
               2014  |   .0579161    .007981     7.26   0.000     .0398619    .0759704
               2015  |   .0730554   .0056691    12.89   0.000      .060231    .0858798
               2016  |   .0793493    .007668    10.35   0.000     .0620032    .0966954
               2017  |   .0932969   .0065863    14.17   0.000     .0783977    .1081961
               2018  |   .1046369   .0081695    12.81   0.000     .0861562    .1231176
               2019  |   .1108316   .0077046    14.39   0.000     .0934024    .1282607
                     |
                nind |
                  2  |   .0981467   .0185411     5.29   0.000     .0562039    .1400895
                  3  |   .1586592   .0194842     8.14   0.000     .1145829    .2027356
                  4  |  -.0592003   .0209729    -2.82   0.020    -.1066443   -.0117563
                  5  |   .1196383   .0185842     6.44   0.000     .0775978    .1616787
                  6  |    .107317   .0196432     5.46   0.000     .0628809     .151753
                  7  |   .0536182   .0225649     2.38   0.041     .0025729    .1046636
                  8  |   .0283884   .0230518     1.23   0.249    -.0237583    .0805352
                  9  |  -.0508826   .0161808    -3.14   0.012    -.0874861   -.0142791
                 10  |  -.0421058   .0181306    -2.32   0.045    -.0831201   -.0010914
                 11  |   .1053914   .0226599     4.65   0.001     .0541312    .1566516
                     |
                educ |   .0936877    .003307    28.33   0.000     .0862068    .1011686
               exper |   .0467477   .0031103    15.03   0.000     .0397116    .0537838
              exper2 |  -.0013772   .0002085    -6.61   0.000    -.0018488   -.0009057
              exper3 |   .0000203   6.36e-06     3.20   0.011     5.94e-06    .0000347
              exper4 |  -9.67e-08   6.46e-08    -1.50   0.169    -2.43e-07    4.94e-08
                edex |  -.0007774   .0001267    -6.13   0.000    -.0010641   -.0004907
                     |
               ee_cl |
                  2  |  -.1333841   .0107512   -12.41   0.000    -.1577051   -.1090632
                  3  |   -.181168   .0110193   -16.44   0.000    -.2060953   -.1562407
                  4  |   -.193243   .0264543    -7.30   0.000    -.2530867   -.1333992
                  5  |  -.1411716   .0185362    -7.62   0.000    -.1831034   -.0992399
                  6  |  -.1762775    .014476   -12.18   0.000    -.2090246   -.1435305
                  7  |  -.1862015   .0170105   -10.95   0.000    -.2246818   -.1477211
                  8  |  -.1065433   .0229418    -4.64   0.001    -.1584412   -.0546453
                  9  |  -.1652533   .0205139    -8.06   0.000    -.2116589   -.1188477
                 10  |  -.1850228   .0171118   -10.81   0.000    -.2237323   -.1463134
                 11  |  -.1762901   .0156476   -11.27   0.000    -.2116874   -.1408928
                 12  |  -.1135314   .0215123    -5.28   0.001    -.1621956   -.0648671
                 13  |  -.1309138   .0239645    -5.46   0.000    -.1851253   -.0767023
                 14  |  -.1650863   .0181622    -9.09   0.000    -.2061721   -.1240006
                 15  |  -.1395238    .021615    -6.45   0.000    -.1884204   -.0906272
                 16  |  -.1217433   .0250902    -4.85   0.001    -.1785013   -.0649854
                     |
                marr |    .050119    .003392    14.78   0.000     .0424458    .0577922
               partt |  -.1416662   .0030457   -46.51   0.000    -.1485561   -.1347763
              public |    .016361   .0086325     1.90   0.091    -.0031671     .035889
                cmsa |   .1583943    .015821    10.01   0.000     .1226047    .1941838
                     |
               nocc2 |
                  2  |  -.1539808   .0091038   -16.91   0.000    -.1745751   -.1333866
                  3  |  -.0503799   .0140644    -3.58   0.006    -.0821957    -.018564
                  4  |  -.3629838   .0096833   -37.49   0.000     -.384889   -.3410787
                  5  |   .0315607   .0121267     2.60   0.029     .0041282    .0589933
                  6  |  -.3537423   .0092297   -38.33   0.000    -.3746214   -.3328632
                  7  |  -.3772293   .0088597   -42.58   0.000    -.3972714   -.3571872
                  8  |  -.1822067   .0119268   -15.28   0.000    -.2091871   -.1552263
                  9  |  -.4311284   .0091579   -47.08   0.000     -.451845   -.4104117
                 10  |  -.4616709   .0199617   -23.13   0.000    -.5068274   -.4165144
                 11  |  -.2546478   .0150222   -16.95   0.000    -.2886303   -.2206653
                 12  |  -.4376491   .0184359   -23.74   0.000    -.4793539   -.3959443
                     |
               unemp |   .0016172   .0035549     0.45   0.660    -.0064245     .009659
             citizen |  -.0233345   .0045049    -5.18   0.001    -.0335254   -.0131436
               _cons |   .3105742   .0496287     6.26   0.000     .1983064     .422842
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen if female == 0 & cove
> red == 1, vce(cluster state)

Linear regression                               Number of obs     =     38,901
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3411
                                                Root MSE          =      .3397

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0532304   .0084534    -6.30   0.000    -.0723533   -.0341076
            treat_st |  -.0454327   .0332108    -1.37   0.204    -.1205608    .0296954
treat_sthisprelwhite |   .0180462   .0233864     0.77   0.460    -.0348575      .07095
                     |
               state |
                 OH  |   -.000448   .0015244    -0.29   0.776    -.0038964    .0030004
                 IN  |   .0157095   .0086894     1.81   0.104    -.0039473    .0353663
                 IL  |   .1087679    .002316    46.96   0.000     .1035287    .1140072
                 MI  |   .0859546   .0059585    14.43   0.000     .0724755    .0994336
                 WI  |   .0306438   .0040278     7.61   0.000     .0215323    .0397553
                 MN  |   .0501171   .0040985    12.23   0.000     .0408457    .0593885
                 MO  |    .021041   .0031273     6.73   0.000     .0139667    .0281154
                 WV  |  -.0338823   .0143306    -2.36   0.042    -.0663003   -.0014642
                 KY  |  -.0239746   .0073447    -3.26   0.010    -.0405894   -.0073597
                     |
                year |
               1997  |  -.0085751   .0092633    -0.93   0.379    -.0295301      .01238
               1998  |  -.0084219   .0124222    -0.68   0.515    -.0365228     .019679
               1999  |   .0031187   .0139928     0.22   0.829    -.0285352    .0347726
               2000  |   .0116512     .01235     0.94   0.370    -.0162864    .0395887
               2001  |   .0112702   .0134677     0.84   0.424    -.0191959    .0417363
               2002  |   .0375887   .0110997     3.39   0.008     .0124794     .062698
               2003  |     .03642   .0175011     2.08   0.067    -.0031702    .0760102
               2004  |    .027625    .008792     3.14   0.012      .007736     .047514
               2005  |   .0166761   .0093798     1.78   0.109    -.0045426    .0378947
               2006  |   .0059216   .0161581     0.37   0.722    -.0306306    .0424738
               2007  |  -.0067899   .0166628    -0.41   0.693    -.0444838     .030904
               2008  |    -.01192   .0130508    -0.91   0.385    -.0414429     .017603
               2009  |   .0489657   .0108835     4.50   0.001     .0243454    .0735859
               2010  |   .0509511   .0105678     4.82   0.001     .0270451    .0748572
               2011  |   .0336519   .0156319     2.15   0.060    -.0017098    .0690137
               2012  |   .0261835   .0166702     1.57   0.151    -.0115271     .063894
               2013  |   .0086298   .0186592     0.46   0.655    -.0335802    .0508398
               2014  |  -.0038077   .0218164    -0.17   0.865    -.0531599    .0455445
               2015  |  -.0062243   .0233619    -0.27   0.796    -.0590725    .0466238
               2016  |   .0079982   .0201624     0.40   0.701    -.0376122    .0536087
               2017  |   .0148784   .0198395     0.75   0.472    -.0300016    .0597584
               2018  |   .0146311   .0185725     0.79   0.451    -.0273827    .0566449
               2019  |   .0179232   .0233834     0.77   0.463    -.0349736      .07082
                     |
                nind |
                  2  |   .0329767     .05515     0.60   0.565    -.0917813    .1577346
                  3  |  -.1281279   .0505014    -2.54   0.032    -.2423701   -.0138858
                  4  |  -.2978809   .0600954    -4.96   0.001    -.4338261   -.1619358
                  5  |   .0135865   .0527017     0.26   0.802     -.105633     .132806
                  6  |  -.1642382   .0676283    -2.43   0.038    -.3172239   -.0112524
                  7  |  -.1368058   .0543937    -2.52   0.033    -.2598529   -.0137588
                  8  |  -.2406434   .0592945    -4.06   0.003    -.3747769   -.1065098
                  9  |  -.1901534   .0619309    -3.07   0.013    -.3302507    -.050056
                 10  |  -.2039367   .0698886    -2.92   0.017    -.3620358   -.0458376
                 11  |    .029688   .0552945     0.54   0.604    -.0953968    .1547729
                     |
                educ |   .0711079   .0102029     6.97   0.000     .0480274    .0941885
               exper |   .0729254   .0052821    13.81   0.000     .0609764    .0848743
              exper2 |  -.0030316   .0005656    -5.36   0.000    -.0043109   -.0017522
              exper3 |   .0000705   .0000174     4.06   0.003     .0000312    .0001097
              exper4 |  -6.40e-07   1.73e-07    -3.70   0.005    -1.03e-06   -2.49e-07
                edex |  -.0006991     .00017    -4.11   0.003    -.0010838   -.0003144
                     |
               ee_cl |
                  2  |   .0716116   .0356464     2.01   0.075    -.0090262    .1522494
                  3  |   .0483943    .039025     1.24   0.246    -.0398863    .1366749
                  4  |  -.0406965   .0536067    -0.76   0.467    -.1619632    .0805702
                  5  |   .0218474   .0634128     0.34   0.738    -.1216024    .1652971
                  6  |   .0455416   .0367371     1.24   0.246    -.0375634    .1286466
                  7  |   .0484686   .0502568     0.96   0.360    -.0652202    .1621574
                  8  |  -.0286619   .0544081    -0.53   0.611    -.1517415    .0944177
                  9  |   .0421751    .062135     0.68   0.514     -.098384    .1827342
                 10  |    .020228   .0508217     0.40   0.700    -.0947387    .1351946
                 11  |   .0415633    .056286     0.74   0.479    -.0857645     .168891
                 12  |   .0276401   .0630284     0.44   0.671    -.1149401    .1702203
                 13  |   .0375914   .0643964     0.58   0.574    -.1080834    .1832662
                 14  |   .0036898   .0537977     0.07   0.947    -.1180092    .1253887
                 15  |    .015714   .0578417     0.27   0.792    -.1151331    .1465611
                 16  |  -.0001348   .0605451    -0.00   0.998    -.1370974    .1368278
                     |
                marr |   .0686481   .0058813    11.67   0.000     .0553437    .0819525
               partt |  -.1244114   .0191077    -6.51   0.000    -.1676361   -.0811867
              public |  -.0723692   .0111456    -6.49   0.000    -.0975822   -.0471562
                cmsa |   .1104179   .0145068     7.61   0.000     .0776011    .1432346
                     |
               nocc2 |
                  2  |   -.022081   .0178589    -1.24   0.248    -.0624807    .0183186
                  3  |   -.007089   .0188524    -0.38   0.716    -.0497361    .0355582
                  4  |  -.0522476   .0168687    -3.10   0.013    -.0904072    -.014088
                  5  |  -.0120154   .0191976    -0.63   0.547    -.0554433    .0314125
                  6  |  -.2434779   .0184716   -13.18   0.000    -.2852635   -.2016923
                  7  |  -.2554225   .0221881   -11.51   0.000    -.3056155   -.2052294
                  8  |  -.1963081   .1112352    -1.76   0.111    -.4479396    .0553234
                  9  |  -.2327962   .0096627   -24.09   0.000    -.2546548   -.2109376
                 10  |  -.1531669   .0180392    -8.49   0.000    -.1939745   -.1123593
                 11  |  -.0573449   .0152951    -3.75   0.005    -.0919448    -.022745
                 12  |  -.2135952   .0175979   -12.14   0.000    -.2534044   -.1737861
                     |
               unemp |  -.0123006   .0031333    -3.93   0.003    -.0193887   -.0052125
             citizen |  -.0405042   .0095945    -4.22   0.002    -.0622084      -.0188
               _cons |   .7391994   .0950986     7.77   0.000     .5240714    .9543273
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 
> exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen if female == 1 & cove
> red == 1, vce(cluster state)

Linear regression                               Number of obs     =     28,478
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4370
                                                Root MSE          =     .34986

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0068308   .0284699    -0.24   0.816    -.0712342    .0575725
            treat_st |  -.0438967   .0217046    -2.02   0.074     -.092996    .0052027
treat_sthisprelwhite |  -.0142896   .0374632    -0.38   0.712    -.0990373    .0704582
                     |
               state |
                 OH  |  -.0318191   .0018766   -16.96   0.000    -.0360643   -.0275739
                 IN  |  -.0365162   .0073022    -5.00   0.001    -.0530348   -.0199975
                 IL  |  -.0045813   .0035352    -1.30   0.227    -.0125784    .0034159
                 MI  |   .0387382   .0071324     5.43   0.000     .0226036    .0548728
                 WI  |  -.0051645   .0040521    -1.27   0.234    -.0143309    .0040019
                 MN  |   .0409052   .0062088     6.59   0.000       .02686    .0549503
                 MO  |  -.1021588   .0037253   -27.42   0.000    -.1105859   -.0937317
                 WV  |  -.1102841   .0114315    -9.65   0.000    -.1361439   -.0844243
                 KY  |  -.0932616   .0066755   -13.97   0.000    -.1083626   -.0781606
                     |
                year |
               1997  |   .0113002   .0137176     0.82   0.431    -.0197311    .0423315
               1998  |   .0215287   .0111667     1.93   0.086    -.0037321    .0467896
               1999  |    .030429   .0114509     2.66   0.026     .0045252    .0563329
               2000  |   .0099268   .0095146     1.04   0.324    -.0115968    .0314504
               2001  |   .0189413   .0134114     1.41   0.191    -.0113974    .0492799
               2002  |   .0393659   .0117299     3.36   0.008      .012831    .0659009
               2003  |   .0399023   .0166577     2.40   0.040       .00222    .0775846
               2004  |   .0231507   .0145875     1.59   0.147    -.0098484    .0561498
               2005  |   .0121778   .0173255     0.70   0.500    -.0270153    .0513708
               2006  |   .0116009   .0175244     0.66   0.525    -.0280419    .0512438
               2007  |   .0107546   .0207256     0.52   0.616    -.0361299    .0576391
               2008  |  -.0272055   .0193014    -1.41   0.192    -.0708683    .0164572
               2009  |   .0154632   .0239182     0.65   0.534    -.0386435      .06957
               2010  |   .0212622   .0195075     1.09   0.304    -.0228669    .0653914
               2011  |  -.0053062   .0213715    -0.25   0.809     -.053652    .0430395
               2012  |  -.0215158   .0165699    -1.30   0.226    -.0589995    .0159679
               2013  |  -.0086066   .0151675    -0.57   0.584    -.0429178    .0257046
               2014  |  -.0431146   .0198233    -2.17   0.058     -.087958    .0017288
               2015  |  -.0342619   .0125598    -2.73   0.023    -.0626742   -.0058496
               2016  |  -.0004799   .0140458    -0.03   0.973    -.0322536    .0312939
               2017  |  -.0171812   .0151751    -1.13   0.287    -.0515096    .0171471
               2018  |  -.0183598   .0165945    -1.11   0.297     -.055899    .0191795
               2019  |  -.0070277   .0152136    -0.46   0.655    -.0414433     .027388
                     |
                nind |
                  2  |  -.0503073   .0641344    -0.78   0.453    -.1953895    .0947748
                  3  |  -.1068596   .0492788    -2.17   0.058    -.2183359    .0046168
                  4  |  -.4281924   .0444945    -9.62   0.000    -.5288459   -.3275389
                  5  |   .0020576   .0569812     0.04   0.972    -.1268428     .130958
                  6  |  -.1933696   .0517357    -3.74   0.005    -.3104038   -.0763353
                  7  |  -.2396175   .0490864    -4.88   0.001    -.3506586   -.1285764
                  8  |  -.2757604   .0470343    -5.86   0.000    -.3821594   -.1693614
                  9  |  -.3404696   .0553463    -6.15   0.000    -.4656715   -.2152676
                 10  |  -.3069235   .0564844    -5.43   0.000       -.4347    -.179147
                 11  |  -.1485303   .0504053    -2.95   0.016     -.262555   -.0345056
                     |
                educ |   .1203819   .0084496    14.25   0.000     .1012675    .1394962
               exper |   .0483143   .0027962    17.28   0.000     .0419889    .0546396
              exper2 |  -.0014695   .0003103    -4.74   0.001    -.0021715   -.0007676
              exper3 |   .0000239   .0000105     2.26   0.050     5.40e-09    .0000477
              exper4 |  -1.57e-07   1.11e-07    -1.42   0.190    -4.08e-07    9.36e-08
                edex |   -.000492   .0002705    -1.82   0.102     -.001104      .00012
                     |
               ee_cl |
                  2  |   -.153236    .025583    -5.99   0.000    -.2111087   -.0953632
                  3  |  -.2026593    .032064    -6.32   0.000     -.275193   -.1301256
                  4  |   -.301801   .0523364    -5.77   0.000    -.4201942   -.1834078
                  5  |  -.1162175   .0578632    -2.01   0.076    -.2471133    .0146782
                  6  |  -.2044614   .0408721    -5.00   0.001    -.2969206   -.1120023
                  7  |  -.2569152   .0444691    -5.78   0.000    -.3575113   -.1563191
                  8  |  -.3027574   .0576239    -5.25   0.001    -.4331117   -.1724031
                  9  |  -.1228352   .0541664    -2.27   0.050    -.2453682   -.0003023
                 10  |  -.2341833    .063477    -3.69   0.005    -.3777782   -.0905884
                 11  |  -.2903755   .0598346    -4.85   0.001    -.4257307   -.1550203
                 12  |  -.3078929   .0576823    -5.34   0.000    -.4383793   -.1774066
                 13  |  -.0558815   .0614389    -0.91   0.387    -.1948659    .0831029
                 14  |  -.2082607   .0638798    -3.26   0.010    -.3527667   -.0637546
                 15  |  -.2489798   .0659973    -3.77   0.004     -.398276   -.0996836
                 16  |  -.2771711   .0560208    -4.95   0.001    -.4038989   -.1504433
                     |
                marr |   .0069611   .0037194     1.87   0.094    -.0014527    .0153749
               partt |  -.0703479    .015435    -4.56   0.001    -.1052643   -.0354315
              public |    .036308    .009869     3.68   0.005     .0139828    .0586333
                cmsa |   .1139015   .0163752     6.96   0.000     .0768582    .1509448
                     |
               nocc2 |
                  2  |  -.0204181   .0194839    -1.05   0.322    -.0644937    .0236575
                  3  |   .0033809   .0303538     0.11   0.914    -.0652842    .0720461
                  4  |  -.0799775   .0263602    -3.03   0.014    -.1396085   -.0203466
                  5  |   .1699418   .0321437     5.29   0.001     .0972278    .2426559
                  6  |  -.1834979   .0255867    -7.17   0.000     -.241379   -.1256168
                  7  |  -.2185885    .022199    -9.85   0.000    -.2688062   -.1683709
                  8  |   .0666638   .1081169     0.62   0.553    -.1779135    .3112412
                  9  |  -.2176236   .0255699    -8.51   0.000    -.2754667   -.1597805
                 10  |   -.195423   .0378138    -5.17   0.001    -.2809638   -.1098821
                 11  |   .1433149   .0353976     4.05   0.003       .06324    .2233898
                 12  |  -.1922376   .0236028    -8.14   0.000    -.2456309   -.1388442
                     |
               unemp |  -1.09e-07   .0038967    -0.00   1.000    -.0088151    .0088149
             citizen |  -.0144794   .0070201    -2.06   0.069    -.0303601    .0014012
               _cons |   .2614775   .0888557     2.94   0.016      .060472    .4624829
--------------------------------------------------------------------------------------

. 
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 closed on:   8 Mar 2021, 14:49:56
------------------------------------------------------------------------------------------------
