-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-hisp.log
  log type:  text
 opened on:  31 Mar 2021, 18:09:41

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt public marr hisprace hi
> spracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effective; signed Dec2012) Ma
> r1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82) //incl Idaho wh
> ich changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. gen lyear = year - 1900

. 
. ** pta WV drop, common support MT
. drop if state == 55 | state == 81
(76,583 observations deleted)

. 
. eststo clear

. 
. ** HISP-WHITE
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr pa
> rtt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 9,843,204,503)

Linear regression                               Number of obs     =  1,101,354
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2140
                                                Root MSE          =     .32716

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0294707   .0056355    -5.23   0.000    -.0408017   -.0181397
            treat_st |   -.032733   .0109033    -3.00   0.004    -.0546556   -.0108104
treat_sthisprelwhite |   .0058927   .0089966     0.65   0.516    -.0121962    .0239816
                     |
               state |
                 NH  |  -.0418202   .0032327   -12.94   0.000    -.0483199   -.0353204
                 VT  |   -.045604   .0012566   -36.29   0.000    -.0481307   -.0430774
                 MA  |   .0046749   .0046305     1.01   0.318    -.0046354    .0139851
                 RI  |   .0067811   .0043973     1.54   0.130    -.0020603    .0156225
                 CT  |   .0095687   .0045495     2.10   0.041     .0004214     .018716
                 NY  |   .0916845   .0040523    22.63   0.000     .0835368    .0998322
                 NJ  |   .0388771   .0048554     8.01   0.000     .0291148    .0486395
                 PA  |   .0182057   .0034778     5.23   0.000     .0112131    .0251984
                 OH  |   .0121398   .0035431     3.43   0.001     .0050159    .0192638
                 IN  |   -.003933   .0043386    -0.91   0.369    -.0126563    .0047903
                 IL  |   .0356711   .0044281     8.06   0.000     .0267678    .0445743
                 MI  |   .0479909   .0045716    10.50   0.000     .0387991    .0571828
                 WI  |  -.0000253   .0034898    -0.01   0.994     -.007042    .0069913
                 MN  |   .0182385   .0038072     4.79   0.000     .0105835    .0258934
                 IA  |   .0115005   .0112105     1.03   0.310    -.0110396    .0340407
                 MO  |  -.0095512   .0033975    -2.81   0.007    -.0163824     -.00272
                 ND  |  -.0522694   .0110207    -4.74   0.000    -.0744281   -.0301107
                 SD  |  -.0724969   .0110053    -6.59   0.000    -.0946246   -.0503691
                 NE  |  -.0271426   .0114646    -2.37   0.022    -.0501937   -.0040914
                 KS  |  -.0323884   .0115189    -2.81   0.007    -.0555488    -.009228
                 DE  |  -.0525941   .0011706   -44.93   0.000    -.0549477   -.0502406
                 MD  |  -.0534302   .0048168   -11.09   0.000    -.0631149   -.0437454
                 DC  |  -.0600907   .0070432    -8.53   0.000    -.0742519   -.0459295
                 VA  |  -.0817972   .0117712    -6.95   0.000    -.1054649   -.0581296
                 NC  |  -.1074856   .0117299    -9.16   0.000    -.1310702   -.0839011
                 SC  |  -.1125561   .0117143    -9.61   0.000    -.1361093    -.089003
                 GA  |  -.0716513   .0119626    -5.99   0.000    -.0957038   -.0475988
                 FL  |  -.0595544   .0122133    -4.88   0.000    -.0841108    -.034998
                 KY  |  -.0479168    .002756   -17.39   0.000    -.0534581   -.0423755
                 TN  |   -.061479   .0117571    -5.23   0.000    -.0851182   -.0378397
                 AL  |  -.0363519   .0116649    -3.12   0.003    -.0598058    -.012898
                 MS  |  -.0863049   .0112782    -7.65   0.000    -.1089813   -.0636284
                 AR  |  -.0902025   .0115121    -7.84   0.000    -.1133491   -.0670559
                 LA  |  -.0675073   .0118724    -5.69   0.000    -.0913783   -.0436362
                 OK  |   -.081732   .0072508   -11.27   0.000    -.0963106   -.0671534
                 TX  |  -.0699912   .0121756    -5.75   0.000    -.0944719   -.0455106
                 ID  |  -.0538132   .0113266    -4.75   0.000    -.0765868   -.0310395
                 WY  |  -.0515507   .0114154    -4.52   0.000    -.0745029   -.0285984
                 CO  |  -.0564849   .0046378   -12.18   0.000    -.0658098   -.0471601
                 NM  |  -.0816566   .0040643   -20.09   0.000    -.0898284   -.0734848
                 AZ  |  -.0658123   .0121311    -5.43   0.000    -.0902034   -.0414211
                 UT  |  -.0624558   .0121906    -5.12   0.000    -.0869667   -.0379448
                 NV  |   .0494945   .0122851     4.03   0.000     .0247936    .0741954
                 WA  |   .0454427   .0038077    11.93   0.000     .0377868    .0530985
                 OR  |   .0042773   .0036897     1.16   0.252    -.0031413     .011696
                 CA  |   .0186273   .0055808     3.34   0.002     .0074064    .0298481
                 AK  |    .035546   .0050249     7.07   0.000     .0254428    .0456491
                 HI  |   .0500764   .0042035    11.91   0.000     .0416246    .0585282
                     |
                year |
               1990  |  -.0065678   .0028226    -2.33   0.024     -.012243   -.0008926
               1991  |  -.0083629   .0031999    -2.61   0.012    -.0147968    -.001929
               1992  |  -.0117326   .0026105    -4.49   0.000    -.0169813   -.0064839
               1993  |  -.0143605   .0035621    -4.03   0.000    -.0215225   -.0071984
               1996  |  -.0276229   .0036343    -7.60   0.000    -.0349301   -.0203158
               1997  |  -.0283342   .0041517    -6.82   0.000    -.0366817   -.0199867
               1998  |  -.0341215   .0040711    -8.38   0.000     -.042307   -.0259359
               1999  |  -.0331627   .0039591    -8.38   0.000    -.0411231   -.0252023
               2000  |  -.0366209   .0048373    -7.57   0.000    -.0463468   -.0268949
               2001  |  -.0393642   .0051335    -7.67   0.000    -.0496859   -.0290425
               2002  |  -.0423638   .0054167    -7.82   0.000    -.0532547   -.0314729
               2003  |   -.047696   .0044513   -10.71   0.000    -.0566461    -.038746
               2004  |  -.0522164   .0048241   -10.82   0.000    -.0619158    -.042517
               2005  |  -.0571635   .0050781   -11.26   0.000    -.0673737   -.0469534
               2006  |  -.0624995   .0056445   -11.07   0.000    -.0738485   -.0511505
               2007  |  -.0614878   .0049185   -12.50   0.000    -.0713771   -.0515986
               2008  |  -.0520896   .0050876   -10.24   0.000    -.0623189   -.0418603
               2009  |  -.0551053   .0049765   -11.07   0.000    -.0651113   -.0450993
               2010  |  -.0604473   .0059193   -10.21   0.000    -.0723489   -.0485458
               2011  |  -.0619108   .0054845   -11.29   0.000    -.0729381   -.0508834
               2012  |   -.059481   .0056787   -10.47   0.000    -.0708988   -.0480632
               2013  |  -.0628597   .0046163   -13.62   0.000    -.0721413    -.053578
               2014  |  -.0604277   .0059326   -10.19   0.000    -.0723559   -.0484994
               2015  |  -.0621174   .0054436   -11.41   0.000    -.0730625   -.0511722
               2016  |   -.062769   .0050848   -12.34   0.000    -.0729926   -.0525454
               2017  |  -.0589011    .005118   -11.51   0.000    -.0691915   -.0486108
               2018  |  -.0584864   .0032134   -18.20   0.000    -.0649473   -.0520254
               2019  |  -.0585862   .0050861   -11.52   0.000    -.0688125   -.0483599
                     |
                nind |
                  2  |    .092465    .017433     5.30   0.000     .0574135    .1275165
                  3  |   .0892148   .0101203     8.82   0.000     .0688665    .1095631
                  4  |   .0178247   .0096555     1.85   0.071    -.0015889    .0372383
                  5  |   .1776362   .0088159    20.15   0.000     .1599107    .1953618
                  6  |    .011119   .0093646     1.19   0.241    -.0077099    .0299478
                  7  |    .005969   .0065849     0.91   0.369    -.0072709    .0192089
                  8  |   .0219871   .0137434     1.60   0.116    -.0056459    .0496202
                  9  |   .1221365   .0163873     7.45   0.000     .0891878    .1550853
                 10  |   .0176165   .0172488     1.02   0.312    -.0170646    .0522975
                 11  |   .0875382   .0161482     5.42   0.000     .0550702    .1200063
                     |
                educ |   .0100965   .0019652     5.14   0.000     .0061452    .0140478
               exper |   .0047683   .0007359     6.48   0.000     .0032887    .0062479
              exper2 |   .0000782   .0000341     2.29   0.026     9.61e-06    .0001467
              exper3 |  -3.95e-06   1.33e-06    -2.98   0.005    -6.61e-06   -1.28e-06
              exper4 |   2.87e-08   1.65e-08     1.73   0.089    -4.58e-09    6.19e-08
                edex |  -.0001202   .0000307    -3.92   0.000    -.0001819   -.0000586
                     |
               ee_cl |
                  2  |  -.0135539    .004532    -2.99   0.004    -.0226662   -.0044417
                  3  |  -.0066441   .0054514    -1.22   0.229    -.0176048    .0043165
                  4  |  -.0323355   .0106577    -3.03   0.004    -.0537643   -.0109067
                  5  |  -.0550206   .0074107    -7.42   0.000    -.0699209   -.0401204
                  6  |  -.0005683   .0034897    -0.16   0.871    -.0075849    .0064482
                  7  |   .0182308   .0062458     2.92   0.005     .0056728    .0307888
                  8  |  -.0434679   .0121516    -3.58   0.001    -.0679004   -.0190354
                  9  |  -.0538904   .0059727    -9.02   0.000    -.0658993   -.0418814
                 10  |   .0177124   .0054827     3.23   0.002     .0066887     .028736
                 11  |   .0169912   .0074723     2.27   0.027     .0019671    .0320152
                 12  |  -.0576004   .0131745    -4.37   0.000    -.0840895   -.0311112
                 13  |   .0009044   .0093173     0.10   0.923    -.0178293     .019638
                 14  |    .034718   .0063924     5.43   0.000     .0218652    .0475708
                 15  |   .0088698   .0083553     1.06   0.294    -.0079297    .0256693
                 16  |  -.0652238   .0142906    -4.56   0.000     -.093957   -.0364905
                     |
                marr |   .0157911   .0018077     8.74   0.000     .0121566    .0194257
               partt |  -.0545678   .0054467   -10.02   0.000    -.0655191   -.0436165
              public |   .2721524   .0281952     9.65   0.000     .2154621    .3288428
                cmsa |   .0362099   .0051611     7.02   0.000     .0258328    .0465871
                     |
               nocc2 |
                  2  |   .0517833   .0031176    16.61   0.000      .045515    .0580515
                  3  |   .0321756    .005124     6.28   0.000     .0218731     .042478
                  4  |   .1622627   .0104362    15.55   0.000     .1412793    .1832461
                  5  |   .1421668   .0169297     8.40   0.000     .1081273    .1762063
                  6  |   .1355821   .0077638    17.46   0.000     .1199719    .1511924
                  7  |   .0722376   .0053855    13.41   0.000     .0614093    .0830659
                  8  |   .0663763   .0086586     7.67   0.000      .048967    .0837856
                  9  |   .1663366   .0114844    14.48   0.000     .1432456    .1894276
                 10  |   .1819926   .0131473    13.84   0.000     .1555581    .2084271
                 11  |    .199322   .0159364    12.51   0.000     .1672797    .2313642
                 12  |    .202895   .0168138    12.07   0.000     .1690885    .2367014
                     |
             quarter |
                  2  |  -.0030419   .0014285    -2.13   0.038    -.0059141   -.0001697
                  3  |  -.0026936   .0012528    -2.15   0.037    -.0052126   -.0001747
                  4  |  -.0038571   .0010205    -3.78   0.000    -.0059088   -.0018053
                     |
               _cons |  -.2017047   .0472428    -4.27   0.000    -.2966927   -.1067167
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all

. 
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr pa
> rtt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 9,843,204,503)

Linear regression                               Number of obs     =  1,101,354
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2140
                                                Root MSE          =     .32715

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0294433   .0056365    -5.22   0.000    -.0407763   -.0181104
            treat_st |  -.0331479   .0107543    -3.08   0.003    -.0547708    -.011525
treat_sthisprelwhite |   .0057983   .0090611     0.64   0.525    -.0124203     .024017
                     |
               state |
                 NH  |  -.0439731   .0034059   -12.91   0.000    -.0508211   -.0371252
                 VT  |  -.0476254     .00176   -27.06   0.000    -.0511641   -.0440867
                 MA  |   .0047736   .0046493     1.03   0.310    -.0045745    .0141217
                 RI  |   .0087562    .004771     1.84   0.073    -.0008365    .0183489
                 CT  |   .0097724   .0045699     2.14   0.038      .000584    .0189608
                 NY  |    .093072    .004333    21.48   0.000     .0843599    .1017841
                 NJ  |   .0399211   .0050052     7.98   0.000     .0298574    .0499848
                 PA  |   .0189394   .0035838     5.28   0.000     .0117336    .0261451
                 OH  |   .0133119   .0036711     3.63   0.001     .0059306    .0206931
                 IN  |  -.0037718   .0043128    -0.87   0.386    -.0124433    .0048997
                 IL  |   .0375542   .0046006     8.16   0.000     .0283041    .0468043
                 MI  |   .0508338   .0050392    10.09   0.000     .0407019    .0609658
                 WI  |  -.0007821   .0034819    -0.22   0.823    -.0077829    .0062186
                 MN  |   .0166777   .0038558     4.33   0.000     .0089252    .0244303
                 IA  |   .0095431   .0109293     0.87   0.387    -.0124316    .0315179
                 MO  |  -.0091753   .0034516    -2.66   0.011    -.0161153   -.0022353
                 ND  |  -.0552788   .0106489    -5.19   0.000    -.0766899   -.0338677
                 SD  |  -.0753691   .0107121    -7.04   0.000    -.0969073   -.0538309
                 NE  |  -.0304799   .0110737    -2.75   0.008     -.052745   -.0082147
                 KS  |  -.0332908   .0112364    -2.96   0.005     -.055883   -.0106985
                 DE  |  -.0538348   .0015319   -35.14   0.000     -.056915   -.0507546
                 MD  |  -.0540678   .0047161   -11.46   0.000    -.0635502   -.0445855
                 DC  |   -.056824   .0076759    -7.40   0.000    -.0722573   -.0413906
                 VA  |  -.0830925   .0114244    -7.27   0.000    -.1060627   -.0601223
                 NC  |  -.1064521   .0117031    -9.10   0.000    -.1299827   -.0829215
                 SC  |  -.1106366   .0118204    -9.36   0.000    -.1344031   -.0868702
                 GA  |  -.0703838   .0120037    -5.86   0.000    -.0945188   -.0462487
                 FL  |  -.0582337   .0123909    -4.70   0.000    -.0831474   -.0333201
                 KY  |  -.0463354   .0031046   -14.92   0.000    -.0525776   -.0400931
                 TN  |    -.06032   .0117411    -5.14   0.000    -.0839271   -.0367128
                 AL  |  -.0344592   .0117538    -2.93   0.005    -.0580919   -.0108265
                 MS  |  -.0830632   .0116848    -7.11   0.000    -.1065571   -.0595692
                 AR  |  -.0889413   .0115125    -7.73   0.000    -.1120887   -.0657939
                 LA  |  -.0653333    .012118    -5.39   0.000    -.0896982   -.0409684
                 OK  |  -.0824962     .00705   -11.70   0.000    -.0966712   -.0683212
                 TX  |  -.0689122   .0122509    -5.63   0.000    -.0935444   -.0442801
                 ID  |  -.0534198   .0112069    -4.77   0.000    -.0759527   -.0308869
                 WY  |  -.0527083   .0110866    -4.75   0.000    -.0749994   -.0304171
                 CO  |   -.057211   .0045943   -12.45   0.000    -.0664485   -.0479735
                 NM  |  -.0803555   .0042593   -18.87   0.000    -.0889194   -.0717916
                 AZ  |  -.0642618   .0123506    -5.20   0.000    -.0890943   -.0394294
                 UT  |   -.063744   .0118534    -5.38   0.000    -.0875767   -.0399112
                 NV  |   .0515326   .0127208     4.05   0.000     .0259558    .0771094
                 WA  |   .0470445     .00416    11.31   0.000     .0386804    .0554087
                 OR  |   .0064842   .0040975     1.58   0.120    -.0017544    .0147227
                 CA  |   .0215881   .0058428     3.69   0.001     .0098404    .0333358
                 AK  |   .0393583   .0064265     6.12   0.000      .026437    .0522797
                 HI  |   .0479844   .0039003    12.30   0.000     .0401423    .0558264
                     |
                year |
               1990  |  -.0059814   .0028712    -2.08   0.043    -.0117543   -.0002085
               1991  |  -.0055322   .0035885    -1.54   0.130    -.0127474    .0016829
               1992  |    -.00769   .0035892    -2.14   0.037    -.0149066   -.0004734
               1993  |  -.0113266   .0037444    -3.02   0.004    -.0188553   -.0037979
               1996  |    -.02741   .0034473    -7.95   0.000    -.0343413   -.0204786
               1997  |  -.0289762   .0038428    -7.54   0.000    -.0367027   -.0212496
               1998  |  -.0355357   .0038891    -9.14   0.000    -.0433553   -.0277162
               1999  |  -.0350952   .0038713    -9.07   0.000    -.0428789   -.0273114
               2000  |  -.0389067   .0046366    -8.39   0.000    -.0482293   -.0295842
               2001  |  -.0403059   .0049812    -8.09   0.000    -.0503214   -.0302905
               2002  |   -.041308   .0054418    -7.59   0.000    -.0522495   -.0303665
               2003  |  -.0462673   .0043522   -10.63   0.000     -.055018   -.0375165
               2004  |  -.0516428   .0047117   -10.96   0.000    -.0611162   -.0421693
               2005  |  -.0574059   .0050172   -11.44   0.000    -.0674937   -.0473182
               2006  |  -.0635372    .005587   -11.37   0.000    -.0747706   -.0523037
               2007  |  -.0626048   .0051104   -12.25   0.000      -.07288   -.0523295
               2008  |  -.0510765   .0049381   -10.34   0.000    -.0610052   -.0411478
               2009  |  -.0478693   .0064601    -7.41   0.000    -.0608582   -.0348805
               2010  |  -.0524656   .0072408    -7.25   0.000    -.0670242   -.0379069
               2011  |   -.055177   .0065741    -8.39   0.000    -.0683952   -.0419589
               2012  |  -.0543604    .006287    -8.65   0.000    -.0670012   -.0417196
               2013  |  -.0589794   .0047922   -12.31   0.000    -.0686149    -.049344
               2014  |  -.0587593   .0059133    -9.94   0.000    -.0706487   -.0468699
               2015  |  -.0620793   .0053481   -11.61   0.000    -.0728324   -.0513262
               2016  |  -.0634317   .0051062   -12.42   0.000    -.0736985   -.0531649
               2017  |  -.0604728   .0048702   -12.42   0.000     -.070265   -.0506806
               2018  |  -.0608509   .0037717   -16.13   0.000    -.0684344   -.0532675
               2019  |  -.0613564   .0055453   -11.06   0.000    -.0725059   -.0502068
                     |
                nind |
                  2  |   .0924437   .0174282     5.30   0.000     .0574021    .1274854
                  3  |   .0891999   .0101146     8.82   0.000     .0688631    .1095367
                  4  |   .0178344   .0096454     1.85   0.071    -.0015591    .0372278
                  5  |    .177643   .0088091    20.17   0.000     .1599312    .1953549
                  6  |   .0111284   .0093581     1.19   0.240    -.0076874    .0299442
                  7  |   .0059683   .0065747     0.91   0.369    -.0072509    .0191876
                  8  |   .0219939   .0137399     1.60   0.116     -.005632    .0496198
                  9  |   .1221273   .0163824     7.45   0.000     .0891883    .1550664
                 10  |    .017625   .0172341     1.02   0.312    -.0170264    .0522765
                 11  |   .0875373   .0161372     5.42   0.000     .0550912    .1199833
                     |
                educ |   .0101001   .0019708     5.12   0.000     .0061375    .0140626
               exper |   .0047875    .000735     6.51   0.000     .0033097    .0062653
              exper2 |   .0000771   .0000341     2.26   0.029     8.45e-06    .0001457
              exper3 |  -3.91e-06   1.33e-06    -2.94   0.005    -6.59e-06   -1.24e-06
              exper4 |   2.83e-08   1.66e-08     1.71   0.095    -5.08e-09    6.17e-08
                edex |  -.0001206   .0000307    -3.93   0.000    -.0001823   -.0000589
                     |
               ee_cl |
                  2  |  -.0135338    .004527    -2.99   0.004     -.022636   -.0044316
                  3  |  -.0066408   .0054456    -1.22   0.229    -.0175899    .0043083
                  4  |  -.0323277   .0106812    -3.03   0.004    -.0538036   -.0108517
                  5  |    -.05503   .0074044    -7.43   0.000    -.0699176   -.0401425
                  6  |  -.0005879    .003495    -0.17   0.867    -.0076151    .0064393
                  7  |   .0182404   .0062438     2.92   0.005     .0056864    .0307945
                  8  |  -.0434402   .0121757    -3.57   0.001    -.0679211   -.0189593
                  9  |  -.0539092   .0059636    -9.04   0.000    -.0658998   -.0419186
                 10  |   .0176781   .0054918     3.22   0.002     .0066362    .0287201
                 11  |   .0170065   .0074709     2.28   0.027     .0019854    .0320277
                 12  |  -.0575618   .0131951    -4.36   0.000    -.0840922   -.0310313
                 13  |   .0008111   .0093145     0.09   0.931     -.017917    .0195391
                 14  |   .0346823   .0063991     5.42   0.000     .0218161    .0475485
                 15  |   .0088603    .008357     1.06   0.294    -.0079425    .0256632
                 16  |  -.0651838   .0143064    -4.56   0.000    -.0939487   -.0364189
                     |
                marr |   .0158013    .001806     8.75   0.000       .01217    .0194326
               partt |  -.0544972   .0054515   -10.00   0.000    -.0654582   -.0435361
              public |   .2721632   .0281999     9.65   0.000     .2154634    .3288629
                cmsa |   .0361854   .0051705     7.00   0.000     .0257894    .0465814
                     |
               nocc2 |
                  2  |   .0517838   .0031189    16.60   0.000     .0455128    .0580548
                  3  |   .0321791   .0051231     6.28   0.000     .0218784    .0424798
                  4  |   .1622549   .0104387    15.54   0.000     .1412664    .1832434
                  5  |   .1421527   .0169324     8.40   0.000     .1081077    .1761976
                  6  |   .1355973   .0077628    17.47   0.000     .1199891    .1512054
                  7  |   .0722409   .0053877    13.41   0.000     .0614082    .0830736
                  8  |    .066345   .0086572     7.66   0.000     .0489385    .0837515
                  9  |   .1663537    .011484    14.49   0.000     .1432635    .1894439
                 10  |   .1820068   .0131469    13.84   0.000     .1555731    .2084405
                 11  |   .1993073   .0159396    12.50   0.000     .1672587    .2313559
                 12  |    .202889    .016815    12.07   0.000     .1690801    .2366979
                     |
               unemp |  -.0018146   .0012547    -1.45   0.155    -.0043374    .0007082
                     |
             quarter |
                  2  |  -.0030507    .001435    -2.13   0.039    -.0059359   -.0001655
                  3  |   -.002697   .0012544    -2.15   0.037    -.0052191   -.0001749
                  4  |  -.0038556   .0010187    -3.78   0.000    -.0059039   -.0018073
                     |
               _cons |  -.1932114   .0491812    -3.93   0.000    -.2920969   -.0943259
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all_unemp 

. 
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_c
> l marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 9,843,204,503)

Linear regression                               Number of obs     =  1,101,354
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2146
                                                Root MSE          =     .32704

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0297332    .005938    -5.01   0.000    -.0416724   -.0177941
            treat_st |   .0185676   .0088946     2.09   0.042     .0006837    .0364515
treat_sthisprelwhite |   .0032372   .0095322     0.34   0.736    -.0159285    .0224029
                     |
               state |
                 NH  |  -.1899403   .0064777   -29.32   0.000    -.2029646   -.1769161
                 VT  |  -.2496425   .0059778   -41.76   0.000    -.2616617   -.2376233
                 MA  |  -.0838614   .0076763   -10.92   0.000    -.0992957   -.0684271
                 RI  |  -.0638541    .009421    -6.78   0.000    -.0827963    -.044912
                 CT  |  -.0745743   .0089066    -8.37   0.000    -.0924822   -.0566665
                 NY  |   .0564719   .0097009     5.82   0.000     .0369668     .075977
                 NJ  |   .0894346   .0093895     9.52   0.000     .0705557    .1083136
                 PA  |   .1075432   .0070095    15.34   0.000     .0934495    .1216368
                 OH  |   .1884181   .0091094    20.68   0.000     .1701023    .2067338
                 IN  |   .3964899   .0295571    13.41   0.000     .3370613    .4559185
                 IL  |   .1427809   .0073547    19.41   0.000     .1279933    .1575686
                 MI  |   .3559213   .0271838    13.09   0.000     .3012646    .4105781
                 WI  |   .2780684   .0230427    12.07   0.000      .231738    .3243989
                 MN  |   .0421471   .0084324     5.00   0.000     .0251927    .0591016
                 IA  |   .0575769   .0099394     5.79   0.000     .0375925    .0775614
                 MO  |  -.0249361   .0062221    -4.01   0.000    -.0374465   -.0124258
                 ND  |  -.1809437   .0161341   -11.22   0.000    -.2133834    -.148504
                 SD  |   -.077251   .0154765    -4.99   0.000    -.1083686   -.0461333
                 NE  |   -.071219   .0108249    -6.58   0.000    -.0929838   -.0494541
                 KS  |  -.0341692   .0110994    -3.08   0.003    -.0564861   -.0118523
                 DE  |   .0538255   .0117002     4.60   0.000     .0303008    .0773502
                 MD  |  -.1492711   .0114186   -13.07   0.000    -.1722297   -.1263124
                 DC  |  -.2199757   .0131327   -16.75   0.000    -.2463809   -.1935706
                 VA  |   -.285576   .0099686   -28.65   0.000    -.3056192   -.2655328
                 NC  |  -.3460653   .0121322   -28.52   0.000    -.3704588   -.3216717
                 SC  |  -.3928403   .0134173   -29.28   0.000    -.4198175    -.365863
                 GA  |  -.2465332   .0113481   -21.72   0.000    -.2693501   -.2237163
                 FL  |  -.2586537   .0123763   -20.90   0.000    -.2835379   -.2337695
                 KY  |  -.1424322   .0157405    -9.05   0.000    -.1740807   -.1107838
                 TN  |  -.0891397   .0106129    -8.40   0.000    -.1104785    -.067801
                 AL  |   .0062893   .0116872     0.54   0.593    -.0172094    .0297879
                 MS  |  -.2225605   .0134939   -16.49   0.000    -.2496918   -.1954292
                 AR  |  -.1385216   .0107217   -12.92   0.000    -.1600791   -.1169641
                 LA  |  -.2302184   .0112026   -20.55   0.000    -.2527428   -.2076941
                 OK  |  -.0778036   .0406862    -1.91   0.062    -.1596087    .0040015
                 TX  |  -.2652996   .0136177   -19.48   0.000    -.2926798   -.2379193
                 ID  |  -.0502134   .0106511    -4.71   0.000    -.0716288   -.0287979
                 WY  |  -.1039989   .0108544    -9.58   0.000    -.1258232   -.0821746
                 CO  |  -.2547563   .0099446   -25.62   0.000    -.2747512   -.2347615
                 NM  |  -.2201586    .009342   -23.57   0.000    -.2389419   -.2013753
                 AZ  |    -.31067    .011158   -27.84   0.000    -.3331046   -.2882354
                 UT  |  -.1399388   .0133044   -10.52   0.000    -.1666891   -.1131886
                 NV  |   -.076907   .0156153    -4.93   0.000    -.1083038   -.0455103
                 WA  |    .104432   .0091848    11.37   0.000     .0859647    .1228993
                 OR  |   .0168783   .0068331     2.47   0.017     .0031394    .0306171
                 CA  |  -.0688486   .0125993    -5.46   0.000    -.0941812    -.043516
                 AK  |  -.1250775   .0127744    -9.79   0.000     -.150762   -.0993929
                 HI  |   .0131181   .0132138     0.99   0.326      -.01345    .0396862
                     |
       state#c.lyear |
                 ME  |  -.0024025   .0000967   -24.86   0.000    -.0025969   -.0022082
                 NH  |   -.001006   .0001202    -8.37   0.000    -.0012476   -.0007645
                 VT  |   -.000436   .0000789    -5.53   0.000    -.0005945   -.0002774
                 MA  |  -.0015376   .0000721   -21.33   0.000    -.0016826   -.0013926
                 RI  |  -.0017139   .0000981   -17.47   0.000    -.0019111   -.0015167
                 CT  |  -.0015852   .0000997   -15.90   0.000    -.0017856   -.0013848
                 NY  |  -.0020541   .0000733   -28.03   0.000    -.0022015   -.0019068
                 NJ  |  -.0028851   .0000839   -34.39   0.000    -.0030538   -.0027164
                 PA  |  -.0032651   .0000781   -41.79   0.000    -.0034222    -.003108
                 OH  |  -.0041033   .0000711   -57.68   0.000    -.0042463   -.0039603
                 IN  |  -.0063963   .0003073   -20.82   0.000    -.0070141   -.0057785
                 IL  |  -.0034351   .0000614   -55.94   0.000    -.0035586   -.0033117
                 MI  |  -.0054966   .0002745   -20.03   0.000    -.0060484   -.0049448
                 WI  |   -.005171   .0002359   -21.92   0.000    -.0056454   -.0046967
                 MN  |  -.0026348   .0000669   -39.37   0.000    -.0027694   -.0025003
                 IA  |   -.003352   .0000742   -45.18   0.000    -.0035011   -.0032028
                 MO  |  -.0022514   .0000658   -34.21   0.000    -.0023837   -.0021191
                 ND  |  -.0016639   .0001047   -15.89   0.000    -.0018744   -.0014533
                 SD  |  -.0028721   .0000579   -49.57   0.000    -.0029886   -.0027556
                 NE  |  -.0024758   .0000633   -39.12   0.000    -.0026031   -.0023486
                 KS  |  -.0028827   .0000627   -45.98   0.000    -.0030088   -.0027566
                 DE  |  -.0034966   .0001408   -24.84   0.000    -.0037796   -.0032135
                 MD  |  -.0014895   .0000827   -18.01   0.000    -.0016558   -.0013232
                 DC  |  -.0008755   .0000427   -20.48   0.000    -.0009614   -.0007895
                 VA  |  -.0009244   .0000912   -10.13   0.000    -.0011078    -.000741
                 NC  |  -.0005931   .0001328    -4.47   0.000      -.00086   -.0003262
                 SC  |  -.0001927   .0001186    -1.62   0.111    -.0004312    .0000458
                 GA  |  -.0012098   .0000949   -12.75   0.000    -.0014005    -.001019
                 FL  |  -.0009783   .0000567   -17.25   0.000    -.0010924   -.0008643
                 KY  |  -.0015371   .0001614    -9.52   0.000    -.0018616   -.0012126
                 TN  |  -.0026269   .0001048   -25.07   0.000    -.0028376   -.0024162
                 AL  |  -.0033067   .0000963   -34.34   0.000    -.0035003   -.0031131
                 MS  |  -.0015777   .0001015   -15.55   0.000    -.0017818   -.0013737
                 AR  |  -.0024327   .0001129   -21.55   0.000    -.0026596   -.0022057
                 LA  |  -.0013153   .0000673   -19.53   0.000    -.0014507   -.0011799
                 OK  |  -.0027261   .0004273    -6.38   0.000    -.0035852    -.001867
                 TX  |  -.0010099   .0000686   -14.73   0.000    -.0011478    -.000872
                 ID  |   -.002928   .0001003   -29.18   0.000    -.0031297   -.0027263
                 WY  |  -.0024082   .0000419   -57.48   0.000    -.0024925    -.002324
                 CO  |  -.0005083   .0000444   -11.44   0.000    -.0005976    -.000419
                 NM  |    -.00109   .0001091    -9.99   0.000    -.0013093   -.0008707
                 AZ  |   -.000541   .0000757    -7.15   0.000    -.0006932   -.0003888
                 UT  |  -.0021505   .0000912   -23.58   0.000    -.0023339   -.0019671
                 NV  |  -.0016736   .0000501   -33.43   0.000    -.0017742   -.0015729
                 WA  |   -.002958   .0000831   -35.59   0.000    -.0031251   -.0027909
                 OR  |  -.0025222   .0000841   -29.97   0.000    -.0026914    -.002353
                 CA  |  -.0015478   .0000543   -28.51   0.000    -.0016569   -.0014387
                 AK  |  -.0008149   .0000307   -26.57   0.000    -.0008766   -.0007532
                 HI  |  -.0020465   .0000602   -34.02   0.000    -.0021675   -.0019256
                     |
                nind |
                  2  |    .090743   .0174636     5.20   0.000     .0556301    .1258559
                  3  |   .0879422   .0100628     8.74   0.000     .0677096    .1081749
                  4  |   .0164982   .0096893     1.70   0.095    -.0029834    .0359797
                  5  |   .1763543   .0088156    20.00   0.000     .1586293    .1940792
                  6  |   .0098363   .0093911     1.05   0.300    -.0090458    .0287184
                  7  |   .0043331   .0065594     0.66   0.512    -.0088554    .0175216
                  8  |   .0209419   .0137147     1.53   0.133    -.0066334    .0485172
                  9  |   .1210265   .0163377     7.41   0.000     .0881773    .1538757
                 10  |   .0173385   .0171405     1.01   0.317    -.0171249    .0518019
                 11  |   .0867706   .0161455     5.37   0.000     .0543079    .1192333
                     |
                educ |   .0102562   .0019686     5.21   0.000      .006298    .0142144
               exper |   .0051009   .0007327     6.96   0.000     .0036278     .006574
              exper2 |   .0000501   .0000326     1.54   0.131    -.0000155    .0001158
              exper3 |  -3.05e-06   1.29e-06    -2.36   0.022    -5.65e-06   -4.51e-07
              exper4 |   2.00e-08   1.65e-08     1.22   0.229    -1.30e-08    5.31e-08
                edex |  -.0001262   .0000308    -4.10   0.000     -.000188   -.0000644
                     |
               ee_cl |
                  2  |  -.0140052   .0045572    -3.07   0.003     -.023168   -.0048424
                  3  |  -.0072652   .0054605    -1.33   0.190    -.0182443    .0037139
                  4  |  -.0329479   .0106446    -3.10   0.003    -.0543503   -.0115455
                  5  |  -.0543774   .0071834    -7.57   0.000    -.0688205   -.0399342
                  6  |  -.0008478   .0035353    -0.24   0.811    -.0079559    .0062603
                  7  |   .0183091   .0062716     2.92   0.005     .0056992    .0309191
                  8  |  -.0436001   .0121485    -3.59   0.001    -.0680263   -.0191739
                  9  |   -.053439   .0059062    -9.05   0.000    -.0653142   -.0415638
                 10  |   .0171416   .0055356     3.10   0.003     .0060115    .0282718
                 11  |   .0169338   .0075336     2.25   0.029     .0017865    .0320812
                 12  |  -.0574511   .0131145    -4.38   0.000    -.0838197   -.0310826
                 13  |    .000303   .0094017     0.03   0.974    -.0186004    .0192065
                 14  |   .0344996   .0065044     5.30   0.000     .0214216    .0475777
                 15  |    .008506   .0084103     1.01   0.317     -.008404    .0254161
                 16  |  -.0653654   .0142301    -4.59   0.000     -.093977   -.0367539
                     |
                marr |   .0156432   .0017978     8.70   0.000     .0120285    .0192579
               partt |  -.0544923   .0054899    -9.93   0.000    -.0655304   -.0434542
              public |   .2719649   .0282432     9.63   0.000     .2151782    .3287517
                cmsa |   .0356284   .0053866     6.61   0.000     .0247979    .0464588
                     |
               nocc2 |
                  2  |   .0515785   .0031058    16.61   0.000     .0453338    .0578231
                  3  |    .032177   .0051463     6.25   0.000     .0218296    .0425245
                  4  |   .1617293   .0104062    15.54   0.000     .1408062    .1826524
                  5  |   .1419263   .0170251     8.34   0.000      .107695    .1761576
                  6  |   .1355303   .0077427    17.50   0.000     .1199626    .1510981
                  7  |   .0722986    .005351    13.51   0.000     .0615397    .0830576
                  8  |    .066141   .0086315     7.66   0.000     .0487863    .0834958
                  9  |   .1658798   .0115304    14.39   0.000     .1426964    .1890632
                 10  |   .1819619   .0131307    13.86   0.000     .1555608     .208363
                 11  |   .1991345   .0159385    12.49   0.000      .167088    .2311811
                 12  |   .2029898   .0167989    12.08   0.000     .1692133    .2367662
                     |
               unemp |  -.0003179    .000347    -0.92   0.364    -.0010156    .0003797
                     |
             quarter |
                  2  |  -.0029805   .0014625    -2.04   0.047     -.005921   -.0000401
                  3  |  -.0027052    .001279    -2.12   0.040    -.0052769   -.0001336
                  4  |  -.0038549    .001044    -3.69   0.001    -.0059539   -.0017559
                     |
               _cons |   .0071147   .0522493     0.14   0.892    -.0979396     .112169
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_mal_all_sltt 

.         
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr pa
> rtt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,909,936,593)

Linear regression                               Number of obs     =  1,047,037
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2693
                                                Root MSE          =     .29148

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |   .0039468    .011323     0.35   0.729    -.0188197    .0267133
            treat_st |   -.029873   .0112887    -2.65   0.011    -.0525705   -.0071754
treat_sthisprelwhite |   .0007107   .0140585     0.05   0.960    -.0275558    .0289771
                     |
               state |
                 NH  |  -.0136879   .0012499   -10.95   0.000     -.016201   -.0111748
                 VT  |  -.0056088   .0004285   -13.09   0.000    -.0064703   -.0047474
                 MA  |   .0195713   .0028647     6.83   0.000     .0138115    .0253312
                 RI  |   .0335051   .0028527    11.75   0.000     .0277694    .0392408
                 CT  |   .0276666   .0027148    10.19   0.000     .0222081    .0331251
                 NY  |    .094283   .0029931    31.50   0.000     .0882649    .1003011
                 NJ  |   .0328625   .0032341    10.16   0.000     .0263599    .0393652
                 PA  |   .0104325   .0024456     4.27   0.000     .0055153    .0153497
                 OH  |   .0002302   .0019692     0.12   0.907    -.0037292    .0041896
                 IN  |  -.0357262   .0034553   -10.34   0.000    -.0426736   -.0287789
                 IL  |  -.0018276   .0032069    -0.57   0.571    -.0082755    .0046203
                 MI  |   .0432483   .0028237    15.32   0.000     .0375709    .0489256
                 WI  |   .0017774   .0026332     0.67   0.503    -.0035171    .0070718
                 MN  |   .0385086    .001971    19.54   0.000     .0345457    .0424715
                 IA  |   .0071397   .0112208     0.64   0.528    -.0154211    .0297006
                 MO  |   -.049258    .002089   -23.58   0.000    -.0534581   -.0450578
                 ND  |  -.0338302   .0111124    -3.04   0.004    -.0561732   -.0114871
                 SD  |  -.0455524   .0112408    -4.05   0.000    -.0681535   -.0229513
                 NE  |  -.0145752   .0111308    -1.31   0.197    -.0369551    .0078048
                 KS  |  -.0463966   .0111075    -4.18   0.000    -.0687297   -.0240636
                 DE  |  -.0298032    .000936   -31.84   0.000    -.0316851   -.0279213
                 MD  |  -.0316654   .0030621   -10.34   0.000    -.0378221   -.0255087
                 DC  |  -.0659171   .0035121   -18.77   0.000    -.0729787   -.0588555
                 VA  |  -.0683216   .0110053    -6.21   0.000    -.0904492    -.046194
                 NC  |  -.0889183   .0114088    -7.79   0.000    -.1118573   -.0659794
                 SC  |   -.094974   .0112324    -8.46   0.000    -.1175583   -.0723897
                 GA  |  -.0765471   .0113045    -6.77   0.000    -.0992762   -.0538179
                 FL  |  -.0318866   .0113362    -2.81   0.007    -.0546795   -.0090936
                 KY  |  -.0573123   .0016837   -34.04   0.000    -.0606976    -.053927
                 TN  |   -.057824    .011428    -5.06   0.000    -.0808015   -.0348465
                 AL  |   -.026968   .0112614    -2.39   0.021    -.0496106   -.0043255
                 MS  |  -.0833065    .011257    -7.40   0.000    -.1059403   -.0606728
                 AR  |  -.0685423   .0112659    -6.08   0.000    -.0911939   -.0458908
                 LA  |  -.0640334   .0111388    -5.75   0.000    -.0864294   -.0416375
                 OK  |  -.0613787   .0062841    -9.77   0.000    -.0740138   -.0487436
                 TX  |  -.0633394   .0113073    -5.60   0.000    -.0860743   -.0406046
                 ID  |  -.0414991   .0111435    -3.72   0.001    -.0639047   -.0190935
                 WY  |  -.0829358   .0115533    -7.18   0.000    -.1061652   -.0597064
                 CO  |  -.0424602   .0029794   -14.25   0.000    -.0484507   -.0364696
                 NM  |  -.0718237   .0061091   -11.76   0.000    -.0841069   -.0595404
                 AZ  |  -.0486114   .0111957    -4.34   0.000    -.0711219   -.0261009
                 UT  |  -.0456045   .0111117    -4.10   0.000    -.0679461   -.0232629
                 NV  |   .0678818   .0113805     5.96   0.000     .0449997    .0907639
                 WA  |    .060437   .0021652    27.91   0.000     .0560835    .0647905
                 OR  |   .0436924   .0020806    21.00   0.000      .039509    .0478758
                 CA  |    .038694   .0053105     7.29   0.000     .0280165    .0493715
                 AK  |   .0686972   .0043375    15.84   0.000     .0599759    .0774184
                 HI  |   .0654075   .0025184    25.97   0.000     .0603439    .0704711
                     |
                year |
               1990  |  -.0002667   .0018102    -0.15   0.883    -.0039064     .003373
               1991  |  -.0012936   .0021951    -0.59   0.558    -.0057072    .0031201
               1992  |   .0003532   .0020289     0.17   0.863    -.0037261    .0044325
               1993  |   .0009243   .0028801     0.32   0.750    -.0048665    .0067151
               1996  |   .0005996   .0032683     0.18   0.855    -.0059719     .007171
               1997  |  -.0038679   .0033068    -1.17   0.248    -.0105167    .0027808
               1998  |  -.0058258   .0028073    -2.08   0.043    -.0114702   -.0001813
               1999  |  -.0083094   .0031855    -2.61   0.012    -.0147142   -.0019045
               2000  |  -.0078162   .0037699    -2.07   0.044    -.0153961   -.0002363
               2001  |  -.0060636   .0027658    -2.19   0.033    -.0116246   -.0005026
               2002  |  -.0083025   .0027608    -3.01   0.004    -.0138535   -.0027516
               2003  |  -.0131562   .0026207    -5.02   0.000    -.0184255   -.0078869
               2004  |  -.0146746   .0024205    -6.06   0.000    -.0195413    -.009808
               2005  |  -.0159718   .0031079    -5.14   0.000    -.0222206   -.0097229
               2006  |  -.0176656   .0031246    -5.65   0.000     -.023948   -.0113831
               2007  |  -.0191625    .003103    -6.18   0.000    -.0254015   -.0129234
               2008  |  -.0153202   .0038723    -3.96   0.000     -.023106   -.0075344
               2009  |  -.0144219   .0033111    -4.36   0.000    -.0210792   -.0077646
               2010  |   -.018455   .0030939    -5.96   0.000    -.0246757   -.0122342
               2011  |  -.0170203   .0029735    -5.72   0.000     -.022999   -.0110416
               2012  |  -.0221068   .0035475    -6.23   0.000    -.0292396    -.014974
               2013  |  -.0182511   .0035881    -5.09   0.000    -.0254654   -.0110368
               2014  |  -.0205753   .0036198    -5.68   0.000    -.0278533   -.0132972
               2015  |  -.0205026   .0038947    -5.26   0.000    -.0283334   -.0126718
               2016  |  -.0194457   .0039618    -4.91   0.000    -.0274114     -.01148
               2017  |  -.0220842   .0034585    -6.39   0.000     -.029038   -.0151305
               2018  |  -.0234708   .0043069    -5.45   0.000    -.0321303   -.0148112
               2019  |  -.0240576   .0038009    -6.33   0.000    -.0316999   -.0164154
                     |
                nind |
                  2  |   .0388898   .0108289     3.59   0.001     .0171167    .0606628
                  3  |   .0511071   .0104791     4.88   0.000     .0300375    .0721768
                  4  |   .0476498   .0115808     4.11   0.000     .0243651    .0709345
                  5  |   .1632298   .0115734    14.10   0.000       .13996    .1864996
                  6  |   .0229683   .0096522     2.38   0.021     .0035613    .0423753
                  7  |   .0145442   .0091858     1.58   0.120     -.003925    .0330135
                  8  |   .0299406   .0136578     2.19   0.033     .0024796    .0574015
                  9  |    .144493   .0189522     7.62   0.000      .106387    .1825989
                 10  |   .0178462   .0115896     1.54   0.130    -.0054563    .0411487
                 11  |   .0154231   .0197696     0.78   0.439    -.0243263    .0551726
                     |
                educ |   .0154208   .0018932     8.15   0.000     .0116141    .0192274
               exper |   .0089242   .0010223     8.73   0.000     .0068686    .0109797
              exper2 |  -.0002978   .0000538    -5.54   0.000    -.0004059   -.0001896
              exper3 |   6.20e-06   1.69e-06     3.67   0.001     2.80e-06    9.59e-06
              exper4 |  -5.28e-08   1.81e-08    -2.92   0.005    -8.92e-08   -1.65e-08
                edex |  -.0001699   .0000435    -3.91   0.000    -.0002573   -.0000825
                     |
               ee_cl |
                  2  |  -.0345341   .0042539    -8.12   0.000    -.0430871   -.0259812
                  3  |  -.0642329   .0063499   -10.12   0.000    -.0770002   -.0514655
                  4  |  -.0945134   .0127749    -7.40   0.000     -.120199   -.0688278
                  5  |  -.0410068   .0085442    -4.80   0.000     -.058186   -.0238275
                  6  |  -.0431303   .0053492    -8.06   0.000    -.0538856   -.0323749
                  7  |  -.0618429   .0080867    -7.65   0.000    -.0781022   -.0455836
                  8  |  -.0854046   .0127358    -6.71   0.000    -.1110116   -.0597975
                  9  |   -.032764   .0090602    -3.62   0.001    -.0509807   -.0145473
                 10  |  -.0442325    .006789    -6.52   0.000    -.0578827   -.0305822
                 11  |  -.0629157   .0086907    -7.24   0.000    -.0803896   -.0454418
                 12  |   -.074677   .0123767    -6.03   0.000     -.099562   -.0497921
                 13  |  -.0088171   .0084181    -1.05   0.300    -.0257428    .0081087
                 14  |   -.035041   .0074713    -4.69   0.000     -.050063   -.0200189
                 15  |  -.0528872    .010511    -5.03   0.000     -.074021   -.0317534
                 16  |  -.0650543   .0134193    -4.85   0.000    -.0920356    -.038073
                     |
                marr |  -.0015071   .0007858    -1.92   0.061     -.003087    .0000729
               partt |  -.0523704   .0049336   -10.62   0.000    -.0622901   -.0424507
              public |   .2909151   .0304357     9.56   0.000     .2297202    .3521101
                cmsa |   .0201712    .002829     7.13   0.000     .0144831    .0258593
                     |
               nocc2 |
                  2  |   .0211956   .0018599    11.40   0.000     .0174561    .0249352
                  3  |   .0313288    .006472     4.84   0.000      .018316    .0443416
                  4  |   .1497828   .0067505    22.19   0.000       .13621    .1633555
                  5  |   .1309303   .0161512     8.11   0.000     .0984561    .1634046
                  6  |   .0608495    .005291    11.50   0.000     .0502113    .0714877
                  7  |   .0805324   .0078823    10.22   0.000      .064684    .0963808
                  8  |   .0538344   .0027206    19.79   0.000     .0483642    .0593046
                  9  |   .0914437   .0083581    10.94   0.000     .0746386    .1082488
                 10  |   .1572724   .0133214    11.81   0.000      .130488    .1840568
                 11  |    .190539   .0155232    12.27   0.000     .1593276    .2217504
                 12  |    .165237   .0151861    10.88   0.000     .1347034    .1957707
                     |
             quarter |
                  2  |  -.0009839   .0010386    -0.95   0.348    -.0030722    .0011044
                  3  |   .0002441   .0007936     0.31   0.760    -.0013515    .0018396
                  4  |  -.0024823   .0011142    -2.23   0.031    -.0047225   -.0002421
                     |
               _cons |  -.2314422   .0363313    -6.37   0.000    -.3044911   -.1583933
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all

. 
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr pa
> rtt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,909,936,593)

Linear regression                               Number of obs     =  1,047,037
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2693
                                                Root MSE          =     .29148

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |   .0039545   .0113224     0.35   0.728    -.0188108    .0267197
            treat_st |  -.0301442   .0112098    -2.69   0.010    -.0526829   -.0076054
treat_sthisprelwhite |   .0006511   .0140718     0.05   0.963    -.0276421    .0289442
                     |
               state |
                 NH  |  -.0150422   .0015131    -9.94   0.000    -.0180846   -.0119998
                 VT  |  -.0068676   .0009463    -7.26   0.000    -.0087703   -.0049649
                 MA  |   .0196314   .0028636     6.86   0.000     .0138737    .0253891
                 RI  |   .0347797   .0027974    12.43   0.000     .0291551    .0404043
                 CT  |   .0278161   .0026937    10.33   0.000        .0224    .0332322
                 NY  |   .0951718     .00278    34.23   0.000     .0895823    .1007614
                 NJ  |   .0335378    .003117    10.76   0.000     .0272706     .039805
                 PA  |   .0109054   .0024871     4.38   0.000     .0059047    .0159062
                 OH  |   .0009962    .002042     0.49   0.628    -.0031095    .0051018
                 IN  |   -.035586   .0034432   -10.34   0.000     -.042509   -.0286629
                 IL  |  -.0006261   .0031738    -0.20   0.844    -.0070073    .0057552
                 MI  |   .0450717   .0032145    14.02   0.000     .0386085    .0515349
                 WI  |   .0013409   .0026026     0.52   0.609     -.003892    .0065739
                 MN  |   .0375457   .0020564    18.26   0.000      .033411    .0416804
                 IA  |   .0059418   .0109988     0.54   0.592    -.0161729    .0280564
                 MO  |  -.0490089   .0021032   -23.30   0.000    -.0532376   -.0447802
                 ND  |  -.0356698   .0108867    -3.28   0.002     -.057559   -.0137806
                 SD  |  -.0473292   .0109953    -4.30   0.000    -.0694369   -.0252216
                 NE  |  -.0166221   .0108625    -1.53   0.133    -.0384626    .0052183
                 KS  |  -.0469245   .0109403    -4.29   0.000    -.0689214   -.0249276
                 DE  |  -.0305308   .0011232   -27.18   0.000     -.032789   -.0282725
                 MD  |  -.0320458   .0031416   -10.20   0.000    -.0383624   -.0257293
                 DC  |   -.063841   .0035348   -18.06   0.000    -.0709482   -.0567337
                 VA  |  -.0691081   .0108179    -6.39   0.000    -.0908589   -.0473573
                 NC  |  -.0882434   .0113802    -7.75   0.000    -.1111249   -.0653619
                 SC  |  -.0937251   .0112715    -8.32   0.000     -.116388   -.0710622
                 GA  |  -.0757386   .0113045    -6.70   0.000    -.0984678   -.0530094
                 FL  |  -.0310275   .0113697    -2.73   0.009    -.0538879   -.0081671
                 KY  |  -.0562973   .0017781   -31.66   0.000    -.0598725   -.0527221
                 TN  |  -.0570634   .0114094    -5.00   0.000    -.0800036   -.0341233
                 AL  |  -.0257605   .0113145    -2.28   0.027    -.0485098   -.0030111
                 MS  |  -.0812413   .0114256    -7.11   0.000     -.104214   -.0582686
                 AR  |  -.0677306   .0112414    -6.03   0.000    -.0903328   -.0451283
                 LA  |  -.0626188   .0112395    -5.57   0.000    -.0852172   -.0400203
                 OK  |  -.0618334   .0061905    -9.99   0.000    -.0742803   -.0493866
                 TX  |  -.0626351   .0112961    -5.54   0.000    -.0853474   -.0399229
                 ID  |  -.0412322   .0110633    -3.73   0.001    -.0634766   -.0189879
                 WY  |  -.0836377   .0114043    -7.33   0.000    -.1065676   -.0607077
                 CO  |  -.0428957    .003071   -13.97   0.000    -.0490704    -.036721
                 NM  |  -.0710081   .0057922   -12.26   0.000    -.0826541   -.0593622
                 AZ  |  -.0475974   .0112496    -4.23   0.000    -.0702163   -.0249786
                 UT  |  -.0463891   .0109112    -4.25   0.000    -.0683275   -.0244507
                 NV  |   .0692003   .0115084     6.01   0.000     .0460611    .0923395
                 WA  |   .0614624   .0021971    27.97   0.000     .0570448      .06588
                 OR  |   .0451067   .0021194    21.28   0.000     .0408453    .0493681
                 CA  |   .0405769   .0047801     8.49   0.000     .0309658    .0501879
                 AK  |    .071112     .00434    16.39   0.000     .0623858    .0798382
                 HI  |    .064123   .0030239    21.21   0.000     .0580431     .070203
                     |
                year |
               1990  |   .0001187   .0018548     0.06   0.949    -.0036106     .003848
               1991  |   .0004859   .0026799     0.18   0.857    -.0049024    .0058742
               1992  |   .0028763   .0023361     1.23   0.224    -.0018208    .0075733
               1993  |   .0028031   .0028526     0.98   0.331    -.0029325    .0085387
               1996  |   .0007227   .0031306     0.23   0.818    -.0055718    .0070172
               1997  |  -.0042731   .0031029    -1.38   0.175     -.010512    .0019658
               1998  |    -.00672   .0026625    -2.52   0.015    -.0120733   -.0013667
               1999  |  -.0095177   .0030914    -3.08   0.003    -.0157335    -.003302
               2000  |  -.0092462   .0033365    -2.77   0.008    -.0159546   -.0025377
               2001  |  -.0066515   .0026811    -2.48   0.017    -.0120422   -.0012608
               2002  |  -.0076569   .0028587    -2.68   0.010    -.0134047   -.0019091
               2003  |  -.0122597   .0026151    -4.69   0.000    -.0175178   -.0070017
               2004  |  -.0142985   .0024379    -5.87   0.000    -.0192003   -.0093968
               2005  |  -.0160974   .0030851    -5.22   0.000    -.0223004   -.0098944
               2006  |  -.0183008   .0031154    -5.87   0.000    -.0245647   -.0120368
               2007  |  -.0198325   .0031469    -6.30   0.000    -.0261598   -.0135052
               2008  |  -.0146604   .0040819    -3.59   0.001    -.0228677   -.0064531
               2009  |  -.0098535   .0047564    -2.07   0.044    -.0194169   -.0002901
               2010  |  -.0134596   .0046848    -2.87   0.006    -.0228791   -.0040401
               2011  |   -.012831   .0040809    -3.14   0.003    -.0210361   -.0046258
               2012  |  -.0189018    .004257    -4.44   0.000    -.0274611   -.0103425
               2013  |  -.0158157   .0040378    -3.92   0.000    -.0239343   -.0076971
               2014  |  -.0195256   .0037451    -5.21   0.000    -.0270557   -.0119955
               2015  |  -.0204668   .0039025    -5.24   0.000    -.0283133   -.0126203
               2016  |  -.0198523   .0038592    -5.14   0.000    -.0276118   -.0120928
               2017  |  -.0230628   .0034117    -6.76   0.000    -.0299225   -.0162031
               2018  |  -.0249445   .0041077    -6.07   0.000    -.0332036   -.0166854
               2019  |  -.0257721   .0042028    -6.13   0.000    -.0342225   -.0173217
                     |
                nind |
                  2  |   .0388603   .0108279     3.59   0.001     .0170895    .0606312
                  3  |   .0510866   .0104804     4.87   0.000     .0300144    .0721588
                  4  |   .0476468   .0115866     4.11   0.000     .0243504    .0709432
                  5  |   .1632328   .0115759    14.10   0.000     .1399579    .1865077
                  6  |   .0229595   .0096579     2.38   0.021     .0035411     .042378
                  7  |    .014533   .0091891     1.58   0.120    -.0039429     .033009
                  8  |   .0299324   .0136658     2.19   0.033     .0024555    .0574092
                  9  |   .1444741   .0189582     7.62   0.000     .1063561    .1825921
                 10  |    .017846   .0115911     1.54   0.130    -.0054595    .0411514
                 11  |   .0153962   .0197754     0.78   0.440    -.0243648    .0551573
                     |
                educ |   .0154216   .0018935     8.14   0.000     .0116143    .0192288
               exper |   .0089319    .001024     8.72   0.000      .006873    .0109908
              exper2 |  -.0002982   .0000538    -5.54   0.000    -.0004064     -.00019
              exper3 |   6.21e-06   1.69e-06     3.68   0.001     2.81e-06    9.61e-06
              exper4 |  -5.30e-08   1.81e-08    -2.93   0.005    -8.93e-08   -1.66e-08
                edex |  -.0001701   .0000435    -3.91   0.000    -.0002577   -.0000826
                     |
               ee_cl |
                  2  |  -.0345282   .0042527    -8.12   0.000    -.0430789   -.0259775
                  3  |  -.0642228   .0063414   -10.13   0.000    -.0769731   -.0514725
                  4  |  -.0945027   .0127685    -7.40   0.000    -.1201755   -.0688299
                  5  |  -.0409899   .0085377    -4.80   0.000     -.058156   -.0238238
                  6  |  -.0431303   .0053509    -8.06   0.000     -.053889   -.0323716
                  7  |  -.0618293    .008077    -7.65   0.000    -.0780691   -.0455894
                  8  |  -.0853842   .0127215    -6.71   0.000    -.1109625   -.0598059
                  9  |  -.0327557   .0090557    -3.62   0.001    -.0509633    -.014548
                 10  |  -.0442417    .006795    -6.51   0.000     -.057904   -.0305794
                 11  |  -.0628979   .0086797    -7.25   0.000    -.0803496   -.0454462
                 12  |  -.0746508   .0123579    -6.04   0.000    -.0994981   -.0498036
                 13  |  -.0088562   .0084273    -1.05   0.299    -.0258004     .008088
                 14  |  -.0350462   .0074685    -4.69   0.000    -.0500627   -.0200297
                 15  |  -.0528662   .0104941    -5.04   0.000    -.0739659   -.0317664
                 16  |  -.0650224   .0134005    -4.85   0.000    -.0919659   -.0380789
                     |
                marr |  -.0015054   .0007859    -1.92   0.061    -.0030855    .0000746
               partt |  -.0523556   .0049288   -10.62   0.000    -.0622656   -.0424456
              public |    .290927   .0304386     9.56   0.000      .229726    .3521279
                cmsa |     .02016   .0028305     7.12   0.000     .0144689    .0258511
                     |
               nocc2 |
                  2  |   .0211873   .0018572    11.41   0.000     .0174532    .0249214
                  3  |   .0313182   .0064707     4.84   0.000      .018308    .0443284
                  4  |   .1497825   .0067486    22.19   0.000     .1362135    .1633515
                  5  |   .1309232   .0161505     8.11   0.000     .0984505    .1633959
                  6  |   .0608464   .0052896    11.50   0.000     .0502108    .0714819
                  7  |   .0805214   .0078791    10.22   0.000     .0646794    .0963634
                  8  |   .0538303   .0027191    19.80   0.000     .0483631    .0592975
                  9  |   .0914403   .0083564    10.94   0.000     .0746386    .1082421
                 10  |   .1572507   .0133186    11.81   0.000     .1304719    .1840295
                 11  |   .1905249   .0155199    12.28   0.000     .1593201    .2217297
                 12  |   .1652192   .0151823    10.88   0.000     .1346931    .1957453
                     |
               unemp |  -.0011392   .0007934    -1.44   0.158    -.0027345    .0004561
                     |
             quarter |
                  2  |  -.0009819   .0010389    -0.95   0.349    -.0030707     .001107
                  3  |   .0002405   .0007953     0.30   0.764    -.0013586    .0018395
                  4  |  -.0024805   .0011117    -2.23   0.030    -.0047157   -.0002452
                     |
               _cons |  -.2260821   .0353637    -6.39   0.000    -.2971855   -.1549787
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all_unemp 

. 
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_c
> l marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,909,936,593)

Linear regression                               Number of obs     =  1,047,037
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2698
                                                Root MSE          =     .29139

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |   .0028406   .0116329     0.24   0.808    -.0205488    .0262301
            treat_st |  -.0136356   .0122496    -1.11   0.271    -.0382651    .0109938
treat_sthisprelwhite |   .0018422   .0145164     0.13   0.900     -.027345    .0310293
                     |
               state |
                 NH  |  -.1332712   .0036607   -36.41   0.000    -.1406316   -.1259108
                 VT  |   -.147447   .0041855   -35.23   0.000    -.1558625   -.1390314
                 MA  |  -.0434356   .0085711    -5.07   0.000    -.0606689   -.0262023
                 RI  |  -.0607192   .0062295    -9.75   0.000    -.0732443    -.048194
                 CT  |  -.1006131   .0096492   -10.43   0.000    -.1200142    -.081212
                 NY  |  -.0306332   .0088312    -3.47   0.001    -.0483896   -.0128768
                 NJ  |    .145926   .0079887    18.27   0.000     .1298637    .1619883
                 PA  |   .0916855   .0089054    10.30   0.000     .0737801     .109591
                 OH  |   .0791213   .0077921    10.15   0.000     .0634542    .0947884
                 IN  |   .1289014   .0414485     3.11   0.003     .0455635    .2122393
                 IL  |   .0074899   .0071934     1.04   0.303    -.0069733    .0219532
                 MI  |   .0764613   .0380876     2.01   0.050    -.0001191    .1530416
                 WI  |   .2922586   .0322995     9.05   0.000      .227316    .3572011
                 MN  |    .158436   .0103964    15.24   0.000     .1375328    .1793393
                 IA  |   .0620204   .0144398     4.30   0.000     .0329873    .0910536
                 MO  |  -.0224493   .0061014    -3.68   0.001    -.0347169   -.0101817
                 ND  |   .0146222    .018839     0.78   0.441    -.0232561    .0525006
                 SD  |   .0150785   .0140897     1.07   0.290    -.0132507    .0434078
                 NE  |    .065106   .0142424     4.57   0.000     .0364696    .0937423
                 KS  |   -.066958    .014456    -4.63   0.000    -.0960237   -.0378923
                 DE  |  -.0468756   .0119537    -3.92   0.000    -.0709101   -.0228411
                 MD  |   .0609829   .0139342     4.38   0.000     .0329663    .0889995
                 DC  |  -.0693165   .0111269    -6.23   0.000    -.0916886   -.0469444
                 VA  |   -.025669   .0140058    -1.83   0.073    -.0538296    .0024916
                 NC  |  -.0888479   .0143626    -6.19   0.000    -.1177258     -.05997
                 SC  |  -.1243218   .0130189    -9.55   0.000     -.150498   -.0981457
                 GA  |  -.1126487   .0130047    -8.66   0.000    -.1387964   -.0865011
                 FL  |  -.0294929   .0134743    -2.19   0.034    -.0565848   -.0024009
                 KY  |  -.0717384   .0223169    -3.21   0.002    -.1166094   -.0268673
                 TN  |   .0313795   .0131259     2.39   0.021     .0049882    .0577709
                 AL  |   .0020478   .0124083     0.17   0.870    -.0229008    .0269964
                 MS  |  -.0625525   .0123173    -5.08   0.000    -.0873181   -.0377869
                 AR  |   .1157026   .0128171     9.03   0.000     .0899322    .1414731
                 LA  |  -.1315093   .0176637    -7.45   0.000    -.1670247    -.095994
                 OK  |  -.0517188   .0553302    -0.93   0.355    -.1629676    .0595301
                 TX  |  -.0995314   .0140806    -7.07   0.000    -.1278424   -.0712203
                 ID  |   .0851362   .0150396     5.66   0.000     .0548969    .1153754
                 WY  |   .1311521   .0144051     9.10   0.000     .1021888    .1601155
                 CO  |  -.1586927   .0086186   -18.41   0.000    -.1760214   -.1413639
                 NM  |  -.1261821   .0112257   -11.24   0.000    -.1487528   -.1036114
                 AZ  |  -.0417124   .0150664    -2.77   0.008    -.0720054   -.0114195
                 UT  |    .140304    .015586     9.00   0.000     .1089663    .1716418
                 NV  |   .2003666   .0161138    12.43   0.000     .1679676    .2327657
                 WA  |   .1373374   .0109896    12.50   0.000     .1152412    .1594335
                 OR  |  -.0123746   .0076837    -1.61   0.114    -.0278237    .0030745
                 CA  |  -.0246155   .0098611    -2.50   0.016    -.0444425   -.0047884
                 AK  |  -.0579579   .0088638    -6.54   0.000    -.0757797   -.0401361
                 HI  |   .1522175   .0179601     8.48   0.000     .1161063    .1883288
                     |
       state#c.lyear |
                 ME  |  -.0007684   .0001107    -6.94   0.000    -.0009909   -.0005458
                 NH  |   .0003473   .0001049     3.31   0.002     .0001364    .0005583
                 VT  |   .0006014   .0000757     7.94   0.000     .0004491    .0007537
                 MA  |   -.000162   .0000704    -2.30   0.026    -.0003035   -.0000206
                 RI  |    .000136   .0000886     1.53   0.131    -.0000421     .000314
                 CT  |   .0004676    .000115     4.07   0.000     .0002363    .0006988
                 NY  |   .0004449   .0000524     8.49   0.000     .0003395    .0005504
                 NJ  |  -.0018556   .0000946   -19.61   0.000    -.0020458   -.0016653
                 PA  |  -.0015547   .0000334   -46.61   0.000    -.0016218   -.0014876
                 OH  |  -.0015323    .000055   -27.88   0.000    -.0016428   -.0014218
                 IN  |  -.0023979   .0004301    -5.58   0.000    -.0032627   -.0015332
                 IL  |  -.0008606   .0000722   -11.92   0.000    -.0010057   -.0007155
                 MI  |  -.0011231   .0003751    -2.99   0.004    -.0018774   -.0003689
                 WI  |  -.0035994   .0003241   -11.11   0.000    -.0042511   -.0029477
                 MN  |  -.0019239   .0000267   -72.11   0.000    -.0019776   -.0018703
                 IA  |  -.0014558   .0000405   -35.95   0.000    -.0015372   -.0013744
                 MO  |   -.001029    .000056   -18.36   0.000    -.0011417   -.0009163
                 ND  |  -.0013906   .0000397   -35.06   0.000    -.0014703   -.0013108
                 SD  |  -.0015157   .0000411   -36.85   0.000    -.0015984    -.001433
                 NE  |  -.0016912   .0000503   -33.63   0.000    -.0017923   -.0015901
                 KS  |  -.0007285   .0000438   -16.64   0.000    -.0008165   -.0006404
                 DE  |  -.0005909   .0000556   -10.63   0.000    -.0007027   -.0004791
                 MD  |  -.0016547   .0000531   -31.14   0.000    -.0017616   -.0015479
                 DC  |  -.0007428   .0000225   -33.06   0.000    -.0007879   -.0006976
                 VA  |  -.0013397   .0000558   -24.02   0.000    -.0014519   -.0012276
                 NC  |  -.0009296   .0001286    -7.23   0.000    -.0011881   -.0006711
                 SC  |  -.0006462    .000115    -5.62   0.000    -.0008775   -.0004149
                 GA  |  -.0005807   .0000774    -7.50   0.000    -.0007363    -.000425
                 FL  |  -.0009524   .0000682   -13.96   0.000    -.0010896   -.0008152
                 KY  |  -.0006486   .0002096    -3.09   0.003      -.00107   -.0002272
                 TN  |  -.0017903   .0001228   -14.58   0.000    -.0020372   -.0015434
                 AL  |  -.0012093   .0001081   -11.19   0.000    -.0014266    -.000992
                 MS  |  -.0011283   .0001234    -9.14   0.000    -.0013764   -.0008802
                 AR  |  -.0026997   .0001202   -22.46   0.000    -.0029414    -.002458
                 LA  |  -.0002768   .0000639    -4.33   0.000    -.0004053   -.0001483
                 OK  |  -.0009525   .0005944    -1.60   0.116    -.0021476    .0002426
                 TX  |   -.000583   .0000688    -8.48   0.000    -.0007214   -.0004447
                 ID  |  -.0021373   .0000798   -26.77   0.000    -.0022979   -.0019768
                 WY  |  -.0029242   .0000885   -33.05   0.000    -.0031021   -.0027463
                 CO  |   .0003393   .0000758     4.47   0.000     .0001868    .0004918
                 NM  |  -.0002518   .0000727    -3.46   0.001    -.0003981   -.0001056
                 AZ  |  -.0009953   .0000542   -18.37   0.000    -.0011042   -.0008863
                 UT  |  -.0026965   .0000328   -82.10   0.000    -.0027625   -.0026305
                 NV  |  -.0021864    .000105   -20.82   0.000    -.0023975   -.0019753
                 WA  |  -.0015089   .0000488   -30.89   0.000    -.0016072   -.0014107
                 OR  |  -.0002349   .0000622    -3.78   0.000    -.0003598   -.0001099
                 CA  |  -.0001593   .0001119    -1.42   0.161    -.0003843    .0000657
                 AK  |   .0004732   .0001067     4.44   0.000     .0002588    .0006877
                 HI  |  -.0016144   .0001807    -8.94   0.000    -.0019777   -.0012511
                     |
                nind |
                  2  |   .0385108   .0108677     3.54   0.001     .0166599    .0603616
                  3  |   .0510542   .0104674     4.88   0.000     .0300081    .0721003
                  4  |   .0473402   .0116817     4.05   0.000     .0238526    .0708277
                  5  |   .1628447   .0116677    13.96   0.000     .1393852    .1863042
                  6  |   .0228459   .0097285     2.35   0.023     .0032855    .0424063
                  7  |   .0142741   .0092328     1.55   0.129    -.0042896    .0328377
                  8  |   .0296867   .0137564     2.16   0.036     .0020276    .0573457
                  9  |   .1442846   .0190089     7.59   0.000     .1060646    .1825046
                 10  |   .0178963   .0116524     1.54   0.131    -.0055325     .041325
                 11  |   .0150541   .0198842     0.76   0.453    -.0249257     .055034
                     |
                educ |   .0152253   .0018585     8.19   0.000     .0114886    .0189621
               exper |   .0089724   .0010119     8.87   0.000     .0069379    .0110068
              exper2 |  -.0003034   .0000532    -5.70   0.000    -.0004104   -.0001965
              exper3 |   6.37e-06   1.66e-06     3.84   0.000     3.04e-06    9.70e-06
              exper4 |  -5.44e-08   1.77e-08    -3.08   0.003    -9.00e-08   -1.89e-08
                edex |  -.0001691   .0000428    -3.95   0.000    -.0002552    -.000083
                     |
               ee_cl |
                  2  |  -.0346996   .0041926    -8.28   0.000    -.0431293   -.0262699
                  3  |  -.0640113   .0061853   -10.35   0.000    -.0764476   -.0515749
                  4  |  -.0938513   .0125947    -7.45   0.000    -.1191747   -.0685279
                  5  |  -.0411463   .0084583    -4.86   0.000    -.0581527   -.0241398
                  6  |  -.0434797   .0053004    -8.20   0.000    -.0541368   -.0328226
                  7  |  -.0613703   .0079511    -7.72   0.000    -.0773571   -.0453835
                  8  |  -.0845468   .0125712    -6.73   0.000    -.1098229   -.0592707
                  9  |  -.0329706   .0091308    -3.61   0.001    -.0513293    -.014612
                 10  |  -.0444333   .0066501    -6.68   0.000    -.0578043   -.0310623
                 11  |  -.0624635   .0085558    -7.30   0.000    -.0796661   -.0452609
                 12  |  -.0737857     .01222    -6.04   0.000    -.0983556   -.0492158
                 13  |  -.0095466   .0085897    -1.11   0.272    -.0268173    .0077241
                 14  |  -.0351041    .007325    -4.79   0.000    -.0498321   -.0203761
                 15  |  -.0525665   .0103502    -5.08   0.000    -.0733769   -.0317561
                 16  |  -.0645171   .0132988    -4.85   0.000    -.0912561    -.037778
                     |
                marr |  -.0014679   .0007803    -1.88   0.066    -.0030367    .0001009
               partt |  -.0524146   .0049101   -10.67   0.000     -.062287   -.0425422
              public |    .290969    .030471     9.55   0.000     .2297029    .3522351
                cmsa |   .0203739   .0029424     6.92   0.000     .0144577      .02629
                     |
               nocc2 |
                  2  |   .0212398   .0018432    11.52   0.000     .0175338    .0249457
                  3  |   .0312668   .0064615     4.84   0.000      .018275    .0442585
                  4  |    .149575   .0067481    22.17   0.000      .136007    .1631431
                  5  |   .1309291   .0161735     8.10   0.000       .09841    .1634481
                  6  |   .0607585   .0052839    11.50   0.000     .0501344    .0713826
                  7  |   .0804563   .0078254    10.28   0.000     .0647223    .0961903
                  8  |   .0536368    .002738    19.59   0.000     .0481316     .059142
                  9  |   .0911842    .008339    10.93   0.000     .0744174    .1079509
                 10  |   .1569848   .0132873    11.81   0.000     .1302688    .1837007
                 11  |   .1904781   .0155481    12.25   0.000     .1592165    .2217396
                 12  |   .1651204   .0151674    10.89   0.000     .1346242    .1956165
                     |
               unemp |   .0001342   .0003376     0.40   0.693    -.0005446     .000813
                     |
             quarter |
                  2  |  -.0010278   .0010442    -0.98   0.330    -.0031273    .0010718
                  3  |   .0002072   .0008074     0.26   0.799    -.0014162    .0018305
                  4  |  -.0025067   .0011177    -2.24   0.030     -.004754   -.0002595
                     |
               _cons |  -.1610902   .0321616    -5.01   0.000    -.2257555    -.096425
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_fem_all_sltt 

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 9,854,010,154)

Linear regression                               Number of obs     =  1,102,793
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5184
                                                Root MSE          =     .41745

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1943494   .0145154   -13.39   0.000    -.2235345   -.1651643
            treat_st |  -.0395942   .0178123    -2.22   0.031    -.0754083   -.0037801
treat_sthisprelwhite |   .0162662   .0229236     0.71   0.481    -.0298247    .0623571
                     |
               state |
                 NH  |   .0899024   .0035751    25.15   0.000     .0827142    .0970906
                 VT  |   .0264594    .000736    35.95   0.000     .0249795    .0279393
                 MA  |   .1251442   .0080545    15.54   0.000     .1089495    .1413388
                 RI  |    .032971   .0083413     3.95   0.000     .0161998    .0497422
                 CT  |   .1406647   .0082219    17.11   0.000     .1241334     .157196
                 NY  |   .1042322   .0081861    12.73   0.000     .0877728    .1206915
                 NJ  |   .1643156   .0092708    17.72   0.000     .1456754    .1829558
                 PA  |   .0168775   .0063517     2.66   0.011     .0041066    .0296485
                 OH  |  -.0114583   .0062746    -1.83   0.074    -.0240742    .0011575
                 IN  |   .0157426   .0059136     2.66   0.011     .0038525    .0276327
                 IL  |   .0886599   .0078675    11.27   0.000     .0728412    .1044786
                 MI  |   .0500924   .0065603     7.64   0.000     .0369021    .0632828
                 WI  |   .0283481   .0051009     5.56   0.000      .018092    .0386043
                 MN  |   .0737566   .0059487    12.40   0.000      .061796    .0857172
                 IA  |   .0310666   .0177827     1.75   0.087    -.0046879    .0668211
                 MO  |  -.0152315   .0058872    -2.59   0.013    -.0270685   -.0033945
                 ND  |   .0381445   .0186248     2.05   0.046     .0006969    .0755922
                 SD  |  -.0316004    .018001    -1.76   0.086     -.067794    .0045931
                 NE  |  -.0075557   .0179722    -0.42   0.676    -.0436913      .02858
                 KS  |   .0059073    .017851     0.33   0.742    -.0299845    .0417992
                 DE  |   .0529957   .0017734    29.88   0.000     .0494299    .0565615
                 MD  |   .1267132   .0089028    14.23   0.000      .108813    .1446135
                 DC  |   .2053682   .0116162    17.68   0.000     .1820122    .2287241
                 VA  |   .1374301   .0183856     7.47   0.000     .1004634    .1743968
                 NC  |   .0056303   .0180014     0.31   0.756    -.0305639    .0418245
                 SC  |  -.0090361    .017705    -0.51   0.612    -.0446344    .0265622
                 GA  |   .0519742   .0182356     2.85   0.006      .015309    .0886393
                 FL  |  -.0054043   .0192307    -0.28   0.780    -.0440702    .0332615
                 KY  |  -.0423348   .0046293    -9.14   0.000    -.0516427   -.0330269
                 TN  |  -.0299238     .01785    -1.68   0.100    -.0658136     .005966
                 AL  |   .0054347   .0178818     0.30   0.763     -.030519    .0413884
                 MS  |  -.0239432   .0178645    -1.34   0.186    -.0598623    .0119759
                 AR  |  -.0653266   .0179912    -3.63   0.001    -.1015004   -.0291529
                 LA  |    .039854   .0182725     2.18   0.034     .0031147    .0765932
                 OK  |  -.0451205   .0111111    -4.06   0.000    -.0674608   -.0227801
                 TX  |   .0515133   .0193653     2.66   0.011     .0125768    .0904497
                 ID  |   .0140321   .0181166     0.77   0.442    -.0223937    .0504579
                 WY  |   .1811367    .019684     9.20   0.000     .1415594     .220714
                 CO  |   .0575757   .0082677     6.96   0.000     .0409523    .0741992
                 NM  |    .030067   .0091017     3.30   0.002     .0117668    .0483671
                 AZ  |   .0480407   .0192609     2.49   0.016      .009314    .0867674
                 UT  |    .017027   .0184397     0.92   0.360    -.0200484    .0541024
                 NV  |   .1268821   .0193344     6.56   0.000     .0880077    .1657565
                 WA  |   .1080976   .0072586    14.89   0.000     .0935031     .122692
                 OR  |   .0335289   .0071208     4.71   0.000     .0192115    .0478463
                 CA  |   .1446071   .0114429    12.64   0.000     .1215996    .1676145
                 AK  |   .2411208   .0049464    48.75   0.000     .2311755    .2510662
                 HI  |   .1476055   .0062909    23.46   0.000     .1349568    .1602542
                     |
                year |
               1990  |  -.0121914   .0025699    -4.74   0.000    -.0173585   -.0070243
               1991  |  -.0278005   .0036672    -7.58   0.000    -.0351738   -.0204271
               1992  |  -.0310614   .0037002    -8.39   0.000    -.0385012   -.0236216
               1993  |  -.0407751   .0038322   -10.64   0.000    -.0484803   -.0330698
               1996  |  -.0483855   .0096363    -5.02   0.000    -.0677606   -.0290103
               1997  |  -.0344092   .0102287    -3.36   0.002    -.0549755    -.013843
               1998  |  -.0103227   .0090605    -1.14   0.260      -.02854    .0078946
               1999  |   .0114281   .0099645     1.15   0.257    -.0086069    .0314631
               2000  |   .0207413   .0085754     2.42   0.019     .0034993    .0379832
               2001  |   .0341795   .0091246     3.75   0.000     .0158332    .0525258
               2002  |   .0425524   .0073662     5.78   0.000     .0277416    .0573631
               2003  |   .0319269   .0081353     3.92   0.000     .0155698     .048284
               2004  |    .023003   .0072341     3.18   0.003     .0084579    .0375482
               2005  |   .0099507   .0069604     1.43   0.159     -.004044    .0239455
               2006  |   .0052585   .0079279     0.66   0.510    -.0106817    .0211986
               2007  |   .0083281   .0070708     1.18   0.245    -.0058887    .0225449
               2008  |   .0044018   .0072089     0.61   0.544    -.0100927    .0188963
               2009  |    .016573   .0084929     1.95   0.057     -.000503     .033649
               2010  |   .0037499   .0079232     0.47   0.638    -.0121808    .0196806
               2011  |  -.0179029   .0089121    -2.01   0.050    -.0358219     .000016
               2012  |  -.0189907   .0109552    -1.73   0.089    -.0410176    .0030362
               2013  |  -.0206945   .0108313    -1.91   0.062    -.0424723    .0010832
               2014  |  -.0195236   .0120485    -1.62   0.112    -.0437486    .0047015
               2015  |    .002093   .0097362     0.21   0.831     -.017483    .0216689
               2016  |   .0189062   .0088591     2.13   0.038     .0010939    .0367185
               2017  |   .0262774   .0091539     2.87   0.006     .0078724    .0446825
               2018  |   .0380477   .0091256     4.17   0.000     .0196995    .0563958
               2019  |   .0557733   .0083299     6.70   0.000      .039025    .0725216
                     |
                nind |
                  2  |   .1039776   .0380116     2.74   0.009     .0275501    .1804051
                  3  |   .1264209   .0267181     4.73   0.000     .0727005    .1801413
                  4  |  -.0505039     .03234    -1.56   0.125    -.1155278    .0145201
                  5  |   .1719542   .0295945     5.81   0.000     .1124504    .2314579
                  6  |    .125195   .0321956     3.89   0.000     .0604614    .1899287
                  7  |   .0304274    .029942     1.02   0.315     -.029775    .0906298
                  8  |  -.0157866   .0309957    -0.51   0.613    -.0781075    .0465344
                  9  |  -.0341288   .0335468    -1.02   0.314    -.1015793    .0333216
                 10  |  -.0614349   .0361942    -1.70   0.096    -.1342083    .0113384
                 11  |   .1489123   .0344127     4.33   0.000     .0797209    .2181037
                     |
                educ |   .0596376   .0017595    33.90   0.000     .0560999    .0631752
               exper |   .0472071   .0017374    27.17   0.000     .0437137    .0507004
              exper2 |  -.0010298   .0000945   -10.90   0.000    -.0012197   -.0008399
              exper3 |   7.05e-06   2.68e-06     2.63   0.011     1.66e-06    .0000124
              exper4 |   1.17e-08   2.60e-08     0.45   0.654    -4.05e-08    6.39e-08
                edex |  -.0005045   .0000487   -10.37   0.000    -.0006023   -.0004066
                     |
               ee_cl |
                  2  |  -.0324301   .0081559    -3.98   0.000    -.0488288   -.0160315
                  3  |  -.0269348   .0137271    -1.96   0.056     -.054535    .0006653
                  4  |   .0371799   .0201345     1.85   0.071    -.0033032     .077663
                  5  |  -.1148497   .0044229   -25.97   0.000    -.1237426   -.1059567
                  6  |   -.061634   .0085856    -7.18   0.000    -.0788965   -.0443715
                  7  |  -.0120577    .015893    -0.76   0.452    -.0440127    .0198974
                  8  |   .0993124   .0202482     4.90   0.000     .0586006    .1400241
                  9  |  -.1386352   .0059394   -23.34   0.000    -.1505771   -.1266933
                 10  |  -.0702564   .0093903    -7.48   0.000    -.0891368    -.051376
                 11  |   -.008085   .0155632    -0.52   0.606    -.0393769    .0232069
                 12  |   .1041252   .0200139     5.20   0.000     .0638846    .1443659
                 13  |  -.0894827   .0113424    -7.89   0.000    -.1122882   -.0666772
                 14  |  -.0469302   .0096057    -4.89   0.000    -.0662437   -.0276167
                 15  |  -.0003782   .0147371    -0.03   0.980    -.0300091    .0292528
                 16  |   .1035305   .0206541     5.01   0.000     .0620027    .1450582
                     |
                marr |    .117469   .0027734    42.35   0.000     .1118926    .1230454
               partt |  -.1891264   .0091534   -20.66   0.000    -.2075305   -.1707223
              public |   .0206699   .0084297     2.45   0.018     .0037208     .037619
                cmsa |   .1343387   .0084579    15.88   0.000     .1173329    .1513445
                     |
               nocc2 |
                  2  |   -.145682   .0040801   -35.71   0.000    -.1538855   -.1374785
                  3  |  -.0406443   .0064593    -6.29   0.000    -.0536316   -.0276569
                  4  |  -.2946074   .0088945   -33.12   0.000     -.312491   -.2767238
                  5  |  -.0905435   .0092578    -9.78   0.000    -.1091575   -.0719295
                  6  |  -.3766698   .0067942   -55.44   0.000    -.3903305   -.3630091
                  7  |  -.2366389   .0077404   -30.57   0.000     -.252202   -.2210757
                  8  |  -.1009456    .011124    -9.07   0.000     -.123312   -.0785792
                  9  |  -.3987943   .0048969   -81.44   0.000    -.4086402   -.3889485
                 10  |  -.3504428   .0096761   -36.22   0.000    -.3698979   -.3309878
                 11  |  -.2378434   .0078108   -30.45   0.000     -.253548   -.2221388
                 12  |  -.3891526   .0075834   -51.32   0.000       -.4044   -.3739053
                     |
             quarter |
                  2  |   .0035174   .0019212     1.83   0.073    -.0003454    .0073802
                  3  |   .0052638   .0018339     2.87   0.006     .0015765    .0089511
                  4  |   .0145048   .0015488     9.37   0.000     .0113907    .0176189
                     |
               _cons |   .6915013   .0385813    17.92   0.000     .6139284    .7690743
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all 

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 9,854,010,154)

Linear regression                               Number of obs     =  1,102,793
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5185
                                                Root MSE          =     .41742

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |   -.194252   .0145064   -13.39   0.000     -.223419   -.1650849
            treat_st |  -.0411041   .0183988    -2.23   0.030    -.0780974   -.0041107
treat_sthisprelwhite |   .0159261   .0231392     0.69   0.495    -.0305984    .0624506
                     |
               state |
                 NH  |   .0820849   .0040768    20.13   0.000      .073888    .0902818
                 VT  |   .0191172   .0014971    12.77   0.000     .0161071    .0221274
                 MA  |   .1255127   .0080632    15.57   0.000     .1093006    .1417249
                 RI  |   .0401453   .0084326     4.76   0.000     .0231905    .0571001
                 CT  |   .1414026   .0082106    17.22   0.000      .124894    .1579111
                 NY  |   .1092754   .0082725    13.21   0.000     .0926424    .1259083
                 NJ  |   .1681084   .0092331    18.21   0.000      .149544    .1866728
                 PA  |   .0195442   .0063282     3.09   0.003     .0068205    .0322678
                 OH  |  -.0072022   .0062283    -1.16   0.253    -.0197251    .0053207
                 IN  |    .016329   .0059116     2.76   0.008     .0044428    .0282152
                 IL  |    .095503   .0078363    12.19   0.000      .079747    .1112591
                 MI  |   .0604268   .0072281     8.36   0.000     .0458938    .0749598
                 WI  |   .0255972   .0050144     5.10   0.000     .0155152    .0356792
                 MN  |   .0680858   .0062095    10.96   0.000     .0556006    .0805709
                 IA  |   .0239603   .0172928     1.39   0.172    -.0108093    .0587298
                 MO  |   -.013865   .0058751    -2.36   0.022    -.0256778   -.0020523
                 ND  |   .0272225   .0178803     1.52   0.134    -.0087282    .0631733
                 SD  |  -.0420341   .0172299    -2.44   0.018    -.0766771    -.007391
                 NE  |   -.019679    .016883    -1.17   0.250    -.0536247    .0142666
                 KS  |   .0026302    .017724     0.15   0.883    -.0330063    .0382667
                 DE  |   .0484877   .0017296    28.03   0.000     .0450101    .0519653
                 MD  |   .1243966   .0088932    13.99   0.000     .1065156    .1422776
                 DC  |   .2172354   .0121191    17.93   0.000     .1928683    .2416025
                 VA  |   .1327302   .0180422     7.36   0.000     .0964539    .1690065
                 NC  |   .0093799   .0187689     0.50   0.620    -.0283576    .0471173
                 SC  |  -.0020617   .0189294    -0.11   0.914    -.0401218    .0359984
                 GA  |   .0565777   .0191181     2.96   0.005     .0181382    .0950173
                 FL  |  -.0005998   .0201767    -0.03   0.976    -.0411678    .0399683
                 KY  |  -.0365894   .0049351    -7.41   0.000     -.046512   -.0266668
                 TN  |  -.0257137   .0186885    -1.38   0.175    -.0632895    .0118621
                 AL  |   .0123179   .0190571     0.65   0.521     -.025999    .0506347
                 MS  |  -.0121603   .0198458    -0.61   0.543    -.0520629    .0277424
                 AR  |  -.0607344   .0188905    -3.22   0.002    -.0987163   -.0227525
                 LA  |    .047759   .0195756     2.44   0.018     .0083996    .0871184
                 OK  |  -.0478903   .0108697    -4.41   0.000    -.0697453   -.0260353
                 TX  |   .0554389    .020133     2.75   0.008     .0149588    .0959191
                 ID  |   .0154641   .0186222     0.83   0.410    -.0219785    .0529066
                 WY  |   .1769352   .0196048     9.03   0.000     .1375172    .2163532
                 CO  |   .0549373   .0083418     6.59   0.000      .038165    .0717097
                 NM  |    .034797   .0089651     3.88   0.000     .0167715    .0528225
                 AZ  |   .0536755   .0203321     2.64   0.011      .012795     .094556
                 UT  |   .0123489   .0181179     0.68   0.499    -.0240796    .0487774
                 NV  |   .1342854   .0207568     6.47   0.000     .0925511    .1760198
                 WA  |   .1139155   .0072335    15.75   0.000     .0993715    .1284595
                 OR  |    .041542   .0070678     5.88   0.000     .0273311    .0557528
                 CA  |   .1553653   .0113476    13.69   0.000     .1325494    .1781812
                 AK  |   .2549691   .0061802    41.26   0.000      .242543    .2673952
                 HI  |   .1399893   .0063739    21.96   0.000     .1271737    .1528048
                     |
                year |
               1990  |  -.0100582   .0026573    -3.79   0.000    -.0154011   -.0047153
               1991  |  -.0175088    .004633    -3.78   0.000    -.0268239   -.0081936
               1992  |  -.0163653   .0048291    -3.39   0.001    -.0260748   -.0066558
               1993  |  -.0297421   .0037386    -7.96   0.000     -.037259   -.0222252
               1996  |  -.0476062   .0080957    -5.88   0.000    -.0638837   -.0313286
               1997  |  -.0367358   .0087035    -4.22   0.000    -.0542354   -.0192362
               1998  |  -.0154548   .0073684    -2.10   0.041    -.0302699   -.0006397
               1999  |   .0044136   .0086779     0.51   0.613    -.0130346    .0218617
               2000  |   .0124428    .007673     1.62   0.111    -.0029847    .0278703
               2001  |   .0307642   .0084762     3.63   0.001     .0137217    .0478067
               2002  |   .0463936   .0068438     6.78   0.000     .0326332     .060154
               2003  |    .037123   .0078546     4.73   0.000     .0213303    .0529156
               2004  |   .0250926   .0067734     3.70   0.001     .0114738    .0387114
               2005  |   .0090759    .006804     1.33   0.189    -.0046045    .0227564
               2006  |   .0014945   .0076882     0.19   0.847    -.0139636    .0169527
               2007  |   .0042762   .0067628     0.63   0.530    -.0093212    .0178737
               2008  |   .0080877   .0062533     1.29   0.202    -.0044855    .0206608
               2009  |   .0428651   .0091202     4.70   0.000     .0245277    .0612025
               2010  |   .0327513   .0072583     4.51   0.000     .0181576     .047345
               2011  |   .0065647   .0085506     0.77   0.446    -.0106275    .0237568
               2012  |  -.0003831   .0104312    -0.04   0.971    -.0213565    .0205902
               2013  |  -.0065928   .0103757    -0.64   0.528    -.0274546    .0142689
               2014  |   -.013457   .0108397    -1.24   0.220    -.0352517    .0083377
               2015  |   .0022369   .0086527     0.26   0.797    -.0151604    .0196343
               2016  |   .0165044    .008155     2.02   0.049     .0001077    .0329012
               2017  |    .020574   .0084536     2.43   0.019     .0035769     .037571
               2018  |   .0294636   .0087378     3.37   0.001     .0118951    .0470322
               2019  |   .0457157   .0082852     5.52   0.000     .0290572    .0623743
                     |
                nind |
                  2  |   .1039015   .0379792     2.74   0.009     .0275393    .1802638
                  3  |   .1263672   .0266978     4.73   0.000     .0726875    .1800468
                  4  |  -.0504681   .0323072    -1.56   0.125     -.115426    .0144899
                  5  |   .1719784   .0295627     5.82   0.000     .1125386    .2314181
                  6  |   .1252301   .0321762     3.89   0.000     .0605354    .1899248
                  7  |   .0304255   .0298991     1.02   0.314    -.0296908    .0905417
                  8  |   -.015761   .0309731    -0.51   0.613    -.0780367    .0465146
                  9  |  -.0341623   .0335217    -1.02   0.313    -.1015622    .0332377
                 10  |  -.0614024   .0361479    -1.70   0.096    -.1340825    .0112778
                 11  |   .1489085   .0343666     4.33   0.000     .0798099    .2180071
                     |
                educ |   .0596503   .0017681    33.74   0.000     .0560953    .0632052
               exper |   .0472768   .0017404    27.16   0.000     .0437775    .0507762
              exper2 |  -.0010336   .0000949   -10.89   0.000    -.0012244   -.0008429
              exper3 |   7.17e-06   2.70e-06     2.66   0.011     1.74e-06    .0000126
              exper4 |   1.05e-08   2.62e-08     0.40   0.691    -4.22e-08    6.31e-08
                edex |  -.0005058   .0000486   -10.41   0.000    -.0006036   -.0004081
                     |
               ee_cl |
                  2  |  -.0323564    .008142    -3.97   0.000    -.0487271   -.0159858
                  3  |  -.0269212   .0136752    -1.97   0.055    -.0544169    .0005746
                  4  |   .0372096   .0201296     1.85   0.071    -.0032636    .0776829
                  5  |  -.1148838   .0044207   -25.99   0.000    -.1237723   -.1059952
                  6  |  -.0617042   .0085613    -7.21   0.000    -.0789179   -.0444905
                  7  |  -.0120229   .0158797    -0.76   0.453    -.0439511    .0199053
                  8  |   .0994144   .0202722     4.90   0.000     .0586544    .1401743
                  9  |  -.1387054   .0059791   -23.20   0.000    -.1507272   -.1266836
                 10  |  -.0703817   .0093951    -7.49   0.000    -.0892718   -.0514917
                 11  |  -.0080299   .0155567    -0.52   0.608    -.0393088     .023249
                 12  |   .1042639   .0200459     5.20   0.000     .0639588     .144569
                 13  |   -.089822   .0114009    -7.88   0.000    -.1127451   -.0668988
                 14  |   -.047062   .0095931    -4.91   0.000    -.0663502   -.0277738
                 15  |  -.0004131   .0147133    -0.03   0.978    -.0299962      .02917
                 16  |   .1036745   .0207029     5.01   0.000     .0620485    .1453005
                     |
                marr |   .1175058   .0027642    42.51   0.000      .111948    .1230637
               partt |  -.1888708   .0091675   -20.60   0.000    -.2073032   -.1704384
              public |   .0207098   .0084445     2.45   0.018     .0037309    .0376887
                cmsa |   .1342494   .0084615    15.87   0.000     .1172363    .1512624
                     |
               nocc2 |
                  2  |  -.1456798    .004081   -35.70   0.000    -.1538852   -.1374743
                  3  |  -.0406312   .0064584    -6.29   0.000    -.0536166   -.0276458
                  4  |  -.2946366   .0088829   -33.17   0.000    -.3124968   -.2767764
                  5  |  -.0905969   .0092601    -9.78   0.000    -.1092157   -.0719782
                  6  |  -.3766148   .0068206   -55.22   0.000    -.3903286    -.362901
                  7  |  -.2366278    .007742   -30.56   0.000    -.2521941   -.2210616
                  8  |  -.1010595   .0111362    -9.07   0.000    -.1234503   -.0786688
                  9  |  -.3987332   .0049156   -81.12   0.000    -.4086166   -.3888498
                 10  |  -.3503922   .0096879   -36.17   0.000    -.3698709   -.3309135
                 11  |  -.2378983   .0078167   -30.43   0.000    -.2536148   -.2221818
                 12  |  -.3891747   .0075917   -51.26   0.000    -.4044388   -.3739106
                     |
               unemp |  -.0065921   .0015884    -4.15   0.000    -.0097858   -.0033984
                     |
             quarter |
                  2  |   .0034862   .0019117     1.82   0.074    -.0003576    .0073299
                  3  |   .0052532   .0018324     2.87   0.006      .001569    .0089374
                  4  |   .0145117   .0015123     9.60   0.000      .011471    .0175524
                     |
               _cons |     .72235   .0428881    16.84   0.000     .6361176    .8085824
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all_unemp

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl
>  marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 9,854,010,154)

Linear regression                               Number of obs     =  1,102,793
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5178
                                                Root MSE          =     .41769

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1930809   .0146886   -13.14   0.000    -.2226143   -.1635475
            treat_st |  -.0202277   .0093812    -2.16   0.036      -.03909   -.0013655
treat_sthisprelwhite |    .013883   .0235636     0.59   0.559    -.0334949    .0612608
                     |
               state |
                 NH  |   .1293158   .0091901    14.07   0.000     .1108378    .1477938
                 VT  |  -.0409917   .0091949    -4.46   0.000    -.0594794   -.0225041
                 MA  |  -.0205645   .0130851    -1.57   0.123    -.0468739    .0057449
                 RI  |  -.0846664   .0175423    -4.83   0.000    -.1199374   -.0493953
                 CT  |   .1638537   .0159052    10.30   0.000     .1318742    .1958333
                 NY  |   .1895235   .0157133    12.06   0.000     .1579297    .2211172
                 NJ  |   .2245447   .0179424    12.51   0.000      .188469    .2606204
                 PA  |  -.0348262   .0132533    -2.63   0.012    -.0614737   -.0081787
                 OH  |   .1354461   .0173301     7.82   0.000     .1006016    .1702905
                 IN  |   .1410937   .0344289     4.10   0.000     .0718699    .2103176
                 IL  |   .2025397   .0134432    15.07   0.000     .1755103    .2295691
                 MI  |   .4680896   .0317388    14.75   0.000     .4042745    .5319048
                 WI  |  -.0571222   .0275948    -2.07   0.044    -.1126052   -.0016392
                 MN  |  -.0972622   .0138484    -7.02   0.000    -.1251063   -.0694181
                 IA  |  -.1136059   .0121247    -9.37   0.000    -.1379844   -.0892275
                 MO  |   -.027807   .0106335    -2.62   0.012    -.0491871   -.0064268
                 ND  |  -1.137977   .0173731   -65.50   0.000    -1.172908   -1.103046
                 SD  |  -.5475865   .0203325   -26.93   0.000    -.5884678   -.5067053
                 NE  |  -.3535799   .0158567   -22.30   0.000     -.385462   -.3216978
                 KS  |  -.0993062   .0178876    -5.55   0.000    -.1352717   -.0633408
                 DE  |   .1410443   .0123654    11.41   0.000     .1161819    .1659066
                 MD  |  -.1433892   .0188451    -7.61   0.000    -.1812798   -.1054986
                 DC  |  -.1649675   .0212457    -7.76   0.000    -.2076848   -.1222502
                 VA  |  -.1615511   .0151728   -10.65   0.000     -.192058   -.1310442
                 NC  |   .0562237   .0174916     3.21   0.002     .0210545     .091393
                 SC  |   .1079042   .0149165     7.23   0.000     .0779127    .1378958
                 GA  |   .1073687   .0176107     6.10   0.000     .0719601    .1427773
                 FL  |   .0413764   .0188018     2.20   0.033     .0035728      .07918
                 KY  |   .0855923   .0168797     5.07   0.000     .0516534    .1195311
                 TN  |   .0196757   .0158812     1.24   0.221    -.0122555    .0516069
                 AL  |  -.0798543   .0151956    -5.26   0.000    -.1104071   -.0493016
                 MS  |  -.1352777   .0140271    -9.64   0.000    -.1634811   -.1070742
                 AR  |  -.1177419   .0150298    -7.83   0.000    -.1479614   -.0875224
                 LA  |  -.1726683   .0168303   -10.26   0.000    -.2065079   -.1388286
                 OK  |  -.2495146   .0424014    -5.88   0.000    -.3347683   -.1642609
                 TX  |  -.0909987    .022948    -3.97   0.000    -.1371388   -.0448587
                 ID  |   .1088523   .0138655     7.85   0.000     .0809739    .1367307
                 WY  |  -.8126989   .0148554   -54.71   0.000    -.8425678   -.7828301
                 CO  |  -.0947945   .0131561    -7.21   0.000    -.1212466   -.0683424
                 NM  |  -.2256367   .0154514   -14.60   0.000    -.2567038   -.1945697
                 AZ  |  -.1384595   .0191198    -7.24   0.000    -.1769025   -.1000165
                 UT  |   -.234954   .0178865   -13.14   0.000    -.2709173   -.1989907
                 NV  |  -.0190565    .023978    -0.79   0.431    -.0672676    .0291546
                 WA  |  -.2457444   .0124703   -19.71   0.000    -.2708177   -.2206711
                 OR  |   .0119966   .0089073     1.35   0.184    -.0059126    .0299059
                 CA  |   .1548325   .0183992     8.42   0.000     .1178385    .1918265
                 AK  |   .6632353   .0161843    40.98   0.000     .6306946    .6957759
                 HI  |  -.1344479    .021971    -6.12   0.000    -.1786236   -.0902722
                     |
       state#c.lyear |
                 ME  |   .0011346   .0001404     8.08   0.000     .0008523    .0014169
                 NH  |   .0007065   .0002254     3.13   0.003     .0002532    .0011598
                 VT  |   .0017186   .0001192    14.42   0.000      .001479    .0019583
                 MA  |   .0025582    .000102    25.08   0.000     .0023531    .0027633
                 RI  |    .002354   .0001173    20.07   0.000     .0021182    .0025898
                 CT  |   .0009279   .0001251     7.42   0.000     .0006764    .0011794
                 NY  |   .0003559   .0000783     4.54   0.000     .0001984    .0005134
                 NJ  |   .0006016    .000105     5.73   0.000     .0003904    .0008128
                 PA  |   .0016678   .0000865    19.28   0.000     .0014939    .0018416
                 OH  |  -.0002364    .000096    -2.46   0.017    -.0004295   -.0000433
                 IN  |  -.0001094   .0003726    -0.29   0.770    -.0008586    .0006398
                 IL  |   .0000994   .0000799     1.24   0.219    -.0000612      .00026
                 MI  |  -.0028832   .0003111    -9.27   0.000    -.0035086   -.0022578
                 WI  |   .0019107   .0002764     6.91   0.000      .001355    .0024664
                 MN  |   .0027396   .0000796    34.42   0.000     .0025795    .0028996
                 IA  |    .002278   .0000936    24.33   0.000     .0020898    .0024663
                 MO  |   .0012775   .0001019    12.53   0.000     .0010725    .0014824
                 ND  |    .012147    .000079   153.83   0.000     .0119882    .0123057
                 SD  |   .0058956   .0000743    79.32   0.000     .0057461     .006045
                 NE  |    .004166   .0001285    32.41   0.000     .0039076    .0044245
                 KS  |   .0019316   .0001122    17.22   0.000      .001706    .0021572
                 DE  |   .0001695   .0000974     1.74   0.088    -.0000262    .0003653
                 MD  |    .003705   .0000804    46.06   0.000     .0035432    .0038667
                 DC  |   .0047464   .0000622    76.33   0.000     .0046213    .0048714
                 VA  |   .0037955   .0001403    27.05   0.000     .0035134    .0040776
                 NC  |   .0004889   .0002017     2.42   0.019     .0000833    .0008945
                 SC  |  -.0001199   .0001448    -0.83   0.412    -.0004111    .0001713
                 GA  |   .0004523   .0001598     2.83   0.007      .000131    .0007736
                 FL  |   .0005542   .0001178     4.71   0.000     .0003174     .000791
                 KY  |  -.0000551   .0001998    -0.28   0.784    -.0004567    .0003466
                 TN  |   .0005066   .0001531     3.31   0.002     .0001987    .0008145
                 AL  |   .0018268   .0001587    11.51   0.000     .0015077    .0021458
                 MS  |   .0021247   .0001477    14.39   0.000     .0018277    .0024216
                 AR  |    .001488   .0002008     7.41   0.000     .0010842    .0018918
                 LA  |   .0030691   .0001404    21.85   0.000     .0027867    .0033514
                 OK  |    .002993   .0004682     6.39   0.000     .0020516    .0039343
                 TX  |   .0023468   .0001751    13.40   0.000     .0019948    .0026989
                 ID  |   .0000567   .0001796     0.32   0.754    -.0003044    .0004178
                 WY  |   .0101912   .0000653   156.13   0.000       .01006    .0103225
                 CO  |    .002584    .000084    30.75   0.000     .0024151     .002753
                 NM  |   .0036243   .0002226    16.28   0.000     .0031768    .0040718
                 AZ  |   .0027964   .0001602    17.46   0.000     .0024743    .0031184
                 UT  |   .0033176   .0000841    39.44   0.000     .0031485    .0034868
                 NV  |   .0024213   .0001513    16.01   0.000     .0021171    .0027254
                 WA  |   .0045894   .0000877    52.31   0.000      .004413    .0047658
                 OR  |   .0014269   .0001152    12.39   0.000     .0011953    .0016584
                 CA  |   .0011427   .0000784    14.58   0.000     .0009851    .0013002
                 AK  |  -.0028655   .0000556   -51.52   0.000    -.0029773   -.0027537
                 HI  |   .0038099    .000115    33.12   0.000     .0035786    .0040412
                     |
                nind |
                  2  |   .1056722   .0380086     2.78   0.008     .0292508    .1820937
                  3  |   .1267683   .0265985     4.77   0.000     .0732885    .1802482
                  4  |  -.0494025   .0322518    -1.53   0.132     -.114249     .015444
                  5  |   .1732348   .0295007     5.87   0.000     .1139197    .2325499
                  6  |   .1263144   .0321208     3.93   0.000     .0617313    .1908975
                  7  |   .0315304   .0297861     1.06   0.295    -.0283585    .0914192
                  8  |  -.0148219   .0309158    -0.48   0.634    -.0769824    .0473385
                  9  |   -.032862   .0334008    -0.98   0.330    -.1000188    .0342948
                 10  |   -.060177    .035857    -1.68   0.100    -.1322723    .0119184
                 11  |   .1497918   .0342991     4.37   0.000     .0808288    .2187548
                     |
                educ |   .0596803   .0017794    33.54   0.000     .0561025    .0632581
               exper |   .0472165   .0017684    26.70   0.000     .0436608    .0507722
              exper2 |    -.00102   .0000962   -10.60   0.000    -.0012135   -.0008266
              exper3 |   6.73e-06   2.76e-06     2.44   0.018     1.18e-06    .0000123
              exper4 |   1.45e-08   2.67e-08     0.54   0.589    -3.92e-08    6.83e-08
                edex |  -.0005087   .0000507   -10.04   0.000    -.0006106   -.0004069
                     |
               ee_cl |
                  2  |  -.0331494   .0082129    -4.04   0.000    -.0496625   -.0166363
                  3  |  -.0280562   .0134692    -2.08   0.043    -.0551379   -.0009746
                  4  |    .036384   .0197788     1.84   0.072     -.003384     .076152
                  5  |   -.115305   .0044491   -25.92   0.000    -.1242505   -.1063596
                  6  |  -.0634544   .0086635    -7.32   0.000    -.0808735   -.0460352
                  7  |  -.0134293   .0156351    -0.86   0.395    -.0448658    .0180072
                  8  |   .0988956   .0199767     4.95   0.000     .0587298    .1390613
                  9  |  -.1402289   .0060238   -23.28   0.000    -.1523405   -.1281173
                 10  |  -.0713483   .0092234    -7.74   0.000    -.0898933   -.0528034
                 11  |  -.0092566   .0152045    -0.61   0.546    -.0398274    .0213142
                 12  |   .1033414   .0198187     5.21   0.000     .0634932    .1431896
                 13  |  -.0915496   .0114338    -8.01   0.000    -.1145389   -.0685603
                 14  |  -.0481091   .0095274    -5.05   0.000    -.0672652    -.028953
                 15  |  -.0007695    .014448    -0.05   0.958    -.0298191    .0282802
                 16  |   .1031694   .0204963     5.03   0.000     .0619589      .14438
                     |
                marr |   .1174492   .0027476    42.75   0.000     .1119247    .1229737
               partt |  -.1891046   .0090926   -20.80   0.000    -.2073866   -.1708226
              public |   .0205716   .0084093     2.45   0.018     .0036636    .0374796
                cmsa |    .133066   .0085133    15.63   0.000     .1159489    .1501832
                     |
               nocc2 |
                  2  |  -.1463921   .0039519   -37.04   0.000    -.1543378   -.1384463
                  3  |  -.0411257   .0064434    -6.38   0.000    -.0540809   -.0281704
                  4  |  -.2948341   .0088337   -33.38   0.000    -.3125955   -.2770727
                  5  |   -.091052   .0091858    -9.91   0.000    -.1095214   -.0725826
                  6  |  -.3770777   .0067019   -56.26   0.000    -.3905527   -.3636026
                  7  |   -.236908   .0077043   -30.75   0.000    -.2523985   -.2214175
                  8  |  -.1006704     .01112    -9.05   0.000    -.1230286   -.0783122
                  9  |  -.3992448   .0047495   -84.06   0.000    -.4087943   -.3896953
                 10  |  -.3512071   .0095608   -36.73   0.000    -.3704303   -.3319838
                 11  |  -.2383525    .007723   -30.86   0.000    -.2538807   -.2228244
                 12  |  -.3896476   .0075167   -51.84   0.000    -.4047609   -.3745344
                     |
               unemp |  -.0062713   .0006312    -9.94   0.000    -.0075404   -.0050022
                     |
             quarter |
                  2  |    .003293   .0019266     1.71   0.094    -.0005806    .0071666
                  3  |   .0049385   .0018403     2.68   0.010     .0012383    .0086387
                  4  |   .0141366   .0015171     9.32   0.000     .0110862     .017187
                     |
               _cons |   .6075999   .0428867    14.17   0.000     .5213703    .6938295
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_mal_all_sltt  

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,920,338,217)

Linear regression                               Number of obs     =  1,048,517
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5034
                                                Root MSE          =     .39392

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1268137   .0156887    -8.08   0.000    -.1583579   -.0952696
            treat_st |  -.0356077   .0078412    -4.54   0.000    -.0513734    -.019842
treat_sthisprelwhite |   .0098078   .0215807     0.45   0.652    -.0335831    .0531986
                     |
               state |
                 NH  |   .0581681    .003237    17.97   0.000     .0516597    .0646765
                 VT  |   .0372788   .0007529    49.52   0.000      .035765    .0387925
                 MA  |   .1025643   .0080194    12.79   0.000     .0864403    .1186884
                 RI  |   .0193323   .0079822     2.42   0.019     .0032831    .0353815
                 CT  |   .1127061   .0081134    13.89   0.000      .096393    .1290192
                 NY  |   .0680494    .007912     8.60   0.000     .0521413    .0839575
                 NJ  |   .1198145   .0089699    13.36   0.000     .1017794    .1378496
                 PA  |  -.0305148   .0061485    -4.96   0.000    -.0428771   -.0181525
                 OH  |  -.0598673   .0058798   -10.18   0.000    -.0716894   -.0480452
                 IN  |  -.0567254   .0047651   -11.90   0.000    -.0663062   -.0471445
                 IL  |    .009421   .0073073     1.29   0.203    -.0052712    .0241132
                 MI  |  -.0143525   .0060614    -2.37   0.022    -.0265398   -.0021652
                 WI  |  -.0069121   .0045796    -1.51   0.138      -.01612    .0022957
                 MN  |   .0502307   .0056658     8.87   0.000      .038839    .0616225
                 IA  |   -.018517   .0077675    -2.38   0.021    -.0341346   -.0028994
                 MO  |  -.0794426   .0056923   -13.96   0.000    -.0908877   -.0679975
                 ND  |   -.050702   .0079398    -6.39   0.000     -.066666    -.034738
                 SD  |  -.0699143    .007859    -8.90   0.000    -.0857159   -.0541127
                 NE  |  -.0533772   .0078963    -6.76   0.000    -.0692538   -.0375005
                 KS  |  -.0564868   .0080621    -7.01   0.000    -.0726967   -.0402769
                 DE  |   .0458925   .0013986    32.81   0.000     .0430805    .0487045
                 MD  |   .0946546   .0089099    10.62   0.000       .07674    .1125692
                 DC  |    .175496   .0127861    13.73   0.000     .1497877    .2012043
                 VA  |   .0711703    .009328     7.63   0.000     .0524151    .0899256
                 NC  |  -.0263272   .0083982    -3.13   0.003    -.0432129   -.0094415
                 SC  |  -.0674779   .0084878    -7.95   0.000    -.0845438    -.050412
                 GA  |  -.0032119   .0089663    -0.36   0.722    -.0212399    .0148161
                 FL  |  -.0360612   .0099743    -3.62   0.001    -.0561159   -.0160065
                 KY  |  -.0895362   .0038442   -23.29   0.000    -.0972655   -.0818069
                 TN  |  -.0766022   .0086092    -8.90   0.000    -.0939122   -.0592922
                 AL  |  -.0762622   .0083461    -9.14   0.000    -.0930431   -.0594813
                 MS  |  -.0986678   .0077433   -12.74   0.000    -.1142366   -.0830989
                 AR  |  -.1077829   .0079913   -13.49   0.000    -.1238505   -.0917152
                 LA  |  -.0807758   .0090875    -8.89   0.000    -.0990475   -.0625041
                 OK  |  -.1294947   .0063598   -20.36   0.000     -.142282   -.1167074
                 TX  |  -.0092373    .009743    -0.95   0.348    -.0288269    .0103523
                 ID  |  -.0331406   .0077608    -4.27   0.000    -.0487447   -.0175366
                 WY  |   .0134693   .0078923     1.71   0.094    -.0023992    .0293379
                 CO  |   .0110379   .0081464     1.35   0.182    -.0053415    .0274172
                 NM  |  -.0581924   .0081837    -7.11   0.000    -.0746467   -.0417381
                 AZ  |    .014158   .0096899     1.46   0.151    -.0053249    .0336408
                 UT  |  -.0403563   .0093873    -4.30   0.000    -.0592308   -.0214818
                 NV  |   .0826236    .009876     8.37   0.000     .0627666    .1024807
                 WA  |   .0638121   .0070465     9.06   0.000     .0496442      .07798
                 OR  |   .0014496    .006522     0.22   0.825    -.0116638     .014563
                 CA  |   .1175218   .0105457    11.14   0.000     .0963181    .1387254
                 AK  |   .1848489   .0046098    40.10   0.000     .1755801    .1941176
                 HI  |   .0912955   .0063175    14.45   0.000     .0785932    .1039977
                     |
                year |
               1990  |  -.0044927   .0023756    -1.89   0.065    -.0092692    .0002838
               1991  |  -.0042356   .0023144    -1.83   0.073    -.0088891    .0004179
               1992  |   .0111021   .0029556     3.76   0.000     .0051596    .0170447
               1993  |   .0084946   .0037661     2.26   0.029     .0009223    .0160668
               1996  |  -.0016148   .0044123    -0.37   0.716    -.0104864    .0072567
               1997  |   .0092299   .0051163     1.80   0.078    -.0010572     .019517
               1998  |   .0365112   .0040643     8.98   0.000     .0283393    .0446831
               1999  |   .0529881   .0057663     9.19   0.000     .0413942     .064582
               2000  |   .0664742   .0061997    10.72   0.000      .054009    .0789395
               2001  |   .0813677   .0051507    15.80   0.000     .0710115    .0917238
               2002  |   .0931437   .0047746    19.51   0.000     .0835437    .1027438
               2003  |   .0980424    .005439    18.03   0.000     .0871065    .1089783
               2004  |   .0908854   .0050242    18.09   0.000     .0807837    .1009871
               2005  |   .0803551   .0055943    14.36   0.000      .069107    .0916033
               2006  |   .0750718   .0053922    13.92   0.000       .06423    .0859135
               2007  |   .0747706    .004935    15.15   0.000     .0648481    .0846931
               2008  |   .0721083   .0051749    13.93   0.000     .0617035     .082513
               2009  |   .0875303    .004413    19.83   0.000     .0786573    .0964032
               2010  |   .0829052   .0045697    18.14   0.000     .0737173    .0920931
               2011  |   .0646499   .0053289    12.13   0.000     .0539354    .0753644
               2012  |   .0498543   .0053529     9.31   0.000     .0390915     .060617
               2013  |   .0494158   .0058407     8.46   0.000     .0376723    .0611593
               2014  |   .0475553   .0064886     7.33   0.000     .0345092    .0606014
               2015  |   .0652139   .0059195    11.02   0.000     .0533119    .0771159
               2016  |   .0796156   .0057328    13.89   0.000     .0680889    .0911422
               2017  |   .0888729   .0062427    14.24   0.000     .0763212    .1014247
               2018  |   .0921931   .0060453    15.25   0.000     .0800382     .104348
               2019  |   .1034773   .0058523    17.68   0.000     .0917105     .115244
                     |
                nind |
                  2  |   .0575562   .0346732     1.66   0.103    -.0121588    .1272713
                  3  |   .1206746   .0323973     3.72   0.001     .0555355    .1858138
                  4  |  -.0802657   .0333573    -2.41   0.020    -.1473351   -.0131963
                  5  |   .1519588   .0329301     4.61   0.000     .0857485    .2181692
                  6  |   .0887612   .0344618     2.58   0.013     .0194711    .1580513
                  7  |   .0346792   .0350864     0.99   0.328    -.0358667    .1052251
                  8  |  -.0118446   .0358464    -0.33   0.743    -.0839186    .0602294
                  9  |  -.0696098   .0405867    -1.72   0.093    -.1512147    .0119952
                 10  |  -.0779488   .0333538    -2.34   0.024    -.1450112   -.0108865
                 11  |   .0696695   .0356948     1.95   0.057    -.0020998    .1414387
                     |
                educ |   .0857693   .0033397    25.68   0.000     .0790544    .0924841
               exper |   .0545201   .0018139    30.06   0.000     .0508731    .0581671
              exper2 |  -.0017314   .0000907   -19.10   0.000    -.0019137   -.0015491
              exper3 |   .0000302   2.49e-06    12.12   0.000     .0000252    .0000353
              exper4 |  -1.97e-07   2.36e-08    -8.36   0.000    -2.45e-07   -1.50e-07
                edex |  -.0009014   .0000656   -13.73   0.000    -.0010334   -.0007694
                     |
               ee_cl |
                  2  |  -.1130783   .0093073   -12.15   0.000    -.1317918   -.0943648
                  3  |  -.1394568   .0149329    -9.34   0.000    -.1694813   -.1094322
                  4  |  -.1253706   .0261687    -4.79   0.000    -.1779864   -.0727548
                  5  |  -.1424998   .0062084   -22.95   0.000    -.1549827    -.130017
                  6  |  -.1611204   .0116898   -13.78   0.000    -.1846244   -.1376164
                  7  |  -.1480632   .0182717    -8.10   0.000    -.1848009   -.1113254
                  8  |  -.0561484   .0284544    -1.97   0.054    -.1133599    .0010631
                  9  |  -.1601235   .0082817   -19.33   0.000    -.1767749   -.1434722
                 10  |  -.1741301   .0119595   -14.56   0.000    -.1981764   -.1500839
                 11  |  -.1473899   .0178152    -8.27   0.000    -.1832097   -.1115701
                 12  |   -.054558   .0278549    -1.96   0.056    -.1105641    .0014481
                 13  |  -.1501004   .0113086   -13.27   0.000    -.1728378    -.127363
                 14  |  -.1602485    .011292   -14.19   0.000    -.1829526   -.1375443
                 15  |  -.1172469   .0180561    -6.49   0.000    -.1535511   -.0809426
                 16  |  -.0281332   .0307522    -0.91   0.365    -.0899646    .0336981
                     |
                marr |   .0308612   .0026307    11.73   0.000     .0255719    .0361506
               partt |   -.133248   .0039239   -33.96   0.000    -.1411376   -.1253584
              public |   .0609104   .0058812    10.36   0.000     .0490856    .0727353
                cmsa |   .1496813   .0077841    19.23   0.000     .1340303    .1653322
                     |
               nocc2 |
                  2  |  -.1345129   .0039434   -34.11   0.000    -.1424418   -.1265841
                  3  |  -.0394309   .0066989    -5.89   0.000    -.0529001   -.0259618
                  4  |  -.2827172   .0059336   -47.65   0.000    -.2946475   -.2707869
                  5  |    .047593   .0065119     7.31   0.000        .0345     .060686
                  6  |   -.331959   .0043304   -76.66   0.000    -.3406657   -.3232522
                  7  |  -.3602493   .0054103   -66.59   0.000    -.3711275   -.3493711
                  8  |  -.1676537   .0088576   -18.93   0.000    -.1854631   -.1498444
                  9  |  -.4159206    .006934   -59.98   0.000    -.4298623   -.4019789
                 10  |  -.4434575   .0147322   -30.10   0.000    -.4730787   -.4138364
                 11  |  -.1871148   .0099595   -18.79   0.000    -.2071397   -.1670899
                 12  |  -.4133232   .0132377   -31.22   0.000    -.4399393   -.3867071
                     |
             quarter |
                  2  |   .0076175   .0014489     5.26   0.000     .0047043    .0105307
                  3  |   .0169821   .0015707    10.81   0.000      .013824    .0201403
                  4  |   .0196888   .0011152    17.66   0.000     .0174465     .021931
                     |
               _cons |   .3937352   .0486309     8.10   0.000     .2959563    .4915141
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all 

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,920,338,217)

Linear regression                               Number of obs     =  1,048,517
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5034
                                                Root MSE          =     .39391

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1268017   .0156844    -8.08   0.000    -.1583372   -.0952661
            treat_st |  -.0360421   .0081188    -4.44   0.000    -.0523661   -.0197181
treat_sthisprelwhite |   .0097128   .0216208     0.45   0.655    -.0337587    .0531844
                     |
               state |
                 NH  |   .0560011   .0033019    16.96   0.000     .0493622      .06264
                 VT  |   .0352647   .0014211    24.81   0.000     .0324073    .0381221
                 MA  |   .1026638   .0080271    12.79   0.000     .0865244    .1188033
                 RI  |   .0213724   .0081978     2.61   0.012     .0048896    .0378552
                 CT  |   .1129448   .0081278    13.90   0.000     .0966028    .1292868
                 NY  |   .0694724   .0080434     8.64   0.000     .0533001    .0856446
                 NJ  |    .120895   .0090522    13.36   0.000     .1026943    .1390957
                 PA  |  -.0297578   .0062085    -4.79   0.000    -.0422409   -.0172748
                 OH  |  -.0586421    .006003    -9.77   0.000    -.0707118   -.0465724
                 IN  |  -.0565014   .0047972   -11.78   0.000    -.0661469    -.046856
                 IL  |   .0113441   .0075181     1.51   0.138     -.003772    .0264603
                 MI  |  -.0114327   .0066226    -1.73   0.091    -.0247483    .0018829
                 WI  |  -.0076121   .0045023    -1.69   0.097    -.0166645    .0014403
                 MN  |    .048689   .0056319     8.65   0.000     .0373653    .0600126
                 IA  |   -.020435    .007478    -2.73   0.009    -.0354705   -.0053994
                 MO  |  -.0790435   .0057244   -13.81   0.000    -.0905531   -.0675339
                 ND  |  -.0536453   .0075581    -7.10   0.000    -.0688418   -.0384488
                 SD  |  -.0727582   .0074566    -9.76   0.000    -.0877506   -.0577658
                 NE  |  -.0566553     .00735    -7.71   0.000    -.0714335    -.041877
                 KS  |  -.0573324   .0079768    -7.19   0.000    -.0733708    -.041294
                 DE  |   .0447281   .0014937    29.95   0.000     .0417249    .0477313
                 MD  |   .0940445   .0088698    10.60   0.000     .0762106    .1118785
                 DC  |   .1788159   .0130914    13.66   0.000     .1524939    .2051379
                 VA  |   .0699116   .0091459     7.64   0.000     .0515225    .0883006
                 NC  |  -.0252493   .0088006    -2.87   0.006    -.0429442   -.0075545
                 SC  |   -.065481   .0091989    -7.12   0.000    -.0839765   -.0469854
                 GA  |  -.0019182   .0094218    -0.20   0.840    -.0208621    .0170257
                 FL  |  -.0346855   .0103477    -3.35   0.002    -.0554909     -.01388
                 KY  |  -.0879118   .0041598   -21.13   0.000    -.0962757    -.079548
                 TN  |  -.0753854   .0090626    -8.32   0.000     -.093607   -.0571639
                 AL  |  -.0743287   .0090426    -8.22   0.000    -.0925101   -.0561472
                 MS  |  -.0953621   .0089564   -10.65   0.000    -.1133702   -.0773539
                 AR  |  -.1064817   .0084821   -12.55   0.000    -.1235361   -.0894273
                 LA  |  -.0785106   .0098632    -7.96   0.000    -.0983419   -.0586792
                 OK  |  -.1302219   .0062346   -20.89   0.000    -.1427574   -.1176864
                 TX  |   -.008109   .0100483    -0.81   0.424    -.0283126    .0120945
                 ID  |  -.0327134   .0080273    -4.08   0.000    -.0488534   -.0165733
                 WY  |   .0123461   .0077975     1.58   0.120    -.0033318    .0280239
                 CO  |   .0103408   .0081033     1.28   0.208    -.0059519    .0266336
                 NM  |   -.056887    .008314    -6.84   0.000    -.0736035   -.0401706
                 AZ  |   .0157804   .0101333     1.56   0.126    -.0045939    .0361546
                 UT  |  -.0416125   .0091884    -4.53   0.000     -.060087    -.023138
                 NV  |   .0847318    .010492     8.08   0.000     .0636362    .1058274
                 WA  |   .0654527    .007221     9.06   0.000     .0509339    .0799715
                 OR  |   .0037112   .0068117     0.54   0.588    -.0099846     .017407
                 CA  |   .1205356   .0109185    11.04   0.000     .0985825    .1424887
                 AK  |   .1887128   .0053126    35.52   0.000     .1780311    .1993945
                 HI  |   .0892373   .0062879    14.19   0.000     .0765947      .10188
                     |
                year |
               1990  |  -.0038747    .002376    -1.63   0.109    -.0086519    .0009025
               1991  |  -.0013842   .0033758    -0.41   0.684    -.0081717    .0054032
               1992  |   .0151445   .0042693     3.55   0.001     .0065605    .0237285
               1993  |   .0115047   .0043534     2.64   0.011     .0027516    .0202577
               1996  |  -.0014157   .0042135    -0.34   0.738    -.0098874     .007056
               1997  |   .0085834   .0048917     1.75   0.086    -.0012521    .0184188
               1998  |    .035082   .0039933     8.79   0.000     .0270529     .043111
               1999  |   .0510559   .0057702     8.85   0.000     .0394542    .0626577
               2000  |   .0641874   .0062575    10.26   0.000     .0516059     .076769
               2001  |   .0804287   .0050734    15.85   0.000     .0702279    .0906295
               2002  |   .0941792    .004685    20.10   0.000     .0847595    .1035989
               2003  |   .0994795   .0055535    17.91   0.000     .0883135    .1106455
               2004  |   .0914895   .0050306    18.19   0.000     .0813748    .1016042
               2005  |   .0801561   .0056785    14.12   0.000     .0687386    .0915735
               2006  |   .0740571   .0054661    13.55   0.000     .0630667    .0850475
               2007  |   .0737002   .0050505    14.59   0.000     .0635455    .0838549
               2008  |   .0731664   .0051914    14.09   0.000     .0627285    .0836043
               2009  |   .0948447   .0062918    15.07   0.000     .0821942    .1074952
               2010  |   .0909031   .0054461    16.69   0.000     .0799529    .1018533
               2011  |   .0713575   .0049795    14.33   0.000     .0613455    .0813696
               2012  |   .0549865   .0047586    11.56   0.000     .0454188    .0645542
               2013  |   .0533161   .0056283     9.47   0.000     .0419995    .0646326
               2014  |   .0492375    .005987     8.22   0.000     .0371999    .0612751
               2015  |   .0652733   .0057484    11.36   0.000     .0537154    .0768311
               2016  |   .0789669   .0056181    14.06   0.000     .0676708    .0902629
               2017  |   .0873087   .0063363    13.78   0.000     .0745687    .1000486
               2018  |   .0898363   .0064482    13.93   0.000     .0768713    .1028012
               2019  |   .1007351   .0062236    16.19   0.000     .0882217    .1132485
                     |
                nind |
                  2  |   .0575093   .0346708     1.66   0.104     -.012201    .1272196
                  3  |   .1206423   .0324009     3.72   0.001      .055496    .1857886
                  4  |  -.0802698   .0333645    -2.41   0.020    -.1473536    -.013186
                  5  |   .1519641   .0329322     4.61   0.000     .0857495    .2181787
                  6  |   .0887475   .0344712     2.57   0.013     .0194386    .1580564
                  7  |   .0346617   .0350911     0.99   0.328    -.0358936    .1052171
                  8  |  -.0118572   .0358546    -0.33   0.742    -.0839476    .0602333
                  9  |  -.0696393   .0405972    -1.72   0.093    -.1512654    .0119869
                 10  |  -.0779483   .0333528    -2.34   0.024    -.1450085    -.010888
                 11  |   .0696273   .0356991     1.95   0.057    -.0021505    .1414052
                     |
                educ |   .0857706   .0033398    25.68   0.000     .0790555    .0924857
               exper |   .0545325   .0018121    30.09   0.000     .0508889    .0581761
              exper2 |  -.0017321   .0000906   -19.11   0.000    -.0019144   -.0015498
              exper3 |   .0000303   2.49e-06    12.13   0.000     .0000252    .0000353
              exper4 |  -1.97e-07   2.36e-08    -8.37   0.000    -2.45e-07   -1.50e-07
                edex |  -.0009017   .0000656   -13.75   0.000    -.0010336   -.0007699
                     |
               ee_cl |
                  2  |  -.1130687   .0093114   -12.14   0.000    -.1317905    -.094347
                  3  |  -.1394408   .0149269    -9.34   0.000    -.1694533   -.1094282
                  4  |   -.125354   .0261658    -4.79   0.000    -.1779639   -.0727441
                  5  |  -.1424721   .0061996   -22.98   0.000    -.1549373    -.130007
                  6  |  -.1611207   .0116964   -13.78   0.000    -.1846379   -.1376035
                  7  |  -.1480413   .0182694    -8.10   0.000    -.1847745   -.1113081
                  8  |  -.0561158   .0284514    -1.97   0.054    -.1133211    .0010896
                  9  |  -.1601098   .0082838   -19.33   0.000    -.1767654   -.1434541
                 10  |  -.1741449   .0119578   -14.56   0.000    -.1981876   -.1501022
                 11  |  -.1473612   .0178139    -8.27   0.000    -.1831785   -.1115439
                 12  |   -.054516   .0278505    -1.96   0.056    -.1105132    .0014812
                 13  |  -.1501628    .011324   -13.26   0.000    -.1729312   -.1273943
                 14  |  -.1602563   .0112816   -14.21   0.000    -.1829396   -.1375731
                 15  |  -.1172129   .0180472    -6.49   0.000    -.1534992   -.0809266
                 16  |  -.0280817   .0307531    -0.91   0.366    -.0899149    .0337516
                     |
                marr |   .0308638   .0026286    11.74   0.000     .0255786    .0361489
               partt |  -.1332247   .0039248   -33.94   0.000    -.1411159   -.1253334
              public |   .0609291     .00588    10.36   0.000     .0491066    .0727516
                cmsa |   .1496634   .0077862    19.22   0.000     .1340083    .1653186
                     |
               nocc2 |
                  2  |  -.1345261   .0039465   -34.09   0.000    -.1424611   -.1265911
                  3  |  -.0394478   .0066978    -5.89   0.000    -.0529146    -.025981
                  4  |  -.2827175   .0059301   -47.68   0.000    -.2946406   -.2707943
                  5  |   .0475817   .0065113     7.31   0.000     .0344898    .0606736
                  6  |  -.3319641   .0043294   -76.68   0.000    -.3406689   -.3232592
                  7  |  -.3602667   .0054118   -66.57   0.000    -.3711478   -.3493856
                  8  |  -.1676599   .0088661   -18.91   0.000    -.1854865   -.1498334
                  9  |  -.4159263   .0069334   -59.99   0.000    -.4298668   -.4019858
                 10  |  -.4434923   .0147317   -30.10   0.000    -.4731124   -.4138721
                 11  |  -.1871371   .0099554   -18.80   0.000    -.2071537   -.1671204
                 12  |  -.4133517   .0132331   -31.24   0.000    -.4399586   -.3867448
                     |
               unemp |  -.0018235   .0010407    -1.75   0.086     -.003916    .0002689
                     |
             quarter |
                  2  |   .0076209   .0014494     5.26   0.000     .0047067    .0105351
                  3  |   .0169767   .0015709    10.81   0.000     .0138182    .0201351
                  4  |   .0196922   .0011193    17.59   0.000     .0174417    .0219427
                     |
               _cons |    .402312   .0487259     8.26   0.000     .3043421    .5002819
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all_unemp 

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl
>  marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,920,338,217)

Linear regression                               Number of obs     =  1,048,517
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5022
                                                Root MSE          =     .39442

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1267942   .0157872    -8.03   0.000    -.1585364   -.0950519
            treat_st |  -.0586783   .0117248    -5.00   0.000    -.0822525    -.035104
treat_sthisprelwhite |   .0104849    .021923     0.48   0.635    -.0335943     .054564
                     |
               state |
                 NH  |   .1214596   .0094918    12.80   0.000      .102375    .1405442
                 VT  |  -.1333742    .007741   -17.23   0.000    -.1489384   -.1178099
                 MA  |  -.1218097   .0145726    -8.36   0.000    -.1511099   -.0925095
                 RI  |  -.2276937   .0149108   -15.27   0.000     -.257674   -.1977135
                 CT  |    .024255   .0163945     1.48   0.146    -.0087084    .0572183
                 NY  |   -.005906    .015411    -0.38   0.703     -.036892      .02508
                 NJ  |   .0462592   .0172214     2.69   0.010     .0116332    .0808851
                 PA  |   -.055803   .0141054    -3.96   0.000    -.0841638   -.0274422
                 OH  |   -.121747    .017818    -6.83   0.000    -.1575724   -.0859216
                 IN  |   -.199658   .0413223    -4.83   0.000     -.282742   -.1165739
                 IL  |  -.0956667   .0141738    -6.75   0.000    -.1241651   -.0671684
                 MI  |  -.0430166   .0365843    -1.18   0.245    -.1165743    .0305411
                 WI  |  -.3216787   .0318139   -10.11   0.000    -.3856448   -.2577126
                 MN  |  -.1299265   .0136669    -9.51   0.000    -.1574056   -.1024473
                 IA  |  -.1300699     .01381    -9.42   0.000    -.1578368   -.1023031
                 MO  |  -.0660123   .0107834    -6.12   0.000    -.0876937   -.0443308
                 ND  |  -.8834422    .016908   -52.25   0.000     -.917438   -.8494463
                 SD  |  -.4453917   .0178919   -24.89   0.000    -.4813657   -.4094177
                 NE  |  -.4122112   .0152939   -26.95   0.000    -.4429615   -.3814608
                 KS  |  -.1810348   .0184308    -9.82   0.000    -.2180924   -.1439772
                 DE  |   .0875094   .0098206     8.91   0.000     .0677637     .107255
                 MD  |  -.2753744   .0203981   -13.50   0.000    -.3163876   -.2343612
                 DC  |  -.3122575   .0228548   -13.66   0.000    -.3582101   -.2663049
                 VA  |   -.211891   .0159662   -13.27   0.000    -.2439932   -.1797887
                 NC  |   .0186184    .013303     1.40   0.168    -.0081291    .0453659
                 SC  |   .0160654     .01399     1.15   0.257    -.0120634    .0441941
                 GA  |    .180835    .015896    11.38   0.000      .148874     .212796
                 FL  |  -.0077883   .0206674    -0.38   0.708     -.049343    .0337664
                 KY  |  -.2063768   .0206981    -9.97   0.000    -.2479931   -.1647604
                 TN  |  -.1629096   .0151547   -10.75   0.000    -.1933801   -.1324391
                 AL  |  -.0687493   .0145382    -4.73   0.000    -.0979804   -.0395182
                 MS  |  -.0237959   .0119842    -1.99   0.053    -.0478916    .0002999
                 AR  |  -.1330339   .0126949   -10.48   0.000    -.1585588   -.1075091
                 LA  |  -.1915804   .0184155   -10.40   0.000    -.2286072   -.1545536
                 OK  |  -.4108214   .0513455    -8.00   0.000    -.5140584   -.3075843
                 TX  |  -.0765076   .0225577    -3.39   0.001     -.121863   -.0311522
                 ID  |   .0771012   .0141935     5.43   0.000     .0485633    .1056392
                 WY  |  -.6975505   .0184593   -37.79   0.000    -.7346654   -.6604357
                 CO  |  -.1893858   .0139582   -13.57   0.000    -.2174507   -.1613209
                 NM  |  -.3004743    .008619   -34.86   0.000    -.3178039   -.2831447
                 AZ  |  -.0911819   .0196543    -4.64   0.000    -.1306995   -.0516643
                 UT  |  -.1957443   .0196989    -9.94   0.000    -.2353517   -.1561369
                 NV  |   .0613878   .0266358     2.30   0.026     .0078329    .1149426
                 WA  |   -.314816    .013045   -24.13   0.000    -.3410447   -.2885874
                 OR  |  -.1722889   .0112568   -15.31   0.000    -.1949221   -.1496556
                 CA  |  -.0027114    .019646    -0.14   0.891    -.0422122    .0367895
                 AK  |   .3631855   .0175646    20.68   0.000     .3278694    .3985016
                 HI  |  -.1421966   .0269672    -5.27   0.000    -.1964178   -.0879753
                     |
       state#c.lyear |
                 ME  |   .0020048   .0001619    12.38   0.000     .0016792    .0023304
                 NH  |   .0014124    .000237     5.96   0.000      .000936    .0018889
                 VT  |   .0036326   .0001233    29.45   0.000     .0033846    .0038806
                 MA  |   .0041646   .0001023    40.72   0.000     .0039589    .0043702
                 RI  |   .0044248   .0001226    36.09   0.000     .0041783    .0046713
                 CT  |   .0028665   .0001015    28.23   0.000     .0026623    .0030706
                 NY  |   .0027388   .0000829    33.03   0.000     .0025721    .0029055
                 NJ  |     .00274   .0001022    26.80   0.000     .0025344    .0029455
                 PA  |   .0022642   .0000887    25.52   0.000     .0020858    .0024426
                 OH  |   .0026268   .0000754    34.82   0.000     .0024751    .0027785
                 IN  |   .0034472   .0004572     7.54   0.000     .0025279    .0043666
                 IL  |   .0030441   .0000861    35.37   0.000      .002871    .0032171
                 MI  |   .0023616   .0003738     6.32   0.000     .0016099    .0031132
                 WI  |   .0050677   .0003394    14.93   0.000     .0043854      .00575
                 MN  |   .0037317   .0000961    38.85   0.000     .0035385    .0039248
                 IA  |    .003284   .0001101    29.82   0.000     .0030626    .0035054
                 MO  |   .0018861   .0001048    18.00   0.000     .0016754    .0020967
                 ND  |   .0102293   .0000873   117.22   0.000     .0100538    .0104047
                 SD  |   .0058703   .0000824    71.21   0.000     .0057045     .006036
                 NE  |   .0056459   .0001242    45.46   0.000     .0053962    .0058956
                 KS  |   .0034269   .0001029    33.31   0.000       .00322    .0036338
                 DE  |   .0015067   .0001096    13.75   0.000     .0012864     .001727
                 MD  |   .0055497   .0000788    70.40   0.000     .0053912    .0057082
                 DC  |   .0066587   .0000614   108.53   0.000     .0065353     .006782
                 VA  |   .0049479   .0001548    31.96   0.000     .0046366    .0052592
                 NC  |   .0018082   .0002118     8.54   0.000     .0013824     .002234
                 SC  |   .0014508   .0001557     9.32   0.000     .0011378    .0017638
                 GA  |   .0004677   .0001582     2.96   0.005     .0001497    .0007857
                 FL  |    .001987   .0001193    16.65   0.000     .0017471    .0022269
                 KY  |   .0031798   .0002447    13.00   0.000     .0026879    .0036717
                 TN  |   .0030803   .0001787    17.24   0.000      .002721    .0034395
                 AL  |   .0021808   .0001684    12.95   0.000     .0018422    .0025194
                 MS  |   .0015542   .0001608     9.67   0.000      .001231    .0018775
                 AR  |   .0024944   .0002026    12.31   0.000      .002087    .0029018
                 LA  |   .0033151   .0001081    30.65   0.000     .0030977    .0035326
                 OK  |   .0048624   .0005912     8.22   0.000     .0036736    .0060512
                 TX  |   .0028828   .0001639    17.59   0.000     .0025533    .0032122
                 ID  |   .0012009   .0002029     5.92   0.000     .0007929    .0016089
                 WY  |   .0089126   .0001093    81.51   0.000     .0086927    .0091324
                 CO  |   .0039288   .0000946    41.54   0.000     .0037386     .004119
                 NM  |   .0043788   .0001798    24.35   0.000     .0040173    .0047404
                 AZ  |   .0032688   .0001352    24.17   0.000     .0029969    .0035407
                 UT  |   .0037162    .000112    33.19   0.000     .0034911    .0039413
                 NV  |   .0024828   .0001747    14.21   0.000     .0021315    .0028341
                 WA  |   .0056646   .0001103    51.34   0.000     .0054427    .0058864
                 OR  |   .0037162   .0001117    33.26   0.000     .0034916    .0039409
                 CA  |   .0032073   .0000937    34.23   0.000     .0030189    .0033958
                 AK  |   .0002994   .0000571     5.24   0.000     .0001846    .0004142
                 HI  |   .0042451   .0001612    26.33   0.000     .0039209    .0045693
                     |
                nind |
                  2  |   .0606199   .0348603     1.74   0.088    -.0094715    .1307113
                  3  |   .1211496   .0325838     3.72   0.001     .0556356    .1866637
                  4  |  -.0784528   .0335638    -2.34   0.024    -.1459373   -.0109683
                  5  |   .1542018   .0330611     4.66   0.000     .0877281    .2206755
                  6  |   .0904007   .0346995     2.61   0.012     .0206328    .1601687
                  7  |   .0366002   .0352761     1.04   0.305    -.0343271    .1075276
                  8  |  -.0099868   .0360843    -0.28   0.783    -.0825391    .0625655
                  9  |  -.0675477   .0408368    -1.65   0.105    -.1496556    .0145601
                 10  |  -.0771329   .0334916    -2.30   0.026    -.1444722   -.0097936
                 11  |   .0716421   .0358947     2.00   0.052    -.0005291    .1438133
                     |
                educ |   .0845367   .0032743    25.82   0.000     .0779533    .0911201
               exper |   .0539982    .001817    29.72   0.000     .0503449    .0576515
              exper2 |  -.0016952   .0000904   -18.75   0.000    -.0018769   -.0015134
              exper3 |   .0000291   2.52e-06    11.57   0.000     .0000241    .0000342
              exper4 |  -1.88e-07   2.41e-08    -7.79   0.000    -2.36e-07   -1.39e-07
                edex |  -.0008859   .0000664   -13.34   0.000    -.0010194   -.0007524
                     |
               ee_cl |
                  2  |  -.1138366   .0094046   -12.10   0.000    -.1327458   -.0949274
                  3  |  -.1381504   .0147832    -9.35   0.000    -.1678741   -.1084267
                  4  |  -.1212156   .0257486    -4.71   0.000    -.1729867   -.0694445
                  5  |  -.1453344   .0061389   -23.67   0.000    -.1576774   -.1329914
                  6  |  -.1632131   .0116552   -14.00   0.000    -.1866474   -.1397787
                  7  |   -.147075   .0180939    -8.13   0.000    -.1834551   -.1106948
                  8  |  -.0529202   .0281425    -1.88   0.066    -.1095044     .003664
                  9  |  -.1637595   .0081759   -20.03   0.000    -.1801982   -.1473207
                 10  |  -.1745148   .0117828   -14.81   0.000    -.1982058   -.1508238
                 11  |  -.1455198   .0175987    -8.27   0.000    -.1809043   -.1101353
                 12  |  -.0512189   .0276594    -1.85   0.070    -.1068319     .004394
                 13  |  -.1537267   .0112298   -13.69   0.000    -.1763058   -.1311477
                 14  |  -.1601443   .0111028   -14.42   0.000     -.182468   -.1378206
                 15  |  -.1158948   .0178923    -6.48   0.000    -.1518697   -.0799198
                 16  |  -.0263703    .030595    -0.86   0.393    -.0878858    .0351451
                     |
                marr |   .0307728   .0025956    11.86   0.000      .025554    .0359917
               partt |  -.1332524   .0038721   -34.41   0.000    -.1410379   -.1254669
              public |   .0607973   .0058506    10.39   0.000      .049034    .0725607
                cmsa |   .1493898   .0077091    19.38   0.000     .1338897    .1648899
                     |
               nocc2 |
                  2  |  -.1340075   .0040486   -33.10   0.000    -.1421477   -.1258673
                  3  |  -.0387979   .0067565    -5.74   0.000    -.0523828    -.025213
                  4  |  -.2818098   .0058697   -48.01   0.000    -.2936117   -.2700079
                  5  |   .0475092   .0065695     7.23   0.000     .0343004     .060718
                  6  |  -.3321355   .0043409   -76.51   0.000    -.3408635   -.3234075
                  7  |  -.3605976   .0055018   -65.54   0.000    -.3716596   -.3495355
                  8  |  -.1665708   .0088661   -18.79   0.000    -.1843973   -.1487444
                  9  |  -.4158466   .0069536   -59.80   0.000    -.4298277   -.4018655
                 10  |  -.4441239   .0148324   -29.94   0.000    -.4739464   -.4143014
                 11  |  -.1861297   .0098851   -18.83   0.000     -.206005   -.1662544
                 12  |  -.4133397   .0132643   -31.16   0.000    -.4400093   -.3866701
                     |
               unemp |  -.0023625   .0004304    -5.49   0.000     -.003228   -.0014971
                     |
             quarter |
                  2  |    .007307   .0014444     5.06   0.000     .0044028    .0102112
                  3  |   .0166231   .0015165    10.96   0.000      .013574    .0196721
                  4  |   .0194157   .0010888    17.83   0.000     .0172265    .0216048
                     |
               _cons |   .2655663   .0518022     5.13   0.000      .161411    .3697216
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_fem_all_sltt

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 8,242,746,843)

Linear regression                               Number of obs     =    918,144
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5454
                                                Root MSE          =     .41818

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1994818   .0175679   -11.35   0.000    -.2348044   -.1641592
            treat_st |   -.029756    .014022    -2.12   0.039    -.0579491   -.0015628
treat_sthisprelwhite |   .0283388   .0244771     1.16   0.253    -.0208757    .0775533
                     |
               state |
                 NH  |   .0979499   .0033467    29.27   0.000     .0912209    .1046789
                 VT  |   .0397743   .0005878    67.66   0.000     .0385923    .0409562
                 MA  |   .1240639   .0078854    15.73   0.000     .1082092    .1399185
                 RI  |   .0284172   .0081502     3.49   0.001     .0120301    .0448042
                 CT  |    .133234   .0080869    16.48   0.000     .1169741    .1494939
                 NY  |   .0738094   .0081872     9.02   0.000      .057348    .0902707
                 NJ  |   .1467933   .0092657    15.84   0.000     .1281634    .1654232
                 PA  |   .0087718   .0061334     1.43   0.159    -.0035603    .0211038
                 OH  |  -.0251587   .0060363    -4.17   0.000    -.0372954    -.013022
                 IN  |   .0040815   .0054472     0.75   0.457    -.0068708    .0150339
                 IL  |    .066723   .0080061     8.33   0.000     .0506256    .0828204
                 MI  |   .0236474   .0062458     3.79   0.000     .0110894    .0362054
                 WI  |   .0205776   .0048251     4.26   0.000     .0108761    .0302791
                 MN  |   .0638971   .0058204    10.98   0.000     .0521945    .0755997
                 IA  |   .0201014   .0139732     1.44   0.157    -.0079935    .0481964
                 MO  |   -.031835     .00555    -5.74   0.000     -.042994    -.020676
                 ND  |   .0421877   .0145134     2.91   0.006     .0130066    .0713688
                 SD  |  -.0285534   .0140293    -2.04   0.047    -.0567611   -.0003456
                 NE  |  -.0083893   .0141094    -0.59   0.555    -.0367582    .0199796
                 KS  |  -.0029823   .0140665    -0.21   0.833    -.0312649    .0253003
                 DE  |   .0558315   .0017807    31.35   0.000     .0522512    .0594118
                 MD  |   .1338757   .0086263    15.52   0.000     .1165314      .15122
                 DC  |   .2149105   .0115054    18.68   0.000     .1917773    .2380437
                 VA  |   .1413959   .0145682     9.71   0.000     .1121046    .1706872
                 NC  |   .0153146    .014215     1.08   0.287    -.0132665    .0438958
                 SC  |   .0038209   .0139185     0.27   0.785    -.0241641    .0318059
                 GA  |   .0530682   .0144722     3.67   0.001     .0239699    .0821665
                 FL  |  -.0042884   .0156624    -0.27   0.785    -.0357797    .0272029
                 KY  |  -.0404727   .0041767    -9.69   0.000    -.0488707   -.0320748
                 TN  |  -.0299391    .014141    -2.12   0.039    -.0583715   -.0015068
                 AL  |   .0029658   .0140964     0.21   0.834    -.0253768    .0313085
                 MS  |  -.0167365   .0139236    -1.20   0.235    -.0447317    .0112587
                 AR  |  -.0593005   .0141246    -4.20   0.000       -.0877   -.0309011
                 LA  |   .0445847   .0143794     3.10   0.003     .0156729    .0734965
                 OK  |  -.0354347   .0091996    -3.85   0.000    -.0539317   -.0169377
                 TX  |   .0545762   .0158196     3.45   0.001     .0227686    .0863837
                 ID  |    .013187   .0141242     0.93   0.355    -.0152116    .0415857
                 WY  |   .1794579   .0154256    11.63   0.000     .1484426    .2104732
                 CO  |   .0700026   .0080379     8.71   0.000     .0538413    .0861639
                 NM  |   .0463155   .0098791     4.69   0.000     .0264524    .0661787
                 AZ  |   .0481195   .0157109     3.06   0.004     .0165306    .0797084
                 UT  |    .018987   .0145777     1.30   0.199    -.0103235    .0482974
                 NV  |   .0999288   .0155383     6.43   0.000     .0686869    .1311707
                 WA  |   .0983901    .007159    13.74   0.000      .083996    .1127842
                 OR  |   .0295531   .0072333     4.09   0.000     .0150095    .0440967
                 CA  |   .1294223   .0124094    10.43   0.000     .1044715     .154373
                 AK  |   .2337072   .0045623    51.23   0.000     .2245342    .2428803
                 HI  |   .1435118   .0060248    23.82   0.000     .1313981    .1556255
                     |
                year |
               1990  |  -.0096831   .0031146    -3.11   0.003    -.0159454   -.0034207
               1991  |  -.0243313   .0046158    -5.27   0.000    -.0336119   -.0150506
               1992  |  -.0281876   .0050811    -5.55   0.000    -.0384039   -.0179714
               1993  |   -.038605   .0043083    -8.96   0.000    -.0472674   -.0299425
               1996  |  -.0474825    .010205    -4.65   0.000     -.068001   -.0269641
               1997  |  -.0312999   .0101782    -3.08   0.003    -.0517644   -.0108353
               1998  |  -.0034142   .0097132    -0.35   0.727    -.0229439    .0161156
               1999  |   .0208537   .0108717     1.92   0.061    -.0010054    .0427127
               2000  |   .0317541   .0093073     3.41   0.001     .0130405    .0504677
               2001  |    .049089   .0095707     5.13   0.000     .0298458    .0683323
               2002  |   .0574505   .0072571     7.92   0.000     .0428591    .0720419
               2003  |   .0449053   .0091505     4.91   0.000      .026507    .0633036
               2004  |   .0369975   .0074824     4.94   0.000     .0219532    .0520418
               2005  |   .0235777   .0082589     2.85   0.006      .006972    .0401834
               2006  |   .0214035   .0076526     2.80   0.007     .0060168    .0367902
               2007  |   .0234956   .0074047     3.17   0.003     .0086075    .0383837
               2008  |   .0187222   .0073606     2.54   0.014     .0039226    .0335218
               2009  |   .0316716   .0087761     3.61   0.001      .014026    .0493171
               2010  |   .0174855   .0083292     2.10   0.041     .0007386    .0342325
               2011  |  -.0053859   .0089935    -0.60   0.552    -.0234686    .0126968
               2012  |  -.0047401   .0113002    -0.42   0.677    -.0274607    .0179805
               2013  |  -.0066347   .0110125    -0.60   0.550    -.0287768    .0155073
               2014  |  -.0059066   .0123125    -0.48   0.634    -.0306625    .0188493
               2015  |    .017766   .0098989     1.79   0.079     -.002137     .037669
               2016  |   .0361459   .0092249     3.92   0.000     .0175981    .0546937
               2017  |   .0416224    .009356     4.45   0.000     .0228109    .0604339
               2018  |   .0545132   .0095055     5.73   0.000      .035401    .0736253
               2019  |   .0741084   .0086049     8.61   0.000     .0568071    .0914096
                     |
                nind |
                  2  |   .0622072   .0321188     1.94   0.059     -.002372    .1267864
                  3  |   .1176374   .0251724     4.67   0.000      .067025    .1682498
                  4  |  -.0452612   .0302022    -1.50   0.141    -.1059868    .0154644
                  5  |   .1210443   .0279961     4.32   0.000     .0647544    .1773343
                  6  |   .1214105   .0304189     3.99   0.000     .0602492    .1825717
                  7  |   .0289432   .0285709     1.01   0.316    -.0285025    .0863888
                  8  |  -.0124545   .0293573    -0.42   0.673    -.0714812    .0465723
                  9  |  -.0552918   .0288995    -1.91   0.062    -.1133982    .0028146
                 10  |  -.0626926   .0312976    -2.00   0.051    -.1256206    .0002354
                 11  |    .109196   .0287572     3.80   0.000     .0513758    .1670162
                     |
                educ |   .0549243   .0015298    35.90   0.000     .0518484    .0580002
               exper |   .0432935   .0017061    25.38   0.000     .0398632    .0467237
              exper2 |  -.0008737      .0001    -8.74   0.000    -.0010748   -.0006727
              exper3 |   2.92e-06   3.04e-06     0.96   0.342    -3.20e-06    9.03e-06
              exper4 |   5.32e-08   3.13e-08     1.70   0.095    -9.69e-09    1.16e-07
                edex |  -.0004442   .0000541    -8.21   0.000    -.0005529   -.0003354
                     |
               ee_cl |
                  2  |  -.0347474   .0079394    -4.38   0.000    -.0507106   -.0187842
                  3  |  -.0317783   .0129011    -2.46   0.017    -.0577178   -.0058389
                  4  |   .0473937   .0196916     2.41   0.020      .007801    .0869864
                  5  |  -.1065855   .0038107   -27.97   0.000    -.1142474   -.0989237
                  6  |   -.073089   .0082498    -8.86   0.000    -.0896764   -.0565017
                  7  |  -.0262379   .0149077    -1.76   0.085    -.0562117     .003736
                  8  |   .1231483   .0198792     6.19   0.000     .0831784    .1631181
                  9  |  -.1353627   .0061066   -22.17   0.000    -.1476409   -.1230846
                 10  |  -.0869829   .0098012    -8.87   0.000    -.1066895   -.0672762
                 11  |  -.0140924   .0145613    -0.97   0.338    -.0433698    .0151849
                 12  |    .129736   .0195869     6.62   0.000     .0903538    .1691182
                 13  |  -.1011103   .0112577    -8.98   0.000    -.1237453   -.0784752
                 14  |  -.0601417   .0093004    -6.47   0.000    -.0788413   -.0414421
                 15  |   .0020017   .0140289     0.14   0.887    -.0262052    .0302087
                 16  |   .1296134   .0205174     6.32   0.000     .0883605    .1708663
                     |
                marr |   .1208985   .0031876    37.93   0.000     .1144894    .1273075
               partt |  -.1868512   .0085032   -21.97   0.000    -.2039479   -.1697544
              public |  -.0087333   .0064267    -1.36   0.181    -.0216551    .0041885
                cmsa |   .1279892   .0077977    16.41   0.000     .1123108    .1436675
                     |
               nocc2 |
                  2  |  -.1551579   .0043263   -35.86   0.000    -.1638565   -.1464593
                  3  |  -.0417666   .0068643    -6.08   0.000    -.0555682   -.0279651
                  4  |    -.33362   .0070873   -47.07   0.000      -.34787     -.31937
                  5  |  -.1074423   .0116736    -9.20   0.000    -.1309137   -.0839709
                  6  |  -.4028687   .0077213   -52.18   0.000    -.4183934   -.3873439
                  7  |  -.2562468    .009489   -27.00   0.000    -.2753256    -.237168
                  8  |  -.1124702    .010708   -10.50   0.000        -.134   -.0909404
                  9  |  -.4480438    .007971   -56.21   0.000    -.4640705   -.4320171
                 10  |  -.3984908    .012415   -32.10   0.000    -.4234528   -.3735288
                 11  |  -.2905918   .0086709   -33.51   0.000    -.3080258   -.2731577
                 12  |  -.4496484   .0107446   -41.85   0.000     -.471252   -.4280449
                     |
             quarter |
                  2  |   .0039857    .001955     2.04   0.047      .000055    .0079165
                  3  |   .0047778   .0018516     2.58   0.013      .001055    .0085006
                  4  |   .0157028   .0017128     9.17   0.000      .012259    .0191466
                     |
               _cons |   .7901902   .0219243    36.04   0.000     .7461084     .834272
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 8,242,746,843)

Linear regression                               Number of obs     =    918,144
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5455
                                                Root MSE          =     .41815

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1993771   .0175486   -11.36   0.000     -.234661   -.1640932
            treat_st |  -.0314233   .0145703    -2.16   0.036     -.060719   -.0021277
treat_sthisprelwhite |   .0279864   .0246505     1.14   0.262    -.0215767    .0775495
                     |
               state |
                 NH  |   .0898139   .0037905    23.69   0.000     .0821926    .0974352
                 VT  |   .0322131   .0016209    19.87   0.000     .0289541    .0354721
                 MA  |   .1244921   .0078989    15.76   0.000     .1086102    .1403739
                 RI  |   .0360561   .0083914     4.30   0.000     .0191841    .0529281
                 CT  |   .1341907   .0080937    16.58   0.000     .1179172    .1504642
                 NY  |   .0791901   .0083872     9.44   0.000     .0623266    .0960537
                 NJ  |   .1509421   .0093218    16.19   0.000     .1321992    .1696849
                 PA  |   .0116823   .0061736     1.89   0.064    -.0007307    .0240952
                 OH  |  -.0205182   .0061228    -3.35   0.002    -.0328289   -.0082074
                 IN  |    .005038   .0054516     0.92   0.360    -.0059231    .0159992
                 IL  |   .0740465   .0082196     9.01   0.000       .05752     .090573
                 MI  |   .0346681    .007145     4.85   0.000      .020302    .0490341
                 WI  |   .0179718   .0046627     3.85   0.000     .0085968    .0273468
                 MN  |   .0580724   .0059416     9.77   0.000      .046126    .0700187
                 IA  |   .0128488   .0134696     0.95   0.345    -.0142338    .0399313
                 MO  |  -.0303102   .0055678    -5.44   0.000    -.0415051   -.0191153
                 ND  |   .0309555   .0138886     2.23   0.031     .0030306    .0588803
                 SD  |   -.039307   .0132828    -2.96   0.005    -.0660138   -.0126002
                 NE  |  -.0208095   .0130196    -1.60   0.117    -.0469873    .0053682
                 KS  |  -.0061802     .01388    -0.45   0.658    -.0340879    .0217274
                 DE  |   .0512428    .001691    30.30   0.000     .0478429    .0546427
                 MD  |   .1315872   .0085905    15.32   0.000     .1143149    .1488595
                 DC  |   .2274819   .0121403    18.74   0.000     .2030721    .2518917
                 VA  |   .1366589    .014156     9.65   0.000     .1081964    .1651213
                 NC  |   .0195446   .0149099     1.31   0.196    -.0104338    .0495229
                 SC  |   .0113328    .015065     0.75   0.456    -.0189575     .041623
                 GA  |   .0581628   .0152732     3.81   0.000      .027454    .0888716
                 FL  |   .0009376   .0164545     0.06   0.955    -.0321465    .0340216
                 KY  |   -.034303   .0045903    -7.47   0.000    -.0435325   -.0250736
                 TN  |  -.0252531   .0149131    -1.69   0.097    -.0552378    .0047317
                 AL  |   .0102905   .0152055     0.68   0.502    -.0202823    .0408633
                 MS  |  -.0041911   .0158491    -0.26   0.793    -.0360577    .0276756
                 AR  |  -.0543607   .0149481    -3.64   0.001    -.0844159   -.0243055
                 LA  |   .0530669   .0156072     3.40   0.001     .0216866    .0844472
                 OK  |  -.0382096   .0088816    -4.30   0.000    -.0560672    -.020352
                 TX  |   .0588717   .0164558     3.58   0.001      .025785    .0919583
                 ID  |   .0148133   .0145604     1.02   0.314    -.0144624     .044089
                 WY  |   .1752143   .0153636    11.40   0.000     .1443238    .2061048
                 CO  |   .0673854    .008037     8.38   0.000      .051226    .0835448
                 NM  |   .0514224   .0099033     5.19   0.000     .0315106    .0713343
                 AZ  |   .0542611   .0166357     3.26   0.002     .0208129    .0877094
                 UT  |   .0143076   .0141689     1.01   0.318    -.0141808    .0427961
                 NV  |   .1078962   .0167871     6.43   0.000     .0741436    .1416489
                 WA  |    .104651   .0072662    14.40   0.000     .0900413    .1192607
                 OR  |   .0381563   .0073892     5.16   0.000     .0232994    .0530133
                 CA  |   .1408263   .0127032    11.09   0.000     .1152848    .1663677
                 AK  |   .2484978   .0056335    44.11   0.000     .2371709    .2598247
                 HI  |   .1358974   .0060843    22.34   0.000     .1236641    .1481308
                     |
                year |
               1990  |  -.0075709   .0032491    -2.33   0.024    -.0141036   -.0010381
               1991  |  -.0138179   .0059109    -2.34   0.024    -.0257025   -.0019334
               1992  |  -.0131424   .0053855    -2.44   0.018    -.0239707   -.0023141
               1993  |   -.027403    .004047    -6.77   0.000    -.0355401   -.0192659
               1996  |   -.046862   .0085727    -5.47   0.000    -.0640985   -.0296256
               1997  |  -.0339475   .0086545    -3.92   0.000    -.0513486   -.0165464
               1998  |  -.0089678    .008095    -1.11   0.273    -.0252438    .0073082
               1999  |   .0133263   .0097319     1.37   0.177     -.006241    .0328935
               2000  |   .0228777   .0084807     2.70   0.010     .0058261    .0399292
               2001  |   .0453256   .0089345     5.07   0.000     .0273615    .0632896
               2002  |   .0613006   .0066298     9.25   0.000     .0479705    .0746308
               2003  |   .0501307   .0088491     5.67   0.000     .0323385    .0679229
               2004  |   .0389382   .0071361     5.46   0.000     .0245902    .0532862
               2005  |   .0224932   .0081283     2.77   0.008     .0061502    .0388363
               2006  |    .017263   .0074921     2.30   0.026     .0021991    .0323269
               2007  |   .0189861   .0070163     2.71   0.009     .0048789    .0330934
               2008  |   .0223159   .0064356     3.47   0.001     .0093762    .0352555
               2009  |   .0589677   .0100472     5.87   0.000     .0387665    .0791689
               2010  |   .0476225   .0086363     5.51   0.000     .0302581    .0649869
               2011  |   .0200046   .0091624     2.18   0.034     .0015823    .0384268
               2012  |   .0144084   .0107945     1.33   0.188    -.0072953    .0361121
               2013  |    .007815    .010409     0.75   0.456    -.0131137    .0287437
               2014  |   .0001858   .0107822     0.02   0.986    -.0214934    .0218649
               2015  |   .0177191   .0086283     2.05   0.045     .0003707    .0350675
               2016  |   .0334887   .0083231     4.02   0.000     .0167539    .0502235
               2017  |   .0354745   .0085451     4.15   0.000     .0182934    .0526555
               2018  |   .0453633   .0089952     5.04   0.000     .0272773    .0634494
               2019  |   .0634056   .0084254     7.53   0.000     .0464651    .0803461
                     |
                nind |
                  2  |   .0621572   .0320798     1.94   0.059    -.0023435    .1266579
                  3  |   .1176208   .0251451     4.68   0.000     .0670633    .1681784
                  4  |   -.045196   .0301644    -1.50   0.141    -.1058457    .0154537
                  5  |   .1210822   .0279487     4.33   0.000     .0648876    .1772767
                  6  |   .1214624    .030392     4.00   0.000     .0603553    .1825696
                  7  |   .0289784   .0285208     1.02   0.315    -.0283664    .0863233
                  8  |   -.012393   .0293305    -0.42   0.675    -.0713658    .0465799
                  9  |   -.055275   .0288652    -1.91   0.061    -.1133123    .0027622
                 10  |  -.0626066   .0312442    -2.00   0.051    -.1254273    .0002142
                 11  |   .1092651   .0287081     3.81   0.000     .0515435    .1669866
                     |
                educ |   .0549316    .001525    36.02   0.000     .0518655    .0579978
               exper |   .0433648   .0017132    25.31   0.000     .0399201    .0468095
              exper2 |  -.0008777   .0001006    -8.73   0.000    -.0010799   -.0006756
              exper3 |   3.04e-06   3.06e-06     0.99   0.326    -3.12e-06    9.20e-06
              exper4 |   5.19e-08   3.16e-08     1.65   0.106    -1.15e-08    1.15e-07
                edex |  -.0004455   .0000541    -8.24   0.000    -.0005542   -.0003368
                     |
               ee_cl |
                  2  |  -.0346596   .0079347    -4.37   0.000    -.0506133   -.0187058
                  3  |  -.0317419    .012856    -2.47   0.017    -.0575907   -.0058931
                  4  |   .0474721   .0196779     2.41   0.020      .007907    .0870372
                  5  |  -.1066152    .003818   -27.92   0.000    -.1142918   -.0989385
                  6  |  -.0731566   .0082219    -8.90   0.000    -.0896879   -.0566253
                  7  |  -.0261915   .0148982    -1.76   0.085    -.0561464    .0037633
                  8  |   .1233071   .0199053     6.19   0.000     .0832848    .1633293
                  9  |   -.135444   .0061466   -22.04   0.000    -.1478025   -.1230854
                 10  |  -.0870579   .0098009    -8.88   0.000    -.1067639   -.0673519
                 11  |  -.0139784   .0145577    -0.96   0.342    -.0432486    .0152919
                 12  |   .1299176   .0196193     6.62   0.000     .0904705    .1693648
                 13  |  -.1014372   .0113159    -8.96   0.000    -.1241894   -.0786851
                 14  |  -.0602534   .0092955    -6.48   0.000    -.0789433   -.0415636
                 15  |   .0019908   .0140048     0.14   0.888    -.0261678    .0301493
                 16  |   .1298057   .0205771     6.31   0.000     .0884325    .1711788
                     |
                marr |   .1209327   .0031788    38.04   0.000     .1145413    .1273242
               partt |   -.186594   .0085333   -21.87   0.000    -.2037513   -.1694367
              public |  -.0087272   .0064274    -1.36   0.181    -.0216504     .004196
                cmsa |   .1278853   .0077972    16.40   0.000     .1122079    .1435627
                     |
               nocc2 |
                  2  |  -.1551509   .0043303   -35.83   0.000    -.1638575   -.1464443
                  3  |  -.0417589   .0068625    -6.09   0.000    -.0555569   -.0279608
                  4  |   -.333613   .0070846   -47.09   0.000    -.3478576   -.3193683
                  5  |  -.1074669   .0116816    -9.20   0.000    -.1309543   -.0839795
                  6  |  -.4028045   .0077478   -51.99   0.000    -.4183824   -.3872266
                  7  |  -.2562356   .0094869   -27.01   0.000    -.2753103   -.2371609
                  8  |  -.1125727   .0107234   -10.50   0.000    -.1341336   -.0910117
                  9  |    -.44797   .0079999   -56.00   0.000    -.4640549   -.4318852
                 10  |  -.3984029   .0124263   -32.06   0.000    -.4233877    -.373418
                 11  |   -.290637   .0086775   -33.49   0.000    -.3080843   -.2731897
                 12  |  -.4496591   .0107614   -41.78   0.000    -.4712964   -.4280219
                     |
               unemp |  -.0069083   .0015549    -4.44   0.000    -.0100347   -.0037819
                     |
             quarter |
                  2  |   .0039438   .0019418     2.03   0.048     .0000395    .0078481
                  3  |   .0047399   .0018446     2.57   0.013      .001031    .0084488
                  4  |   .0156538   .0016857     9.29   0.000     .0122644    .0190432
                     |
               _cons |   .8226557   .0259629    31.69   0.000     .7704538    .8748577
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all_unemp 

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl
>  marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 8,242,746,843)

Linear regression                               Number of obs     =    918,144
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5447
                                                Root MSE          =     .41853

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1981936   .0178271   -11.12   0.000    -.2340374   -.1623497
            treat_st |  -.0218792   .0105548    -2.07   0.044     -.043101   -.0006574
treat_sthisprelwhite |   .0267011   .0251647     1.06   0.294    -.0238958     .077298
                     |
               state |
                 NH  |   .2513103   .0085412    29.42   0.000     .2341372    .2684835
                 VT  |   .0861625   .0083002    10.38   0.000     .0694739    .1028512
                 MA  |   .0542114    .012746     4.25   0.000     .0285839    .0798388
                 RI  |  -.0171768   .0166732    -1.03   0.308    -.0507005     .016347
                 CT  |   .2432228   .0151566    16.05   0.000     .2127485    .2736972
                 NY  |   .2387447    .015074    15.84   0.000     .2084364     .269053
                 NJ  |   .3067984   .0174786    17.55   0.000     .2716554    .3419415
                 PA  |  -.0021309   .0126523    -0.17   0.867    -.0275702    .0233083
                 OH  |   .1058346   .0171977     6.15   0.000     .0712563    .1404129
                 IN  |   .0785286   .0387873     2.02   0.048     .0005415    .1565157
                 IL  |   .1928331   .0146116    13.20   0.000     .1634544    .2222117
                 MI  |    .377735   .0346933    10.89   0.000     .3079793    .4474906
                 WI  |  -.0601724   .0304284    -1.98   0.054    -.1213529     .001008
                 MN  |  -.1120823   .0132905    -8.43   0.000    -.1388046     -.08536
                 IA  |  -.1518671   .0129962   -11.69   0.000    -.1779976   -.1257366
                 MO  |  -.0528451   .0101447    -5.21   0.000    -.0732423   -.0324478
                 ND  |  -1.147137   .0151566   -75.69   0.000    -1.177611   -1.116662
                 SD  |  -.5445021   .0189798   -28.69   0.000    -.5826635   -.5063407
                 NE  |  -.3077147   .0159531   -19.29   0.000    -.3397905   -.2756388
                 KS  |  -.1038046   .0177492    -5.85   0.000    -.1394917   -.0681174
                 DE  |   .1127546     .01444     7.81   0.000      .083721    .1417881
                 MD  |  -.0611193   .0179743    -3.40   0.001    -.0972591   -.0249795
                 DC  |  -.0832348   .0203647    -4.09   0.000    -.1241809   -.0422887
                 VA  |   -.099514    .015168    -6.56   0.000    -.1300113   -.0690167
                 NC  |   .1453876    .017168     8.47   0.000      .110869    .1799062
                 SC  |   .2080436   .0150771    13.80   0.000     .1777291    .2383582
                 GA  |   .1629684   .0174881     9.32   0.000     .1278062    .1981306
                 FL  |    .108281   .0186322     5.81   0.000     .0708185    .1457435
                 KY  |   .1006607   .0184105     5.47   0.000     .0636438    .1376776
                 TN  |   .0731749   .0159625     4.58   0.000     .0410802    .1052697
                 AL  |  -.0819276   .0156289    -5.24   0.000    -.1133517   -.0505035
                 MS  |  -.0554021   .0131656    -4.21   0.000    -.0818734   -.0289308
                 AR  |  -.0700353   .0147517    -4.75   0.000    -.0996956    -.040375
                 LA  |  -.0888342   .0171142    -5.19   0.000    -.1232447   -.0544238
                 OK  |  -.1862006   .0473625    -3.93   0.000    -.2814293    -.090972
                 TX  |   -.025394   .0215198    -1.18   0.244    -.0686623    .0178744
                 ID  |    .140995   .0135608    10.40   0.000     .1137292    .1682609
                 WY  |  -.7588096     .01529   -49.63   0.000    -.7895521    -.728067
                 CO  |  -.0689377   .0130771    -5.27   0.000    -.0952309   -.0426445
                 NM  |  -.1854823   .0119193   -15.56   0.000    -.2094477   -.1615169
                 AZ  |  -.0482127   .0186991    -2.58   0.013    -.0858098   -.0106156
                 UT  |  -.1539189   .0171632    -8.97   0.000    -.1884279   -.1194099
                 NV  |   .0593171   .0234972     2.52   0.015     .0120727    .1065614
                 WA  |   -.323084   .0121638   -26.56   0.000     -.347541   -.2986271
                 OR  |  -.0050958   .0090457    -0.56   0.576    -.0232834    .0130918
                 CA  |   .1543581   .0173555     8.89   0.000     .1194624    .1892537
                 AK  |   .6808391   .0154807    43.98   0.000     .6497131    .7119651
                 HI  |  -.1886049   .0218153    -8.65   0.000    -.2324674   -.1447424
                     |
       state#c.lyear |
                 ME  |    .001957   .0001384    14.14   0.000     .0016787    .0022353
                 NH  |   .0004479   .0002209     2.03   0.048     3.68e-06    .0008922
                 VT  |    .001437   .0001103    13.02   0.000     .0012151    .0016588
                 MA  |   .0026403   .0000995    26.52   0.000     .0024402    .0028405
                 RI  |   .0024794   .0001001    24.77   0.000     .0022781    .0026806
                 CT  |   .0009119   .0001018     8.96   0.000     .0007073    .0011165
                 NY  |   .0004099   .0000754     5.44   0.000     .0002584    .0005614
                 NJ  |     .00047   .0000678     6.93   0.000     .0003336    .0006064
                 PA  |    .002095   .0000741    28.27   0.000      .001946     .002244
                 OH  |   .0007462   .0000634    11.77   0.000     .0006188    .0008737
                 IN  |   .0012363    .000404     3.06   0.004      .000424    .0020485
                 IL  |    .000809   .0000677    11.96   0.000     .0006729     .000945
                 MI  |   -.001389   .0003386    -4.10   0.000    -.0020698   -.0007082
                 WI  |   .0026975   .0003034     8.89   0.000     .0020875    .0033075
                 MN  |   .0035996   .0000787    45.75   0.000     .0034414    .0037578
                 IA  |   .0034662   .0000919    37.72   0.000     .0032814     .003651
                 MO  |   .0021773   .0000936    23.25   0.000      .001989    .0023656
                 ND  |   .0131719   .0000867   152.00   0.000     .0129977    .0133462
                 SD  |   .0068182   .0000643   106.05   0.000      .006689    .0069475
                 NE  |   .0046329   .0001278    36.24   0.000     .0043759    .0048899
                 KS  |   .0028156    .000108    26.08   0.000     .0025985    .0030326
                 DE  |   .0013194   .0000838    15.74   0.000     .0011509     .001488
                 MD  |   .0038013   .0000742    51.23   0.000     .0036521    .0039505
                 DC  |   .0048816   .0000609    80.21   0.000     .0047592     .005004
                 VA  |   .0041585   .0001374    30.27   0.000     .0038823    .0044347
                 NC  |   .0006569   .0001821     3.61   0.001     .0002908     .001023
                 SC  |  -.0000295   .0001245    -0.24   0.814    -.0002797    .0002208
                 GA  |   .0008619   .0001454     5.93   0.000     .0005695    .0011543
                 FL  |   .0008541     .00012     7.12   0.000     .0006128    .0010954
                 KY  |   .0006542   .0002024     3.23   0.002     .0002472    .0010612
                 TN  |   .0009262   .0001357     6.83   0.000     .0006535     .001199
                 AL  |   .0027541   .0001334    20.65   0.000     .0024859    .0030223
                 MS  |   .0023571   .0001237    19.06   0.000     .0021084    .0026058
                 AR  |   .0020196   .0001908    10.59   0.000      .001636    .0024032
                 LA  |   .0032341   .0001406    23.00   0.000     .0029514    .0035168
                 OK  |   .0033528   .0005194     6.46   0.000     .0023086    .0043971
                 TX  |   .0026735    .000165    16.20   0.000     .0023417    .0030053
                 ID  |   .0006734   .0001731     3.89   0.000     .0003254    .0010214
                 WY  |   .0105832     .00007   151.19   0.000     .0104425     .010724
                 CO  |   .0032726   .0000809    40.45   0.000     .0031099    .0034352
                 NM  |   .0042177   .0001965    21.47   0.000     .0038227    .0046128
                 AZ  |   .0028627   .0001597    17.93   0.000     .0025416    .0031837
                 UT  |   .0034853   .0001119    31.15   0.000     .0032603    .0037103
                 NV  |   .0023505   .0001583    14.85   0.000     .0020323    .0026688
                 WA  |   .0060398   .0000847    71.30   0.000     .0058695    .0062101
                 OR  |    .002377    .000107    22.21   0.000     .0021618    .0025922
                 CA  |   .0018258   .0000706    25.87   0.000     .0016839    .0019677
                 AK  |   -.002277   .0000596   -38.17   0.000    -.0023969   -.0021571
                 HI  |   .0051115    .000105    48.68   0.000     .0049004    .0053226
                     |
                nind |
                  2  |   .0644016   .0321472     2.00   0.051    -.0002348    .1290379
                  3  |   .1184082    .025025     4.73   0.000     .0680921    .1687244
                  4  |  -.0437902   .0300934    -1.46   0.152    -.1042971    .0167166
                  5  |   .1226086   .0278151     4.41   0.000     .0666825    .1785347
                  6  |   .1230023    .030322     4.06   0.000     .0620359    .1839688
                  7  |   .0305779   .0284079     1.08   0.287      -.02654    .0876958
                  8  |   -.011094   .0292606    -0.38   0.706    -.0699264    .0477384
                  9  |  -.0538028    .028737    -1.87   0.067    -.1115825    .0039768
                 10  |  -.0611378   .0309794    -1.97   0.054    -.1234261    .0011505
                 11  |   .1103169   .0286696     3.85   0.000     .0526729     .167961
                     |
                educ |   .0548828   .0014346    38.26   0.000     .0519983    .0577673
               exper |   .0432282   .0017715    24.40   0.000     .0396663    .0467901
              exper2 |  -.0008587    .000104    -8.26   0.000    -.0010678   -.0006496
              exper3 |   2.43e-06   3.18e-06     0.76   0.450    -3.97e-06    8.83e-06
              exper4 |   5.76e-08   3.26e-08     1.77   0.084    -8.01e-09    1.23e-07
                edex |  -.0004459    .000056    -7.96   0.000    -.0005586   -.0003332
                     |
               ee_cl |
                  2  |  -.0354329   .0079802    -4.44   0.000    -.0514781   -.0193877
                  3  |  -.0327852   .0126323    -2.60   0.012    -.0581842   -.0073862
                  4  |   .0468421   .0192329     2.44   0.019     .0081718    .0855124
                  5  |  -.1071179   .0038681   -27.69   0.000    -.1148952   -.0993406
                  6  |  -.0749936   .0082871    -9.05   0.000    -.0916559   -.0583313
                  7  |  -.0276608   .0146642    -1.89   0.065    -.0571452    .0018236
                  8  |   .1229345   .0194633     6.32   0.000     .0838009     .162068
                  9  |  -.1371273   .0061578   -22.27   0.000    -.1495083   -.1247463
                 10  |  -.0877819   .0096077    -9.14   0.000    -.1070994   -.0684643
                 11  |  -.0151447   .0142995    -1.06   0.295    -.0438957    .0136064
                 12  |   .1290992   .0193734     6.66   0.000     .0901463     .168052
                 13  |  -.1032017   .0113195    -9.12   0.000    -.1259611   -.0804423
                 14  |   -.061497   .0091941    -6.69   0.000    -.0799829    -.043011
                 15  |   .0013516   .0137559     0.10   0.922    -.0263064    .0290097
                 16  |    .129195   .0203384     6.35   0.000     .0883019    .1700881
                     |
                marr |   .1208883   .0031826    37.98   0.000     .1144892    .1272875
               partt |  -.1869335   .0084533   -22.11   0.000      -.20393    -.169937
              public |  -.0088277   .0064212    -1.37   0.176    -.0217383    .0040829
                cmsa |   .1269024   .0078115    16.25   0.000     .1111964    .1426085
                     |
               nocc2 |
                  2  |  -.1557994   .0042358   -36.78   0.000     -.164316   -.1472828
                  3  |  -.0422559   .0068422    -6.18   0.000    -.0560131   -.0284987
                  4  |  -.3336946   .0070165   -47.56   0.000    -.3478022   -.3195869
                  5  |  -.1079785    .011593    -9.31   0.000    -.1312878   -.0846692
                  6  |  -.4032974   .0076749   -52.55   0.000    -.4187289   -.3878658
                  7  |  -.2565333   .0094711   -27.09   0.000    -.2755762   -.2374903
                  8  |  -.1121802   .0106759   -10.51   0.000    -.1336454    -.090715
                  9  |  -.4483181   .0078675   -56.98   0.000    -.4641367   -.4324994
                 10  |  -.3990911   .0123773   -32.24   0.000    -.4239773   -.3742048
                 11  |  -.2909324   .0085994   -33.83   0.000    -.3082227   -.2736422
                 12  |  -.4499814   .0106894   -42.10   0.000    -.4714739   -.4284889
                     |
               unemp |  -.0065716   .0006624    -9.92   0.000    -.0079033   -.0052398
                     |
             quarter |
                  2  |    .003725   .0019673     1.89   0.064    -.0002305    .0076806
                  3  |   .0044511   .0018473     2.41   0.020     .0007369    .0081652
                  4  |   .0152532   .0016858     9.05   0.000     .0118638    .0186426
                     |
               _cons |   .6338172   .0264066    24.00   0.000     .5807232    .6869112
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_mal_all_sltt 

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,713,347,868)

Linear regression                               Number of obs     =    904,991
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5047
                                                Root MSE          =     .39412

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1335879   .0175179    -7.63   0.000    -.1688101   -.0983657
            treat_st |  -.0267521    .006666    -4.01   0.000    -.0401551   -.0133492
treat_sthisprelwhite |   .0088941   .0226504     0.39   0.696    -.0366475    .0544357
                     |
               state |
                 NH  |    .060171   .0032271    18.65   0.000     .0536826    .0666595
                 VT  |   .0458119   .0005676    80.71   0.000     .0446706    .0469532
                 MA  |   .0958356    .008123    11.80   0.000     .0795032    .1121681
                 RI  |  -.0072653   .0081142    -0.90   0.375      -.02358    .0090494
                 CT  |   .0989132   .0082326    12.01   0.000     .0823604     .115466
                 NY  |   .0431496   .0081022     5.33   0.000     .0268591    .0594401
                 NJ  |   .0990087   .0092004    10.76   0.000     .0805101    .1175074
                 PA  |  -.0442211      .0062    -7.13   0.000    -.0566869   -.0317552
                 OH  |  -.0725994   .0058708   -12.37   0.000    -.0844035   -.0607953
                 IN  |  -.0639888    .004703   -13.61   0.000    -.0734448   -.0545328
                 IL  |    .004536   .0074011     0.61   0.543    -.0103448    .0194169
                 MI  |  -.0417991   .0061696    -6.77   0.000     -.054204   -.0293942
                 WI  |  -.0164621   .0045785    -3.60   0.001    -.0256677   -.0072564
                 MN  |    .039854   .0058458     6.82   0.000     .0281001    .0516078
                 IA  |  -.0313635   .0066732    -4.70   0.000    -.0447809   -.0179462
                 MO  |  -.0788007   .0056173   -14.03   0.000     -.090095   -.0675064
                 ND  |  -.0560627   .0066971    -8.37   0.000    -.0695281   -.0425973
                 SD  |  -.0714247   .0067414   -10.59   0.000    -.0849793   -.0578702
                 NE  |  -.0592955   .0069077    -8.58   0.000    -.0731843   -.0454067
                 KS  |  -.0619336   .0071617    -8.65   0.000    -.0763332   -.0475339
                 DE  |   .0319229   .0014555    21.93   0.000     .0289964    .0348494
                 MD  |   .0887275   .0089554     9.91   0.000     .0707214    .1067335
                 DC  |   .1803907   .0127288    14.17   0.000     .1547977    .2059838
                 VA  |   .0678413   .0087085     7.79   0.000     .0503318    .0853508
                 NC  |  -.0251307   .0076451    -3.29   0.002    -.0405022   -.0097591
                 SC  |  -.0642453   .0077782    -8.26   0.000    -.0798844   -.0486062
                 GA  |  -.0031853   .0082768    -0.38   0.702    -.0198268    .0134563
                 FL  |  -.0438885   .0092006    -4.77   0.000    -.0623875   -.0253894
                 KY  |  -.0889407   .0038116   -23.33   0.000    -.0966045   -.0812769
                 TN  |  -.0817098   .0078852   -10.36   0.000    -.0975641   -.0658555
                 AL  |  -.0819968   .0075879   -10.81   0.000    -.0972533   -.0667402
                 MS  |  -.0969676   .0068558   -14.14   0.000     -.110752   -.0831832
                 AR  |  -.1093154   .0070902   -15.42   0.000    -.1235712   -.0950597
                 LA  |  -.0837167   .0083879    -9.98   0.000    -.1005818   -.0668516
                 OK  |  -.1273239   .0061634   -20.66   0.000    -.1397164   -.1149315
                 TX  |  -.0100049    .008839    -1.13   0.263    -.0277768     .007767
                 ID  |  -.0367895   .0065993    -5.57   0.000    -.0500582   -.0235208
                 WY  |   .0145982   .0067078     2.18   0.034     .0011112    .0280852
                 CO  |   .0149957   .0081711     1.84   0.073    -.0014334    .0314247
                 NM  |  -.0492474   .0087809    -5.61   0.000    -.0669027   -.0315922
                 AZ  |   .0099184   .0088369     1.12   0.267    -.0078495    .0276862
                 UT  |  -.0440852   .0085495    -5.16   0.000    -.0612752   -.0268953
                 NV  |   .0579019   .0088723     6.53   0.000      .040063    .0757408
                 WA  |   .0567893   .0072493     7.83   0.000     .0422136     .071365
                 OR  |  -.0036054   .0066853    -0.54   0.592    -.0170472    .0098363
                 CA  |   .0983117   .0111505     8.82   0.000     .0758921    .1207314
                 AK  |   .1716481   .0046731    36.73   0.000     .1622522    .1810439
                 HI  |   .0884433   .0066724    13.26   0.000     .0750276     .101859
                     |
                year |
               1990  |  -.0045043   .0026116    -1.72   0.091    -.0097554    .0007467
               1991  |  -.0029519   .0021736    -1.36   0.181    -.0073223    .0014185
               1992  |   .0123572   .0031954     3.87   0.000     .0059323     .018782
               1993  |   .0079119   .0037335     2.12   0.039     .0004052    .0154185
               1996  |  -.0047805    .004607    -1.04   0.305    -.0140435    .0044825
               1997  |   .0092542   .0055925     1.65   0.105    -.0019903    .0204988
               1998  |   .0393465   .0047206     8.33   0.000      .029855     .048838
               1999  |   .0578521   .0065185     8.88   0.000     .0447457    .0709585
               2000  |    .073618    .006612    11.13   0.000     .0603237    .0869123
               2001  |   .0889434   .0059343    14.99   0.000     .0770117    .1008751
               2002  |   .1003704   .0053467    18.77   0.000     .0896201    .1111207
               2003  |   .1083022   .0060042    18.04   0.000       .09623    .1203744
               2004  |   .1006437   .0060172    16.73   0.000     .0885454     .112742
               2005  |   .0908779   .0064449    14.10   0.000     .0779195    .1038362
               2006  |   .0844756   .0060793    13.90   0.000     .0722523    .0966989
               2007  |   .0850498   .0053851    15.79   0.000     .0742223    .0958773
               2008  |   .0813348    .005883    13.83   0.000     .0695062    .0931635
               2009  |   .0962265   .0052914    18.19   0.000     .0855875    .1068655
               2010  |   .0914978   .0047769    19.15   0.000     .0818932    .1011024
               2011  |   .0738359   .0060604    12.18   0.000     .0616506    .0860212
               2012  |   .0603543   .0056702    10.64   0.000     .0489535    .0717551
               2013  |   .0592708   .0063915     9.27   0.000     .0464199    .0721217
               2014  |   .0601386   .0072032     8.35   0.000     .0456556    .0746216
               2015  |   .0761546   .0067054    11.36   0.000     .0626724    .0896367
               2016  |   .0917081   .0064639    14.19   0.000     .0787117    .1047046
               2017  |   .1041944   .0069843    14.92   0.000     .0901515    .1182373
               2018  |   .1078482   .0067416    16.00   0.000     .0942933    .1214032
               2019  |   .1208095   .0070386    17.16   0.000     .1066576    .1349615
                     |
                nind |
                  2  |    .046266   .0323541     1.43   0.159    -.0187863    .1113183
                  3  |   .1123721   .0315868     3.56   0.001     .0488627    .1758815
                  4  |  -.0841591    .031597    -2.66   0.010    -.1476892   -.0206291
                  5  |   .1043323   .0320695     3.25   0.002     .0398523    .1688123
                  6  |   .0838331   .0335415     2.50   0.016     .0163934    .1512729
                  7  |   .0334118   .0340506     0.98   0.331    -.0350516    .1018752
                  8  |  -.0113237   .0344558    -0.33   0.744    -.0806018    .0579544
                  9  |  -.0895043   .0370011    -2.42   0.019    -.1638999   -.0151087
                 10  |  -.0785802    .031692    -2.48   0.017    -.1423011   -.0148592
                 11  |   .0816218   .0368501     2.21   0.032     .0075297     .155714
                     |
                educ |    .079247    .003092    25.63   0.000       .07303    .0854639
               exper |     .05296   .0016329    32.43   0.000     .0496767    .0562432
              exper2 |  -.0016685   .0000909   -18.35   0.000    -.0018513   -.0014856
              exper3 |   .0000289   2.57e-06    11.24   0.000     .0000237     .000034
              exper4 |  -1.85e-07   2.48e-08    -7.46   0.000    -2.34e-07   -1.35e-07
                edex |  -.0009049   .0000562   -16.11   0.000    -.0010178   -.0007919
                     |
               ee_cl |
                  2  |  -.1042356   .0084722   -12.30   0.000    -.1212701    -.087201
                  3  |  -.1218313   .0144118    -8.45   0.000    -.1508082   -.0928544
                  4  |  -.0908098   .0249726    -3.64   0.001    -.1410206    -.040599
                  5  |  -.1409844   .0060238   -23.40   0.000     -.153096   -.1288728
                  6  |  -.1512571   .0109981   -13.75   0.000    -.1733702    -.129144
                  7  |  -.1277714   .0173249    -7.38   0.000    -.1626055   -.0929374
                  8  |  -.0116182   .0271337    -0.43   0.670    -.0661741    .0429378
                  9  |  -.1632575   .0068139   -23.96   0.000    -.1769577   -.1495572
                 10  |  -.1628244   .0111603   -14.59   0.000    -.1852637   -.1403851
                 11  |  -.1240763   .0165531    -7.50   0.000    -.1573586    -.090794
                 12  |  -.0194993   .0257687    -0.76   0.453    -.0713107    .0323122
                 13  |  -.1606695   .0094755   -16.96   0.000    -.1797213   -.1416176
                 14  |  -.1480129   .0109661   -13.50   0.000    -.1700617   -.1259641
                 15  |  -.0935929   .0170617    -5.49   0.000    -.1278978    -.059288
                 16  |  -.0015318    .028874    -0.05   0.958    -.0595869    .0565233
                     |
                marr |   .0351791   .0029075    12.10   0.000     .0293331    .0410251
               partt |   -.130104   .0031541   -41.25   0.000    -.1364457   -.1237622
              public |   .0141564   .0052251     2.71   0.009     .0036506    .0246622
                cmsa |   .1507995   .0076334    19.76   0.000     .1354515    .1661475
                     |
               nocc2 |
                  2  |  -.1415225   .0037771   -37.47   0.000    -.1491168   -.1339281
                  3  |  -.0384669    .006967    -5.52   0.000    -.0524749   -.0244588
                  4  |  -.3290731   .0042827   -76.84   0.000     -.337684   -.3204621
                  5  |   .0269899   .0084254     3.20   0.002     .0100496    .0439303
                  6  |  -.3451336   .0048606   -71.01   0.000    -.3549065   -.3353607
                  7  |  -.3778576   .0064654   -58.44   0.000    -.3908571   -.3648581
                  8  |  -.1791442   .0084888   -21.10   0.000    -.1962121   -.1620763
                  9  |  -.4384187   .0074334   -58.98   0.000    -.4533646   -.4234728
                 10  |   -.482129   .0147826   -32.61   0.000    -.5118514   -.4524065
                 11  |  -.2547106    .007215   -35.30   0.000    -.2692174   -.2402038
                 12  |  -.4622019   .0164962   -28.02   0.000    -.4953699    -.429034
                     |
             quarter |
                  2  |   .0089918   .0015088     5.96   0.000     .0059581    .0120255
                  3  |   .0172395   .0017413     9.90   0.000     .0137384    .0207407
                  4  |   .0210461   .0011825    17.80   0.000     .0186685    .0234238
                     |
               _cons |   .4864908   .0463712    10.49   0.000     .3932552    .5797264
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all 

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,713,347,868)

Linear regression                               Number of obs     =    904,991
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5047
                                                Root MSE          =     .39411

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1335735   .0175093    -7.63   0.000    -.1687783   -.0983686
            treat_st |   -.027217   .0068661    -3.96   0.000    -.0410222   -.0134117
treat_sthisprelwhite |   .0087847   .0226804     0.39   0.700    -.0368174    .0543867
                     |
               state |
                 NH  |   .0578283   .0033035    17.51   0.000     .0511862    .0644703
                 VT  |   .0436375   .0015473    28.20   0.000     .0405265    .0467485
                 MA  |   .0959498   .0081385    11.79   0.000     .0795862    .1123134
                 RI  |  -.0050378   .0084936    -0.59   0.556    -.0221153    .0120398
                 CT  |   .0991567   .0082612    12.00   0.000     .0825464     .115767
                 NY  |   .0447224   .0083568     5.35   0.000     .0279199    .0615249
                 NJ  |   .1002034    .009367    10.70   0.000     .0813699     .119037
                 PA  |  -.0433837   .0063072    -6.88   0.000    -.0560652   -.0307023
                 OH  |  -.0712547   .0060734   -11.73   0.000    -.0834662   -.0590432
                 IN  |  -.0637232    .004736   -13.45   0.000    -.0732456   -.0542008
                 IL  |   .0066322   .0077769     0.85   0.398    -.0090042    .0222686
                 MI  |  -.0386288   .0069287    -5.58   0.000    -.0525598   -.0246977
                 WI  |  -.0172002   .0044704    -3.85   0.000    -.0261885    -.008212
                 MN  |   .0381856   .0057676     6.62   0.000     .0265889    .0497822
                 IA  |  -.0334597    .006326    -5.29   0.000     -.046179   -.0207403
                 MO  |  -.0783615    .005669   -13.82   0.000    -.0897598   -.0669631
                 ND  |  -.0592638   .0064234    -9.23   0.000    -.0721788   -.0463487
                 SD  |  -.0745288   .0063965   -11.65   0.000    -.0873899   -.0616677
                 NE  |   -.062847   .0063916    -9.83   0.000    -.0756981   -.0499958
                 KS  |  -.0628524     .00698    -9.00   0.000    -.0768866   -.0488182
                 DE  |   .0306748   .0015372    19.96   0.000     .0275841    .0337655
                 MD  |   .0880527    .008887     9.91   0.000     .0701843    .1059212
                 DC  |   .1840126   .0132621    13.88   0.000     .1573473    .2106779
                 VA  |   .0664647   .0084434     7.87   0.000     .0494881    .0834414
                 NC  |  -.0239452   .0079765    -3.00   0.004    -.0399829   -.0079074
                 SC  |  -.0620793   .0084582    -7.34   0.000    -.0790856    -.045073
                 GA  |  -.0017789   .0086646    -0.21   0.838    -.0192002    .0156423
                 FL  |  -.0423927   .0094866    -4.47   0.000    -.0614667   -.0233187
                 KY  |  -.0871616   .0042335   -20.59   0.000    -.0956735   -.0786497
                 TN  |  -.0803807   .0082813    -9.71   0.000    -.0970313   -.0637301
                 AL  |  -.0798922   .0082644    -9.67   0.000    -.0965088   -.0632755
                 MS  |  -.0933672   .0081338   -11.48   0.000    -.1097212   -.0770131
                 AR  |  -.1079249   .0075095   -14.37   0.000    -.1230238    -.092826
                 LA  |  -.0812681     .00914    -8.89   0.000    -.0996453   -.0628908
                 OK  |  -.1281168   .0059872   -21.40   0.000    -.1401549   -.1160788
                 TX  |  -.0087801   .0090437    -0.97   0.336    -.0269636    .0094035
                 ID  |  -.0363426   .0067655    -5.37   0.000    -.0499456   -.0227396
                 WY  |   .0133546   .0065726     2.03   0.048     .0001394    .0265698
                 CO  |   .0142467   .0080893     1.76   0.085    -.0020179    .0305113
                 NM  |  -.0478119   .0090419    -5.29   0.000    -.0659919   -.0296319
                 AZ  |   .0116957   .0091944     1.27   0.209    -.0067908    .0301822
                 UT  |  -.0454525   .0082505    -5.51   0.000    -.0620412   -.0288638
                 NV  |   .0602045   .0094556     6.37   0.000     .0411928    .0792161
                 WA  |   .0585806   .0075371     7.77   0.000     .0434262    .0737351
                 OR  |   -.001133   .0071634    -0.16   0.875    -.0155361      .01327
                 CA  |   .1015991   .0118494     8.57   0.000     .0777743    .1254239
                 AK  |   .1758933   .0057561    30.56   0.000     .1643198    .1874667
                 HI  |   .0862467   .0065125    13.24   0.000     .0731525    .0993409
                     |
                year |
               1990  |  -.0038571   .0026248    -1.47   0.148    -.0091346    .0014205
               1991  |   .0000868   .0035092     0.02   0.980    -.0069689    .0071424
               1992  |   .0166712    .004786     3.48   0.001     .0070483    .0262941
               1993  |   .0110898   .0045448     2.44   0.018      .001952    .0202277
               1996  |  -.0046355   .0043437    -1.07   0.291    -.0133691    .0040982
               1997  |   .0084748   .0053816     1.57   0.122    -.0023456    .0192953
               1998  |   .0377232   .0046628     8.09   0.000      .028348    .0470983
               1999  |   .0556879   .0066225     8.41   0.000     .0423725    .0690034
               2000  |   .0710696   .0067423    10.54   0.000     .0575132     .084626
               2001  |   .0878858   .0058742    14.96   0.000     .0760749    .0996967
               2002  |   .1014567   .0053302    19.03   0.000     .0907396    .1121738
               2003  |   .1098145   .0062315    17.62   0.000     .0972853    .1223437
               2004  |   .1012522     .00603    16.79   0.000     .0891281    .1133763
               2005  |   .0906336   .0065526    13.83   0.000     .0774588    .1038085
               2006  |   .0833295   .0061543    13.54   0.000     .0709553    .0957036
               2007  |   .0838243   .0054733    15.32   0.000     .0728195    .0948291
               2008  |   .0824241   .0059233    13.92   0.000     .0705144    .0943337
               2009  |     .10414   .0077527    13.43   0.000     .0885522    .1197278
               2010  |   .1001559   .0067301    14.88   0.000     .0866242    .1136876
               2011  |   .0810804    .006307    12.86   0.000     .0683993    .0937615
               2012  |   .0658562   .0053896    12.22   0.000     .0550198    .0766927
               2013  |   .0634336   .0062011    10.23   0.000     .0509654    .0759018
               2014  |   .0619075   .0066786     9.27   0.000     .0484792    .0753358
               2015  |   .0761705   .0065437    11.64   0.000     .0630135    .0893274
               2016  |   .0909693   .0063996    14.21   0.000     .0781021    .1038366
               2017  |   .1024495   .0071057    14.42   0.000     .0881626    .1167364
               2018  |   .1052378   .0072246    14.57   0.000     .0907117    .1197639
               2019  |   .1177877   .0075288    15.64   0.000       .10265    .1329254
                     |
                nind |
                  2  |   .0462234    .032347     1.43   0.159    -.0188147    .1112614
                  3  |   .1123415   .0315886     3.56   0.001     .0488284    .1758545
                  4  |  -.0841604   .0316017    -2.66   0.011    -.1476999   -.0206208
                  5  |   .1043419   .0320655     3.25   0.002     .0398698    .1688139
                  6  |   .0838244   .0335502     2.50   0.016     .0163672    .1512816
                  7  |   .0333961   .0340521     0.98   0.332    -.0350703    .1018625
                  8  |  -.0113327   .0344615    -0.33   0.744    -.0806221    .0579568
                  9  |  -.0895243   .0370108    -2.42   0.019    -.1639396    -.015109
                 10  |   -.078572   .0316891    -2.48   0.017    -.1422872   -.0148569
                 11  |   .0815935   .0368565     2.21   0.032     .0074885    .1556985
                     |
                educ |   .0792498   .0030912    25.64   0.000     .0730346     .085465
               exper |   .0529742   .0016301    32.50   0.000     .0496967    .0562518
              exper2 |  -.0016692   .0000909   -18.36   0.000     -.001852   -.0014864
              exper3 |   .0000289   2.57e-06    11.25   0.000     .0000237     .000034
              exper4 |  -1.85e-07   2.47e-08    -7.47   0.000    -2.35e-07   -1.35e-07
                edex |  -.0009053    .000056   -16.15   0.000     -.001018   -.0007926
                     |
               ee_cl |
                  2  |  -.1042284   .0084775   -12.29   0.000    -.1212735   -.0871832
                  3  |  -.1218178    .014408    -8.45   0.000    -.1507871   -.0928485
                  4  |  -.0907964   .0249715    -3.64   0.001    -.1410049   -.0405879
                  5  |  -.1409538   .0060213   -23.41   0.000    -.1530604   -.1288471
                  6  |  -.1512643   .0110036   -13.75   0.000    -.1733886   -.1291401
                  7  |   -.127754   .0173261    -7.37   0.000    -.1625905   -.0929174
                  8  |  -.0115892   .0271352    -0.43   0.671    -.0661481    .0429697
                  9  |  -.1632464   .0068225   -23.93   0.000    -.1769639    -.149529
                 10  |   -.162842   .0111595   -14.59   0.000    -.1852798   -.1404043
                 11  |  -.1240433   .0165565    -7.49   0.000    -.1573324   -.0907542
                 12  |  -.0194467   .0257774    -0.75   0.454    -.0712756    .0323823
                 13  |  -.1607394   .0094908   -16.94   0.000    -.1798221   -.1416568
                 14  |  -.1480241   .0109573   -13.51   0.000    -.1700553    -.125993
                 15  |  -.0935478   .0170598    -5.48   0.000    -.1278487   -.0592468
                 16  |  -.0014631   .0288843    -0.05   0.960    -.0595389    .0566127
                     |
                marr |   .0351824   .0029043    12.11   0.000      .029343    .0410218
               partt |  -.1300819   .0031573   -41.20   0.000      -.13643   -.1237338
              public |   .0141655   .0052254     2.71   0.009     .0036591    .0246718
                cmsa |   .1507794    .007637    19.74   0.000     .1354243    .1661345
                     |
               nocc2 |
                  2  |   -.141539   .0037804   -37.44   0.000    -.1491399   -.1339381
                  3  |  -.0384923   .0069635    -5.53   0.000    -.0524933   -.0244913
                  4  |  -.3290645   .0042811   -76.87   0.000    -.3376722   -.3204569
                  5  |   .0269783   .0084253     3.20   0.002      .010038    .0439185
                  6  |  -.3451382     .00486   -71.02   0.000    -.3549098   -.3353665
                  7  |  -.3778731   .0064676   -58.43   0.000    -.3908771    -.364869
                  8  |  -.1791507   .0084965   -21.09   0.000     -.196234   -.1620675
                  9  |  -.4384228   .0074333   -58.98   0.000    -.4533684   -.4234772
                 10  |  -.4821602   .0147811   -32.62   0.000    -.5118796   -.4524408
                 11  |  -.2547492    .007202   -35.37   0.000    -.2692297   -.2402686
                 12  |   -.462229   .0164941   -28.02   0.000    -.4953927   -.4290652
                     |
               unemp |  -.0019875   .0012796    -1.55   0.127    -.0045602    .0005852
                     |
             quarter |
                  2  |   .0089893    .001509     5.96   0.000     .0059551    .0120234
                  3  |   .0172307   .0017392     9.91   0.000     .0137337    .0207277
                  4  |   .0210428   .0011852    17.75   0.000     .0186597    .0234259
                     |
               _cons |   .4958745   .0467344    10.61   0.000     .4019087    .5898403
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all_unemp 

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl
>  marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,713,347,868)

Linear regression                               Number of obs     =    904,991
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5033
                                                Root MSE          =     .39466

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1337371   .0176268    -7.59   0.000    -.1691782   -.0982959
            treat_st |  -.0584299   .0116615    -5.01   0.000    -.0818769   -.0349829
treat_sthisprelwhite |   .0101452   .0229971     0.44   0.661    -.0360936     .056384
                     |
               state |
                 NH  |   .1791674   .0097392    18.40   0.000     .1595853    .1987494
                 VT  |  -.1163185   .0073168   -15.90   0.000      -.13103   -.1016071
                 MA  |  -.1043113   .0140789    -7.41   0.000    -.1326188   -.0760038
                 RI  |  -.1806331   .0143827   -12.56   0.000    -.2095514   -.1517148
                 CT  |   .0255127   .0167015     1.53   0.133    -.0080679    .0590934
                 NY  |  -.0029154    .015435    -0.19   0.851    -.0339496    .0281187
                 NJ  |   .0829966   .0175883     4.72   0.000     .0476328    .1183603
                 PA  |  -.0585797   .0138041    -4.24   0.000    -.0863348   -.0308246
                 OH  |  -.1635079   .0182372    -8.97   0.000    -.2001763   -.1268395
                 IN  |  -.2525748   .0413609    -6.11   0.000    -.3357365   -.1694131
                 IL  |  -.1076282    .015202    -7.08   0.000    -.1381939   -.0770625
                 MI  |  -.1464104   .0364556    -4.02   0.000    -.2197093   -.0731114
                 WI  |   -.395366   .0324541   -12.18   0.000    -.4606195   -.3301126
                 MN  |  -.2094406   .0134954   -15.52   0.000    -.2365749   -.1823063
                 IA  |  -.1544778    .013447   -11.49   0.000    -.1815148   -.1274409
                 MO  |  -.0774901   .0103295    -7.50   0.000    -.0982589   -.0567213
                 ND  |  -.8971503   .0152002   -59.02   0.000    -.9277124   -.8665883
                 SD  |   -.446067   .0174857   -25.51   0.000    -.4812245   -.4109096
                 NE  |  -.4244063   .0149335   -28.42   0.000    -.4544322   -.3943805
                 KS  |  -.2036504   .0179795   -11.33   0.000    -.2398006   -.1675001
                 DE  |   .0548722   .0103495     5.30   0.000      .034063    .0756813
                 MD  |  -.3114603   .0199031   -15.65   0.000    -.3514781   -.2714424
                 DC  |   -.291196    .021692   -13.42   0.000    -.3348106   -.2475814
                 VA  |  -.1853781   .0154691   -11.98   0.000    -.2164808   -.1542753
                 NC  |   .0496184   .0143423     3.46   0.001     .0207812    .0784555
                 SC  |   .0458529   .0148107     3.10   0.003     .0160741    .0756318
                 GA  |   .2078442   .0158871    13.08   0.000      .175901    .2397874
                 FL  |  -.0155448   .0202741    -0.77   0.447    -.0563085    .0252189
                 KY  |  -.2238454   .0205484   -10.89   0.000    -.2651606   -.1825301
                 TN  |  -.1845903   .0157303   -11.73   0.000    -.2162182   -.1529623
                 AL  |  -.0915088   .0152983    -5.98   0.000    -.1222681   -.0607496
                 MS  |   .0113486   .0121098     0.94   0.353    -.0129997    .0356969
                 AR  |  -.1250248   .0129245    -9.67   0.000    -.1510112   -.0990384
                 LA  |   -.160725   .0176507    -9.11   0.000    -.1962142   -.1252358
                 OK  |  -.4565149   .0506131    -9.02   0.000    -.5582795   -.3547504
                 TX  |  -.0423056   .0224944    -1.88   0.066    -.0875337    .0029226
                 ID  |    .071111   .0144087     4.94   0.000     .0421403    .1000817
                 WY  |  -.7282951   .0179449   -40.59   0.000    -.7643756   -.6922145
                 CO  |  -.2438962   .0137959   -17.68   0.000    -.2716347   -.2161578
                 NM  |  -.2962049   .0071412   -41.48   0.000    -.3105632   -.2818466
                 AZ  |  -.1127712   .0194746    -5.79   0.000    -.1519275   -.0736148
                 UT  |  -.1886818   .0193276    -9.76   0.000    -.2275427    -.149821
                 NV  |   .0278317   .0264533     1.05   0.298    -.0253562    .0810197
                 WA  |  -.4404266   .0125258   -35.16   0.000    -.4656113   -.4152419
                 OR  |  -.1735252   .0108974   -15.92   0.000     -.195436   -.1516145
                 CA  |  -.0343957   .0198595    -1.73   0.090    -.0743259    .0055345
                 AK  |   .3520136   .0160731    21.90   0.000     .3196965    .3843308
                 HI  |  -.1697037   .0299293    -5.67   0.000    -.2298807   -.1095268
                     |
       state#c.lyear |
                 ME  |   .0024885   .0001477    16.85   0.000     .0021917    .0027854
                 NH  |   .0013685    .000232     5.90   0.000      .000902     .001835
                 VT  |   .0040302   .0001107    36.41   0.000     .0038076    .0042527
                 MA  |   .0044144   .0000956    46.20   0.000     .0042222    .0046065
                 RI  |   .0042039   .0000988    42.54   0.000     .0040052    .0044026
                 CT  |   .0032052   .0000669    47.87   0.000     .0030706    .0033398
                 NY  |   .0029523   .0000702    42.04   0.000     .0028111    .0030935
                 NJ  |    .002673   .0000681    39.25   0.000     .0025361      .00281
                 PA  |   .0026439   .0000788    33.54   0.000     .0024854    .0028024
                 OH  |   .0033926   .0000611    55.49   0.000     .0032697    .0035155
                 IN  |   .0043909   .0004459     9.85   0.000     .0034943    .0052875
                 IL  |   .0035989   .0000823    43.74   0.000     .0034335    .0037643
                 MI  |   .0036049   .0003723     9.68   0.000     .0028563    .0043534
                 WI  |   .0061746   .0003425    18.03   0.000      .005486    .0068632
                 MN  |   .0048755   .0000846    57.62   0.000     .0047054    .0050456
                 IA  |   .0039558   .0001114    35.50   0.000     .0037317    .0041798
                 MO  |   .0024869   .0000976    25.49   0.000     .0022908    .0026831
                 ND  |   .0108607   .0000983   110.50   0.000     .0106631    .0110583
                 SD  |   .0064205   .0000828    77.57   0.000     .0062541     .006587
                 NE  |   .0062614   .0001144    54.73   0.000     .0060314    .0064915
                 KS  |    .004156   .0000917    45.34   0.000     .0039717    .0043403
                 DE  |   .0021745   .0000979    22.22   0.000     .0019777    .0023713
                 MD  |   .0063174   .0000711    88.79   0.000     .0061744    .0064605
                 DC  |   .0069946   .0000579   120.84   0.000     .0068782     .007111
                 VA  |   .0052194    .000146    35.74   0.000     .0049257     .005513
                 NC  |     .00209    .000187    11.17   0.000     .0017139     .002466
                 SC  |   .0017653   .0001391    12.69   0.000     .0014857    .0020449
                 GA  |   .0007758   .0001372     5.65   0.000     .0004999    .0010517
                 FL  |   .0025543   .0001057    24.17   0.000     .0023418    .0027668
                 KY  |   .0038496   .0002395    16.07   0.000      .003368    .0043312
                 TN  |   .0038077   .0001492    25.52   0.000     .0035077    .0041076
                 AL  |   .0029148    .000137    21.28   0.000     .0026393    .0031902
                 MS  |   .0018046   .0001413    12.77   0.000     .0015205    .0020887
                 AR  |   .0029723   .0001912    15.55   0.000     .0025879    .0033567
                 LA  |   .0035558   .0001062    33.47   0.000     .0033422    .0037694
                 OK  |   .0058552   .0005826    10.05   0.000     .0046838    .0070266
                 TX  |   .0031147   .0001531    20.34   0.000     .0028068    .0034226
                 ID  |   .0017911   .0002012     8.90   0.000     .0013865    .0021957
                 WY  |   .0097668   .0000847   115.31   0.000     .0095965    .0099371
                 CO  |   .0049723   .0000845    58.86   0.000     .0048024    .0051421
                 NM  |   .0049096    .000186    26.40   0.000     .0045357    .0052835
                 AZ  |   .0040005   .0001237    32.34   0.000     .0037518    .0042493
                 UT  |   .0041735   .0001074    38.86   0.000     .0039576    .0043895
                 NV  |   .0031387    .000159    19.74   0.000      .002819    .0034584
                 WA  |   .0072834   .0001133    64.31   0.000     .0070557    .0075111
                 OR  |    .004169   .0001094    38.10   0.000     .0039489     .004389
                 CA  |   .0038178   .0001138    33.54   0.000      .003589    .0040466
                 AK  |   .0007665   .0000587    13.06   0.000     .0006485    .0008845
                 HI  |   .0049658   .0001923    25.83   0.000     .0045792    .0053524
                     |
                nind |
                  2  |   .0495427   .0326104     1.52   0.135    -.0160249    .1151103
                  3  |   .1129845   .0317844     3.55   0.001     .0490776    .1768914
                  4  |  -.0821127   .0318412    -2.58   0.013    -.1461337   -.0180917
                  5  |   .1071051   .0322509     3.32   0.002     .0422603      .17195
                  6  |   .0857059    .033815     2.53   0.015     .0177162    .1536955
                  7  |   .0355927    .034295     1.04   0.305    -.0333621    .1045475
                  8  |  -.0092487    .034735    -0.27   0.791     -.079088    .0605906
                  9  |  -.0875943     .03728    -2.35   0.023    -.1625508   -.0126379
                 10  |  -.0776399   .0318868    -2.43   0.019    -.1417526   -.0135272
                 11  |   .0837842   .0370832     2.26   0.028     .0092235    .1583449
                     |
                educ |   .0780024   .0029641    26.32   0.000     .0720428    .0839621
               exper |   .0523837   .0016377    31.99   0.000     .0490907    .0556766
              exper2 |  -.0016302   .0000911   -17.90   0.000    -.0018132   -.0014471
              exper3 |   .0000277   2.59e-06    10.68   0.000     .0000225    .0000329
              exper4 |  -1.74e-07   2.51e-08    -6.92   0.000    -2.25e-07   -1.23e-07
                edex |   -.000887   .0000563   -15.75   0.000    -.0010002   -.0007737
                     |
               ee_cl |
                  2  |  -.1048837   .0085301   -12.30   0.000    -.1220346   -.0877327
                  3  |  -.1204812   .0141188    -8.53   0.000    -.1488689   -.0920934
                  4  |  -.0868691   .0243366    -3.57   0.001     -.135801   -.0379371
                  5  |  -.1435955   .0060159   -23.87   0.000    -.1556913   -.1314996
                  6  |  -.1532038   .0109764   -13.96   0.000    -.1752734   -.1311343
                  7  |  -.1267422   .0171109    -7.41   0.000     -.161146   -.0923384
                  8  |   -.008148   .0266661    -0.31   0.761    -.0617637    .0454677
                  9  |    -.16644   .0067242   -24.75   0.000      -.17996     -.15292
                 10  |  -.1629875   .0109196   -14.93   0.000    -.1849428   -.1410323
                 11  |  -.1221498   .0162361    -7.52   0.000    -.1547946    -.089505
                 12  |  -.0160508   .0254181    -0.63   0.531    -.0671573    .0350556
                 13  |   -.164077   .0094033   -17.45   0.000    -.1829836   -.1451704
                 14  |  -.1478717   .0105971   -13.95   0.000    -.1691786   -.1265648
                 15  |  -.0922651   .0167326    -5.51   0.000    -.1259083   -.0586218
                 16  |  -.0001806   .0285411    -0.01   0.995    -.0575664    .0572052
                     |
                marr |      .0351   .0028606    12.27   0.000     .0293483    .0408517
               partt |  -.1302042   .0030787   -42.29   0.000    -.1363943    -.124014
              public |   .0140125   .0051968     2.70   0.010     .0035635    .0244614
                cmsa |   .1506164   .0075282    20.01   0.000       .13548    .1657529
                     |
               nocc2 |
                  2  |  -.1411359    .003945   -35.78   0.000    -.1490679    -.133204
                  3  |  -.0378576   .0070201    -5.39   0.000    -.0519726   -.0237427
                  4  |  -.3281346     .00434   -75.61   0.000    -.3368607   -.3194085
                  5  |   .0267971   .0084836     3.16   0.003     .0097396    .0438546
                  6  |  -.3452803   .0048785   -70.78   0.000    -.3550893   -.3354714
                  7  |  -.3782207   .0065999   -57.31   0.000    -.3914907   -.3649507
                  8  |  -.1779281   .0085465   -20.82   0.000     -.195112   -.1607441
                  9  |  -.4382742   .0074633   -58.72   0.000    -.4532803   -.4232682
                 10  |  -.4827757   .0148823   -32.44   0.000    -.5126985   -.4528529
                 11  |  -.2536807   .0071967   -35.25   0.000    -.2681507   -.2392107
                 12  |  -.4621181   .0165845   -27.86   0.000    -.4954634   -.4287727
                     |
               unemp |  -.0028171   .0004892    -5.76   0.000    -.0038007   -.0018335
                     |
             quarter |
                  2  |   .0085981   .0014762     5.82   0.000       .00563    .0115662
                  3  |    .016809   .0016746    10.04   0.000     .0134419    .0201761
                  4  |   .0206595   .0011454    18.04   0.000     .0183565    .0229625
                     |
               _cons |   .3177104   .0511791     6.21   0.000      .214808    .4206129
--------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_fem_all_sltt 

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,600,457,660)

Linear regression                               Number of obs     =    183,210
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3435
                                                Root MSE          =     .36195

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1279556   .0098484   -12.99   0.000     -.147757   -.1081541
            treat_st |  -.0536614   .0301597    -1.78   0.082    -.1143016    .0069788
treat_sthisprelwhite |   .0058939   .0203797     0.29   0.774    -.0350822    .0468699
                     |
               state |
                 NH  |    .037391   .0057599     6.49   0.000       .02581     .048972
                 VT  |  -.0183772   .0035673    -5.15   0.000    -.0255497   -.0112047
                 MA  |   .0911839   .0103038     8.85   0.000     .0704668     .111901
                 RI  |   .0290172   .0110449     2.63   0.012     .0068098    .0512245
                 CT  |   .1402116    .010233    13.70   0.000     .1196368    .1607864
                 NY  |   .1130987   .0092924    12.17   0.000      .094415    .1317825
                 NJ  |   .1709377   .0105327    16.23   0.000     .1497602    .1921151
                 PA  |   .0014448   .0075036     0.19   0.848    -.0136422    .0165319
                 OH  |   .0004415     .00709     0.06   0.951    -.0138138    .0146969
                 IN  |   .0289814   .0062375     4.65   0.000     .0164401    .0415226
                 IL  |   .0903149    .008168    11.06   0.000      .073892    .1067378
                 MI  |   .0814071   .0070942    11.48   0.000     .0671433    .0956709
                 WI  |   .0292037   .0055696     5.24   0.000     .0180053     .040402
                 MN  |   .0626221    .007559     8.28   0.000     .0474237    .0778205
                 IA  |   .0333871   .0297478     1.12   0.267    -.0264248    .0931989
                 MO  |   .0241261   .0076123     3.17   0.003     .0088205    .0394316
                 ND  |    .039537   .0312343     1.27   0.212    -.0232638    .1023378
                 SD  |   .0036848   .0299753     0.12   0.903    -.0565846    .0639543
                 NE  |  -.0096054   .0293203    -0.33   0.745    -.0685578    .0493469
                 KS  |   .0602149   .0285918     2.11   0.040     .0027273    .1177026
                 DE  |   .0752951   .0025444    29.59   0.000     .0701794    .0804109
                 MD  |   .1186887   .0110546    10.74   0.000      .096462    .1409155
                 DC  |   .1941837   .0128696    15.09   0.000     .1683077    .2200597
                 VA  |   .1722526   .0290398     5.93   0.000     .1138642     .230641
                 NC  |   .0422306   .0293769     1.44   0.157    -.0168357    .1012968
                 SC  |   .0007531   .0292581     0.03   0.980    -.0580744    .0595805
                 GA  |   .0872224   .0292356     2.98   0.004     .0284404    .1460045
                 FL  |   .0338212   .0300075     1.13   0.265    -.0265129    .0941553
                 KY  |  -.0297424   .0059689    -4.98   0.000    -.0417437   -.0177412
                 TN  |   .0075886   .0289776     0.26   0.795    -.0506749     .065852
                 AL  |   .0303341   .0289857     1.05   0.301    -.0279455    .0886137
                 MS  |   .0109407   .0297423     0.37   0.715    -.0488603    .0707417
                 AR  |  -.0015267   .0297455    -0.05   0.959    -.0613339    .0582806
                 LA  |   .0537971   .0287994     1.87   0.068     -.004108    .1117021
                 OK  |  -.0391027   .0144388    -2.71   0.009    -.0681338   -.0100716
                 TX  |   .0655339   .0292804     2.24   0.030     .0066616    .1244062
                 ID  |   .0415305   .0299662     1.39   0.172    -.0187206    .1017817
                 WY  |   .2107433   .0325983     6.46   0.000        .1452    .2762866
                 CO  |   .0221355   .0090833     2.44   0.019     .0038722    .0403987
                 NM  |  -.0088235   .0079141    -1.11   0.270    -.0247359    .0070889
                 AZ  |   .0838491   .0299878     2.80   0.007     .0235546    .1441436
                 UT  |   .0185433   .0294451     0.63   0.532    -.0406601    .0777466
                 NV  |   .1501531   .0309714     4.85   0.000      .087881    .2124252
                 WA  |   .1082467   .0082435    13.13   0.000      .091672    .1248215
                 OR  |    .028144   .0078548     3.58   0.001     .0123508    .0439371
                 CA  |   .1745604   .0109088    16.00   0.000     .1526267    .1964941
                 AK  |   .2352112    .006968    33.76   0.000      .221201    .2492213
                 HI  |   .1058328   .0088798    11.92   0.000     .0879786    .1236869
                     |
                year |
               1990  |   -.015761   .0035919    -4.39   0.000    -.0229831    -.008539
               1991  |  -.0311437   .0044793    -6.95   0.000    -.0401499   -.0221374
               1992  |  -.0304594    .006253    -4.87   0.000    -.0430319   -.0178869
               1993  |  -.0336836   .0049679    -6.78   0.000    -.0436722   -.0236951
               1996  |  -.0184576   .0082422    -2.24   0.030    -.0350297   -.0018856
               1997  |  -.0138692    .009424    -1.47   0.148    -.0328174     .005079
               1998  |   .0000489    .006874     0.01   0.994    -.0137721      .01387
               1999  |   .0072577    .006542     1.11   0.273    -.0058958    .0204113
               2000  |   .0112088     .00615     1.82   0.075    -.0011566    .0235742
               2001  |   .0086213   .0061002     1.41   0.164    -.0036439    .0208865
               2002  |   .0226382   .0072942     3.10   0.003     .0079723    .0373041
               2003  |   .0272309   .0090921     3.00   0.004     .0089501    .0455117
               2004  |   .0202539   .0076381     2.65   0.011     .0048964    .0356114
               2005  |   .0177966   .0062692     2.84   0.007     .0051915    .0304016
               2006  |   .0079616   .0105209     0.76   0.453    -.0131921    .0291153
               2007  |   .0142854    .009735     1.47   0.149    -.0052881     .033859
               2008  |   .0037786    .007346     0.51   0.609    -.0109916    .0185488
               2009  |   .0167778   .0105424     1.59   0.118    -.0044192    .0379748
               2010  |     .02048    .010554     1.94   0.058    -.0007401    .0417002
               2011  |    .006215   .0107294     0.58   0.565    -.0153579    .0277878
               2012  |  -.0069177   .0094923    -0.73   0.470    -.0260033    .0121678
               2013  |  -.0032252   .0099787    -0.32   0.748    -.0232888    .0168385
               2014  |  -.0027549   .0122937    -0.22   0.824     -.027473    .0219632
               2015  |   .0091084   .0117056     0.78   0.440    -.0144274    .0326441
               2016  |   .0151918   .0109836     1.38   0.173    -.0068922    .0372758
               2017  |   .0311234   .0095661     3.25   0.002     .0118896    .0503573
               2018  |   .0358887   .0091921     3.90   0.000     .0174068    .0543706
               2019  |   .0375914   .0121897     3.08   0.003     .0130822    .0621005
                     |
                nind |
                  2  |   .1345364   .0478023     2.81   0.007     .0384235    .2306494
                  3  |  -.0006834   .0438148    -0.02   0.988    -.0887789    .0874121
                  4  |  -.1627256   .0532227    -3.06   0.004    -.2697369   -.0557143
                  5  |   .1341865   .0416646     3.22   0.002     .0504143    .2179588
                  6  |  -.0295223   .0493342    -0.60   0.552    -.1287152    .0696707
                  7  |  -.0271093   .0382315    -0.71   0.482    -.1039789    .0497604
                  8  |  -.1154216   .0438641    -2.63   0.011    -.2036163    -.027227
                  9  |  -.0840618   .0421806    -1.99   0.052    -.1688716    .0007481
                 10  |  -.1084296   .0678016    -1.60   0.116    -.2447539    .0278947
                 11  |   .1485954   .0507543     2.93   0.005      .046547    .2506438
                     |
                educ |   .0731531   .0038561    18.97   0.000     .0653999    .0809062
               exper |   .0749272   .0026034    28.78   0.000     .0696926    .0801617
              exper2 |  -.0026797   .0001827   -14.67   0.000    -.0030469   -.0023124
              exper3 |   .0000529   5.52e-06     9.58   0.000     .0000418     .000064
              exper4 |  -4.18e-07   5.50e-08    -7.60   0.000    -5.28e-07   -3.07e-07
                edex |  -.0008525   .0000931    -9.16   0.000    -.0010397   -.0006653
                     |
               ee_cl |
                  2  |   .0677585   .0104514     6.48   0.000     .0467445    .0887725
                  3  |   .0512179   .0130178     3.93   0.000     .0250439    .0773919
                  4  |    .001064   .0212287     0.05   0.960    -.0416192    .0437471
                  5  |   -.000201   .0170463    -0.01   0.991    -.0344748    .0340728
                  6  |   .0360141   .0101075     3.56   0.001     .0156915    .0563367
                  7  |   .0472401   .0138867     3.40   0.001     .0193191    .0751612
                  8  |   .0003348   .0193268     0.02   0.986    -.0385244     .039194
                  9  |  -.0068346   .0159946    -0.43   0.671    -.0389938    .0253246
                 10  |    .017892   .0141905     1.26   0.213    -.0106398    .0464238
                 11  |   .0335917   .0157165     2.14   0.038     .0019917    .0651918
                 12  |   .0483123   .0204773     2.36   0.022     .0071399    .0894846
                 13  |   .0072831   .0174926     0.42   0.679    -.0278882    .0424543
                 14  |   .0113881   .0147447     0.77   0.444     -.018258    .0410343
                 15  |   .0269072   .0167024     1.61   0.114    -.0066752    .0604896
                 16  |   .0687263    .020079     3.42   0.001     .0283548    .1090979
                     |
                marr |   .0653386   .0036347    17.98   0.000     .0580306    .0726465
               partt |   -.076456   .0147839    -5.17   0.000    -.1061811   -.0467309
              public |  -.0520871   .0076008    -6.85   0.000    -.0673696   -.0368047
                cmsa |   .1065216     .01084     9.83   0.000     .0847263    .1283169
                     |
               nocc2 |
                  2  |   -.043348   .0102314    -4.24   0.000    -.0639196   -.0227765
                  3  |  -.0170796   .0114226    -1.50   0.141    -.0400463    .0058872
                  4  |  -.0683159   .0128603    -5.31   0.000    -.0941733   -.0424586
                  5  |  -.0111205   .0162207    -0.69   0.496    -.0437344    .0214934
                  6  |  -.2416891   .0085985   -28.11   0.000    -.2589774   -.2244007
                  7  |  -.1909145   .0109101   -17.50   0.000    -.2128507   -.1689782
                  8  |  -.0564865   .0357031    -1.58   0.120    -.1282725    .0152994
                  9  |  -.2181447   .0093095   -23.43   0.000    -.2368627   -.1994267
                 10  |  -.1494462   .0062674   -23.85   0.000    -.1620476   -.1368447
                 11  |  -.0653498   .0076302    -8.56   0.000    -.0806913   -.0500084
                 12  |  -.1879639   .0063275   -29.71   0.000    -.2006862   -.1752417
                     |
             quarter |
                  2  |   .0022962   .0023366     0.98   0.331    -.0024018    .0069942
                  3  |   .0097602   .0025316     3.86   0.000     .0046701    .0148503
                  4  |   .0115367   .0025019     4.61   0.000     .0065063     .016567
                     |
               _cons |   .4466757   .0734632     6.08   0.000      .298968    .5943834
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all 

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,600,457,660)

Linear regression                               Number of obs     =    183,210
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3436
                                                Root MSE          =     .36194

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1279125   .0098332   -13.01   0.000    -.1476834   -.1081416
            treat_st |  -.0543255   .0309006    -1.76   0.085    -.1164554    .0078043
treat_sthisprelwhite |   .0057239   .0205512     0.28   0.782    -.0355969    .0470448
                     |
               state |
                 NH  |   .0330984   .0069418     4.77   0.000      .019141    .0470559
                 VT  |  -.0226963   .0041863    -5.42   0.000    -.0311135   -.0142792
                 MA  |   .0912854   .0102752     8.88   0.000     .0706258    .1119451
                 RI  |   .0326673   .0103269     3.16   0.003     .0119037    .0534308
                 CT  |   .1402383   .0102151    13.73   0.000     .1196994    .1607772
                 NY  |   .1156116   .0088611    13.05   0.000     .0977953     .133428
                 NJ  |   .1726558   .0101297    17.04   0.000     .1522886    .1930229
                 PA  |   .0026459   .0071462     0.37   0.713    -.0117224    .0170142
                 OH  |   .0024069   .0064999     0.37   0.713     -.010662    .0154757
                 IN  |   .0285739   .0063033     4.53   0.000     .0159004    .0412475
                 IL  |   .0937315   .0074727    12.54   0.000     .0787067    .1087564
                 MI  |   .0866832   .0069331    12.50   0.000     .0727432    .1006232
                 WI  |   .0271357   .0060668     4.47   0.000     .0149376    .0393337
                 MN  |   .0592778   .0085752     6.91   0.000     .0420362    .0765193
                 IA  |   .0291195   .0288596     1.01   0.318    -.0289066    .0871457
                 MO  |   .0246834   .0074629     3.31   0.002     .0096781    .0396886
                 ND  |   .0331071   .0296141     1.12   0.269    -.0264359    .0926502
                 SD  |  -.0022801   .0287461    -0.08   0.937     -.060078    .0555177
                 NE  |  -.0168948   .0278152    -0.61   0.546    -.0728209    .0390313
                 KS  |   .0579393   .0284054     2.04   0.047     .0008265    .1150521
                 DE  |   .0725702   .0025777    28.15   0.000     .0673873    .0777531
                 MD  |   .1171386   .0114548    10.23   0.000     .0941072      .14017
                 DC  |   .2003955   .0125387    15.98   0.000     .1751848    .2256062
                 VA  |   .1694077   .0287255     5.90   0.000     .1116512    .2271642
                 NC  |   .0429503   .0300939     1.43   0.160    -.0175576    .1034581
                 SC  |   .0042144   .0308588     0.14   0.892    -.0578313    .0662601
                 GA  |   .0889922   .0302725     2.94   0.005     .0281252    .1498591
                 FL  |   .0361146   .0311895     1.16   0.253     -.026596    .0988252
                 KY  |  -.0269157   .0060027    -4.48   0.000     -.038985   -.0148463
                 TN  |   .0092067   .0299792     0.31   0.760    -.0510704    .0694839
                 AL  |   .0340131   .0306353     1.11   0.272    -.0275832    .0956094
                 MS  |    .017022   .0324011     0.53   0.602    -.0481248    .0821687
                 AR  |   .0010524   .0311117     0.03   0.973    -.0615019    .0636067
                 LA  |   .0577548   .0304915     1.89   0.064    -.0035525    .1190622
                 OK  |  -.0407551   .0143567    -2.84   0.007    -.0696212    -.011889
                 TX  |    .067454    .030328     2.22   0.031     .0064754    .1284326
                 ID  |    .042297   .0307149     1.38   0.175    -.0194595    .1040535
                 WY  |   .2082312   .0324075     6.43   0.000     .1430717    .2733908
                 CO  |   .0203719   .0095654     2.13   0.038     .0011394    .0396044
                 NM  |  -.0066025   .0075027    -0.88   0.383    -.0216876    .0084826
                 AZ  |   .0863427   .0312013     2.77   0.008     .0236082    .1490771
                 UT  |   .0155223   .0292066     0.53   0.598    -.0432015    .0742461
                 NV  |   .1537894   .0326978     4.70   0.000      .088046    .2195328
                 WA  |   .1111021   .0076172    14.59   0.000     .0957868    .1264175
                 OR  |   .0321006   .0073553     4.36   0.000     .0173119    .0468894
                 CA  |   .1801614   .0103341    17.43   0.000     .1593833    .2009396
                 AK  |   .2423185    .007495    32.33   0.000     .2272487    .2573882
                 HI  |   .1010764   .0097099    10.41   0.000     .0815534    .1205994
                     |
                year |
               1990  |  -.0143867    .003254    -4.42   0.000    -.0209294    -.007844
               1991  |  -.0250405   .0059173    -4.23   0.000     -.036938    -.013143
               1992  |  -.0217846   .0068141    -3.20   0.002    -.0354852    -.008084
               1993  |  -.0270032   .0067133    -4.02   0.000    -.0405012   -.0135053
               1996  |  -.0177059   .0076376    -2.32   0.025    -.0330622   -.0023495
               1997  |    -.01478   .0085601    -1.73   0.091    -.0319912    .0024313
               1998  |  -.0024838    .006233    -0.40   0.692    -.0150161    .0100485
               1999  |   .0037011   .0057597     0.64   0.524    -.0078795    .0152818
               2000  |   .0069552   .0051622     1.35   0.184    -.0034241    .0173345
               2001  |   .0070363   .0061756     1.14   0.260    -.0053805    .0194531
               2002  |   .0249878   .0072471     3.45   0.001     .0104166    .0395591
               2003  |   .0304429   .0095991     3.17   0.003     .0111427    .0497431
               2004  |   .0218523   .0077733     2.81   0.007      .006223    .0374817
               2005  |   .0175333   .0062491     2.81   0.007     .0049687    .0300979
               2006  |   .0062037   .0108246     0.57   0.569    -.0155607     .027968
               2007  |   .0125843    .010161     1.24   0.222    -.0078457    .0330144
               2008  |   .0063125   .0068687     0.92   0.363    -.0074979    .0201229
               2009  |   .0316245   .0139413     2.27   0.028     .0035936    .0596554
               2010  |   .0368034   .0138459     2.66   0.011     .0089644    .0646425
               2011  |   .0200535   .0131032     1.53   0.132    -.0062922    .0463992
               2012  |   .0040559    .010139     0.40   0.691    -.0163301    .0244418
               2013  |   .0052327   .0102238     0.51   0.611    -.0153236     .025789
               2014  |   .0010901   .0124379     0.09   0.931    -.0239179    .0260981
               2015  |   .0094868    .011577     0.82   0.417    -.0137902    .0327639
               2016  |    .013984   .0112769     1.24   0.221    -.0086897    .0366577
               2017  |   .0282186   .0097762     2.89   0.006     .0085623    .0478749
               2018  |   .0313608   .0091256     3.44   0.001     .0130125    .0497092
               2019  |   .0322782   .0119276     2.71   0.009     .0082962    .0562601
                     |
                nind |
                  2  |   .1343852   .0478208     2.81   0.007      .038235    .2305355
                  3  |  -.0008527   .0438537    -0.02   0.985    -.0890265    .0873212
                  4  |  -.1628282   .0532578    -3.06   0.004    -.2699101   -.0557462
                  5  |   .1340924   .0416964     3.22   0.002     .0502562    .2179285
                  6  |   -.029481   .0493398    -0.60   0.553    -.1286853    .0697234
                  7  |  -.0273511   .0383065    -0.71   0.479    -.1043716    .0496694
                  8  |   -.115569    .043908    -2.63   0.011     -.203852    -.027286
                  9  |  -.0842059    .042211    -1.99   0.052    -.1690769    .0006651
                 10  |  -.1086421   .0678798    -1.60   0.116    -.2451236    .0278395
                 11  |    .148427    .050786     2.92   0.005     .0463149    .2505392
                     |
                educ |   .0731911   .0038724    18.90   0.000      .065405    .0809771
               exper |   .0749827   .0026022    28.81   0.000     .0697506    .0802148
              exper2 |  -.0026822   .0001827   -14.68   0.000    -.0030495   -.0023148
              exper3 |    .000053   5.52e-06     9.59   0.000     .0000419    .0000641
              exper4 |  -4.19e-07   5.51e-08    -7.60   0.000    -5.29e-07   -3.08e-07
                edex |  -.0008539   .0000934    -9.14   0.000    -.0010418   -.0006661
                     |
               ee_cl |
                  2  |   .0677832   .0104517     6.49   0.000     .0467687    .0887977
                  3  |   .0511647   .0130263     3.93   0.000     .0249734    .0773559
                  4  |   .0009073    .021284     0.04   0.966    -.0418871    .0437017
                  5  |  -.0002413   .0170437    -0.01   0.989    -.0345099    .0340273
                  6  |   .0359609   .0101256     3.55   0.001     .0156021    .0563197
                  7  |    .047214   .0138951     3.40   0.001     .0192761    .0751519
                  8  |   .0001933   .0193387     0.01   0.992    -.0386898    .0390764
                  9  |  -.0068029   .0160317    -0.42   0.673    -.0390368    .0254309
                 10  |   .0177175   .0142063     1.25   0.218    -.0108462    .0462813
                 11  |   .0334827   .0157301     2.13   0.038     .0018553    .0651102
                 12  |    .048264   .0204613     2.36   0.022     .0071238    .0894042
                 13  |   .0070546   .0174904     0.40   0.688    -.0281122    .0422214
                 14  |   .0112474   .0147754     0.76   0.450    -.0184605    .0409554
                 15  |   .0268009   .0167167     1.60   0.115    -.0068104    .0604121
                 16  |   .0686668    .020064     3.42   0.001     .0283254    .1090082
                     |
                marr |   .0653722   .0036342    17.99   0.000     .0580651    .0726793
               partt |  -.0762445   .0147448    -5.17   0.000     -.105891   -.0465981
              public |   -.052021   .0076158    -6.83   0.000    -.0673336   -.0367083
                cmsa |    .106501   .0108335     9.83   0.000     .0847189    .1282832
                     |
               nocc2 |
                  2  |  -.0433278   .0101972    -4.25   0.000    -.0638306    -.022825
                  3  |  -.0170144   .0114188    -1.49   0.143    -.0399734    .0059446
                  4  |  -.0683547   .0128464    -5.32   0.000    -.0941841   -.0425254
                  5  |    -.01118   .0162538    -0.69   0.495    -.0438605    .0215004
                  6  |  -.2416391    .008622   -28.03   0.000    -.2589749   -.2243034
                  7  |  -.1908517   .0109174   -17.48   0.000    -.2128026   -.1689009
                  8  |  -.0566977   .0357081    -1.59   0.119    -.1284937    .0150983
                  9  |  -.2180739   .0093195   -23.40   0.000     -.236812   -.1993359
                 10  |  -.1494196   .0062728   -23.82   0.000    -.1620319   -.1368073
                 11  |  -.0653505   .0076377    -8.56   0.000    -.0807072   -.0499938
                 12  |  -.1879379   .0063301   -29.69   0.000    -.2006654   -.1752104
                     |
               unemp |  -.0036003   .0023477    -1.53   0.132    -.0083206      .00112
                     |
             quarter |
                  2  |   .0022993   .0023385     0.98   0.330    -.0024026    .0070011
                  3  |    .009815   .0025293     3.88   0.000     .0047296    .0149005
                  4  |   .0116871    .002532     4.62   0.000     .0065961    .0167781
                     |
               _cons |   .4630353   .0760824     6.09   0.000     .3100614    .6160092
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all_unemp 

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl
>  marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,600,457,660)

Linear regression                               Number of obs     =    183,210
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3439
                                                Root MSE          =     .36187

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1275495   .0098826   -12.91   0.000    -.1474199   -.1076792
            treat_st |  -.0399717    .016745    -2.39   0.021    -.0736399   -.0063036
treat_sthisprelwhite |   .0049942   .0205355     0.24   0.809    -.0362952    .0462836
                     |
               state |
                 NH  |  -.2821131   .0105736   -26.68   0.000    -.3033727   -.2608535
                 VT  |  -.3759513   .0163713   -22.96   0.000    -.4088679   -.3430346
                 MA  |  -.2324099   .0176392   -13.18   0.000    -.2678759   -.1969439
                 RI  |   -.305161   .0256237   -11.91   0.000    -.3566809   -.2536411
                 CT  |  -.1078103    .021984    -4.90   0.000     -.152012   -.0636086
                 NY  |  -.1072392    .025412    -4.22   0.000    -.1583335   -.0561449
                 NJ  |  -.2292776   .0222775   -10.29   0.000    -.2740696   -.1844857
                 PA  |  -.2156701   .0204036   -10.57   0.000    -.2566942    -.174646
                 OH  |   .0367005   .0226036     1.62   0.111     -.008747    .0821481
                 IN  |  -.0657435   .0558671    -1.18   0.245    -.1780719    .0465849
                 IL  |  -.0198629   .0178899    -1.11   0.272     -.055833    .0161073
                 MI  |   .3685838   .0539212     6.84   0.000      .260168    .4769997
                 WI  |  -.3048683   .0456737    -6.67   0.000    -.3967013   -.2130352
                 MN  |  -.0954422   .0210768    -4.53   0.000      -.13782   -.0530643
                 IA  |    .095198    .016299     5.84   0.000     .0624267    .1279694
                 MO  |   .0044351   .0161255     0.28   0.784    -.0279873    .0368575
                 ND  |  -.6180321   .0349983   -17.66   0.000    -.6884009   -.5476633
                 SD  |  -.4159702   .0344367   -12.08   0.000    -.4852098   -.3467306
                 NE  |  -.3170797   .0173021   -18.33   0.000     -.351868   -.2822914
                 KS  |  -.0720742   .0209794    -3.44   0.001    -.1142562   -.0298923
                 DE  |   .1518582   .0219583     6.92   0.000     .1077081    .1960083
                 MD  |  -.2708684   .0258891   -10.46   0.000    -.3229221   -.2188148
                 DC  |  -.2560521    .033623    -7.62   0.000    -.3236556   -.1884486
                 VA  |   .0608719    .024683     2.47   0.017     .0112434    .1105005
                 NC  |   .1533291   .0213259     7.19   0.000     .1104506    .1962077
                 SC  |   .0723484   .0149619     4.84   0.000     .0422654    .1024315
                 GA  |   .1142305   .0213819     5.34   0.000     .0712393    .1572218
                 FL  |   .0382625   .0274571     1.39   0.170    -.0169437    .0934687
                 KY  |     .13141   .0332992     3.95   0.000     .0644576    .1983625
                 TN  |  -.1637697   .0186782    -8.77   0.000    -.2013247   -.1262147
                 AL  |  -.0302071   .0163444    -1.85   0.071    -.0630697    .0026556
                 MS  |  -.3295975   .0204895   -16.09   0.000    -.3707944   -.2884006
                 AR  |  -.1385141   .0178111    -7.78   0.000    -.1743256   -.1027026
                 LA  |  -.4579323   .0255699   -17.91   0.000    -.5093439   -.4065206
                 OK  |   -.554526   .0771023    -7.19   0.000    -.7095504   -.3995015
                 TX  |  -.0684024    .024768    -2.76   0.008    -.1182018    -.018603
                 ID  |   .0642027   .0201351     3.19   0.003     .0237184    .1046871
                 WY  |  -.9639398   .0276753   -34.83   0.000    -1.019585   -.9082948
                 CO  |   .0462039   .0203607     2.27   0.028      .005266    .0871419
                 NM  |  -.0345573    .039748    -0.87   0.389    -.1144759    .0453614
                 AZ  |  -.2026901   .0250642    -8.09   0.000    -.2530851    -.152295
                 UT  |  -.3652929   .0369597    -9.88   0.000    -.4396052   -.2909805
                 NV  |   -.316109   .0424763    -7.44   0.000    -.4015133   -.2307046
                 WA  |  -.0640583   .0162465    -3.94   0.000    -.0967241   -.0313925
                 OR  |  -.0059579   .0135779    -0.44   0.663    -.0332581    .0213422
                 CA  |    .137757   .0252974     5.45   0.000     .0868931    .1886208
                 AK  |    .644804   .0232448    27.74   0.000     .5980672    .6915408
                 HI  |  -.1151564   .0300126    -3.84   0.000    -.1755008   -.0548119
                     |
       state#c.lyear |
                 ME  |   .0003594   .0002395     1.50   0.140    -.0001221    .0008409
                 NH  |    .003385   .0003076    11.00   0.000     .0027664    .0040035
                 VT  |   .0038027   .0002301    16.53   0.000       .00334    .0042653
                 MA  |   .0035408   .0002005    17.66   0.000     .0031376     .003944
                 RI  |   .0036815   .0001638    22.47   0.000      .003352    .0040109
                 CT  |   .0027995   .0002273    12.32   0.000     .0023426    .0032565
                 NY  |     .00256     .00011    23.27   0.000     .0023388    .0027811
                 NJ  |   .0042897     .00025    17.16   0.000     .0037871    .0047923
                 PA  |   .0025139   .0001969    12.77   0.000      .002118    .0029098
                 OH  |   .0000326    .000231     0.14   0.888     -.000432    .0004971
                 IN  |   .0012714   .0005666     2.24   0.029     .0001321    .0024107
                 IL  |   .0014888   .0002073     7.18   0.000     .0010719    .0019057
                 MI  |  -.0024706   .0004959    -4.98   0.000    -.0034676   -.0014735
                 WI  |    .003635   .0003979     9.14   0.000     .0028351     .004435
                 MN  |   .0018834   .0001494    12.61   0.000     .0015831    .0021838
                 IA  |  -.0004334   .0001696    -2.56   0.014    -.0007744   -.0000924
                 MO  |   .0005769   .0001683     3.43   0.001     .0002385    .0009153
                 ND  |   .0066062   .0001172    56.34   0.000     .0063705    .0068419
                 SD  |   .0043369   .0002429    17.85   0.000     .0038485    .0048254
                 NE  |   .0031705   .0002343    13.53   0.000     .0026995    .0036415
                 KS  |   .0015064   .0001815     8.30   0.000     .0011413    .0018714
                 DE  |   -.000538   .0003034    -1.77   0.083     -.001148     .000072
                 MD  |   .0041427   .0002048    20.23   0.000     .0037308    .0045545
                 DC  |   .0047483   .0001251    37.96   0.000     .0044968    .0049998
                 VA  |   .0012883   .0002375     5.43   0.000     .0008108    .0017658
                 NC  |  -.0008812   .0002688    -3.28   0.002    -.0014217   -.0003407
                 SC  |  -.0003884   .0002793    -1.39   0.171    -.0009499    .0001732
                 GA  |  -.0000209   .0002391    -0.09   0.931    -.0005017    .0004599
                 FL  |   .0002328   .0001519     1.53   0.132    -.0000726    .0005381
                 KY  |  -.0011684   .0003309    -3.53   0.001    -.0018337   -.0005031
                 TN  |   .0019324   .0002406     8.03   0.000     .0014487    .0024161
                 AL  |   .0008565   .0002909     2.94   0.005     .0002716    .0014414
                 MS  |   .0036281   .0002451    14.80   0.000     .0031352     .004121
                 AR  |   .0015912   .0002376     6.70   0.000     .0011136    .0020688
                 LA  |   .0052899   .0001979    26.73   0.000      .004892    .0056878
                 OK  |    .005364   .0008027     6.68   0.000       .00375     .006978
                 TX  |    .001563   .0002338     6.69   0.000      .001093     .002033
                 ID  |   .0000165   .0002909     0.06   0.955    -.0005683    .0006013
                 WY  |    .011333   .0001603    70.71   0.000     .0110108    .0116553
                 CO  |   .0001435   .0001289     1.11   0.271    -.0001157    .0004027
                 NM  |    .000674   .0005221     1.29   0.203    -.0003758    .0017237
                 AZ  |   .0030457   .0001894    16.08   0.000      .002665    .0034265
                 UT  |   .0039546   .0000614    64.40   0.000     .0038312    .0040781
                 NV  |   .0047575    .000212    22.44   0.000     .0043313    .0051838
                 WA  |   .0020881   .0001511    13.82   0.000     .0017843     .002392
                 OR  |   .0007536   .0001948     3.87   0.000      .000362    .0011452
                 CA  |   .0007958    .000123     6.47   0.000     .0005485    .0010432
                 AK  |  -.0035775   .0001042   -34.32   0.000     -.003787   -.0033679
                 HI  |   .0024756   .0002083    11.88   0.000     .0020567    .0028944
                     |
                nind |
                  2  |   .1367395   .0476379     2.87   0.006     .0409572    .2325219
                  3  |  -.0004304   .0436749    -0.01   0.992    -.0882447    .0873839
                  4  |  -.1615996   .0530783    -3.04   0.004    -.2683206   -.0548786
                  5  |    .135745   .0416457     3.26   0.002     .0520106    .2194793
                  6  |   -.028738   .0495357    -0.58   0.565    -.1283361    .0708602
                  7  |  -.0261251   .0382598    -0.68   0.498    -.1030516    .0508013
                  8  |  -.1132139   .0437089    -2.59   0.013    -.2010966   -.0253313
                  9  |   -.081704   .0419179    -1.95   0.057    -.1659856    .0025776
                 10  |  -.1069989    .067302    -1.59   0.118    -.2423186    .0283208
                 11  |   .1502038   .0505948     2.97   0.005     .0484762    .2519314
                     |
                educ |   .0728675   .0038407    18.97   0.000     .0651454    .0805897
               exper |   .0746948   .0025676    29.09   0.000     .0695323    .0798573
              exper2 |  -.0026603   .0001823   -14.59   0.000    -.0030269   -.0022936
              exper3 |   .0000522   5.54e-06     9.43   0.000     .0000411    .0000634
              exper4 |  -4.11e-07   5.54e-08    -7.42   0.000    -5.22e-07   -3.00e-07
                edex |  -.0008484   .0000922    -9.20   0.000    -.0010338    -.000663
                     |
               ee_cl |
                  2  |   .0682831    .010632     6.42   0.000     .0469061    .0896601
                  3  |    .051552   .0130025     3.96   0.000     .0254087    .0776953
                  4  |   .0017859   .0214099     0.08   0.934    -.0412615    .0448334
                  5  |  -.0005323   .0170979    -0.03   0.975      -.03491    .0338453
                  6  |   .0356648   .0104583     3.41   0.001     .0146369    .0566927
                  7  |   .0473546   .0141291     3.35   0.002     .0189463     .075763
                  8  |   .0009846   .0194779     0.05   0.960    -.0381784    .0401475
                  9  |  -.0072318   .0160609    -0.45   0.655    -.0395245    .0250608
                 10  |   .0178955   .0145021     1.23   0.223    -.0112629    .0470538
                 11  |    .033271   .0159526     2.09   0.042     .0011962    .0653457
                 12  |   .0486075   .0205229     2.37   0.022     .0073435    .0898714
                 13  |   .0077135   .0176121     0.44   0.663     -.027698     .043125
                 14  |   .0119689   .0151034     0.79   0.432    -.0183984    .0423362
                 15  |    .028531   .0170769     1.67   0.101    -.0058045    .0628665
                 16  |   .0700692   .0201153     3.48   0.001     .0296247    .1105137
                     |
                marr |   .0654404   .0035896    18.23   0.000      .058223    .0726578
               partt |  -.0761107   .0146298    -5.20   0.000    -.1055259   -.0466955
              public |  -.0524597   .0075842    -6.92   0.000    -.0677088   -.0372107
                cmsa |   .1060681   .0108778     9.75   0.000     .0841969    .1279393
                     |
               nocc2 |
                  2  |  -.0433566   .0102491    -4.23   0.000    -.0639638   -.0227493
                  3  |  -.0173189   .0113736    -1.52   0.134     -.040187    .0055493
                  4  |  -.0688456   .0131046    -5.25   0.000    -.0951942   -.0424971
                  5  |  -.0111051   .0163765    -0.68   0.501    -.0440324    .0218221
                  6  |  -.2414503   .0084856   -28.45   0.000    -.2585118   -.2243888
                  7  |  -.1915644   .0109854   -17.44   0.000     -.213652   -.1694768
                  8  |  -.0554077   .0360628    -1.54   0.131    -.1279169    .0171015
                  9  |  -.2184819   .0092667   -23.58   0.000    -.2371138   -.1998499
                 10  |  -.1498131   .0062359   -24.02   0.000    -.1623512    -.137275
                 11  |  -.0661338   .0076309    -8.67   0.000    -.0814769   -.0507908
                 12  |  -.1885243   .0062662   -30.09   0.000    -.2011232   -.1759253
                     |
               unemp |  -.0039829   .0012555    -3.17   0.003    -.0065072   -.0014586
                     |
             quarter |
                  2  |    .002118   .0023079     0.92   0.363    -.0025223    .0067583
                  3  |    .009406   .0025913     3.63   0.001     .0041959    .0146161
                  4  |   .0112052   .0024139     4.64   0.000     .0063517    .0160586
                     |
               _cons |   .4347944   .0745358     5.83   0.000     .2849302    .5846586
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_mal_all_sltt 

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,196,588,725)

Linear regression                               Number of obs     =    142,046
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4367
                                                Root MSE          =     .36506

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0887306   .0110697    -8.02   0.000    -.1109877   -.0664735
            treat_st |  -.0712938   .0154681    -4.61   0.000    -.1023946   -.0401931
treat_sthisprelwhite |   .0550043   .0206736     2.66   0.011     .0134373    .0965714
                     |
               state |
                 NH  |    .049857   .0039986    12.47   0.000     .0418174    .0578966
                 VT  |   -.005913   .0019383    -3.05   0.004    -.0098101   -.0020158
                 MA  |   .1324637   .0087532    15.13   0.000     .1148643    .1500632
                 RI  |   .1380661    .009434    14.63   0.000     .1190977    .1570345
                 CT  |   .1726926   .0092142    18.74   0.000     .1541663     .191219
                 NY  |   .1247262   .0085038    14.67   0.000     .1076281    .1418242
                 NJ  |   .2091358   .0096758    21.61   0.000     .1896814    .2285902
                 PA  |   .0368452   .0073053     5.04   0.000      .022157    .0515334
                 OH  |   .0143231   .0074744     1.92   0.061    -.0007052    .0293515
                 IN  |     .01527   .0074839     2.04   0.047     .0002226    .0303174
                 IL  |    .038236   .0080587     4.74   0.000      .022033    .0544391
                 MI  |   .0917139    .008004    11.46   0.000     .0756208     .107807
                 WI  |   .0479126   .0063577     7.54   0.000     .0351295    .0606956
                 MN  |   .0865358   .0068466    12.64   0.000     .0727697    .1003019
                 IA  |   .0611974   .0154509     3.96   0.000     .0301313    .0922635
                 MO  |  -.0510207   .0075792    -6.73   0.000    -.0662598   -.0357816
                 ND  |   .0204238   .0155255     1.32   0.195    -.0107923      .05164
                 SD  |  -.0263113   .0147589    -1.78   0.081    -.0559861    .0033635
                 NE  |    -.01151   .0142888    -0.81   0.424    -.0402395    .0172195
                 KS  |   .0231506   .0143501     1.61   0.113    -.0057022    .0520035
                 DE  |   .1684239   .0024481    68.80   0.000     .1635017    .1733461
                 MD  |   .1711633   .0095587    17.91   0.000     .1519442    .1903824
                 DC  |   .2225762   .0116851    19.05   0.000     .1990818    .2460706
                 VA  |   .1790224   .0150882    11.87   0.000     .1486856    .2093593
                 NC  |   .0717319   .0147199     4.87   0.000     .0421355    .1013284
                 SC  |   -.002708    .014859    -0.18   0.856     -.032584    .0271681
                 GA  |   .0683043   .0148759     4.59   0.000     .0383942    .0982143
                 FL  |   .0508153   .0148894     3.41   0.001     .0208782    .0807525
                 KY  |  -.0379676   .0059745    -6.35   0.000    -.0499801    -.025955
                 TN  |   .0232303   .0150201     1.55   0.129    -.0069696    .0534301
                 AL  |  -.0241013   .0145211    -1.66   0.103    -.0532979    .0050953
                 MS  |    -.01796   .0151626    -1.18   0.242    -.0484465    .0125265
                 AR  |  -.0277553   .0152767    -1.82   0.075    -.0584711    .0029605
                 LA  |   .0073097    .014761     0.50   0.623    -.0223692    .0369887
                 OK  |  -.0935249   .0081684   -11.45   0.000    -.1099485   -.0771012
                 TX  |   .0507272   .0148983     3.40   0.001     .0207721    .0806822
                 ID  |   .0120626   .0147963     0.82   0.419    -.0176873    .0418126
                 WY  |   .1079726   .0158411     6.82   0.000      .076122    .1398232
                 CO  |    .024119   .0088614     2.72   0.009     .0063019    .0419361
                 NM  |  -.0346868   .0065178    -5.32   0.000    -.0477918   -.0215819
                 AZ  |   .0805684   .0160032     5.03   0.000     .0483918     .112745
                 UT  |   .0169139   .0157673     1.07   0.289    -.0147884    .0486162
                 NV  |   .1732901   .0182914     9.47   0.000     .1365127    .2100674
                 WA  |   .0863417   .0083663    10.32   0.000     .0695201    .1031633
                 OR  |   .0190315    .007066     2.69   0.010     .0048242    .0332387
                 CA  |   .2008387   .0099363    20.21   0.000     .1808604     .220817
                 AK  |   .2245982    .004457    50.39   0.000     .2156367    .2335596
                 HI  |   .0880862   .0073075    12.05   0.000     .0733935     .102779
                     |
                year |
               1990  |  -.0047999    .003885    -1.24   0.223    -.0126112    .0030114
               1991  |  -.0119137   .0078708    -1.51   0.137     -.027739    .0039115
               1992  |    .002502   .0077607     0.32   0.749     -.013102     .018106
               1993  |   .0099061    .006952     1.42   0.161    -.0040719    .0238841
               1996  |   .0175811   .0067432     2.61   0.012     .0040229    .0311392
               1997  |   .0127259   .0065353     1.95   0.057    -.0004143     .025866
               1998  |   .0252748   .0049983     5.06   0.000     .0152251    .0353245
               1999  |   .0340837   .0065128     5.23   0.000     .0209888    .0471787
               2000  |   .0296926   .0067032     4.43   0.000      .016215    .0431702
               2001  |   .0401247   .0078636     5.10   0.000     .0243139    .0559355
               2002  |   .0557809   .0075027     7.43   0.000     .0406958     .070866
               2003  |   .0455313   .0069337     6.57   0.000     .0315902    .0594725
               2004  |   .0427082   .0074496     5.73   0.000     .0277298    .0576866
               2005  |   .0288802   .0051965     5.56   0.000     .0184319    .0393285
               2006  |   .0343581   .0076437     4.49   0.000     .0189895    .0497268
               2007  |    .032428   .0083152     3.90   0.000     .0157092    .0491467
               2008  |   .0302968   .0087828     3.45   0.001     .0126378    .0479559
               2009  |   .0501046   .0069227     7.24   0.000     .0361856    .0640235
               2010  |   .0512761    .008241     6.22   0.000     .0347065    .0678457
               2011  |   .0271386   .0075679     3.59   0.001     .0119222    .0423549
               2012  |   .0112142   .0090933     1.23   0.223     -.007069    .0294974
               2013  |   .0121104   .0072805     1.66   0.103     -.002528    .0267487
               2014  |  -.0057858    .013598    -0.43   0.672    -.0331263    .0215548
               2015  |   .0207652   .0106601     1.95   0.057    -.0006684    .0421988
               2016  |   .0302296   .0070059     4.31   0.000     .0161432     .044316
               2017  |   .0174676   .0109079     1.60   0.116    -.0044642    .0393994
               2018  |   .0190724   .0102485     1.86   0.069    -.0015335    .0396784
               2019  |   .0187148   .0083572     2.24   0.030     .0019115    .0355181
                     |
                nind |
                  2  |   .1237548    .068027     1.82   0.075    -.0130226    .2605323
                  3  |   .0786384   .0553465     1.42   0.162    -.0326433      .18992
                  4  |  -.1655575   .0650835    -2.54   0.014    -.2964167   -.0346983
                  5  |   .2114641   .0546425     3.87   0.000      .101598    .3213302
                  6  |   .0245524   .0569588     0.43   0.668     -.089971    .1390758
                  7  |   -.031427   .0536912    -0.59   0.561    -.1393804    .0765264
                  8  |   -.067033   .0656539    -1.02   0.312    -.1990389     .064973
                  9  |  -.1209132   .0642044    -1.88   0.066    -.2500048    .0081785
                 10  |  -.0914828   .0583849    -1.57   0.124    -.2088736     .025908
                 11  |     .06998   .0626595     1.12   0.270    -.0560053    .1959653
                     |
                educ |   .1091645   .0068521    15.93   0.000     .0953874    .1229415
               exper |   .0590376   .0042789    13.80   0.000     .0504343    .0676408
              exper2 |  -.0020007   .0002092    -9.56   0.000    -.0024213   -.0015801
              exper3 |     .00004   7.10e-06     5.63   0.000     .0000257    .0000543
              exper4 |  -3.10e-07   7.97e-08    -3.89   0.000    -4.70e-07   -1.50e-07
                edex |  -.0009139   .0001718    -5.32   0.000    -.0012594   -.0005684
                     |
               ee_cl |
                  2  |  -.0591274   .0207867    -2.84   0.007    -.1009218   -.0173329
                  3  |  -.1160318   .0241357    -4.81   0.000      -.16456   -.0675037
                  4  |  -.1802781   .0465264    -3.87   0.000    -.2738256   -.0867306
                  5  |  -.0273739   .0196242    -1.39   0.169    -.0668311    .0120833
                  6  |   -.097893   .0208895    -4.69   0.000    -.1398941   -.0558919
                  7  |  -.1421251   .0237633    -5.98   0.000    -.1899043   -.0943458
                  8  |  -.1623661   .0466436    -3.48   0.001    -.2561492   -.0685829
                  9  |  -.0400719   .0197757    -2.03   0.048    -.0798335   -.0003102
                 10  |  -.1284666    .025526    -5.03   0.000    -.1797901   -.0771431
                 11  |  -.1589723   .0297716    -5.34   0.000    -.2188321   -.0991124
                 12  |  -.1342179   .0434079    -3.09   0.003    -.2214954   -.0469405
                 13  |  -.0436026   .0315325    -1.38   0.173    -.1070029    .0197977
                 14  |  -.1377233   .0270911    -5.08   0.000    -.1921937   -.0832529
                 15  |  -.1396318   .0311831    -4.48   0.000    -.2023297    -.076934
                 16  |  -.0899234   .0451796    -1.99   0.052    -.1807631    .0009162
                     |
                marr |   .0058512   .0025127     2.33   0.024      .000799    .0109035
               partt |  -.0694843   .0077688    -8.94   0.000    -.0851045   -.0538641
              public |   .0167934    .013623     1.23   0.224    -.0105976    .0441843
                cmsa |   .1143726   .0094323    12.13   0.000     .0954077    .1333374
                     |
               nocc2 |
                  2  |  -.0444929   .0142907    -3.11   0.003    -.0732263   -.0157595
                  3  |  -.0188719   .0127849    -1.48   0.146    -.0445777     .006834
                  4  |  -.1087696   .0108595   -10.02   0.000    -.1306041   -.0869352
                  5  |   .1439089    .014585     9.87   0.000     .1145838     .173234
                  6  |  -.2398416    .009727   -24.66   0.000    -.2593991    -.220284
                  7  |  -.2446788   .0253451    -9.65   0.000    -.2956386    -.193719
                  8  |  -.0849312    .041864    -2.03   0.048    -.1691045   -.0007579
                  9  |  -.2930562   .0193471   -15.15   0.000    -.3319562   -.2541563
                 10  |  -.2718448   .0229651   -11.84   0.000    -.3180193   -.2256704
                 11  |    .009824   .0279804     0.35   0.727    -.0464345    .0660824
                 12  |   -.240105    .015252   -15.74   0.000    -.2707712   -.2094389
                     |
             quarter |
                  2  |   .0006747   .0029635     0.23   0.821    -.0052837    .0066331
                  3  |   .0155182   .0035818     4.33   0.000     .0083164      .02272
                  4  |   .0161251   .0029571     5.45   0.000     .0101794    .0220707
                     |
               _cons |   .0645306   .0760875     0.85   0.401    -.0884536    .2175148
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr par
> tt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,196,588,725)

Linear regression                               Number of obs     =    142,046
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4367
                                                Root MSE          =     .36506

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0887233   .0110686    -8.02   0.000    -.1109781   -.0664684
            treat_st |  -.0715956   .0157906    -4.53   0.000    -.1033447   -.0398465
treat_sthisprelwhite |    .054985   .0207081     2.66   0.011     .0133485    .0966215
                     |
               state |
                 NH  |   .0485806   .0049916     9.73   0.000     .0385443    .0586168
                 VT  |   -.007104   .0030323    -2.34   0.023    -.0132009   -.0010071
                 MA  |   .1324879   .0087424    15.15   0.000       .11491    .1500657
                 RI  |   .1391942   .0092435    15.06   0.000     .1206089    .1577795
                 CT  |   .1728638   .0091188    18.96   0.000     .1545293    .1911983
                 NY  |   .1254826   .0083326    15.06   0.000     .1087287    .1422365
                 NJ  |   .2097024   .0094606    22.17   0.000     .1906807    .2287241
                 PA  |    .037234   .0072292     5.15   0.000     .0226988    .0517692
                 OH  |   .0149848   .0073837     2.03   0.048     .0001388    .0298308
                 IN  |   .0153145   .0074903     2.04   0.046     .0002543    .0303747
                 IL  |   .0393154   .0079014     4.98   0.000     .0234286    .0552023
                 MI  |   .0933735   .0083209    11.22   0.000     .0766433    .1101037
                 WI  |   .0474474   .0063882     7.43   0.000     .0346031    .0602916
                 MN  |   .0856418    .007039    12.17   0.000      .071489    .0997946
                 IA  |   .0601821   .0151652     3.97   0.000     .0296905    .0906737
                 MO  |  -.0508077   .0075354    -6.74   0.000    -.0659587   -.0356567
                 ND  |   .0187709   .0150578     1.25   0.219    -.0115048    .0490467
                 SD  |  -.0278509   .0144448    -1.93   0.060    -.0568942    .0011923
                 NE  |  -.0133951   .0140637    -0.95   0.346    -.0416721    .0148819
                 KS  |   .0226971   .0143982     1.58   0.122    -.0062524    .0516466
                 DE  |   .1677019   .0028324    59.21   0.000      .162007    .1733968
                 MD  |   .1708564   .0097537    17.52   0.000     .1512452    .1904675
                 DC  |    .224448   .0110823    20.25   0.000     .2021656    .2467304
                 VA  |   .1783724   .0151772    11.75   0.000     .1478565    .2088882
                 NC  |   .0722303   .0150768     4.79   0.000     .0419165    .1025442
                 SC  |  -.0014434   .0154373    -0.09   0.926    -.0324822    .0295955
                 GA  |   .0690838   .0152858     4.52   0.000     .0383496    .0998181
                 FL  |   .0516295   .0152175     3.39   0.001     .0210326    .0822264
                 KY  |  -.0370848     .00598    -6.20   0.000    -.0491084   -.0250612
                 TN  |   .0239186   .0154722     1.55   0.129    -.0071903    .0550274
                 AL  |  -.0229787   .0151251    -1.52   0.135    -.0533898    .0074324
                 MS  |  -.0160683   .0163607    -0.98   0.331    -.0489636    .0168271
                 AR  |  -.0268034   .0159299    -1.68   0.099    -.0588326    .0052259
                 LA  |   .0087358    .015423     0.57   0.574    -.0222743    .0397459
                 OK  |  -.0939121   .0082392   -11.40   0.000    -.1104782    -.077346
                 TX  |    .051412    .015226     3.38   0.001      .020798     .082026
                 ID  |   .0124314    .015131     0.82   0.415    -.0179916    .0428544
                 WY  |   .1074985   .0158209     6.79   0.000     .0756884    .1393086
                 CO  |   .0236923   .0090567     2.62   0.012     .0054827     .041902
                 NM  |  -.0340039   .0062793    -5.42   0.000    -.0466293   -.0213785
                 AZ  |   .0814433    .016346     4.98   0.000     .0485776    .1143091
                 UT  |   .0162261   .0158675     1.02   0.312    -.0156776    .0481298
                 NV  |   .1744954   .0186608     9.35   0.000     .1369753    .2120154
                 WA  |   .0872495   .0083129    10.50   0.000     .0705352    .1039637
                 OR  |   .0202824   .0069791     2.91   0.006       .00625    .0343149
                 CA  |   .2025143   .0097629    20.74   0.000     .1828848    .2221439
                 AK  |   .2267096    .004999    45.35   0.000     .2166586    .2367607
                 HI  |   .0868493   .0077334    11.23   0.000     .0713003    .1023983
                     |
                year |
               1990  |  -.0043763   .0043203    -1.01   0.316    -.0130628    .0043101
               1991  |  -.0101186    .008938    -1.13   0.263    -.0280896    .0078525
               1992  |   .0050311   .0106739     0.47   0.640    -.0164302    .0264924
               1993  |   .0118926    .009197     1.29   0.202    -.0065992    .0303844
               1996  |   .0179054   .0072273     2.48   0.017      .003374    .0324369
               1997  |   .0125896   .0064839     1.94   0.058     -.000447    .0256263
               1998  |   .0246722   .0049435     4.99   0.000     .0147327    .0346118
               1999  |    .033174   .0069256     4.79   0.000     .0192491     .047099
               2000  |    .028578   .0072472     3.94   0.000     .0140066    .0431495
               2001  |   .0396931   .0077706     5.11   0.000     .0240693     .055317
               2002  |    .056479   .0072574     7.78   0.000     .0418871     .071071
               2003  |   .0464913    .006417     7.25   0.000      .033589    .0593935
               2004  |   .0431879   .0076934     5.61   0.000     .0277193    .0586564
               2005  |   .0288363   .0052297     5.51   0.000     .0183213    .0393512
               2006  |   .0338992   .0079818     4.25   0.000     .0178506    .0499478
               2007  |   .0320011   .0085034     3.76   0.000     .0149039    .0490982
               2008  |   .0310791   .0093517     3.32   0.002     .0122762     .049882
               2009  |   .0543672   .0116327     4.67   0.000     .0309781    .0777562
               2010  |   .0559226    .012918     4.33   0.000     .0299493     .081896
               2011  |   .0310871   .0107788     2.88   0.006     .0094149    .0527593
               2012  |   .0143772   .0110213     1.30   0.198    -.0077825     .036537
               2013  |   .0145705   .0090273     1.61   0.113    -.0035802    .0327211
               2014  |  -.0046508   .0144524    -0.32   0.749    -.0337093    .0244076
               2015  |   .0209359   .0108418     1.93   0.059     -.000863    .0427347
               2016  |   .0299451   .0070829     4.23   0.000     .0157039    .0441862
               2017  |   .0166985   .0111935     1.49   0.142    -.0058076    .0392046
               2018  |    .017864   .0100841     1.77   0.083    -.0024114    .0381394
               2019  |   .0172592   .0085368     2.02   0.049     .0000949    .0344236
                     |
                nind |
                  2  |   .1236343   .0680668     1.82   0.076    -.0132233    .2604919
                  3  |   .0785606   .0554112     1.42   0.163     -.032851    .1899722
                  4  |   -.165608   .0651291    -2.54   0.014    -.2965589   -.0346571
                  5  |   .2114044   .0547146     3.86   0.000     .1013933    .3214154
                  6  |   .0244445   .0570136     0.43   0.670     -.090189    .1390779
                  7  |  -.0315042   .0537449    -0.59   0.561    -.1395655    .0765571
                  8  |  -.0671077   .0657255    -1.02   0.312    -.1992577    .0650424
                  9  |  -.1210024   .0642661    -1.88   0.066    -.2502181    .0082133
                 10  |  -.0915682   .0584408    -1.57   0.124    -.2090712    .0259349
                 11  |   .0698738    .062725     1.11   0.271    -.0562432    .1959908
                     |
                educ |   .1091644   .0068544    15.93   0.000     .0953828     .122946
               exper |   .0590454   .0042805    13.79   0.000     .0504388     .067652
              exper2 |  -.0020014   .0002092    -9.57   0.000    -.0024221   -.0015808
              exper3 |     .00004   7.10e-06     5.63   0.000     .0000257    .0000543
              exper4 |  -3.10e-07   7.97e-08    -3.89   0.000    -4.71e-07   -1.50e-07
                edex |  -.0009139   .0001718    -5.32   0.000    -.0012594   -.0005684
                     |
               ee_cl |
                  2  |  -.0591244   .0207842    -2.84   0.007    -.1009139   -.0173349
                  3  |  -.1160257   .0241283    -4.81   0.000     -.164539   -.0675125
                  4  |   -.180278   .0465199    -3.88   0.000    -.2738125   -.0867435
                  5  |   -.027375   .0196158    -1.40   0.169    -.0668152    .0120651
                  6  |  -.0978694   .0208792    -4.69   0.000    -.1398497    -.055889
                  7  |  -.1421042   .0237394    -5.99   0.000    -.1898355   -.0943728
                  8  |   -.162351   .0466212    -3.48   0.001    -.2560893   -.0686127
                  9  |   -.040046   .0197649    -2.03   0.048    -.0797861    -.000306
                 10  |   -.128472   .0255228    -5.03   0.000     -.179789    -.077155
                 11  |   -.158974   .0297717    -5.34   0.000    -.2188341   -.0991139
                 12  |  -.1342255   .0433979    -3.09   0.003    -.2214828   -.0469681
                 13  |  -.0436218   .0315204    -1.38   0.173    -.1069979    .0197543
                 14  |  -.1377235   .0270815    -5.09   0.000    -.1921746   -.0832724
                 15  |  -.1396472   .0311884    -4.48   0.000    -.2023557   -.0769388
                 16  |  -.0899452    .045183    -1.99   0.052    -.1807917    .0009012
                     |
                marr |   .0058506   .0025117     2.33   0.024     .0008005    .0109007
               partt |  -.0694584   .0077615    -8.95   0.000     -.085064   -.0538528
              public |   .0168325   .0136332     1.23   0.223    -.0105789    .0442438
                cmsa |   .1143625   .0094237    12.14   0.000     .0954149      .13331
                     |
               nocc2 |
                  2  |  -.0444699   .0142968    -3.11   0.003    -.0732156   -.0157243
                  3  |  -.0188356   .0127867    -1.47   0.147    -.0445451    .0068739
                  4  |  -.1087551   .0108548   -10.02   0.000      -.13058   -.0869301
                  5  |    .143929   .0145714     9.88   0.000     .1146312    .1732267
                  6  |  -.2398295   .0097255   -24.66   0.000    -.2593839   -.2202751
                  7  |  -.2446941   .0253647    -9.65   0.000    -.2956931    -.193695
                  8  |  -.0849296   .0418586    -2.03   0.048     -.169092   -.0007673
                  9  |  -.2930447   .0193374   -15.15   0.000    -.3319251   -.2541642
                 10  |  -.2718601   .0229782   -11.83   0.000    -.3180608   -.2256593
                 11  |   .0098711   .0279791     0.35   0.726    -.0463846    .0661268
                 12  |  -.2401156   .0152546   -15.74   0.000    -.2707871   -.2094442
                     |
               unemp |    -.00102   .0016334    -0.62   0.535    -.0043042    .0022641
                     |
             quarter |
                  2  |   .0006961   .0029741     0.23   0.816    -.0052837    .0066759
                  3  |    .015522   .0035863     4.33   0.000     .0083113    .0227328
                  4  |   .0161484   .0029714     5.43   0.000      .010174    .0221227
                     |
               _cons |   .0692057   .0725764     0.95   0.345    -.0767188    .2151302
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all_unemp 

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_cl
>  marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,196,588,725)

Linear regression                               Number of obs     =    142,046
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4365
                                                Root MSE          =     .36513

                                         (Std. Err. adjusted for 49 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0886734   .0108731    -8.16   0.000    -.1105353   -.0668115
            treat_st |  -.0573474   .0219131    -2.62   0.012    -.1014067    -.013288
treat_sthisprelwhite |   .0556675    .020955     2.66   0.011     .0135347    .0978003
                     |
               state |
                 NH  |   -.109271   .0140352    -7.79   0.000    -.1374906   -.0810514
                 VT  |  -.2600219   .0184169   -14.12   0.000    -.2970516   -.2229922
                 MA  |   -.253502   .0147529   -17.18   0.000    -.2831648   -.2238393
                 RI  |  -.3846932   .0198474   -19.38   0.000     -.424599   -.3447874
                 CT  |    .033441   .0181834     1.84   0.072    -.0031192    .0700012
                 NY  |  -.1038609   .0159959    -6.49   0.000    -.1360229   -.0716989
                 NJ  |  -.3335413   .0221946   -15.03   0.000    -.3781666    -.288916
                 PA  |   -.227287   .0171319   -13.27   0.000    -.2617329   -.1928411
                 OH  |  -.0578359   .0149323    -3.87   0.000    -.0878594   -.0278125
                 IN  |   -.089488   .0792482    -1.13   0.264    -.2488272    .0698513
                 IL  |  -.0745358   .0173633    -4.29   0.000     -.109447   -.0396246
                 MI  |    .209091   .0631916     3.31   0.002     .0820358    .3361462
                 WI  |  -.1526379   .0442422    -3.45   0.001    -.2415929    -.063683
                 MN  |   .0257382   .0144344     1.78   0.081    -.0032842    .0547606
                 IA  |  -.0053486   .0224145    -0.24   0.812     -.050416    .0397187
                 MO  |   .0689841   .0240922     2.86   0.006     .0205434    .1174248
                 ND  |  -.7808127   .0289157   -27.00   0.000    -.8389517   -.7226737
                 SD  |  -.3788908   .0246162   -15.39   0.000    -.4283849   -.3293967
                 NE  |  -.2905127   .0260094   -11.17   0.000    -.3428081   -.2382173
                 KS  |   .1650717   .0295328     5.59   0.000     .1056921    .2244513
                 DE  |    .380807   .0138037    27.59   0.000     .3530527    .4085612
                 MD  |  -.1526376   .0210772    -7.24   0.000    -.1950162   -.1102589
                 DC  |  -.2614826   .0239899   -10.90   0.000    -.3097176   -.2132477
                 VA  |  -.4153193   .0270438   -15.36   0.000    -.4696944   -.3609441
                 NC  |   .0215927   .0233898     0.92   0.361    -.0254356    .0686209
                 SC  |   .1931296   .0260674     7.41   0.000     .1407176    .2455416
                 GA  |   .0639377   .0277494     2.30   0.026     .0081437    .1197317
                 FL  |   .1543368   .0304119     5.07   0.000     .0931896     .215484
                 KY  |  -.0275863   .0378696    -0.73   0.470    -.1037283    .0485557
                 TN  |   .1945401   .0303217     6.42   0.000     .1335742    .2555059
                 AL  |   .1436133   .0299455     4.80   0.000     .0834039    .2038226
                 MS  |  -.1796432   .0248114    -7.24   0.000    -.2295298   -.1297567
                 AR  |  -.2155068   .0238114    -9.05   0.000    -.2633828   -.1676308
                 LA  |  -.0418489   .0318728    -1.31   0.195    -.1059335    .0222357
                 OK  |   .1459767   .1045487     1.40   0.169    -.0642326     .356186
                 TX  |  -.2035725   .0293723    -6.93   0.000    -.2626295   -.1445155
                 ID  |   .2108895   .0262214     8.04   0.000     .1581678    .2636112
                 WY  |  -.5556843   .0289893   -19.17   0.000    -.6139711   -.4973974
                 CO  |   .2470018   .0173085    14.27   0.000     .2122006     .281803
                 NM  |  -.0383216   .0214788    -1.78   0.081    -.0815075    .0048644
                 AZ  |   .4551489   .0312237    14.58   0.000     .3923695    .5179283
                 UT  |  -.2533725   .0316791    -8.00   0.000    -.3170676   -.1896775
                 NV  |   .0015818   .0338542     0.05   0.963    -.0664867    .0696503
                 WA  |  -.0080442   .0162946    -0.49   0.624    -.0408068    .0247183
                 OR  |  -.2344349   .0181179   -12.94   0.000    -.2708634   -.1980064
                 CA  |   .0555488    .023326     2.38   0.021     .0086488    .1024488
                 AK  |   .3131047    .029342    10.67   0.000     .2541087    .3721007
                 HI  |  -.2170724   .0229215    -9.47   0.000    -.2631592   -.1709856
                     |
       state#c.lyear |
                 ME  |  -.0006221   .0002314    -2.69   0.010    -.0010875   -.0001567
                 NH  |   .0009051   .0003269     2.77   0.008     .0002477    .0015624
                 VT  |   .0018261   .0001282    14.25   0.000     .0015684    .0020839
                 MA  |   .0030779    .000163    18.88   0.000     .0027501    .0034057
                 RI  |      .0044   .0001813    24.27   0.000     .0040355    .0047646
                 CT  |   .0007153   .0002707     2.64   0.011     .0001709    .0012596
                 NY  |   .0015841   .0001375    11.52   0.000     .0013077    .0018605
                 NJ  |   .0046047   .0003168    14.53   0.000     .0039677    .0052417
                 PA  |   .0019374   .0002407     8.05   0.000     .0014534    .0024214
                 OH  |    .000073   .0002053     0.36   0.724    -.0003399    .0004859
                 IN  |   .0003673    .000893     0.41   0.683    -.0014282    .0021628
                 IL  |   .0004621      .0003     1.54   0.130    -.0001411    .0010652
                 MI  |  -.0018057   .0006492    -2.78   0.008    -.0031111   -.0005003
                 WI  |   .0013211    .000504     2.62   0.012     .0003077    .0023346
                 MN  |  -.0000344   .0002185    -0.16   0.875    -.0004739     .000405
                 IA  |  -.0001054   .0001692    -0.62   0.536    -.0004456    .0002349
                 MO  |  -.0017835   .0003542    -5.04   0.000    -.0024958   -.0010713
                 ND  |   .0070348    .000155    45.39   0.000     .0067231    .0073464
                 SD  |   .0027018   .0001159    23.32   0.000     .0024688    .0029348
                 NE  |   .0019525   .0002973     6.57   0.000     .0013548    .0025502
                 KS  |  -.0021261   .0001675   -12.70   0.000    -.0024628   -.0017894
                 DE  |  -.0028547   .0002283   -12.51   0.000    -.0033136   -.0023958
                 MD  |   .0024995   .0002457    10.17   0.000     .0020054    .0029935
                 DC  |    .003978   .0001829    21.75   0.000     .0036103    .0043456
                 VA  |   .0050228   .0002341    21.45   0.000     .0045521    .0054935
                 NC  |  -.0002979   .0002336    -1.28   0.208    -.0007677    .0001718
                 SC  |  -.0026414   .0001905   -13.87   0.000    -.0030244   -.0022584
                 GA  |  -.0007123   .0002758    -2.58   0.013    -.0012668   -.0001578
                 FL  |   -.001747   .0001498   -11.66   0.000    -.0020481   -.0014458
                 KY  |  -.0007387   .0004407    -1.68   0.100    -.0016247    .0001473
                 TN  |  -.0024564    .000444    -5.53   0.000    -.0033491   -.0015636
                 AL  |  -.0023898   .0004266    -5.60   0.000    -.0032476   -.0015321
                 MS  |   .0008256   .0002664     3.10   0.003       .00029    .0013612
                 AR  |   .0010586   .0003118     3.40   0.001     .0004317    .0016855
                 LA  |  -.0002787   .0001685    -1.65   0.105    -.0006175    .0000602
                 OK  |  -.0030563   .0011405    -2.68   0.010    -.0053493   -.0007632
                 TX  |   .0016827   .0002619     6.43   0.000     .0011561    .0022093
                 ID  |  -.0026813   .0003358    -7.99   0.000    -.0033564   -.0020062
                 WY  |   .0055926   .0002214    25.26   0.000     .0051475    .0060376
                 CO  |  -.0027183   .0001316   -20.65   0.000     -.002983   -.0024537
                 NM  |  -.0005292   .0001468    -3.60   0.001    -.0008243    -.000234
                 AZ  |  -.0043536   .0001508   -28.87   0.000    -.0046569   -.0040504
                 UT  |    .001879   .0001402    13.40   0.000     .0015971    .0021609
                 NV  |   .0008989   .0002107     4.27   0.000     .0004752    .0013226
                 WA  |    .000284     .00012     2.37   0.022     .0000427    .0005253
                 OR  |    .001816   .0001241    14.63   0.000     .0015664    .0020655
                 CA  |     .00077   .0001033     7.45   0.000     .0005623    .0009778
                 AK  |  -.0014979   .0001025   -14.61   0.000     -.001704   -.0012917
                 HI  |   .0023339   .0002131    10.95   0.000     .0019054    .0027623
                     |
                nind |
                  2  |   .1263586   .0678404     1.86   0.069    -.0100437    .2627609
                  3  |   .0768828   .0545929     1.41   0.165    -.0328836    .1866491
                  4  |  -.1646969   .0647483    -2.54   0.014     -.294882   -.0345118
                  5  |     .21084    .054489     3.87   0.000     .1012825    .3203975
                  6  |   .0256658   .0559398     0.46   0.648    -.0868087    .1381402
                  7  |  -.0313193   .0532994    -0.59   0.560    -.1384849    .0758463
                  8  |  -.0663009   .0653955    -1.01   0.316    -.1977874    .0651855
                  9  |  -.1195015   .0638716    -1.87   0.067    -.2479239     .008921
                 10  |  -.0900481   .0580395    -1.55   0.127    -.2067442    .0266481
                 11  |    .070546   .0624954     1.13   0.265    -.0551095    .1962015
                     |
                educ |   .1081652    .006825    15.85   0.000     .0944425    .1218878
               exper |   .0582783   .0042516    13.71   0.000     .0497298    .0668267
              exper2 |  -.0019351   .0002155    -8.98   0.000    -.0023684   -.0015018
              exper3 |   .0000383   7.26e-06     5.28   0.000     .0000237    .0000529
              exper4 |  -2.98e-07   8.10e-08    -3.67   0.001    -4.61e-07   -1.35e-07
                edex |  -.0009153   .0001658    -5.52   0.000    -.0012486    -.000582
                     |
               ee_cl |
                  2  |   -.060199   .0212131    -2.84   0.007    -.1028508   -.0175471
                  3  |  -.1144044   .0242601    -4.72   0.000    -.1631827   -.0656261
                  4  |  -.1753431   .0464594    -3.77   0.000    -.2687559   -.0819303
                  5  |  -.0307357   .0190897    -1.61   0.114    -.0691182    .0076468
                  6  |  -.1004473   .0209108    -4.80   0.000    -.1424912   -.0584034
                  7  |  -.1406981   .0236171    -5.96   0.000    -.1881835   -.0932127
                  8  |  -.1591192   .0463479    -3.43   0.001    -.2523079   -.0659306
                  9  |   -.044497   .0197463    -2.25   0.029    -.0841996   -.0047945
                 10  |  -.1293509   .0253229    -5.11   0.000    -.1802661   -.0784357
                 11  |  -.1567834   .0296667    -5.28   0.000    -.2164323   -.0971344
                 12  |  -.1297922   .0434669    -2.99   0.004    -.2171882   -.0423961
                 13  |   -.047289   .0307981    -1.54   0.131    -.1092126    .0146347
                 14  |  -.1377628   .0271361    -5.08   0.000    -.1923235    -.083202
                 15  |  -.1377374   .0314171    -4.38   0.000    -.2009057   -.0745691
                 16  |  -.0858387   .0453625    -1.89   0.064    -.1770462    .0053688
                     |
                marr |   .0056687   .0025343     2.24   0.030     .0005732    .0107643
               partt |  -.0685994   .0078051    -8.79   0.000    -.0842926   -.0529061
              public |   .0164708   .0136732     1.20   0.234     -.011021    .0439625
                cmsa |   .1151263   .0093179    12.36   0.000     .0963914    .1338613
                     |
               nocc2 |
                  2  |  -.0433177   .0140081    -3.09   0.003    -.0714828   -.0151526
                  3  |  -.0185858   .0126689    -1.47   0.149    -.0440584    .0068868
                  4  |  -.1084124   .0110029    -9.85   0.000    -.1305352   -.0862897
                  5  |   .1443749   .0144679     9.98   0.000     .1152852    .1734645
                  6  |  -.2397274   .0096792   -24.77   0.000    -.2591887   -.2202662
                  7  |  -.2455648    .025239    -9.73   0.000    -.2963111   -.1948185
                  8  |  -.0886181   .0420364    -2.11   0.040    -.1731381   -.0040982
                  9  |  -.2929911   .0190737   -15.36   0.000    -.3313413   -.2546409
                 10  |  -.2713508   .0228649   -11.87   0.000    -.3173238   -.2253779
                 11  |    .010714   .0278313     0.38   0.702    -.0452446    .0666726
                 12  |  -.2398215   .0149714   -16.02   0.000    -.2699235   -.2097194
                     |
               unemp |   .0003236   .0007839     0.41   0.682    -.0012524    .0018997
                     |
             quarter |
                  2  |   .0012325   .0029545     0.42   0.678     -.004708     .007173
                  3  |   .0156799   .0036194     4.33   0.000     .0084025    .0229573
                  4  |   .0164725   .0029704     5.55   0.000     .0105001    .0224448
                     |
               _cons |   .1616009   .0684205     2.36   0.022     .0240323    .2991694
--------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_fem_all_sltt

. 
. ** RUST BELT ONLY BLACK-WHITE + WV, KY - IA
. ** keep if inrange(state, 31, 35) | inlist(state, 23, 41, 43) | inlist(state, 55, 61)
. 
. ** DROP ALWAYS RTW BLACK-WHITE
. ** drop if alwaysr2w == 1
. 
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl ma
> rr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo covstagdid_mal_cf 
.         
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl ma
> rr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo covstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo wagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo wagstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_fem_cf
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_fem_cf 
. 
. label variable hisprelwhite "$ Hispanic $"

. label variable treat_st "$ Treat_{st} $"

. label variable treat_sthisprelwhite "$ Treat_{st} \times Hispanic $"

. 
. ** FIXME ignore rust best stuff, dropping always rtw
. esttab covstagdid_mal_all covstagdid_mal_all_unemp covstagdid_mal_all_sltt covstagdid_fem_all covstagdid_fem_all_unemp covstagdid
> _fem_all_sltt using $tabs/covstagdid-hisp.tex, se title(Difference in Differences of Union Coverage on Right to Work Laws Treatme
> nt in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrul
> e(lr){@span})) keep(hisprelwhite treat_st treat_sthisprelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) scalar
> s("unemp_level State Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time Trends")
(note: file /Users/amedeusdsouza/econ499/tabs/covstagdid-hisp.tex not found)
(output written to /Users/amedeusdsouza/econ499/tabs/covstagdid-hisp.tex)

. 
. esttab wagstagdid_mal_all wagstagdid_mal_all_unemp wagstagdid_mal_all_sltt wagstagdid_fem_all wagstagdid_fem_all_unemp wagstagdid
> _fem_all_sltt using $tabs/wagstagdid1-hisp.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatm
> ent in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidru
> le(lr){@span})) keep(hisprelwhite treat_st treat_sthisprelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) 
(note: file /Users/amedeusdsouza/econ499/tabs/wagstagdid1-hisp.tex not found)
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid1-hisp.tex)

. 
. esttab nwagstagdid_mal_all nwagstagdid_mal_all_unemp nwagstagdid_mal_all_sltt nwagstagdid_fem_all nwagstagdid_fem_all_unemp nwags
> tagdid_fem_all_sltt using $tabs/wagstagdid2-hisp.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws 
> Treatment in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\
> cmidrule(lr){@span})) keep(hisprelwhite treat_st treat_sthisprelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01)
(note: file /Users/amedeusdsouza/econ499/tabs/wagstagdid2-hisp.tex not found)
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid2-hisp.tex)

. 
. esttab uwagstagdid_mal_all uwagstagdid_mal_all_unemp uwagstagdid_mal_all_sltt uwagstagdid_fem_all uwagstagdid_fem_all_unemp uwags
> tagdid_fem_all_sltt using $tabs/wagstagdid3-hisp.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws 
> Treatment in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\
> cmidrule(lr){@span})) keep(hisprelwhite treat_st treat_sthisprelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01)
>  scalars("unemp_level State Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time Trends")
(note: file /Users/amedeusdsouza/econ499/tabs/wagstagdid3-hisp.tex not found)
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid3-hisp.tex)

. 
. panelcombine, use($tabs/wagstagdid1-hisp.tex $tabs/wagstagdid2-hisp.tex $tabs/wagstagdid3-hisp.tex) paneltitles("All (Hispanic an
> d White) People" "People Not Covered by Union - Spillover Effect" "People Covered by Union - Direct Effect") columncount(3) save(
> $tabs/wagstagdid-hisp.tex)

. 
. *** esttab wagstagdid_mal_all wagstagdid_fem_all nwagstagdid_mal_all nwagstagdid_fem_all uwagstagdid_mal_all uwagstagdid_fem_all 
> using $tabs/wagstagdid.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Tim
> e) nonumbers mtitles("men" "women" "men not covered by union" "women not covered by union" "men covered by union" "women covered 
> by union") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
. 
. ** esttab wagstagdid_mal_cf wagstagdid_fem_cf nwagstagdid_mal_cf nwagstagdid_fem_cf uwagstagdid_mal_cf uwagstagdid_fem_cf using $
> tabs/wagstagdid_cf.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Time) n
> onumbers mtitles("men" "women" "men not covered by union" "women not covered by union" "men covered by union" "women covered by u
> nion") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
. 
. ** panelcombine, use($tabs/wagstagdid_all.tex $tabs/wagstagdid_cf.tex) paneltitles("All States" "W/O Always RTW States") columnco
> unt(3) save($tabs/wagstagdid.tex)
. 
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-hisp.log
  log type:  text
 closed on:  31 Mar 2021, 18:11:55
-----------------------------------------------------------------------------------------------------------------------------------
