-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 opened on:   2 Apr 2021, 13:30:34

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt public marr hisprace hi
> spracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effective; signed Dec2012) Ma
> r1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82) //incl Idaho wh
> ich changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. gen lyear = year - 1900

. 
. ** pta WV drop, common support MT, ME, NH, VT
. drop if inlist(state, 55, 81, 11, 12, 13)
(215,210 observations deleted)

. 
. eststo clear

. 
. ** BLACK-WHITE
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 9,044,801,513)

Linear regression                               Number of obs     =  1,004,424
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2235
                                                Root MSE          =     .33506

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0594546    .007698     7.72   0.000       .04395    .0749591
             treat_st |  -.0298137   .0105558    -2.82   0.007    -.0510742   -.0085533
treat_stblackrelwhite |  -.0611189   .0081115    -7.53   0.000    -.0774563   -.0447814
                      |
                state |
                  RI  |    .007391   .0020483     3.61   0.001     .0032655    .0115164
                  CT  |   .0019569   .0008968     2.18   0.034     .0001506    .0037632
                  NY  |   .0899683   .0026252    34.27   0.000     .0846808    .0952558
                  NJ  |   .0372061   .0009811    37.92   0.000       .03523    .0391822
                  PA  |   .0169421   .0019367     8.75   0.000     .0130414    .0208427
                  OH  |   .0064915   .0023047     2.82   0.007     .0018495    .0111334
                  IN  |  -.0094717   .0038166    -2.48   0.017    -.0171586   -.0017847
                  IL  |   .0351226   .0012269    28.63   0.000     .0326516    .0375937
                  MI  |   .0498682   .0030202    16.51   0.000     .0437853    .0559511
                  WI  |  -.0019656   .0032267    -0.61   0.545    -.0084645    .0045334
                  MN  |   .0172723   .0011491    15.03   0.000     .0149578    .0195867
                  IA  |   .0080055   .0113133     0.71   0.483    -.0147807    .0307916
                  MO  |  -.0153391   .0018702    -8.20   0.000    -.0191059   -.0115723
                  ND  |  -.0514263   .0118788    -4.33   0.000    -.0753515   -.0275011
                  SD  |  -.0737932   .0116716    -6.32   0.000     -.097301   -.0502854
                  NE  |  -.0280922   .0109332    -2.57   0.014    -.0501129   -.0060716
                  KS  |  -.0342929   .0109833    -3.12   0.003    -.0564144   -.0121714
                  DE  |  -.0557287   .0060223    -9.25   0.000    -.0678583   -.0435991
                  MD  |  -.0537064   .0038268   -14.03   0.000     -.061414   -.0459987
                  DC  |    -.05864   .0043596   -13.45   0.000    -.0674207   -.0498593
                  VA  |  -.0841588   .0109854    -7.66   0.000    -.1062845   -.0620331
                  NC  |  -.1151031   .0109566   -10.51   0.000    -.1371708   -.0930355
                  SC  |  -.1253851   .0111682   -11.23   0.000     -.147879   -.1028911
                  GA  |  -.0793463   .0108116    -7.34   0.000     -.101122   -.0575706
                  FL  |  -.0621437   .0108483    -5.73   0.000    -.0839934   -.0402941
                  KY  |  -.0483563   .0031808   -15.20   0.000    -.0547628   -.0419498
                  TN  |  -.0634317   .0110242    -5.75   0.000    -.0856356   -.0412278
                  AL  |  -.0405205   .0112314    -3.61   0.001    -.0631417   -.0178993
                  MS  |  -.0959539   .0116092    -8.27   0.000    -.1193361   -.0725717
                  AR  |  -.0927262   .0114031    -8.13   0.000    -.1156932   -.0697592
                  LA  |  -.0735989   .0111047    -6.63   0.000    -.0959649   -.0512329
                  OK  |  -.0852704   .0067036   -12.72   0.000    -.0987721   -.0717687
                  TX  |  -.0715244   .0107172    -6.67   0.000    -.0931099    -.049939
                  ID  |  -.0606139    .011256    -5.39   0.000    -.0832847   -.0379431
                  WY  |  -.0547276   .0123608    -4.43   0.000    -.0796236   -.0298317
                  CO  |  -.0616907   .0010687   -57.73   0.000    -.0638431   -.0595383
                  NM  |  -.1073797   .0039666   -27.07   0.000    -.1153689   -.0993905
                  AZ  |  -.0686193   .0107417    -6.39   0.000    -.0902542   -.0469844
                  UT  |  -.0669815   .0108662    -6.16   0.000    -.0888671   -.0450958
                  NV  |     .03821   .0109316     3.50   0.001     .0161926    .0602274
                  WA  |   .0454948   .0014222    31.99   0.000     .0426303    .0483593
                  OR  |   .0086457   .0015717     5.50   0.000       .00548    .0118113
                  CA  |   .0237919   .0008823    26.96   0.000     .0220148     .025569
                  AK  |   .0338799   .0065527     5.17   0.000     .0206822    .0470777
                  HI  |   .0212028   .0045636     4.65   0.000     .0120113    .0303944
                      |
                 year |
                1990  |  -.0065055   .0024956    -2.61   0.012     -.011532   -.0014791
                1991  |  -.0092536   .0030651    -3.02   0.004     -.015427   -.0030802
                1992  |   -.014297   .0026646    -5.37   0.000    -.0196637   -.0089303
                1993  |  -.0155265   .0036608    -4.24   0.000    -.0228998   -.0081533
                1996  |  -.0273724   .0037442    -7.31   0.000    -.0349135   -.0198312
                1997  |  -.0286802   .0042714    -6.71   0.000    -.0372832   -.0200773
                1998  |  -.0332426   .0042092    -7.90   0.000    -.0417205   -.0247648
                1999  |  -.0335395   .0037252    -9.00   0.000    -.0410425   -.0260366
                2000  |  -.0381835    .004323    -8.83   0.000    -.0468904   -.0294765
                2001  |  -.0409668   .0047215    -8.68   0.000    -.0504764   -.0314572
                2002  |  -.0417339   .0055797    -7.48   0.000     -.052972   -.0304958
                2003  |  -.0487618   .0047619   -10.24   0.000    -.0583529   -.0391708
                2004  |  -.0522087    .005175   -10.09   0.000    -.0626318   -.0417857
                2005  |  -.0600499    .005499   -10.92   0.000    -.0711254   -.0489743
                2006  |  -.0628977   .0061848   -10.17   0.000    -.0753546   -.0504408
                2007  |  -.0616544   .0058289   -10.58   0.000    -.0733945   -.0499143
                2008  |  -.0530584    .005987    -8.86   0.000    -.0651168   -.0409999
                2009  |  -.0556586   .0055678   -10.00   0.000    -.0668727   -.0444445
                2010  |  -.0592114   .0070217    -8.43   0.000    -.0733538    -.045069
                2011  |  -.0634358    .005615   -11.30   0.000     -.074745   -.0521266
                2012  |  -.0607646   .0064409    -9.43   0.000    -.0737372    -.047792
                2013  |  -.0611209   .0055142   -11.08   0.000     -.072227   -.0500148
                2014  |  -.0618799   .0055732   -11.10   0.000    -.0731049   -.0506549
                2015  |  -.0632778   .0057904   -10.93   0.000    -.0749403   -.0516153
                2016  |  -.0632697   .0057571   -10.99   0.000     -.074865   -.0516743
                2017  |  -.0559443   .0051325   -10.90   0.000    -.0662817   -.0456069
                2018  |  -.0576852   .0038791   -14.87   0.000    -.0654981   -.0498723
                2019  |    -.06213   .0053033   -11.72   0.000    -.0728114   -.0514487
                      |
                 nind |
                   2  |   .0998906   .0162712     6.14   0.000     .0671186    .1326626
                   3  |   .0927652    .010708     8.66   0.000     .0711982    .1143321
                   4  |   .0139332   .0076169     1.83   0.074    -.0014082    .0292745
                   5  |   .1795543   .0079007    22.73   0.000     .1636415    .1954671
                   6  |   .0035008    .007212     0.49   0.630     -.011025    .0180266
                   7  |   .0008558   .0059411     0.14   0.886    -.0111102    .0128218
                   8  |   .0156946   .0122255     1.28   0.206    -.0089288     .040318
                   9  |   .1207247   .0143249     8.43   0.000     .0918729    .1495764
                  10  |   .0071013   .0133422     0.53   0.597    -.0197712    .0339738
                  11  |   .0807377   .0162272     4.98   0.000     .0480545    .1134209
                      |
                 educ |   .0068579   .0013936     4.92   0.000     .0040511    .0096646
                exper |   .0069778   .0011667     5.98   0.000     .0046279    .0093277
               exper2 |  -.0000749   .0000627    -1.19   0.239    -.0002012    .0000514
               exper3 |   2.21e-06   2.06e-06     1.07   0.289    -1.94e-06    6.37e-06
               exper4 |  -5.04e-08   2.33e-08    -2.16   0.036    -9.73e-08   -3.47e-09
                 edex |  -.0001796   .0000423    -4.24   0.000    -.0002648   -.0000943
                      |
                ee_cl |
                   2  |  -.0155086   .0048617    -3.19   0.003    -.0253006   -.0057166
                   3  |  -.0067804   .0053696    -1.26   0.213    -.0175954    .0040346
                   4  |  -.0182155     .00829    -2.20   0.033    -.0349124   -.0015185
                   5  |  -.0695894   .0083215    -8.36   0.000    -.0863496   -.0528291
                   6  |  -.0024302   .0042206    -0.58   0.568     -.010931    .0060705
                   7  |   .0163668   .0061165     2.68   0.010     .0040475    .0286861
                   8  |  -.0282074   .0102733    -2.75   0.009    -.0488988    -.007516
                   9  |  -.0601123   .0068941    -8.72   0.000    -.0739977   -.0462269
                  10  |   .0136228   .0060502     2.25   0.029      .001437    .0258086
                  11  |   .0162781   .0076309     2.13   0.038     .0009088    .0316475
                  12  |  -.0397723   .0122547    -3.25   0.002    -.0644546   -.0150901
                  13  |    .001794   .0076974     0.23   0.817    -.0137094    .0172973
                  14  |   .0276854   .0067272     4.12   0.000     .0141361    .0412348
                  15  |     .00799   .0084225     0.95   0.348    -.0089738    .0249538
                  16  |  -.0481109    .013283    -3.62   0.001    -.0748643   -.0213575
                      |
                 marr |   .0172289   .0016196    10.64   0.000     .0139669     .020491
                partt |  -.0584517    .006212    -9.41   0.000    -.0709633     -.04594
               public |   .2662847   .0259244    10.27   0.000     .2140702    .3184991
                 cmsa |   .0438718   .0050135     8.75   0.000     .0337741    .0539695
                      |
                nocc2 |
                   2  |   .0519149   .0030671    16.93   0.000     .0457375    .0580923
                   3  |   .0326408   .0048987     6.66   0.000     .0227742    .0425074
                   4  |   .1649262   .0109805    15.02   0.000     .1428102    .1870421
                   5  |   .1502997   .0167912     8.95   0.000     .1164806    .1841188
                   6  |   .1366519   .0067738    20.17   0.000     .1230088    .1502949
                   7  |   .0708078   .0048046    14.74   0.000      .061131    .0804847
                   8  |   .0687689   .0070827     9.71   0.000     .0545036    .0830341
                   9  |    .166574   .0108783    15.31   0.000     .1446639     .188484
                  10  |   .1959038   .0138091    14.19   0.000     .1680908    .2237168
                  11  |   .2101313   .0150122    14.00   0.000     .1798951    .2403675
                  12  |   .2089025   .0165754    12.60   0.000     .1755179    .2422871
                      |
              quarter |
                   2  |  -.0028286   .0015087    -1.87   0.067    -.0058673    .0002101
                   3  |  -.0033394   .0013415    -2.49   0.017    -.0060412   -.0006375
                   4  |  -.0041988   .0009643    -4.35   0.000    -.0061411   -.0022565
                      |
                _cons |  -.1710451   .0316112    -5.41   0.000    -.2347133   -.1073769
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 9,044,801,513)

Linear regression                               Number of obs     =  1,004,424
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2235
                                                Root MSE          =     .33506

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0594473   .0077029     7.72   0.000     .0439328    .0749618
             treat_st |  -.0303286    .010446    -2.90   0.006    -.0513679   -.0092894
treat_stblackrelwhite |  -.0611159   .0081177    -7.53   0.000    -.0774659    -.044766
                      |
                state |
                  RI  |   .0092778   .0024681     3.76   0.000     .0043069    .0142487
                  CT  |   .0020557    .000878     2.34   0.024     .0002872    .0038241
                  NY  |   .0912762   .0027636    33.03   0.000     .0857101    .0968424
                  NJ  |   .0381333   .0012325    30.94   0.000      .035651    .0406156
                  PA  |   .0175766   .0019585     8.97   0.000     .0136319    .0215213
                  OH  |   .0075621   .0023209     3.26   0.002     .0028876    .0122365
                  IN  |  -.0094085   .0037799    -2.49   0.017    -.0170217   -.0017953
                  IL  |   .0369045   .0016717    22.08   0.000     .0335376    .0402715
                  MI  |   .0526565   .0035478    14.84   0.000     .0455108    .0598021
                  WI  |  -.0028398   .0033029    -0.86   0.394    -.0094923    .0038126
                  MN  |   .0155824   .0018079     8.62   0.000      .011941    .0192237
                  IA  |   .0060208     .01107     0.54   0.589    -.0162753    .0283169
                  MO  |  -.0150729   .0018724    -8.05   0.000    -.0188441   -.0113016
                  ND  |  -.0544745   .0116446    -4.68   0.000     -.077928    -.031021
                  SD  |   -.076698   .0114721    -6.69   0.000     -.099804    -.053592
                  NE  |  -.0314809   .0106885    -2.95   0.005    -.0530087    -.009953
                  KS  |   -.035242   .0107304    -3.28   0.002    -.0568543   -.0136298
                  DE  |  -.0570599   .0062149    -9.18   0.000    -.0695773   -.0445425
                  MD  |  -.0544416   .0039031   -13.95   0.000    -.0623028   -.0465805
                  DC  |  -.0554444    .004694   -11.81   0.000    -.0648987   -.0459901
                  VA  |  -.0854644   .0107192    -7.97   0.000    -.1070538   -.0638749
                  NC  |  -.1141914   .0108917   -10.48   0.000    -.1361284   -.0922544
                  SC  |   -.123447   .0112676   -10.96   0.000    -.1461411   -.1007528
                  GA  |   -.078116    .010823    -7.22   0.000    -.0999147   -.0563173
                  FL  |  -.0608355   .0109164    -5.57   0.000    -.0828223   -.0388488
                  KY  |  -.0468683   .0033662   -13.92   0.000    -.0536481   -.0400885
                  TN  |  -.0622872   .0109999    -5.66   0.000     -.084442   -.0401323
                  AL  |  -.0386328   .0113245    -3.41   0.001    -.0614414   -.0158241
                  MS  |  -.0926924   .0119926    -7.73   0.000    -.1168467    -.068538
                  AR  |  -.0914499    .011403    -8.02   0.000    -.1144168    -.068483
                  LA  |  -.0713767   .0113267    -6.30   0.000    -.0941898   -.0485636
                  OK  |  -.0860825   .0065642   -13.11   0.000    -.0993035   -.0728616
                  TX  |  -.0703689   .0107292    -6.56   0.000    -.0919786   -.0487593
                  ID  |  -.0602071   .0111398    -5.40   0.000    -.0826438   -.0377704
                  WY  |  -.0559109    .012117    -4.61   0.000    -.0803158   -.0315059
                  CO  |  -.0625606   .0011212   -55.80   0.000    -.0648188   -.0603024
                  NM  |  -.1060653    .004149   -25.56   0.000    -.1144219   -.0977087
                  AZ  |  -.0671244   .0108403    -6.19   0.000    -.0889579   -.0452909
                  UT  |  -.0683138   .0105778    -6.46   0.000    -.0896186    -.047009
                  NV  |    .040132   .0111737     3.59   0.001     .0176271     .062637
                  WA  |    .046987   .0018537    25.35   0.000     .0432535    .0507206
                  OR  |    .010757    .002271     4.74   0.000      .006183    .0153311
                  CA  |   .0266581   .0024643    10.82   0.000     .0216948    .0316214
                  AK  |   .0376287   .0072189     5.21   0.000      .023089    .0521683
                  HI  |    .019002   .0048088     3.95   0.000     .0093167    .0286873
                      |
                 year |
                1990  |  -.0059433   .0025652    -2.32   0.025    -.0111098   -.0007768
                1991  |   -.006497   .0033665    -1.93   0.060    -.0132774    .0002834
                1992  |  -.0104048   .0039313    -2.65   0.011    -.0183229   -.0024867
                1993  |  -.0127403   .0040496    -3.15   0.003    -.0208965    -.004584
                1996  |  -.0273387   .0036914    -7.41   0.000    -.0347735   -.0199039
                1997  |  -.0294679   .0041956    -7.02   0.000    -.0379182   -.0210176
                1998  |  -.0348216   .0043901    -7.93   0.000    -.0436637   -.0259794
                1999  |  -.0356105   .0040035    -8.89   0.000    -.0436739   -.0275471
                2000  |  -.0405837   .0044682    -9.08   0.000    -.0495832   -.0315843
                2001  |  -.0419771    .004843    -8.67   0.000    -.0517315   -.0322227
                2002  |  -.0407716   .0056638    -7.20   0.000    -.0521792   -.0293641
                2003  |  -.0474042   .0046838   -10.12   0.000    -.0568377   -.0379706
                2004  |  -.0516551   .0051098   -10.11   0.000    -.0619467   -.0413635
                2005  |  -.0602408   .0054383   -11.08   0.000    -.0711941   -.0492874
                2006  |   -.063887   .0061811   -10.34   0.000    -.0763364   -.0514376
                2007  |  -.0627544   .0060452   -10.38   0.000    -.0749301   -.0505787
                2008  |  -.0520692   .0058905    -8.84   0.000    -.0639333    -.040205
                2009  |  -.0483582   .0076087    -6.36   0.000    -.0636828   -.0330336
                2010  |  -.0512706   .0084432    -6.07   0.000     -.068276   -.0342652
                2011  |  -.0567959   .0071102    -7.99   0.000    -.0711167   -.0424752
                2012  |  -.0557296    .007446    -7.48   0.000    -.0707266   -.0407327
                2013  |  -.0572388   .0058631    -9.76   0.000    -.0690477   -.0454299
                2014  |  -.0602146   .0056769   -10.61   0.000    -.0716485   -.0487808
                2015  |  -.0632373   .0058169   -10.87   0.000    -.0749531   -.0515216
                2016  |  -.0639269   .0058694   -10.89   0.000    -.0757484   -.0521054
                2017  |  -.0575199   .0052296   -11.00   0.000     -.068053   -.0469869
                2018  |  -.0600702   .0045737   -13.13   0.000    -.0692822   -.0508582
                2019  |  -.0649111   .0058703   -11.06   0.000    -.0767346   -.0530876
                      |
                 nind |
                   2  |   .0998888   .0162667     6.14   0.000      .067126    .1326516
                   3  |   .0927665   .0107071     8.66   0.000     .0712012    .1143318
                   4  |   .0139582    .007609     1.83   0.073    -.0013673    .0292836
                   5  |   .1795842   .0078901    22.76   0.000     .1636928    .1954756
                   6  |   .0035282   .0072041     0.49   0.627    -.0109815     .018038
                   7  |   .0008741   .0059335     0.15   0.884    -.0110766    .0128248
                   8  |   .0157225     .01222     1.29   0.205    -.0088898    .0403349
                   9  |   .1207427   .0143224     8.43   0.000     .0918959    .1495895
                  10  |   .0071335   .0133272     0.54   0.595    -.0197089     .033976
                  11  |   .0807536   .0162204     4.98   0.000      .048084    .1134233
                      |
                 educ |    .006862   .0013983     4.91   0.000     .0040457    .0096784
                exper |   .0069941   .0011684     5.99   0.000     .0046409    .0093473
               exper2 |  -.0000758   .0000626    -1.21   0.232    -.0002019    .0000503
               exper3 |   2.24e-06   2.06e-06     1.09   0.282    -1.91e-06    6.40e-06
               exper4 |  -5.07e-08   2.33e-08    -2.17   0.035    -9.76e-08   -3.75e-09
                 edex |  -.0001798   .0000425    -4.23   0.000    -.0002654   -.0000943
                      |
                ee_cl |
                   2  |   -.015467   .0048583    -3.18   0.003    -.0252522   -.0056818
                   3  |  -.0067454   .0053679    -1.26   0.215    -.0175569    .0040661
                   4  |  -.0181912   .0082974    -2.19   0.034    -.0349031   -.0014794
                   5  |  -.0696033   .0083214    -8.36   0.000    -.0863635   -.0528431
                   6  |   -.002416   .0042196    -0.57   0.570    -.0109146    .0060826
                   7  |   .0164051   .0061166     2.68   0.010     .0040856    .0287247
                   8  |  -.0281585   .0102802    -2.74   0.009    -.0488638   -.0074532
                   9  |  -.0601058   .0068911    -8.72   0.000    -.0739851   -.0462265
                  10  |   .0136203   .0060482     2.25   0.029     .0014385     .025802
                  11  |   .0163185   .0076325     2.14   0.038     .0009459    .0316911
                  12  |   -.039721   .0122538    -3.24   0.002    -.0644014   -.0150407
                  13  |    .001753   .0076863     0.23   0.821     -.013728    .0172339
                  14  |   .0276891   .0067252     4.12   0.000     .0141438    .0412343
                  15  |   .0080092    .008423     0.95   0.347    -.0089556    .0249739
                  16  |  -.0480746    .013281    -3.62   0.001    -.0748239   -.0213254
                      |
                 marr |   .0172338   .0016194    10.64   0.000     .0139723    .0204954
                partt |  -.0583849   .0062113    -9.40   0.000     -.070895   -.0458748
               public |   .2662957   .0259288    10.27   0.000     .2140723     .318519
                 cmsa |   .0438569   .0050198     8.74   0.000     .0337466    .0539672
                      |
                nocc2 |
                   2  |   .0519193   .0030673    16.93   0.000     .0457414    .0580972
                   3  |   .0326467   .0048959     6.67   0.000      .022786    .0425075
                   4  |   .1649241    .010981    15.02   0.000     .1428072    .1870409
                   5  |   .1502904    .016789     8.95   0.000     .1164756    .1841053
                   6  |   .1366676   .0067738    20.18   0.000     .1230244    .1503108
                   7  |   .0708233   .0048005    14.75   0.000     .0611546     .080492
                   8  |   .0687347   .0070818     9.71   0.000     .0544713    .0829981
                   9  |   .1665971   .0108762    15.32   0.000     .1446913    .1885029
                  10  |    .195904   .0138053    14.19   0.000     .1680987    .2237092
                  11  |   .2101306   .0150096    14.00   0.000     .1798997    .2403615
                  12  |   .2089045   .0165731    12.61   0.000     .1755245    .2422845
                      |
                unemp |  -.0018333   .0014482    -1.27   0.212    -.0047502    .0010835
                      |
              quarter |
                   2  |  -.0028332   .0015125    -1.87   0.068    -.0058796    .0002131
                   3  |  -.0033417   .0013431    -2.49   0.017    -.0060467   -.0006366
                   4  |  -.0041987   .0009652    -4.35   0.000    -.0061428   -.0022546
                      |
                _cons |  -.1623344   .0319834    -5.08   0.000    -.2267524   -.0979164
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee
> _cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 9,044,801,513)

Linear regression                               Number of obs     =  1,004,424
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2242
                                                Root MSE          =     .33491

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0597581   .0076851     7.78   0.000     .0442795    .0752367
             treat_st |   .0216995   .0089394     2.43   0.019     .0036946    .0397043
treat_stblackrelwhite |  -.0614236   .0080604    -7.62   0.000    -.0776581   -.0451891
                      |
                state |
                  RI  |   .0203442   .0035137     5.79   0.000     .0132673    .0274212
                  CT  |  -.0109064   .0053001    -2.06   0.045    -.0215814   -.0002314
                  NY  |   .1303245   .0063579    20.50   0.000      .117519      .14313
                  NJ  |   .1282126   .0038524    33.28   0.000     .1204536    .1359716
                  PA  |   .1791628   .0033441    53.58   0.000     .1724274    .1858981
                  OH  |   .2909658    .003189    91.24   0.000     .2845428    .2973887
                  IN  |   .4601668   .0286152    16.08   0.000     .4025327    .5178008
                  IL  |   .1896184   .0035938    52.76   0.000     .1823802    .1968565
                  MI  |   .4430016   .0243888    18.16   0.000     .3938801    .4921232
                  WI  |   .3573429   .0216131    16.53   0.000     .3138118     .400874
                  MN  |   .1194687   .0030576    39.07   0.000     .1133103    .1256271
                  IA  |   .1342768   .0108371    12.39   0.000     .1124498    .1561039
                  MO  |   .0660631   .0022663    29.15   0.000     .0614986    .0706276
                  ND  |   -.105876   .0133463    -7.93   0.000    -.1327569   -.0789951
                  SD  |   .0074008   .0110514     0.67   0.506    -.0148578    .0296594
                  NE  |   .0271618   .0105295     2.58   0.013     .0059542    .0483693
                  KS  |   .0652598   .0093767     6.96   0.000     .0463742    .0841454
                  DE  |   .1106526   .0128903     8.58   0.000     .0846902     .136615
                  MD  |  -.0661826   .0081551    -8.12   0.000    -.0826079   -.0497573
                  DC  |  -.1242635   .0208508    -5.96   0.000    -.1662591   -.0822679
                  VA  |  -.1513675   .0117134   -12.92   0.000    -.1749596   -.1277755
                  NC  |     -.2737   .0139168   -19.67   0.000    -.3017299     -.24567
                  SC  |  -.3400332   .0125768   -27.04   0.000    -.3653641   -.3147023
                  GA  |  -.1809679   .0110084   -16.44   0.000      -.20314   -.1587957
                  FL  |  -.1728352   .0092395   -18.71   0.000    -.1914446   -.1542258
                  KY  |  -.0678514   .0155429    -4.37   0.000    -.0991565   -.0365463
                  TN  |    .001374   .0108374     0.13   0.900    -.0204537    .0232017
                  AL  |   .1242247   .0108454    11.45   0.000     .1023809    .1460685
                  MS  |  -.0358064   .0128818    -2.78   0.008    -.0617517   -.0098612
                  AR  |  -.0253585    .013574    -1.87   0.068     -.052698    .0019811
                  LA  |   -.136177   .0099156   -13.73   0.000     -.156148    -.116206
                  OK  |   .0072042   .0393968     0.18   0.856     -.072145    .0865535
                  TX  |   -.218251   .0091638   -23.82   0.000    -.2367077   -.1997942
                  ID  |   .0366707   .0145862     2.51   0.016     .0072927    .0660487
                  WY  |  -.0107625   .0106061    -1.01   0.316    -.0321243    .0105993
                  CO  |   -.252793   .0033467   -75.53   0.000    -.2595336   -.2460523
                  NM  |  -.2785833   .0133987   -20.79   0.000    -.3055696    -.251597
                  AZ  |  -.2801753   .0098666   -28.40   0.000    -.3000477   -.2603029
                  UT  |  -.0621433   .0112704    -5.51   0.000     -.084843   -.0394435
                  NV  |  -.0037869     .01211    -0.31   0.756    -.0281778    .0206039
                  WA  |    .202274   .0052542    38.50   0.000     .1916916    .2128564
                  OR  |   .0805993   .0054215    14.87   0.000     .0696798    .0915188
                  CA  |  -.0113952   .0027345    -4.17   0.000    -.0169027   -.0058876
                  AK  |  -.0655894   .0060606   -10.82   0.000    -.0777959   -.0533828
                  HI  |    .241615   .0058218    41.50   0.000     .2298893    .2533407
                      |
        state#c.lyear |
                  MA  |  -.0015837   .0000757   -20.92   0.000    -.0017362   -.0014313
                  RI  |  -.0017122   .0000711   -24.08   0.000    -.0018554    -.001569
                  CT  |  -.0014642   .0000865   -16.92   0.000    -.0016384   -.0012899
                  NY  |  -.0019745   .0000962   -20.53   0.000    -.0021682   -.0017808
                  NJ  |   -.002469   .0000796   -31.03   0.000    -.0026293   -.0023087
                  PA  |  -.0031614   .0000816   -38.76   0.000    -.0033257   -.0029971
                  OH  |   -.004342   .0000593   -73.27   0.000    -.0044613   -.0042226
                  IN  |  -.0062613   .0002971   -21.08   0.000    -.0068596    -.005663
                  IL  |  -.0030876   .0000883   -34.97   0.000    -.0032654   -.0029098
                  MI  |  -.0055152   .0002596   -21.24   0.000    -.0060381   -.0049922
                  WI  |  -.0051511    .000228   -22.59   0.000    -.0056104   -.0046919
                  MN  |  -.0025825   .0000801   -32.24   0.000    -.0027438   -.0024211
                  IA  |  -.0033231   .0000845   -39.33   0.000    -.0034932   -.0031529
                  MO  |  -.0023775   .0000604   -39.35   0.000    -.0024992   -.0022558
                  ND  |  -.0015759   .0001117   -14.11   0.000    -.0018008    -.001351
                  SD  |  -.0028987   .0000662   -43.81   0.000     -.003032   -.0027654
                  NE  |  -.0026321   .0000706   -37.29   0.000    -.0027742   -.0024899
                  KS  |  -.0030623    .000069   -44.41   0.000    -.0032012   -.0029234
                  DE  |  -.0032633   .0001499   -21.78   0.000    -.0035651   -.0029614
                  MD  |  -.0014848   .0001082   -13.72   0.000    -.0017028   -.0012669
                  DC  |   -.000954   .0002196    -4.34   0.000    -.0013963   -.0005116
                  VA  |  -.0014379   .0001116   -12.88   0.000    -.0016627    -.001213
                  NC  |  -.0005522   .0001254    -4.40   0.000    -.0008048   -.0002997
                  SC  |  -.0000185   .0000823    -0.22   0.823    -.0001842    .0001473
                  GA  |  -.0011083   .0001015   -10.92   0.000    -.0013126   -.0009039
                  FL  |  -.0010287   .0000624   -16.48   0.000    -.0011544    -.000903
                  KY  |  -.0014533   .0001584    -9.18   0.000    -.0017722   -.0011343
                  TN  |  -.0027155   .0000949   -28.61   0.000    -.0029067   -.0025243
                  AL  |  -.0036847   .0000678   -54.32   0.000    -.0038213   -.0035481
                  MS  |   -.002669    .000069   -38.66   0.000    -.0028081     -.00253
                  AR  |   -.002747   .0001032   -26.62   0.000    -.0029549   -.0025391
                  LA  |  -.0014758   .0000736   -20.05   0.000     -.001624   -.0013276
                  OK  |  -.0027718   .0004222    -6.57   0.000    -.0036221   -.0019214
                  TX  |  -.0006734   .0000775    -8.69   0.000    -.0008295   -.0005173
                  ID  |   -.003033   .0001193   -25.43   0.000    -.0032732   -.0027928
                  WY  |  -.0025313   .0000533   -47.53   0.000    -.0026386    -.002424
                  CO  |    .000229   .0000627     3.65   0.001     .0001028    .0003553
                  NM  |   .0000251   .0001208     0.21   0.836    -.0002182    .0002684
                  AZ  |   -.000057    .000092    -0.62   0.539    -.0002424    .0001284
                  UT  |  -.0021409    .000111   -19.28   0.000    -.0023646   -.0019173
                  NV  |  -.0016869   .0000694   -24.32   0.000    -.0018266   -.0015472
                  WA  |  -.0030958   .0000982   -31.51   0.000    -.0032937   -.0028979
                  OR  |  -.0022881   .0000982   -23.30   0.000    -.0024859   -.0020903
                  CA  |  -.0012373   .0000653   -18.95   0.000    -.0013688   -.0011058
                  AK  |  -.0005918   .0000231   -25.57   0.000    -.0006384   -.0005452
                  HI  |  -.0037519   .0000527   -71.14   0.000    -.0038581   -.0036457
                      |
                 nind |
                   2  |   .0986209   .0162948     6.05   0.000     .0658015    .1314402
                   3  |   .0917152   .0106467     8.61   0.000     .0702716    .1131587
                   4  |   .0126419   .0076148     1.66   0.104     -.002695    .0279789
                   5  |   .1783355   .0078548    22.70   0.000     .1625151    .1941558
                   6  |   .0023419    .007207     0.32   0.747    -.0121737    .0168574
                   7  |  -.0006646   .0058692    -0.11   0.910    -.0124859    .0111566
                   8  |   .0146928   .0121953     1.20   0.235    -.0098699    .0392555
                   9  |   .1195653   .0142663     8.38   0.000     .0908315    .1482991
                  10  |   .0067725   .0132419     0.51   0.612     -.019898    .0334431
                  11  |   .0799182   .0161949     4.93   0.000        .0473    .1125364
                      |
                 educ |   .0074421   .0013593     5.48   0.000     .0047044    .0101798
                exper |   .0073922   .0011694     6.32   0.000     .0050369    .0097476
               exper2 |  -.0001005    .000062    -1.62   0.112    -.0002254    .0000245
               exper3 |   3.02e-06   2.05e-06     1.47   0.148    -1.11e-06    7.15e-06
               exper4 |  -5.79e-08   2.32e-08    -2.49   0.016    -1.05e-07   -1.11e-08
                 edex |   -.000193   .0000421    -4.58   0.000    -.0002778   -.0001082
                      |
                ee_cl |
                   2  |  -.0161975   .0048727    -3.32   0.002    -.0260117   -.0063834
                   3  |   -.008278   .0052558    -1.58   0.122    -.0188638    .0023079
                   4  |  -.0209408     .00822    -2.55   0.014    -.0374966   -.0043849
                   5  |  -.0681545   .0083152    -8.20   0.000    -.0849021   -.0514068
                   6  |  -.0029732   .0042628    -0.70   0.489    -.0115589    .0056125
                   7  |   .0155853   .0060546     2.57   0.013     .0033907    .0277799
                   8  |   -.030264   .0101341    -2.99   0.005     -.050675   -.0098529
                   9  |  -.0591229   .0069413    -8.52   0.000    -.0731034   -.0451423
                  10  |   .0124687   .0060413     2.06   0.045     .0003008    .0246365
                  11  |   .0151899   .0075605     2.01   0.051    -.0000377    .0304175
                  12  |  -.0414445   .0120575    -3.44   0.001    -.0657296   -.0171594
                  13  |   .0012997   .0076227     0.17   0.865    -.0140533    .0166527
                  14  |   .0267171   .0067345     3.97   0.000     .0131531    .0402812
                  15  |   .0064992   .0083442     0.78   0.440    -.0103069    .0233054
                  16  |   -.049892   .0131387    -3.80   0.000    -.0763546   -.0234293
                      |
                 marr |   .0170881   .0015924    10.73   0.000     .0138807    .0202954
                partt |  -.0582706    .006244    -9.33   0.000    -.0708466   -.0456946
               public |   .2661895   .0259723    10.25   0.000     .2138787    .3185004
                 cmsa |    .043227   .0053841     8.03   0.000     .0323828    .0540712
                      |
                nocc2 |
                   2  |   .0517093    .003045    16.98   0.000     .0455765    .0578422
                   3  |   .0327092   .0049138     6.66   0.000     .0228124    .0426061
                   4  |   .1644309    .010943    15.03   0.000     .1423905    .1864712
                   5  |   .1500265   .0168552     8.90   0.000     .1160783    .1839747
                   6  |   .1367939   .0067668    20.22   0.000     .1231648    .1504229
                   7  |   .0711248    .004773    14.90   0.000     .0615116    .0807381
                   8  |   .0686684   .0070924     9.68   0.000     .0543835    .0829533
                   9  |   .1664057   .0108871    15.28   0.000      .144478    .1883333
                  10  |   .1957978   .0137647    14.22   0.000     .1680742    .2235214
                  11  |   .2102114   .0149911    14.02   0.000     .1800177    .2404051
                  12  |   .2091366   .0165732    12.62   0.000     .1757564    .2425168
                      |
                unemp |  -.0003269   .0003676    -0.89   0.379    -.0010674    .0004135
                      |
              quarter |
                   2  |  -.0027766   .0015203    -1.83   0.074    -.0058386    .0002854
                   3  |  -.0034086   .0013612    -2.50   0.016    -.0061502   -.0006671
                   4  |  -.0042611   .0009867    -4.32   0.000    -.0062484   -.0022738
                      |
                _cons |  -.0513465   .0393564    -1.30   0.199    -.1306144    .0279214
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_mal_all_sltt 

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,850,470,240)

Linear regression                               Number of obs     =  1,013,392
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2714
                                                Root MSE          =     .29804

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0796067   .0115638     6.88   0.000     .0563161    .1028974
             treat_st |  -.0218675   .0115893    -1.89   0.066    -.0452095    .0014745
treat_stblackrelwhite |  -.0649013   .0123035    -5.28   0.000    -.0896819   -.0401207
                      |
                state |
                  RI  |   .0179925    .001213    14.83   0.000     .0155495    .0204356
                  CT  |   .0100878   .0009229    10.93   0.000      .008229    .0119466
                  NY  |   .0797958   .0030828    25.88   0.000     .0735866    .0860049
                  NJ  |    .018033   .0015915    11.33   0.000     .0148275    .0212385
                  PA  |  -.0066951   .0007325    -9.14   0.000    -.0081704   -.0052199
                  OH  |   -.020483   .0015887   -12.89   0.000    -.0236827   -.0172833
                  IN  |  -.0583657   .0032037   -18.22   0.000    -.0648183   -.0519131
                  IL  |  -.0156024   .0012349   -12.63   0.000    -.0180896   -.0131151
                  MI  |   .0286675   .0025565    11.21   0.000     .0235185    .0338166
                  WI  |  -.0174456   .0024475    -7.13   0.000     -.022375   -.0125162
                  MN  |   .0218652   .0009711    22.52   0.000     .0199093    .0238212
                  IA  |  -.0170965   .0118195    -1.45   0.155    -.0409022    .0067093
                  MO  |  -.0674324   .0012984   -51.93   0.000    -.0700475   -.0648172
                  ND  |   -.056123   .0121042    -4.64   0.000    -.0805021    -.031744
                  SD  |   -.068294   .0119883    -5.70   0.000    -.0924398   -.0441482
                  NE  |  -.0356251   .0116063    -3.07   0.004    -.0590014   -.0122488
                  KS  |  -.0711672   .0116745    -6.10   0.000    -.0946809   -.0476535
                  DE  |  -.0454459   .0041227   -11.02   0.000    -.0537494   -.0371424
                  MD  |  -.0574137   .0057339   -10.01   0.000    -.0689623   -.0458651
                  DC  |  -.0801003   .0067988   -11.78   0.000    -.0937937   -.0664068
                  VA  |   -.091651   .0116729    -7.85   0.000    -.1151615   -.0681406
                  NC  |  -.1172552   .0119194    -9.84   0.000     -.141262   -.0932483
                  SC  |  -.1245065   .0120967   -10.29   0.000    -.1488704   -.1001425
                  GA  |  -.1020996   .0117671    -8.68   0.000    -.1257998   -.0783994
                  FL  |  -.0531053   .0114511    -4.64   0.000    -.0761691   -.0300415
                  KY  |  -.0739279   .0030415   -24.31   0.000    -.0800539    -.067802
                  TN  |  -.0824575   .0118108    -6.98   0.000    -.1062457   -.0586692
                  AL  |  -.0513545   .0118868    -4.32   0.000    -.0752958   -.0274131
                  MS  |  -.1112521   .0123991    -8.97   0.000    -.1362252   -.0862791
                  AR  |  -.0966038   .0120822    -8.00   0.000    -.1209387   -.0722689
                  LA  |  -.0824041   .0117403    -7.02   0.000    -.1060503   -.0587579
                  OK  |  -.0835834   .0068558   -12.19   0.000    -.0973917    -.069775
                  TX  |  -.0881721   .0115383    -7.64   0.000    -.1114114   -.0649329
                  ID  |  -.0671794   .0117191    -5.73   0.000    -.0907828   -.0435759
                  WY  |  -.1044311   .0129631    -8.06   0.000    -.1305402    -.078322
                  CO  |  -.0618597   .0006151  -100.57   0.000    -.0630986   -.0606208
                  NM  |  -.0926001   .0046406   -19.95   0.000    -.1019466   -.0832535
                  AZ  |  -.0685909    .011346    -6.05   0.000    -.0914428   -.0457389
                  UT  |  -.0683497   .0113184    -6.04   0.000    -.0911462   -.0455533
                  NV  |   .0307072   .0113678     2.70   0.010     .0078114    .0536031
                  WA  |   .0454057   .0014493    31.33   0.000     .0424866    .0483248
                  OR  |   .0290583   .0017211    16.88   0.000     .0255919    .0325247
                  CA  |   .0284034   .0017348    16.37   0.000     .0249094    .0318974
                  AK  |   .0496443   .0052822     9.40   0.000     .0390053    .0602832
                  HI  |   .0362406   .0022424    16.16   0.000     .0317242    .0407571
                      |
                 year |
                1990  |  -.0022385   .0016078    -1.39   0.171    -.0054767    .0009997
                1991  |  -.0039309   .0019449    -2.02   0.049    -.0078482   -.0000137
                1992  |  -.0004613   .0021195    -0.22   0.829    -.0047302    .0038075
                1993  |   -.000479   .0024234    -0.20   0.844      -.00536    .0044019
                1996  |  -.0018757   .0026281    -0.71   0.479     -.007169    .0034177
                1997  |  -.0057381   .0024591    -2.33   0.024    -.0106909   -.0007852
                1998  |  -.0084729   .0029924    -2.83   0.007    -.0144999   -.0024459
                1999  |  -.0114416   .0027726    -4.13   0.000    -.0170259   -.0058572
                2000  |  -.0086475   .0026029    -3.32   0.002      -.01389   -.0034051
                2001  |  -.0084731   .0024781    -3.42   0.001    -.0134644   -.0034819
                2002  |   -.009493    .003532    -2.69   0.010    -.0166069   -.0023792
                2003  |  -.0159192   .0029302    -5.43   0.000    -.0218208   -.0100175
                2004  |   -.018857   .0032334    -5.83   0.000    -.0253693   -.0123447
                2005  |  -.0202455   .0034248    -5.91   0.000    -.0271434   -.0133477
                2006  |  -.0224141   .0032213    -6.96   0.000    -.0289021    -.015926
                2007  |  -.0219764   .0044275    -4.96   0.000    -.0308939   -.0130589
                2008  |  -.0206415   .0043872    -4.70   0.000    -.0294777   -.0118053
                2009  |   -.019506   .0041255    -4.73   0.000    -.0278151   -.0111969
                2010  |  -.0226223   .0040478    -5.59   0.000     -.030775   -.0144695
                2011  |  -.0211516   .0041659    -5.08   0.000    -.0295422    -.012761
                2012  |  -.0259445   .0044094    -5.88   0.000    -.0348254   -.0170636
                2013  |  -.0218875   .0046622    -4.69   0.000    -.0312777   -.0124973
                2014  |  -.0252262   .0045633    -5.53   0.000    -.0344171   -.0160353
                2015  |  -.0242096   .0050026    -4.84   0.000    -.0342854   -.0141339
                2016  |  -.0214893   .0045866    -4.69   0.000    -.0307272   -.0122515
                2017  |  -.0270548   .0050004    -5.41   0.000    -.0371261   -.0169836
                2018  |  -.0292598   .0036544    -8.01   0.000    -.0366201   -.0218995
                2019  |    -.02851   .0051226    -5.57   0.000    -.0388275   -.0181925
                      |
                 nind |
                   2  |   .0341061   .0106476     3.20   0.002     .0126609    .0555514
                   3  |   .0502198   .0111185     4.52   0.000     .0278259    .0726137
                   4  |   .0405935   .0099671     4.07   0.000     .0205188    .0606683
                   5  |   .1718436   .0101015    17.01   0.000     .1514981    .1921891
                   6  |   .0136147   .0092644     1.47   0.149    -.0050448    .0322741
                   7  |   .0047289   .0091197     0.52   0.607    -.0136391    .0230969
                   8  |   .0216785   .0117633     1.84   0.072     -.002014    .0453711
                   9  |   .1400923   .0173843     8.06   0.000     .1050786     .175106
                  10  |   .0075537   .0101338     0.75   0.460    -.0128568    .0279642
                  11  |   .0055448   .0160196     0.35   0.731    -.0267202    .0378099
                      |
                 educ |   .0148081   .0020786     7.12   0.000     .0106216    .0189946
                exper |   .0084449   .0013845     6.10   0.000     .0056564    .0112333
               exper2 |  -.0003077   .0000718    -4.28   0.000    -.0004524    -.000163
               exper3 |   7.01e-06   2.35e-06     2.98   0.005     2.27e-06    .0000118
               exper4 |  -6.54e-08   2.54e-08    -2.57   0.014    -1.17e-07   -1.42e-08
                 edex |  -.0001283   .0000477    -2.69   0.010    -.0002245   -.0000322
                      |
                ee_cl |
                   2  |  -.0356123   .0044121    -8.07   0.000    -.0444987    -.026726
                   3  |  -.0633376   .0066542    -9.52   0.000    -.0767398   -.0499353
                   4  |  -.0944561   .0132709    -7.12   0.000    -.1211851    -.067727
                   5  |  -.0379085   .0059918    -6.33   0.000    -.0499766   -.0258404
                   6  |  -.0424668   .0054174    -7.84   0.000    -.0533779   -.0315556
                   7  |  -.0629149   .0076166    -8.26   0.000    -.0782556   -.0475742
                   8  |  -.0868615   .0129136    -6.73   0.000    -.1128709   -.0608521
                   9  |  -.0264836   .0059603    -4.44   0.000    -.0384883   -.0144788
                  10  |  -.0448382   .0066421    -6.75   0.000     -.058216   -.0314604
                  11  |  -.0632378   .0085077    -7.43   0.000    -.0803732   -.0461024
                  12  |  -.0784683   .0124088    -6.32   0.000    -.1034608   -.0534757
                  13  |  -.0032588   .0069886    -0.47   0.643    -.0173346    .0108169
                  14  |  -.0372343   .0073727    -5.05   0.000    -.0520838   -.0223849
                  15  |  -.0575471   .0094963    -6.06   0.000    -.0766736   -.0384206
                  16  |  -.0718195   .0131362    -5.47   0.000    -.0982771   -.0453619
                      |
                 marr |  -.0007033   .0010301    -0.68   0.498     -.002778    .0013715
                partt |  -.0556109   .0050865   -10.93   0.000    -.0658557   -.0453661
               public |   .2848112   .0287786     9.90   0.000     .2268482    .3427743
                 cmsa |   .0234818   .0029088     8.07   0.000     .0176232    .0293403
                      |
                nocc2 |
                   2  |    .022489   .0020879    10.77   0.000     .0182837    .0266943
                   3  |   .0313872   .0067805     4.63   0.000     .0177305    .0450438
                   4  |   .1515145   .0074034    20.47   0.000     .1366034    .1664257
                   5  |   .1367384   .0160478     8.52   0.000     .1044166    .1690603
                   6  |    .064354   .0054161    11.88   0.000     .0534455    .0752625
                   7  |   .0838221   .0081119    10.33   0.000     .0674838    .1001603
                   8  |   .0565648   .0032957    17.16   0.000      .049927    .0632026
                   9  |   .0977047   .0092565    10.56   0.000     .0790611    .1163483
                  10  |   .1828301   .0152667    11.98   0.000     .1520814    .2135788
                  11  |   .2115704   .0159902    13.23   0.000     .1793645    .2437763
                  12  |   .1713578    .018208     9.41   0.000     .1346851    .2080306
                      |
              quarter |
                   2  |  -.0010521   .0010277    -1.02   0.311    -.0031219    .0010177
                   3  |   .0002401   .0008407     0.29   0.776    -.0014531    .0019334
                   4  |  -.0032978   .0011316    -2.91   0.006    -.0055769   -.0010187
                      |
                _cons |   -.204117   .0360604    -5.66   0.000    -.2767463   -.1314877
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,850,470,240)

Linear regression                               Number of obs     =  1,013,392
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2714
                                                Root MSE          =     .29804

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0796031   .0115611     6.89   0.000     .0563179    .1028884
             treat_st |  -.0221093   .0115435    -1.92   0.062     -.045359    .0011404
treat_stblackrelwhite |  -.0649019    .012303    -5.28   0.000    -.0896814   -.0401224
                      |
                state |
                  RI  |   .0188712   .0013487    13.99   0.000     .0161548    .0215876
                  CT  |   .0101502   .0008862    11.45   0.000     .0083652    .0119351
                  NY  |   .0804027   .0027797    28.92   0.000      .074804    .0860014
                  NJ  |   .0184699   .0013953    13.24   0.000     .0156596    .0212801
                  PA  |  -.0063945   .0007037    -9.09   0.000    -.0078118   -.0049771
                  OH  |   -.019974   .0014383   -13.89   0.000    -.0228708   -.0170771
                  IN  |   -.058303   .0031865   -18.30   0.000    -.0647209   -.0518851
                  IL  |  -.0147778    .001105   -13.37   0.000    -.0170033   -.0125523
                  MI  |   .0299576   .0027976    10.71   0.000      .024323    .0355921
                  WI  |  -.0178061   .0024564    -7.25   0.000    -.0227536   -.0128586
                  MN  |   .0211176   .0013095    16.13   0.000     .0184801    .0237551
                  IA  |  -.0179724   .0116678    -1.54   0.130    -.0414726    .0055277
                  MO  |  -.0672968   .0012351   -54.49   0.000    -.0697844   -.0648093
                  ND  |  -.0574633   .0120235    -4.78   0.000    -.0816799   -.0332466
                  SD  |  -.0695861   .0118485    -5.87   0.000    -.0934503   -.0457219
                  NE  |  -.0371279   .0114521    -3.24   0.002    -.0601937   -.0140622
                  KS  |  -.0715595   .0115508    -6.20   0.000     -.094824   -.0482949
                  DE  |  -.0460174   .0044206   -10.41   0.000    -.0549209   -.0371139
                  MD  |  -.0577354   .0059316    -9.73   0.000    -.0696822   -.0457886
                  DC  |  -.0786315   .0060412   -13.02   0.000    -.0907991    -.066464
                  VA  |  -.0922222   .0115424    -7.99   0.000    -.1154699   -.0689746
                  NC  |  -.1167787   .0119046    -9.81   0.000    -.1407558   -.0928016
                  SC  |  -.1235818    .012135   -10.18   0.000     -.148023   -.0991406
                  GA  |  -.1015127   .0117868    -8.61   0.000    -.1252525   -.0777729
                  FL  |   -.052496   .0114796    -4.57   0.000     -.075617   -.0293749
                  KY  |  -.0732332   .0029418   -24.89   0.000    -.0791583   -.0673081
                  TN  |  -.0819113   .0118107    -6.94   0.000    -.1056993   -.0581233
                  AL  |  -.0504836    .011949    -4.22   0.000      -.07455   -.0264171
                  MS  |   -.109749   .0125351    -8.76   0.000    -.1349961    -.084502
                  AR  |  -.0960114   .0120587    -7.96   0.000     -.120299   -.0717238
                  LA  |  -.0813892   .0118155    -6.89   0.000    -.1051868   -.0575916
                  OK  |  -.0839347   .0068172   -12.31   0.000    -.0976652   -.0702042
                  TX  |  -.0876277   .0115428    -7.59   0.000    -.1108762   -.0643793
                  ID  |   -.066984   .0116575    -5.75   0.000    -.0904635   -.0435045
                  WY  |  -.1049555   .0129029    -8.13   0.000    -.1309432   -.0789677
                  CO  |  -.0622326    .000759   -81.99   0.000    -.0637613   -.0607039
                  NM  |  -.0920284    .004497   -20.46   0.000    -.1010859    -.082971
                  AZ  |  -.0678839   .0114145    -5.95   0.000    -.0908738   -.0448939
                  UT  |  -.0689273    .011158    -6.18   0.000    -.0914006    -.046454
                  NV  |   .0316074   .0114928     2.75   0.009     .0084596    .0547552
                  WA  |   .0461032   .0015411    29.91   0.000     .0429992    .0492073
                  OR  |   .0300386   .0019787    15.18   0.000     .0260534    .0340238
                  CA  |   .0297269   .0017265    17.22   0.000     .0262495    .0332043
                  AK  |    .051363   .0050896    10.09   0.000      .041112     .061614
                  HI  |   .0352743   .0027027    13.05   0.000     .0298309    .0407178
                      |
                 year |
                1990  |  -.0019716   .0017344    -1.14   0.262    -.0054648    .0015217
                1991  |  -.0026727   .0026482    -1.01   0.318    -.0080064     .002661
                1992  |   .0013137   .0024056     0.55   0.588    -.0035314    .0061588
                1993  |   .0007997   .0026591     0.30   0.765     -.004556    .0061554
                1996  |  -.0018444   .0026095    -0.71   0.483    -.0071002    .0034115
                1997  |  -.0060753    .002448    -2.48   0.017    -.0110058   -.0011449
                1998  |  -.0091746   .0030133    -3.04   0.004    -.0152437   -.0031055
                1999  |  -.0123618   .0028282    -4.37   0.000     -.018058   -.0066656
                2000  |  -.0097181     .00249    -3.90   0.000    -.0147331   -.0047031
                2001  |  -.0089187   .0024225    -3.68   0.001    -.0137979   -.0040395
                2002  |  -.0090549   .0036626    -2.47   0.017    -.0164317   -.0016782
                2003  |  -.0152978   .0030887    -4.95   0.000    -.0215186   -.0090769
                2004  |  -.0185925   .0033349    -5.58   0.000    -.0253093   -.0118756
                2005  |   -.020313   .0034217    -5.94   0.000    -.0272046   -.0134213
                2006  |  -.0228535   .0032553    -7.02   0.000      -.02941    -.016297
                2007  |  -.0224537   .0045184    -4.97   0.000    -.0315544   -.0133531
                2008  |  -.0201728    .004611    -4.37   0.000    -.0294598   -.0108858
                2009  |  -.0161717   .0060612    -2.67   0.011    -.0283796   -.0039637
                2010  |  -.0190121   .0060893    -3.12   0.003    -.0312766   -.0067475
                2011  |  -.0181388   .0057995    -3.13   0.003    -.0298195   -.0064581
                2012  |  -.0236458    .005366    -4.41   0.000    -.0344535   -.0128381
                2013  |  -.0201119   .0052785    -3.81   0.000    -.0307432   -.0094805
                2014  |  -.0244532   .0047421    -5.16   0.000    -.0340043   -.0149022
                2015  |  -.0241681   .0050352    -4.80   0.000    -.0343095   -.0140266
                2016  |  -.0217656   .0045344    -4.80   0.000    -.0308984   -.0126328
                2017  |  -.0277506   .0049504    -5.61   0.000    -.0377212   -.0177799
                2018  |  -.0303221   .0038515    -7.87   0.000    -.0380794   -.0225648
                2019  |   -.029747   .0054144    -5.49   0.000    -.0406522   -.0188419
                      |
                 nind |
                   2  |   .0340626   .0106425     3.20   0.003     .0126274    .0554977
                   3  |   .0501867   .0111201     4.51   0.000     .0277896    .0725838
                   4  |   .0405758   .0099689     4.07   0.000     .0204973    .0606543
                   5  |   .1718297   .0101024    17.01   0.000     .1514824     .192177
                   6  |   .0135945    .009268     1.47   0.149    -.0050722    .0322612
                   7  |   .0047024   .0091222     0.52   0.609    -.0136707    .0230756
                   8  |   .0216592   .0117597     1.84   0.072    -.0020261    .0453445
                   9  |   .1400637   .0173841     8.06   0.000     .1050503     .175077
                  10  |   .0075316   .0101385     0.74   0.461    -.0128885    .0279517
                  11  |   .0055084   .0160211     0.34   0.733    -.0267597    .0377765
                      |
                 educ |   .0148068    .002079     7.12   0.000     .0106195     .018994
                exper |   .0084492   .0013854     6.10   0.000     .0056589    .0112396
               exper2 |  -.0003081   .0000719    -4.29   0.000    -.0004528   -.0001634
               exper3 |   7.02e-06   2.35e-06     2.98   0.005     2.28e-06    .0000118
               exper4 |  -6.55e-08   2.54e-08    -2.58   0.013    -1.17e-07   -1.43e-08
                 edex |  -.0001283   .0000477    -2.69   0.010    -.0002245   -.0000322
                      |
                ee_cl |
                   2  |  -.0355992   .0044045    -8.08   0.000    -.0444703   -.0267282
                   3  |  -.0633163   .0066373    -9.54   0.000    -.0766844   -.0499481
                   4  |  -.0944352   .0132567    -7.12   0.000    -.1211356   -.0677349
                   5  |  -.0379173   .0059877    -6.33   0.000    -.0499773   -.0258574
                   6  |    -.04246   .0054099    -7.85   0.000    -.0533561    -.031564
                   7  |  -.0628922   .0075978    -8.28   0.000    -.0781949   -.0475894
                   8  |  -.0868404   .0128962    -6.73   0.000    -.1128148    -.060866
                   9  |   -.026483   .0059575    -4.45   0.000     -.038482   -.0144841
                  10  |  -.0448294   .0066323    -6.76   0.000    -.0581875   -.0314712
                  11  |  -.0632124   .0084876    -7.45   0.000    -.0803072   -.0461176
                  12  |  -.0784445   .0123878    -6.33   0.000    -.1033948   -.0534941
                  13  |  -.0032503   .0069848    -0.47   0.644    -.0173185    .0108179
                  14  |  -.0372131   .0073568    -5.06   0.000    -.0520305   -.0223957
                  15  |  -.0575198   .0094739    -6.07   0.000    -.0766013   -.0384383
                  16  |  -.0718004   .0131202    -5.47   0.000    -.0982258   -.0453749
                      |
                 marr |  -.0007052   .0010292    -0.69   0.497    -.0027782    .0013677
                partt |  -.0555991   .0050789   -10.95   0.000    -.0658284   -.0453698
               public |   .2848205   .0287831     9.90   0.000     .2268482    .3427927
                 cmsa |   .0234768    .002909     8.07   0.000     .0176177    .0293359
                      |
                nocc2 |
                   2  |   .0224835    .002085    10.78   0.000      .018284    .0266829
                   3  |   .0313809   .0067779     4.63   0.000     .0177295    .0450323
                   4  |    .151513   .0074019    20.47   0.000     .1366048    .1664211
                   5  |   .1367311   .0160467     8.52   0.000     .1044114    .1690508
                   6  |   .0643537   .0054162    11.88   0.000      .053445    .0752624
                   7  |    .083816   .0081086    10.34   0.000     .0674844    .1001476
                   8  |   .0565692   .0032988    17.15   0.000     .0499251    .0632132
                   9  |   .0977041   .0092556    10.56   0.000     .0790623    .1163458
                  10  |    .182797    .015261    11.98   0.000     .1520597    .2135342
                  11  |   .2115611   .0159884    13.23   0.000     .1793588    .2437635
                  12  |   .1713457   .0182079     9.41   0.000      .134673    .2080183
                      |
                unemp |  -.0008301   .0009462    -0.88   0.385    -.0027359    .0010756
                      |
              quarter |
                   2  |   -.001049   .0010267    -1.02   0.312    -.0031168    .0010188
                   3  |   .0002389   .0008398     0.28   0.777    -.0014526    .0019304
                   4  |   -.003296   .0011273    -2.92   0.005    -.0055665   -.0010254
                      |
                _cons |  -.2001199   .0344156    -5.81   0.000    -.2694364   -.1308034
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee
> _cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,850,470,240)

Linear regression                               Number of obs     =  1,013,392
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2719
                                                Root MSE          =     .29794

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0796458   .0115516     6.89   0.000     .0563798    .1029119
             treat_st |  -.0054572   .0113361    -0.48   0.633    -.0282892    .0173748
treat_stblackrelwhite |  -.0649983   .0122559    -5.30   0.000    -.0896829   -.0403137
                      |
                state |
                  RI  |  -.0325578   .0036304    -8.97   0.000    -.0398697   -.0252459
                  CT  |  -.0898377   .0065921   -13.63   0.000    -.1031148   -.0765605
                  NY  |   .0262893   .0051053     5.15   0.000     .0160068    .0365719
                  NJ  |   .1425657   .0053295    26.75   0.000     .1318315    .1532998
                  PA  |   .1454152   .0067737    21.47   0.000     .1317723     .159058
                  OH  |   .1344025   .0050617    26.55   0.000     .1242078    .1445972
                  IN  |   .1430481   .0368703     3.88   0.000     .0687875    .2173086
                  IL  |   .0402271   .0055041     7.31   0.000     .0291413     .051313
                  MI  |   .1397597   .0335041     4.17   0.000     .0722789    .2072405
                  WI  |   .3318114   .0280273    11.84   0.000     .2753616    .3882612
                  MN  |   .1842756    .004721    39.03   0.000     .1747671    .1937842
                  IA  |   .0757286   .0142958     5.30   0.000     .0469353    .1045218
                  MO  |   .0506792   .0051036     9.93   0.000        .0404    .0609584
                  ND  |   .0418633   .0161669     2.59   0.013     .0093016    .0744251
                  SD  |   .0280478   .0131975     2.13   0.039     .0014668    .0546289
                  NE  |   .1285014   .0130343     9.86   0.000      .102249    .1547538
                  KS  |  -.0104428   .0128333    -0.81   0.420    -.0362905    .0154048
                  DE  |   .0491664   .0191204     2.57   0.014      .010656    .0876767
                  MD  |    .126788   .0078891    16.07   0.000     .1108986    .1426775
                  DC  |  -.0277349   .0367809    -0.75   0.455    -.1018155    .0463457
                  VA  |   .0452035    .014564     3.10   0.003       .01587     .074537
                  NC  |  -.1004091   .0179061    -5.61   0.000    -.1364739   -.0643443
                  SC  |   -.153705   .0169059    -9.09   0.000    -.1877553   -.1196548
                  GA  |  -.0683739   .0142068    -4.81   0.000    -.0969877     -.03976
                  FL  |   .0123849   .0122223     1.01   0.316    -.0122321    .0370019
                  KY  |  -.0675061    .019441    -3.47   0.001    -.1066624   -.0283498
                  TN  |   .0545803   .0151012     3.61   0.001     .0241648    .0849957
                  AL  |  -.0027787   .0143214    -0.19   0.847    -.0316235    .0260662
                  MS  |  -.0141744   .0158082    -0.90   0.375    -.0460138    .0176649
                  AR  |   .1417317   .0169201     8.38   0.000     .1076528    .1758106
                  LA  |  -.0193025   .0184792    -1.04   0.302    -.0565215    .0179165
                  OK  |  -.0069983   .0497303    -0.14   0.889    -.1071603    .0931637
                  TX  |  -.0814382   .0130248    -6.25   0.000    -.1076715   -.0552048
                  ID  |    .073685   .0167495     4.40   0.000     .0399498    .1074201
                  WY  |   .1417151   .0122875    11.53   0.000     .1169667    .1664634
                  CO  |  -.1681928    .004973   -33.82   0.000     -.178209   -.1581766
                  NM  |  -.1216694   .0076941   -15.81   0.000     -.137166   -.1061727
                  AZ  |  -.0230754   .0134015    -1.72   0.092    -.0500675    .0039166
                  UT  |   .1724603   .0132808    12.99   0.000     .1457114    .1992091
                  NV  |     .25391    .012992    19.54   0.000     .2277427    .2800772
                  WA  |   .1485871   .0038087    39.01   0.000      .140916    .1562581
                  OR  |   .0050818   .0043588     1.17   0.250    -.0036973     .013861
                  CA  |  -.0343037   .0032133   -10.68   0.000    -.0407756   -.0278318
                  AK  |  -.0192264   .0043511    -4.42   0.000    -.0279901   -.0104628
                  HI  |   .1702299   .0094821    17.95   0.000     .1511321    .1893278
                      |
        state#c.lyear |
                  MA  |  -.0003504   .0000552    -6.35   0.000    -.0004616   -.0002392
                  RI  |   .0001361    .000059     2.31   0.026     .0000173     .000255
                  CT  |    .000615    .000093     6.61   0.000     .0004276    .0008024
                  NY  |   .0001752   .0000358     4.90   0.000     .0001031    .0002472
                  NJ  |  -.0015514    .000048   -32.30   0.000    -.0016482   -.0014547
                  PA  |  -.0018195   .0000409   -44.48   0.000    -.0019019   -.0017371
                  OH  |   -.001846   .0000328   -56.35   0.000     -.001912     -.00178
                  IN  |  -.0023346   .0003835    -6.09   0.000     -.003107   -.0015621
                  IL  |  -.0008897    .000031   -28.73   0.000     -.000952   -.0008273
                  MI  |  -.0014563     .00034    -4.28   0.000    -.0021411   -.0007714
                  WI  |  -.0037506   .0002919   -12.85   0.000    -.0043385   -.0031627
                  MN  |  -.0019162   .0000354   -54.07   0.000    -.0019876   -.0018448
                  IA  |  -.0014055   .0000348   -40.39   0.000    -.0014756   -.0013354
                  MO  |  -.0014901   .0000453   -32.89   0.000    -.0015813   -.0013988
                  ND  |   -.001453   .0000535   -27.15   0.000    -.0015608   -.0013452
                  SD  |  -.0014419    .000025   -57.75   0.000    -.0014922   -.0013916
                  NE  |  -.0020919   .0000426   -49.05   0.000    -.0021778    -.002006
                  KS  |  -.0010957   .0000342   -32.05   0.000    -.0011646   -.0010269
                  DE  |  -.0012772   .0001246   -10.25   0.000    -.0015281   -.0010262
                  MD  |  -.0021148   .0000502   -42.12   0.000    -.0022159   -.0020136
                  DC  |   -.000858   .0002561    -3.35   0.002    -.0013737   -.0003422
                  VA  |  -.0018338    .000045   -40.76   0.000    -.0019244   -.0017432
                  NC  |  -.0006725   .0000991    -6.79   0.000     -.000872    -.000473
                  SC  |  -.0002314   .0000882    -2.62   0.012     -.000409   -.0000538
                  GA  |  -.0008358   .0000509   -16.41   0.000    -.0009384   -.0007332
                  FL  |  -.0011421   .0000298   -38.27   0.000    -.0012022    -.001082
                  KY  |  -.0004315   .0001874    -2.30   0.026    -.0008089    -.000054
                  TN  |  -.0018332   .0000633   -28.95   0.000    -.0019607   -.0017057
                  AL  |  -.0009796   .0000542   -18.06   0.000    -.0010889   -.0008704
                  MS  |  -.0014442   .0000745   -19.38   0.000    -.0015943   -.0012941
                  AR  |  -.0028069   .0000997   -28.15   0.000    -.0030077   -.0026061
                  LA  |  -.0011187   .0000874   -12.80   0.000    -.0012947   -.0009426
                  OK  |  -.0011808   .0005436    -2.17   0.035    -.0022756    -.000086
                  TX  |  -.0005766   .0000334   -17.28   0.000    -.0006438   -.0005094
                  ID  |  -.0018626   .0000743   -25.08   0.000    -.0020122    -.001713
                  WY  |  -.0028265   .0000736   -38.43   0.000    -.0029747   -.0026784
                  CO  |   .0006599   .0000737     8.96   0.000     .0005115    .0008082
                  NM  |  -.0000827   .0000747    -1.11   0.274    -.0002331    .0000678
                  AZ  |  -.0009509   .0000406   -23.43   0.000    -.0010327   -.0008692
                  UT  |  -.0028124   .0000361   -77.97   0.000     -.002885   -.0027397
                  NV  |  -.0026487   .0000599   -44.19   0.000    -.0027694    -.002528
                  WA  |  -.0013458   .0000313   -43.06   0.000    -.0014088   -.0012829
                  OR  |  -.0001243   .0000468    -2.66   0.011    -.0002186   -.0000301
                  CA  |   .0002632   .0000604     4.36   0.000     .0001415    .0003848
                  AK  |   .0003402   .0000855     3.98   0.000      .000168    .0005124
                  HI  |  -.0016584   .0001328   -12.49   0.000    -.0019259   -.0013909
                      |
                 nind |
                   2  |   .0333521   .0106768     3.12   0.003     .0118479    .0548564
                   3  |   .0499359   .0110811     4.51   0.000     .0276175    .0722544
                   4  |   .0399846   .0099455     4.02   0.000     .0199535    .0600158
                   5  |   .1710743   .0100711    16.99   0.000     .1507901    .1913585
                   6  |   .0131897   .0092509     1.43   0.161    -.0054426    .0318221
                   7  |   .0041359   .0091037     0.45   0.652       -.0142    .0224717
                   8  |   .0211513   .0117723     1.80   0.079    -.0025593     .044862
                   9  |   .1395187   .0174022     8.02   0.000     .1044689    .1745686
                  10  |   .0070355   .0100343     0.70   0.487    -.0131746    .0272456
                  11  |   .0048036   .0160373     0.30   0.766    -.0274971    .0371044
                      |
                 educ |   .0147125   .0019984     7.36   0.000     .0106874    .0187376
                exper |   .0084949   .0013864     6.13   0.000     .0057026    .0112872
               exper2 |  -.0003114   .0000711    -4.38   0.000    -.0004547   -.0001682
               exper3 |   7.10e-06   2.33e-06     3.04   0.004     2.39e-06    .0000118
               exper4 |  -6.59e-08   2.52e-08    -2.61   0.012    -1.17e-07   -1.51e-08
                 edex |  -.0001284   .0000479    -2.68   0.010    -.0002248   -.0000319
                      |
                ee_cl |
                   2  |  -.0358633   .0043743    -8.20   0.000    -.0446736   -.0270529
                   3  |  -.0631579   .0065308    -9.67   0.000    -.0763117   -.0500041
                   4  |  -.0942388   .0130051    -7.25   0.000    -.1204324   -.0680452
                   5  |  -.0384705   .0062075    -6.20   0.000     -.050973    -.025968
                   6  |   -.042892   .0055066    -7.79   0.000    -.0539829   -.0318012
                   7  |  -.0625191   .0075314    -8.30   0.000    -.0776881   -.0473502
                   8  |  -.0865049   .0127053    -6.81   0.000    -.1120948    -.060915
                   9  |  -.0270135   .0061922    -4.36   0.000    -.0394852   -.0145418
                  10  |  -.0450858   .0066491    -6.78   0.000    -.0584778   -.0316937
                  11  |  -.0629568   .0084158    -7.48   0.000    -.0799072   -.0460065
                  12  |  -.0780886   .0121667    -6.42   0.000    -.1025936   -.0535837
                  13  |  -.0037789   .0071866    -0.53   0.602    -.0182536    .0106957
                  14  |   -.037228   .0073406    -5.07   0.000    -.0520127   -.0224433
                  15  |  -.0574548   .0093706    -6.13   0.000    -.0763281   -.0385815
                  16  |  -.0718545   .0128665    -5.58   0.000    -.0977689     -.04594
                      |
                 marr |   -.000718    .001024    -0.70   0.487    -.0027805    .0013445
                partt |  -.0556155    .005051   -11.01   0.000    -.0657888   -.0454422
               public |   .2848374   .0287899     9.89   0.000     .2268516    .3428233
                 cmsa |   .0236274    .003081     7.67   0.000     .0174218    .0298329
                      |
                nocc2 |
                   2  |   .0226254   .0020786    10.88   0.000     .0184388    .0268119
                   3  |    .031409   .0067705     4.64   0.000     .0177724    .0450456
                   4  |   .1513584   .0074155    20.41   0.000     .1364227     .166294
                   5  |   .1367373   .0160616     8.51   0.000     .1043875    .1690871
                   6  |   .0643422   .0054338    11.84   0.000     .0533979    .0752864
                   7  |   .0838838   .0080795    10.38   0.000     .0676109    .1001567
                   8  |   .0565414   .0032927    17.17   0.000     .0499097    .0631732
                   9  |    .097534   .0092383    10.56   0.000     .0789272    .1161408
                  10  |   .1823295    .015159    12.03   0.000     .1517977    .2128613
                  11  |   .2115439   .0160521    13.18   0.000     .1792133    .2438746
                  12  |   .1713921   .0182183     9.41   0.000     .1346986    .2080856
                      |
                unemp |   .0000514   .0003284     0.16   0.876    -.0006099    .0007128
                      |
              quarter |
                   2  |  -.0011143   .0010342    -1.08   0.287    -.0031974    .0009688
                   3  |   .0001848   .0008673     0.21   0.832    -.0015621    .0019318
                   4  |  -.0033306   .0011421    -2.92   0.006    -.0056309   -.0010302
                      |
                _cons |  -.1806781   .0325528    -5.55   0.000    -.2462429   -.1151134
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 9,055,624,176)

Linear regression                               Number of obs     =  1,005,865
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5105
                                                Root MSE          =     .41797

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1440035   .0064708   -22.25   0.000    -.1570363   -.1309707
             treat_st |  -.0377384   .0182338    -2.07   0.044     -.074463   -.0010137
treat_stblackrelwhite |  -.0219352   .0088436    -2.48   0.017    -.0397471   -.0041234
                      |
                state |
                  RI  |  -.0875147   .0008978   -97.48   0.000    -.0893229   -.0857065
                  CT  |   .0134078   .0006281    21.35   0.000     .0121427    .0146729
                  NY  |  -.0195141   .0013371   -14.59   0.000    -.0222071   -.0168211
                  NJ  |   .0514732   .0007097    72.53   0.000     .0500439    .0529026
                  PA  |  -.1071696   .0021527   -49.78   0.000    -.1115053   -.1028339
                  OH  |  -.1356296   .0025819   -52.53   0.000    -.1408299   -.1304293
                  IN  |  -.1105741    .005992   -18.45   0.000    -.1226427   -.0985056
                  IL  |  -.0378237   .0015356   -24.63   0.000    -.0409166   -.0347309
                  MI  |  -.0717838    .003866   -18.57   0.000    -.0795703   -.0639973
                  WI  |  -.0957459   .0051823   -18.48   0.000    -.1061836   -.0853083
                  MN  |  -.0503888   .0024131   -20.88   0.000     -.055249   -.0455286
                  IA  |  -.0946582   .0208381    -4.54   0.000    -.1366283   -.0526881
                  MO  |  -.1382634   .0026528   -52.12   0.000    -.1436063   -.1329204
                  ND  |  -.0841379   .0226687    -3.71   0.001    -.1297951   -.0384807
                  SD  |  -.1532972   .0217522    -7.05   0.000    -.1971084    -.109486
                  NE  |  -.1387499   .0199687    -6.95   0.000    -.1789691   -.0985308
                  KS  |  -.1186304   .0195576    -6.07   0.000    -.1580215   -.0792393
                  DE  |  -.0614764   .0099448    -6.18   0.000    -.0815062   -.0414465
                  MD  |   .0069432   .0016843     4.12   0.000     .0035508    .0103355
                  DC  |   .0526143   .0042436    12.40   0.000     .0440672    .0611613
                  VA  |    .003599   .0190386     0.19   0.851    -.0347468    .0419447
                  NC  |  -.1104449    .019425    -5.69   0.000     -.149569   -.0713209
                  SC  |  -.1317652    .019402    -6.79   0.000    -.1708429   -.0926875
                  GA  |  -.0624128   .0192619    -3.24   0.002    -.1012084   -.0236173
                  FL  |  -.1303518   .0189546    -6.88   0.000    -.1685284   -.0921753
                  KY  |  -.1600802   .0052135   -30.70   0.000    -.1705808   -.1495797
                  TN  |  -.1479466   .0191559    -7.72   0.000    -.1865285   -.1093647
                  AL  |  -.1251696    .019677    -6.36   0.000    -.1648011   -.0855381
                  MS  |  -.1518894   .0208972    -7.27   0.000    -.1939786   -.1098003
                  AR  |  -.1916174   .0203307    -9.43   0.000    -.2325656   -.1506693
                  LA  |  -.0979002      .0192    -5.10   0.000    -.1365709   -.0592295
                  OK  |  -.1731493   .0110807   -15.63   0.000    -.1954669   -.1508317
                  TX  |  -.0585789   .0188387    -3.11   0.003     -.096522   -.0206358
                  ID  |  -.1181608   .0205476    -5.75   0.000    -.1595456   -.0767759
                  WY  |   .0479515    .023176     2.07   0.044     .0012727    .0946303
                  CO  |  -.0844846   .0008941   -94.49   0.000    -.0862855   -.0826837
                  NM  |  -.1536551   .0034772   -44.19   0.000    -.1606584   -.1466517
                  AZ  |  -.0878721   .0187151    -4.70   0.000    -.1255663   -.0501779
                  UT  |  -.1133932   .0186997    -6.06   0.000    -.1510563   -.0757302
                  NV  |  -.0082728   .0189855    -0.44   0.665    -.0465116     .029966
                  WA  |  -.0205207   .0012375   -16.58   0.000    -.0230132   -.0180282
                  OR  |  -.0935738   .0018968   -49.33   0.000    -.0973941   -.0897535
                  CA  |   .0400676   .0006249    64.12   0.000      .038809    .0413262
                  AK  |    .120946   .0043519    27.79   0.000     .1121807    .1297113
                  HI  |  -.0025451    .003462    -0.74   0.466    -.0095179    .0044277
                      |
                 year |
                1990  |  -.0129936   .0026901    -4.83   0.000    -.0184117   -.0075754
                1991  |  -.0274933   .0035018    -7.85   0.000    -.0345464   -.0204403
                1992  |  -.0279816   .0032502    -8.61   0.000    -.0345278   -.0214354
                1993  |  -.0354709   .0034489   -10.28   0.000    -.0424172   -.0285245
                1996  |  -.0371249   .0053103    -6.99   0.000    -.0478204   -.0264293
                1997  |   -.021093   .0053312    -3.96   0.000    -.0318306   -.0103554
                1998  |   .0016529   .0046134     0.36   0.722    -.0076389    .0109447
                1999  |   .0242698   .0060034     4.04   0.000     .0121783    .0363614
                2000  |   .0321164   .0053765     5.97   0.000     .0212875    .0429452
                2001  |   .0469117   .0055984     8.38   0.000      .035636    .0581874
                2002  |   .0534853   .0056363     9.49   0.000     .0421332    .0648374
                2003  |   .0436335   .0059399     7.35   0.000       .03167     .055597
                2004  |   .0355893   .0054014     6.59   0.000     .0247104    .0464683
                2005  |   .0219311   .0059419     3.69   0.001     .0099636    .0338986
                2006  |   .0178761   .0062087     2.88   0.006     .0053711     .030381
                2007  |   .0188892   .0072441     2.61   0.012     .0042989    .0334795
                2008  |   .0138922   .0076318     1.82   0.075    -.0014789    .0292634
                2009  |   .0261996   .0081102     3.23   0.002     .0098647    .0425344
                2010  |   .0174373   .0079566     2.19   0.034      .001412    .0334627
                2011  |  -.0052266   .0074929    -0.70   0.489    -.0203181    .0098649
                2012  |  -.0069623   .0087949    -0.79   0.433    -.0246762    .0107516
                2013  |  -.0090516   .0087921    -1.03   0.309    -.0267597    .0086566
                2014  |   -.010743   .0090565    -1.19   0.242    -.0289837    .0074976
                2015  |   .0102097   .0071539     1.43   0.160    -.0041989    .0246183
                2016  |   .0244123   .0075019     3.25   0.002     .0093026     .039522
                2017  |   .0307854   .0081381     3.78   0.000     .0143943    .0471765
                2018  |   .0400023   .0079449     5.03   0.000     .0240005    .0560041
                2019  |   .0600599   .0078653     7.64   0.000     .0442183    .0759015
                      |
                 nind |
                   2  |    .091125   .0266713     3.42   0.001     .0374062    .1448439
                   3  |   .1107263   .0219654     5.04   0.000     .0664858    .1549668
                   4  |  -.0730505   .0238117    -3.07   0.004    -.1210096   -.0250913
                   5  |   .1493185   .0233093     6.41   0.000     .1023711    .1962659
                   6  |   .1047686   .0260464     4.02   0.000     .0523084    .1572287
                   7  |   .0086378   .0252117     0.34   0.733    -.0421411    .0594167
                   8  |  -.0504319   .0252723    -2.00   0.052    -.1013329    .0004691
                   9  |  -.0573434   .0282204    -2.03   0.048    -.1141822   -.0005047
                  10  |  -.0886777   .0262266    -3.38   0.002    -.1415007   -.0358546
                  11  |   .1241705   .0262441     4.73   0.000     .0713121    .1770288
                      |
                 educ |   .0678797   .0017143    39.60   0.000      .064427    .0713324
                exper |   .0460048   .0017966    25.61   0.000     .0423863    .0496233
               exper2 |   -.000978   .0000955   -10.24   0.000    -.0011704   -.0007855
               exper3 |   5.54e-06   2.80e-06     1.98   0.054    -9.17e-08    .0000112
               exper4 |   2.66e-08   2.98e-08     0.89   0.376    -3.34e-08    8.67e-08
                 edex |   -.000452   .0000633    -7.15   0.000    -.0005795   -.0003246
                      |
                ee_cl |
                   2  |  -.0585362   .0046065   -12.71   0.000    -.0678141   -.0492583
                   3  |   -.067133   .0061085   -10.99   0.000    -.0794361   -.0548298
                   4  |   -.024971   .0107884    -2.31   0.025       -.0467    -.003242
                   5  |    -.13338    .005821   -22.91   0.000     -.145104    -.121656
                   6  |  -.0846117   .0055646   -15.21   0.000    -.0958195   -.0734039
                   7  |  -.0603181   .0068322    -8.83   0.000    -.0740788   -.0465573
                   8  |   .0293112   .0116485     2.52   0.015     .0058499    .0527724
                   9  |  -.1528071   .0074398   -20.54   0.000    -.1677915   -.1378226
                  10  |  -.0958195   .0079215   -12.10   0.000    -.1117742   -.0798648
                  11  |  -.0570156   .0082901    -6.88   0.000    -.0737127   -.0403186
                  12  |   .0320026   .0117562     2.72   0.009     .0083245    .0556808
                  13  |  -.0766159   .0127568    -6.01   0.000    -.1023094   -.0509224
                  14  |   -.074903   .0097017    -7.72   0.000    -.0944432   -.0553627
                  15  |  -.0468956   .0095617    -4.90   0.000    -.0661537   -.0276374
                  16  |   .0308623   .0128504     2.40   0.021     .0049803    .0567443
                      |
                 marr |   .1235482   .0023648    52.24   0.000     .1187851    .1283112
                partt |   -.209299   .0062401   -33.54   0.000    -.2218673   -.1967307
               public |   .0166052    .007502     2.21   0.032     .0014954     .031715
                 cmsa |   .1452421   .0090708    16.01   0.000     .1269726    .1635115
                      |
                nocc2 |
                   2  |  -.1394958    .003612   -38.62   0.000    -.1467708   -.1322208
                   3  |   -.038991   .0060305    -6.47   0.000    -.0511369    -.026845
                   4  |  -.2907923   .0094796   -30.68   0.000    -.3098851   -.2716994
                   5  |  -.0784406   .0069938   -11.22   0.000     -.092527   -.0643543
                   6  |  -.3674965   .0062848   -58.47   0.000    -.3801548   -.3548383
                   7  |  -.2291937   .0053208   -43.08   0.000    -.2399103   -.2184771
                   8  |  -.0996179    .010788    -9.23   0.000    -.1213461   -.0778897
                   9  |  -.3880839   .0036126  -107.43   0.000      -.39536   -.3808078
                  10  |  -.3258452   .0050456   -64.58   0.000    -.3360075   -.3156829
                  11  |  -.2237965   .0055278   -40.49   0.000    -.2349301   -.2126629
                  12  |   -.376781   .0055675   -67.67   0.000    -.3879946   -.3655674
                      |
              quarter |
                   2  |   .0034573   .0019288     1.79   0.080    -.0004274     .007342
                   3  |   .0047992    .001901     2.52   0.015     .0009705     .008628
                   4  |   .0141535   .0015335     9.23   0.000      .011065    .0172421
                      |
                _cons |   .7350652    .030089    24.43   0.000     .6744629    .7956676
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 9,055,624,176)

Linear regression                               Number of obs     =  1,005,865
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5106
                                                Root MSE          =     .41794

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1440283    .006483   -22.22   0.000    -.1570857   -.1309709
             treat_st |  -.0395266   .0190178    -2.08   0.043    -.0778304   -.0012227
treat_stblackrelwhite |  -.0219241   .0088683    -2.47   0.017    -.0397858   -.0040624
                      |
                state |
                  RI  |  -.0809799   .0023914   -33.86   0.000    -.0857963   -.0761634
                  CT  |   .0137377   .0005795    23.71   0.000     .0125706    .0149048
                  NY  |  -.0149835   .0023014    -6.51   0.000    -.0196188   -.0103482
                  NJ  |   .0546797     .00114    47.97   0.000     .0523837    .0569757
                  PA  |  -.1049765   .0022503   -46.65   0.000    -.1095088   -.1004442
                  OH  |  -.1319268   .0026842   -49.15   0.000    -.1373331   -.1265205
                  IN  |  -.1103645   .0061036   -18.08   0.000    -.1226577   -.0980712
                  IL  |    -.03165   .0022509   -14.06   0.000    -.0361835   -.0271164
                  MI  |  -.0621151   .0054735   -11.35   0.000    -.0731392    -.051091
                  WI  |  -.0987903   .0050688   -19.49   0.000    -.1089993   -.0885813
                  MN  |  -.0562613   .0031269   -17.99   0.000    -.0625593   -.0499633
                  IA  |   -.101549   .0204675    -4.96   0.000    -.1427726   -.0603254
                  MO  |  -.1373485   .0026855   -51.14   0.000    -.1427574   -.1319397
                  ND  |  -.0947121   .0220049    -4.30   0.000    -.1390322    -.050392
                  SD  |  -.1633828   .0210498    -7.76   0.000    -.2057792   -.1209864
                  NE  |   -.150514   .0190557    -7.90   0.000    -.1888941   -.1121339
                  KS  |  -.1219331    .019589    -6.22   0.000    -.1613873   -.0824789
                  DE  |   -.066108   .0098021    -6.74   0.000    -.0858504   -.0463656
                  MD  |   .0043832   .0018356     2.39   0.021     .0006861    .0080804
                  DC  |   .0636847   .0057857    11.01   0.000     .0520318    .0753377
                  VA  |  -.0009348   .0188183    -0.05   0.961    -.0388368    .0369672
                  NC  |   -.107297   .0204084    -5.26   0.000    -.1484016   -.0661925
                  SC  |  -.1250515   .0210169    -5.95   0.000    -.1673817   -.0827212
                  GA  |  -.0581563   .0204533    -2.84   0.007    -.0993513   -.0169612
                  FL  |  -.1258175   .0202577    -6.21   0.000    -.1666187   -.0850163
                  KY  |  -.1549278   .0058098   -26.67   0.000    -.1666294   -.1432262
                  TN  |  -.1439864   .0202984    -7.09   0.000    -.1848695   -.1031033
                  AL  |  -.1186251   .0212264    -5.59   0.000    -.1613773   -.0758729
                  MS  |  -.1405804    .023286    -6.04   0.000    -.1874809   -.0936799
                  AR  |    -.18719   .0215188    -8.70   0.000    -.2305311   -.1438489
                  LA  |   -.090196   .0209921    -4.30   0.000    -.1324762   -.0479157
                  OK  |  -.1759706   .0109643   -16.05   0.000    -.1980538   -.1538874
                  TX  |   -.054574   .0199665    -2.73   0.009    -.0947885   -.0143594
                  ID  |  -.1167572   .0212903    -5.48   0.000    -.1596381   -.0738763
                  WY  |   .0438406   .0232917     1.88   0.066    -.0030713    .0907524
                  CO  |  -.0875127    .001365   -64.11   0.000    -.0902619   -.0847635
                  NM  |   -.149102   .0038955   -38.28   0.000    -.1569479   -.1412561
                  AZ  |  -.0826937   .0201029    -4.11   0.000     -.123183   -.0422044
                  UT  |  -.1180231   .0185853    -6.35   0.000    -.1554558   -.0805905
                  NV  |  -.0016166   .0207608    -0.08   0.938     -.043431    .0401978
                  WA  |  -.0153556   .0019186    -8.00   0.000    -.0192198   -.0114913
                  OR  |  -.0862639   .0028884   -29.87   0.000    -.0920814   -.0804463
                  CA  |   .0500038   .0031513    15.87   0.000     .0436569    .0563508
                  AK  |   .1339389   .0066915    20.02   0.000     .1204616    .1474162
                  HI  |  -.0102062    .003067    -3.33   0.002    -.0163834   -.0040289
                      |
                 year |
                1990  |  -.0110419   .0027574    -4.00   0.000    -.0165955   -.0054882
                1991  |  -.0179248    .004663    -3.84   0.000    -.0273166   -.0085331
                1992  |  -.0144704   .0053526    -2.70   0.010    -.0252512   -.0036897
                1993  |   -.025794    .004265    -6.05   0.000    -.0343841    -.017204
                1996  |  -.0370045   .0049925    -7.41   0.000    -.0470599    -.026949
                1997  |   -.023822   .0047213    -5.05   0.000    -.0333313   -.0143128
                1998  |  -.0038207     .00406    -0.94   0.352     -.011998    .0043565
                1999  |   .0170894   .0052962     3.23   0.002     .0064222    .0277565
                2000  |   .0237938   .0054839     4.34   0.000     .0127487     .034839
                2001  |   .0434107   .0055155     7.87   0.000     .0323019    .0545194
                2002  |   .0568268   .0056207    10.11   0.000     .0455061    .0681475
                2003  |   .0483465   .0060225     8.03   0.000     .0362165    .0604765
                2004  |   .0375132   .0053696     6.99   0.000     .0266983    .0483282
                2005  |   .0212725    .005857     3.63   0.001     .0094759     .033069
                2006  |   .0144478   .0060563     2.39   0.021     .0022497    .0266458
                2007  |    .015077   .0072899     2.07   0.044     .0003944    .0297596
                2008  |    .017327   .0071979     2.41   0.020     .0028296    .0318243
                2009  |   .0515266   .0109622     4.70   0.000     .0294476    .0736056
                2010  |   .0449856   .0093639     4.80   0.000     .0261257    .0638455
                2011  |   .0178093   .0092197     1.93   0.060    -.0007602    .0363788
                2012  |   .0105065   .0103218     1.02   0.314    -.0102827    .0312956
                2013  |   .0044183   .0096923     0.46   0.651    -.0151029    .0239396
                2014  |   -.004963   .0087297    -0.57   0.573    -.0225455    .0126195
                2015  |   .0103537   .0067872     1.53   0.134    -.0033164    .0240238
                2016  |   .0221361   .0072176     3.07   0.004     .0075992     .036673
                2017  |   .0253235   .0080639     3.14   0.003     .0090819    .0415651
                2018  |    .031733   .0079906     3.97   0.000     .0156392    .0478268
                2019  |   .0504166   .0081939     6.15   0.000     .0339133      .06692
                      |
                 nind |
                   2  |   .0911197   .0266476     3.42   0.001     .0374488    .1447906
                   3  |   .1107303   .0219469     5.05   0.000      .066527    .1549336
                   4  |   -.072965   .0237785    -3.07   0.004    -.1208573   -.0250726
                   5  |   .1494211    .023259     6.42   0.000     .1025752    .1962671
                   6  |   .1048635   .0260112     4.03   0.000     .0524742    .1572528
                   7  |   .0087007   .0251796     0.35   0.731    -.0420135    .0594149
                   8  |  -.0503342    .025241    -1.99   0.052    -.1011721    .0005038
                   9  |  -.0572819   .0281945    -2.03   0.048    -.1140686   -.0004952
                  10  |  -.0885667   .0261745    -3.38   0.001    -.1412849   -.0358484
                  11  |    .124225   .0261975     4.74   0.000     .0714605    .1769895
                      |
                 educ |   .0678936   .0017142    39.61   0.000      .064441    .0713462
                exper |   .0460611   .0017941    25.67   0.000     .0424477    .0496746
               exper2 |  -.0009811   .0000961   -10.21   0.000    -.0011746   -.0007877
               exper3 |   5.64e-06   2.82e-06     2.00   0.051    -3.14e-08    .0000113
               exper4 |   2.56e-08   3.00e-08     0.85   0.399    -3.49e-08    8.60e-08
                 edex |   -.000453   .0000629    -7.20   0.000    -.0005798   -.0003263
                      |
                ee_cl |
                   2  |  -.0583891   .0046118   -12.66   0.000    -.0676777   -.0491004
                   3  |  -.0670079   .0061163   -10.96   0.000    -.0793268    -.054689
                   4  |  -.0248827   .0108071    -2.30   0.026    -.0466493   -.0031161
                   5  |  -.1334273   .0058139   -22.95   0.000    -.1451372   -.1217175
                   6  |  -.0845585   .0055309   -15.29   0.000    -.0956984   -.0734186
                   7  |  -.0601824   .0068342    -8.81   0.000    -.0739473   -.0464176
                   8  |   .0294856   .0116708     2.53   0.015     .0059794    .0529917
                   9  |  -.1527843   .0074275   -20.57   0.000     -.167744   -.1378245
                  10  |  -.0958268   .0078933   -12.14   0.000    -.1117247   -.0799289
                  11  |  -.0568731   .0083039    -6.85   0.000     -.073598   -.0401483
                  12  |   .0321828   .0117732     2.73   0.009     .0084703    .0558952
                  13  |  -.0767572   .0127229    -6.03   0.000    -.1023824    -.051132
                  14  |  -.0748899   .0096865    -7.73   0.000    -.0943994   -.0553803
                  15  |  -.0468271   .0095637    -4.90   0.000    -.0660893   -.0275649
                  16  |   .0309907     .01285     2.41   0.020     .0051096    .0568719
                      |
                 marr |   .1235653   .0023633    52.28   0.000     .1188053    .1283253
                partt |  -.2090682   .0062678   -33.36   0.000    -.2216922   -.1964443
               public |   .0166437   .0075051     2.22   0.032     .0015277    .0317597
                 cmsa |   .1451903   .0090795    15.99   0.000     .1269032    .1634775
                      |
                nocc2 |
                   2  |  -.1394806   .0036186   -38.55   0.000    -.1467688   -.1321924
                   3  |  -.0389702   .0060357    -6.46   0.000    -.0511267   -.0268137
                   4  |  -.2908004   .0094663   -30.72   0.000    -.3098665   -.2717344
                   5  |   -.078475   .0069983   -11.21   0.000    -.0925704   -.0643796
                   6  |  -.3674427   .0063107   -58.23   0.000     -.380153   -.3547324
                   7  |  -.2291406   .0053497   -42.83   0.000    -.2399155   -.2183657
                   8  |   -.099736   .0108183    -9.22   0.000    -.1215252   -.0779467
                   9  |  -.3880046   .0036077  -107.55   0.000    -.3952708   -.3807384
                  10  |  -.3258455   .0050457   -64.58   0.000    -.3360081   -.3156828
                  11  |  -.2238002   .0055237   -40.52   0.000    -.2349254   -.2126749
                  12  |  -.3767739   .0055798   -67.52   0.000    -.3880122   -.3655356
                      |
                unemp |  -.0063594   .0020055    -3.17   0.003    -.0103988     -.00232
                      |
              quarter |
                   2  |   .0034421   .0019232     1.79   0.080    -.0004314    .0073156
                   3  |   .0047929   .0019131     2.51   0.016     .0009398     .008646
                   4  |   .0141557   .0015222     9.30   0.000     .0110897    .0172216
                      |
                _cons |   .7652901   .0358557    21.34   0.000      .693073    .8375072
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all_unemp

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 9,055,624,176)

Linear regression                               Number of obs     =  1,005,865
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5100
                                                Root MSE          =      .4182

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1447601   .0063756   -22.71   0.000    -.1576012   -.1319191
             treat_st |  -.0198791   .0106114    -1.87   0.068    -.0412516    .0014934
treat_stblackrelwhite |  -.0218338   .0087644    -2.49   0.016    -.0394863   -.0041813
                      |
                state |
                  RI  |   -.026264   .0065024    -4.04   0.000    -.0393605   -.0131676
                  CT  |   .1170906   .0073174    16.00   0.000     .1023527    .1318286
                  NY  |   .1885652   .0040198    46.91   0.000      .180469    .1966615
                  NJ  |    .193792    .006417    30.20   0.000     .1808674    .2067166
                  PA  |  -.0120319   .0038922    -3.09   0.003    -.0198713   -.0041925
                  OH  |   .1571025   .0060781    25.85   0.000     .1448606    .1693444
                  IN  |   .1574229   .0406658     3.87   0.000     .0755178     .239328
                  IL  |   .1934732   .0050052    38.65   0.000     .1833922    .2035542
                  MI  |   .4987395   .0333632    14.95   0.000     .4315426    .5659365
                  WI  |  -.0493261   .0304506    -1.62   0.112    -.1106567    .0120044
                  MN  |  -.0870564    .003906   -22.29   0.000    -.0949235   -.0791893
                  IA  |  -.0887732   .0124177    -7.15   0.000    -.1137837   -.0637626
                  MO  |   .0195895   .0042482     4.61   0.000     .0110333    .0281458
                  ND  |    -1.0788   .0134176   -80.40   0.000    -1.105825   -1.051776
                  SD  |  -.5034104   .0115638   -43.53   0.000     -.526701   -.4801198
                  NE  |  -.3035107   .0115467   -26.29   0.000    -.3267669   -.2802546
                  KS  |  -.0790883    .009136    -8.66   0.000    -.0974891   -.0606875
                  DE  |   .2459192   .0146969    16.73   0.000     .2163182    .2755202
                  MD  |   -.158034   .0079157   -19.96   0.000     -.173977    -.142091
                  DC  |  -.2023169    .013055   -15.50   0.000     -.228611   -.1760228
                  VA  |  -.1059171   .0112303    -9.43   0.000    -.1285361    -.083298
                  NC  |   .0783178   .0140903     5.56   0.000     .0499385    .1066971
                  SC  |   .0767566   .0116829     6.57   0.000      .053226    .1002872
                  GA  |   .0738924   .0112142     6.59   0.000     .0513058     .096479
                  FL  |   .0563414   .0107347     5.25   0.000     .0347205    .0779623
                  KY  |   .0935057   .0197449     4.74   0.000     .0537374    .1332739
                  TN  |    .013612    .010074     1.35   0.183     -.006678    .0339021
                  AL  |  -.1088301   .0128082    -8.50   0.000    -.1346271   -.0830331
                  MS  |  -.1130821    .016205    -6.98   0.000    -.1457205   -.0804436
                  AR  |  -.0575062   .0202498    -2.84   0.007    -.0982914   -.0167211
                  LA  |  -.1368029   .0150294    -9.10   0.000    -.1670737    -.106532
                  OK  |    -.24087   .0491129    -4.90   0.000    -.3397884   -.1419515
                  TX  |  -.1311795   .0121098   -10.83   0.000    -.1555699   -.1067891
                  ID  |   .2093857   .0229956     9.11   0.000     .1630702    .2557012
                  WY  |   -.761675    .010724   -71.03   0.000    -.7832743   -.7400757
                  CO  |  -.1375127   .0031164   -44.13   0.000    -.1437895    -.131236
                  NM  |  -.3061379   .0212609   -14.40   0.000    -.3489596   -.2633163
                  AZ  |  -.1762192   .0095352   -18.48   0.000    -.1954241   -.1570142
                  UT  |   -.214905    .009817   -21.89   0.000    -.2346774   -.1951325
                  NV  |  -.0289775   .0114233    -2.54   0.015    -.0519851   -.0059698
                  WA  |  -.2086403   .0046824   -44.56   0.000    -.2180712   -.1992094
                  OR  |   .0687252   .0082719     8.31   0.000     .0520649    .0853856
                  CA  |    .135961   .0051303    26.50   0.000      .125628     .146294
                  AK  |   .6894119   .0054569   126.34   0.000     .6784212    .7004026
                  HI  |  -.0665623   .0080976    -8.22   0.000    -.0828716    -.050253
                      |
        state#c.lyear |
                  MA  |    .002582   .0000844    30.60   0.000      .002412    .0027519
                  RI  |   .0020566   .0000726    28.34   0.000     .0019104    .0022028
                  CT  |   .0015844   .0000963    16.46   0.000     .0013905    .0017782
                  NY  |    .000601   .0000601    10.00   0.000     .0004799    .0007221
                  NJ  |   .0012414   .0000729    17.02   0.000     .0010945    .0013882
                  PA  |   .0016811    .000062    27.10   0.000     .0015562    .0018061
                  OH  |  -.0002128   .0000499    -4.26   0.000    -.0003134   -.0001122
                  IN  |  -.0000482    .000409    -0.12   0.907    -.0008719    .0007755
                  IL  |   .0003924   .0000791     4.96   0.000      .000233    .0005517
                  MI  |  -.0029303   .0003381    -8.67   0.000    -.0036113   -.0022494
                  WI  |   .0020708   .0003015     6.87   0.000     .0014636    .0026779
                  MN  |   .0028813    .000064    45.02   0.000     .0027524    .0030102
                  IA  |   .0022767   .0000854    26.66   0.000     .0021047    .0024488
                  MO  |   .0010663   .0000801    13.32   0.000     .0009051    .0012276
                  ND  |   .0118561   .0000809   146.48   0.000     .0116931    .0120192
                  SD  |   .0057546   .0000494   116.53   0.000     .0056551     .005854
                  NE  |   .0038782   .0001043    37.17   0.000     .0036681    .0040884
                  KS  |   .0019876   .0000746    26.65   0.000     .0018374    .0021378
                  DE  |  -.0005788   .0001113    -5.20   0.000    -.0008029   -.0003548
                  MD  |   .0041317   .0000903    45.77   0.000     .0039499    .0043135
                  DC  |   .0051216   .0001372    37.34   0.000     .0048454    .0053979
                  VA  |   .0034192   .0001287    26.57   0.000       .00316    .0036784
                  NC  |   .0005934   .0001695     3.50   0.001      .000252    .0009347
                  SC  |   .0004378   .0001242     3.52   0.001     .0001875     .000688
                  GA  |   .0011145   .0001321     8.44   0.000     .0008486    .0013805
                  FL  |   .0006465   .0000704     9.18   0.000     .0005047    .0007884
                  KY  |   .0001647   .0002036     0.81   0.423    -.0002454    .0005748
                  TN  |   .0008689   .0001002     8.67   0.000     .0006671    .0010707
                  AL  |   .0022955   .0001133    20.27   0.000     .0020674    .0025236
                  MS  |   .0021195    .000122    17.38   0.000     .0018738    .0023652
                  AR  |   .0011416    .000187     6.10   0.000      .000765    .0015183
                  LA  |   .0028427   .0001235    23.02   0.000      .002594    .0030913
                  OK  |   .0031283    .000531     5.89   0.000     .0020588    .0041978
                  TX  |   .0031224    .000074    42.21   0.000     .0029734    .0032714
                  ID  |  -.0007335   .0002053    -3.57   0.001     -.001147     -.00032
                  WY  |    .009901   .0000633   156.49   0.000     .0097735    .0100284
                  CO  |     .00306   .0000873    35.03   0.000     .0028841     .003236
                  NM  |   .0040762   .0002364    17.24   0.000     .0036002    .0045523
                  AZ  |   .0032989   .0000923    35.72   0.000     .0031129    .0034849
                  UT  |   .0033217   .0000737    45.07   0.000     .0031733    .0034702
                  NV  |   .0026567   .0000779    34.11   0.000     .0024998    .0028135
                  WA  |   .0044299   .0000913    48.53   0.000     .0042461    .0046137
                  OR  |   .0010869   .0001251     8.69   0.000     .0008349    .0013389
                  CA  |   .0017487    .000064    27.30   0.000     .0016197    .0018776
                  AK  |  -.0028624   .0000477   -59.98   0.000    -.0029586   -.0027663
                  HI  |    .003142   .0000799    39.30   0.000      .002981    .0033031
                      |
                 nind |
                   2  |   .0933287   .0265323     3.52   0.001     .0398899    .1467674
                   3  |   .1115479   .0217939     5.12   0.000     .0676527    .1554431
                   4  |  -.0714509   .0237319    -3.01   0.004    -.1192495   -.0236523
                   5  |   .1510924   .0230954     6.54   0.000     .1045759    .1976089
                   6  |   .1064156   .0258545     4.12   0.000     .0543419    .1584893
                   7  |   .0102364   .0250152     0.41   0.684    -.0401467    .0606195
                   8  |   -.048788   .0251556    -1.94   0.059    -.0994541     .001878
                   9  |  -.0555737    .028096    -1.98   0.054     -.112162    .0010146
                  10  |  -.0869448   .0260323    -3.34   0.002    -.1393765    -.034513
                  11  |    .125405   .0261098     4.80   0.000     .0728172    .1779929
                      |
                 educ |   .0678145   .0017063    39.74   0.000      .064378    .0712511
                exper |   .0458551   .0017617    26.03   0.000     .0423068    .0494034
               exper2 |  -.0009573    .000096    -9.97   0.000    -.0011507   -.0007638
               exper3 |   4.87e-06   2.82e-06     1.73   0.091    -8.14e-07    .0000106
               exper4 |   3.23e-08   3.01e-08     1.07   0.289    -2.83e-08    9.29e-08
                 edex |  -.0004511   .0000617    -7.31   0.000    -.0005753   -.0003269
                      |
                ee_cl |
                   2  |  -.0596595   .0047163   -12.65   0.000    -.0691586   -.0501604
                   3  |  -.0679488    .006246   -10.88   0.000    -.0805288   -.0553687
                   4  |   -.025909   .0108852    -2.38   0.022     -.047833   -.0039851
                   5  |  -.1365581   .0057724   -23.66   0.000    -.1481843   -.1249319
                   6  |  -.0869368   .0054837   -15.85   0.000    -.0979816   -.0758919
                   7  |   -.061566   .0069034    -8.92   0.000    -.0754701    -.047662
                   8  |   .0286897    .011761     2.44   0.019     .0050018    .0523776
                   9  |  -.1546563   .0073632   -21.00   0.000    -.1694866   -.1398261
                  10  |  -.0966635   .0078125   -12.37   0.000    -.1123986   -.0809284
                  11  |  -.0579517   .0083405    -6.95   0.000    -.0747504   -.0411531
                  12  |   .0307284   .0118392     2.60   0.013      .006883    .0545738
                  13  |  -.0782832    .012612    -6.21   0.000     -.103685   -.0528814
                  14  |  -.0759218    .009674    -7.85   0.000    -.0954062   -.0564373
                  15  |   -.046954   .0096447    -4.87   0.000    -.0663793   -.0275287
                  16  |   .0296561   .0128194     2.31   0.025     .0038365    .0554757
                      |
                 marr |   .1233985   .0023596    52.30   0.000     .1186459     .128151
                partt |  -.2091128   .0062164   -33.64   0.000    -.2216332   -.1965924
               public |   .0164977   .0074553     2.21   0.032      .001482    .0315134
                 cmsa |    .144196   .0091603    15.74   0.000     .1257463    .1626458
                      |
                nocc2 |
                   2  |  -.1402755   .0035549   -39.46   0.000    -.1474355   -.1331155
                   3  |  -.0394558   .0060335    -6.54   0.000    -.0516078   -.0273038
                   4  |  -.2908744   .0093877   -30.98   0.000    -.3097822   -.2719665
                   5  |   -.079037   .0070023   -11.29   0.000    -.0931403   -.0649337
                   6  |  -.3678773   .0062484   -58.88   0.000    -.3804622   -.3552925
                   7  |  -.2292302   .0053694   -42.69   0.000    -.2400448   -.2184157
                   8  |  -.0990662   .0107845    -9.19   0.000    -.1207873   -.0773451
                   9  |  -.3884898   .0035747  -108.68   0.000    -.3956897     -.38129
                  10  |  -.3269425   .0048708   -67.12   0.000    -.3367529   -.3171322
                  11  |  -.2241643   .0054257   -41.31   0.000    -.2350923   -.2132363
                  12  |  -.3774738   .0055006   -68.62   0.000    -.3885526   -.3663951
                      |
                unemp |  -.0059724   .0007126    -8.38   0.000    -.0074077    -.004537
                      |
              quarter |
                   2  |   .0031657   .0019389     1.63   0.110    -.0007395    .0070709
                   3  |   .0044064   .0019156     2.30   0.026     .0005482    .0082646
                   4  |   .0136759   .0015348     8.91   0.000     .0105846    .0167672
                      |
                _cons |   .5103811   .0281364    18.14   0.000     .4537115    .5670507
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_mal_all_sltt  

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,861,640,823)

Linear regression                               Number of obs     =  1,014,977
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5034
                                                Root MSE          =     .39333

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0662639   .0065811   -10.07   0.000    -.0795189   -.0530089
             treat_st |  -.0317659   .0083432    -3.81   0.000      -.04857   -.0149619
treat_stblackrelwhite |  -.0396131    .008008    -4.95   0.000    -.0557421   -.0234842
                      |
                state |
                  RI  |  -.0757901   .0008173   -92.73   0.000    -.0774363   -.0741439
                  CT  |   .0111683    .000442    25.27   0.000      .010278    .0120587
                  NY  |  -.0352648   .0014282   -24.69   0.000    -.0381413   -.0323883
                  NJ  |   .0278817   .0008349    33.39   0.000     .0262001    .0295633
                  PA  |  -.1304168   .0018137   -71.91   0.000    -.1340698   -.1267638
                  OH  |  -.1622159   .0022458   -72.23   0.000    -.1667393   -.1576925
                  IN  |  -.1644804   .0044175   -37.23   0.000    -.1733778   -.1555831
                  IL  |  -.0979231    .001383   -70.80   0.000    -.1007087   -.0951375
                  MI  |  -.1161503   .0027386   -42.41   0.000     -.121666   -.1106345
                  WI  |  -.1116061    .004081   -27.35   0.000    -.1198256   -.1033866
                  MN  |  -.0522277    .002337   -22.35   0.000    -.0569346   -.0475207
                  IA  |  -.1271046   .0117469   -10.82   0.000    -.1507641    -.103445
                  MO  |  -.1821602   .0023032   -79.09   0.000    -.1867991   -.1775214
                  ND  |  -.1531753   .0138324   -11.07   0.000    -.1810352   -.1253155
                  SD  |  -.1742735   .0130161   -13.39   0.000    -.2004893   -.1480577
                  NE  |  -.1644856   .0103965   -15.82   0.000    -.1854252    -.143546
                  KS  |  -.1630234   .0099595   -16.37   0.000    -.1830829   -.1429639
                  DE  |   -.049198   .0088073    -5.59   0.000    -.0669369   -.0314591
                  MD  |  -.0045371   .0027077    -1.68   0.101    -.0099905    .0009164
                  DC  |   .0482178   .0055099     8.75   0.000     .0371203    .0593152
                  VA  |  -.0445493   .0087914    -5.07   0.000    -.0622561   -.0268425
                  NC  |  -.1327601   .0096235   -13.80   0.000    -.1521428   -.1133775
                  SC  |  -.1743239   .0098234   -17.75   0.000    -.1941092   -.1545386
                  GA  |  -.1045383    .009142   -11.44   0.000    -.1229511   -.0861254
                  FL  |  -.1337721   .0086586   -15.45   0.000    -.1512114   -.1163328
                  KY  |  -.1903222   .0045121   -42.18   0.000    -.1994099   -.1812344
                  TN  |  -.1757572    .009399   -18.70   0.000    -.1946879   -.1568266
                  AL  |  -.1893307   .0099884   -18.96   0.000    -.2094483   -.1692131
                  MS  |  -.2138515   .0115244   -18.56   0.000    -.2370628   -.1906402
                  AR  |  -.2144441   .0107531   -19.94   0.000     -.236102   -.1927861
                  LA  |  -.1956369   .0091907   -21.29   0.000    -.2141479   -.1771259
                  OK  |  -.2347112    .005779   -40.61   0.000    -.2463508   -.2230716
                  TX  |  -.1052258   .0086052   -12.23   0.000    -.1225575   -.0878941
                  ID  |  -.1428906   .0110724   -12.91   0.000    -.1651915   -.1205897
                  WY  |  -.0965065   .0133923    -7.21   0.000    -.1234801   -.0695329
                  CO  |  -.1060861   .0007159  -148.18   0.000     -.107528   -.1046442
                  NM  |  -.1970617   .0034324   -57.41   0.000    -.2039749   -.1901484
                  AZ  |  -.0958075   .0085428   -11.21   0.000    -.1130136   -.0786014
                  UT  |  -.1492622   .0087511   -17.06   0.000    -.1668878   -.1316366
                  NV  |  -.0327825   .0088072    -3.72   0.001     -.050521    -.015044
                  WA  |  -.0421505   .0010781   -39.10   0.000    -.0443219    -.039979
                  OR  |  -.1053888   .0016786   -62.78   0.000    -.1087697   -.1020079
                  CA  |    .024679   .0008962    27.54   0.000     .0228741     .026484
                  AK  |   .0814874   .0039073    20.86   0.000     .0736178    .0893571
                  HI  |  -.0277942   .0025825   -10.76   0.000    -.0329956   -.0225927
                      |
                 year |
                1990  |  -.0060899   .0027813    -2.19   0.034    -.0116917   -.0004881
                1991  |  -.0032282   .0024728    -1.31   0.198    -.0082087    .0017524
                1992  |   .0156126   .0030691     5.09   0.000     .0094311    .0217942
                1993  |   .0132109   .0034659     3.81   0.000     .0062303    .0201916
                1996  |   .0030905   .0040034     0.77   0.444    -.0049728    .0111539
                1997  |   .0160282   .0037074     4.32   0.000     .0085611    .0234952
                1998  |    .044891   .0033691    13.32   0.000     .0381053    .0516766
                1999  |   .0615825   .0039677    15.52   0.000     .0535911    .0695739
                2000  |   .0748469   .0042153    17.76   0.000     .0663568     .083337
                2001  |   .0861502   .0044974    19.16   0.000     .0770919    .0952085
                2002  |   .0986059   .0046749    21.09   0.000     .0891902    .1080216
                2003  |   .1045559   .0044016    23.75   0.000     .0956907    .1134212
                2004  |   .0958171   .0046982    20.39   0.000     .0863545    .1052796
                2005  |   .0860132    .004953    17.37   0.000     .0760373     .095989
                2006  |   .0816628   .0044218    18.47   0.000     .0727569    .0905686
                2007  |   .0814631    .005345    15.24   0.000     .0706976    .0922285
                2008  |   .0739299   .0063314    11.68   0.000     .0611778    .0866821
                2009  |   .0910919   .0050067    18.19   0.000     .0810079    .1011758
                2010  |   .0887519   .0052428    16.93   0.000     .0781924    .0993114
                2011  |   .0703355    .005395    13.04   0.000     .0594694    .0812015
                2012  |   .0528586   .0062829     8.41   0.000     .0402041    .0655131
                2013  |   .0555621    .006482     8.57   0.000     .0425067    .0686175
                2014  |   .0510192   .0060959     8.37   0.000     .0387415    .0632969
                2015  |   .0662669   .0053703    12.34   0.000     .0554507    .0770831
                2016  |   .0787006   .0064311    12.24   0.000     .0657476    .0916535
                2017  |   .0870581   .0071661    12.15   0.000     .0726249    .1014914
                2018  |   .0910774   .0066487    13.70   0.000     .0776864    .1044685
                2019  |    .102572   .0062216    16.49   0.000     .0900411     .115103
                      |
                 nind |
                   2  |   .0612394    .042089     1.45   0.153    -.0235321    .1460109
                   3  |   .1356273   .0394737     3.44   0.001     .0561233    .2151314
                   4  |  -.0817336   .0399782    -2.04   0.047    -.1622539   -.0012134
                   5  |   .1584841   .0386656     4.10   0.000     .0806075    .2363606
                   6  |   .0910492   .0403053     2.26   0.029     .0098702    .1722282
                   7  |   .0365773   .0417005     0.88   0.385    -.0474119    .1205665
                   8  |  -.0174593   .0427576    -0.41   0.685    -.1035774    .0686589
                   9  |  -.0698089   .0460221    -1.52   0.136    -.1625022    .0228845
                  10  |  -.0789251   .0408264    -1.93   0.060    -.1611537    .0033035
                  11  |   .0731418   .0425474     1.72   0.092    -.0125531    .1588367
                      |
                 educ |   .0914187   .0023683    38.60   0.000     .0866488    .0961886
                exper |   .0480987    .002159    22.28   0.000     .0437502    .0524472
               exper2 |  -.0015847    .000098   -16.17   0.000    -.0017821   -.0013873
               exper3 |   .0000248   2.75e-06     8.99   0.000     .0000192    .0000303
               exper4 |  -1.31e-07   2.80e-08    -4.70   0.000    -1.88e-07   -7.51e-08
                 edex |  -.0005274   .0000914    -5.77   0.000    -.0007114   -.0003433
                      |
                ee_cl |
                   2  |  -.1255764   .0051872   -24.21   0.000    -.1360241   -.1151288
                   3  |   -.163209   .0078988   -20.66   0.000     -.179118   -.1472999
                   4  |  -.1668591   .0126301   -13.21   0.000    -.1922975   -.1414208
                   5  |  -.1532474   .0083154   -18.43   0.000    -.1699956   -.1364992
                   6  |  -.1680794   .0089181   -18.85   0.000    -.1860415   -.1501174
                   7  |  -.1754521   .0103194   -17.00   0.000    -.1962364   -.1546678
                   8  |  -.1096181   .0132857    -8.25   0.000    -.1363769   -.0828593
                   9  |  -.1542778   .0102089   -15.11   0.000    -.1748396    -.133716
                  10  |  -.1755843   .0110781   -15.85   0.000    -.1978969   -.1532718
                  11  |   -.169347   .0114148   -14.84   0.000    -.1923374   -.1463565
                  12  |  -.1159645   .0120195    -9.65   0.000     -.140173    -.091756
                  13  |  -.1082957   .0149212    -7.26   0.000    -.1383485    -.078243
                  14  |  -.1555283     .01174   -13.25   0.000    -.1791739   -.1318826
                  15  |   -.136802   .0120735   -11.33   0.000    -.1611193   -.1124846
                  16  |   -.101732   .0124685    -8.16   0.000    -.1268448   -.0766192
                      |
                 marr |   .0338026   .0022342    15.13   0.000     .0293027    .0383025
                partt |   -.140965   .0033555   -42.01   0.000    -.1477233   -.1342066
               public |   .0609771   .0060999    10.00   0.000     .0486913    .0732628
                 cmsa |   .1535769   .0081182    18.92   0.000     .1372261    .1699278
                      |
                nocc2 |
                   2  |  -.1309372   .0030605   -42.78   0.000    -.1371013    -.124773
                   3  |  -.0392128    .006928    -5.66   0.000    -.0531664   -.0252591
                   4  |  -.2794891   .0067101   -41.65   0.000     -.293004   -.2659742
                   5  |   .0505854   .0063144     8.01   0.000     .0378676    .0633032
                   6  |  -.3243255   .0043905   -73.87   0.000    -.3331685   -.3154826
                   7  |   -.349726   .0043079   -81.18   0.000    -.3584025   -.3410495
                   8  |  -.1641052   .0078559   -20.89   0.000    -.1799277   -.1482827
                   9  |    -.40388   .0052297   -77.23   0.000    -.4144132   -.3933467
                  10  |  -.4083581   .0092255   -44.26   0.000    -.4269392    -.389777
                  11  |   -.165142   .0088922   -18.57   0.000    -.1830518   -.1472323
                  12  |  -.3809304   .0078437   -48.57   0.000    -.3967284   -.3651325
                      |
              quarter |
                   2  |   .0087045   .0013582     6.41   0.000     .0059688    .0114401
                   3  |   .0177017   .0016833    10.52   0.000     .0143114    .0210919
                   4  |   .0205348   .0011531    17.81   0.000     .0182124    .0228572
                      |
                _cons |   .4271138   .0450294     9.49   0.000     .3364199    .5178077
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,861,640,823)

Linear regression                               Number of obs     =  1,014,977
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5034
                                                Root MSE          =     .39332

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0662754    .006579   -10.07   0.000    -.0795261   -.0530248
             treat_st |  -.0325246   .0087242    -3.73   0.001    -.0500961   -.0149531
treat_stblackrelwhite |  -.0396147   .0080114    -4.94   0.000    -.0557505   -.0234789
                      |
                state |
                  RI  |  -.0730397   .0017801   -41.03   0.000     -.076625   -.0694543
                  CT  |    .011358   .0004588    24.75   0.000     .0104339    .0122821
                  NY  |  -.0333663   .0017263   -19.33   0.000    -.0368432   -.0298894
                  NJ  |   .0292465   .0010203    28.66   0.000     .0271914    .0313015
                  PA  |   -.129479   .0018889   -68.55   0.000    -.1332835   -.1256745
                  OH  |  -.1606259   .0024163   -66.48   0.000    -.1654925   -.1557592
                  IN  |  -.1642898   .0044651   -36.79   0.000     -.173283   -.1552965
                  IL  |  -.0953427   .0017356   -54.93   0.000    -.0988385   -.0918469
                  MI  |  -.1121085   .0036023   -31.12   0.000    -.1193639   -.1048531
                  WI  |  -.1127436   .0040933   -27.54   0.000     -.120988   -.1044992
                  MN  |  -.0545774   .0026142   -20.88   0.000    -.0598427    -.049312
                  IA  |  -.1298567     .01182   -10.99   0.000    -.1536634     -.10605
                  MO  |  -.1817393   .0023202   -78.33   0.000    -.1864124   -.1770662
                  ND  |  -.1573807   .0138563   -11.36   0.000    -.1852887   -.1294727
                  SD  |  -.1783297   .0130552   -13.66   0.000    -.2046243   -.1520352
                  NE  |  -.1692048   .0104445   -16.20   0.000    -.1902412   -.1481684
                  KS  |  -.1642597   .0101086   -16.25   0.000    -.1846194      -.1439
                  DE  |  -.0509945   .0088166    -5.78   0.000    -.0687521   -.0332369
                  MD  |  -.0055519   .0028358    -1.96   0.056    -.0112635    .0001597
                  DC  |   .0528141   .0054572     9.68   0.000     .0418228    .0638054
                  VA  |  -.0463449   .0089019    -5.21   0.000    -.0642742   -.0284156
                  NC  |  -.1312746   .0100771   -13.03   0.000     -.151571   -.1109782
                  SC  |  -.1714323   .0105226   -16.29   0.000    -.1926258   -.1502387
                  GA  |  -.1027035   .0096688   -10.62   0.000    -.1221775   -.0832296
                  FL  |  -.1318651   .0092359   -14.28   0.000     -.150467   -.1132631
                  KY  |  -.1881494   .0047896   -39.28   0.000    -.1977961   -.1785026
                  TN  |  -.1740503   .0098945   -17.59   0.000     -.193979   -.1541217
                  AL  |   -.186604   .0106342   -17.55   0.000    -.2080224   -.1651857
                  MS  |  -.2091436   .0124633   -16.78   0.000    -.2342459   -.1840413
                  AR  |  -.2125893   .0112393   -18.91   0.000    -.2352264   -.1899522
                  LA  |  -.1924578   .0099885   -19.27   0.000    -.2125756     -.17234
                  OK  |  -.2358167   .0058227   -40.50   0.000    -.2475442   -.2240893
                  TX  |  -.1035222   .0091326   -11.34   0.000    -.1219162   -.0851282
                  ID  |  -.1422829   .0113932   -12.49   0.000      -.16523   -.1193359
                  WY  |  -.0981554   .0135411    -7.25   0.000    -.1254285   -.0708822
                  CO  |  -.1072609    .001038  -103.34   0.000    -.1093515   -.1051702
                  NM  |  -.1952745   .0036304   -53.79   0.000    -.2025866   -.1879624
                  AZ  |  -.0935965    .009163   -10.21   0.000    -.1120516   -.0751414
                  UT  |  -.1510787   .0088856   -17.00   0.000    -.1689752   -.1331822
                  NV  |  -.0299682   .0095493    -3.14   0.003    -.0492014    -.010735
                  WA  |  -.0399693   .0015628   -25.58   0.000     -.043117   -.0368217
                  OR  |  -.1023232   .0023806   -42.98   0.000    -.1071179   -.0975284
                  CA  |   .0288237   .0022148    13.01   0.000     .0243628    .0332846
                  AK  |   .0868696   .0047124    18.43   0.000     .0773784    .0963608
                  HI  |  -.0308325   .0028815   -10.70   0.000    -.0366361    -.025029
                      |
                 year |
                1990  |  -.0052515   .0027882    -1.88   0.066    -.0108672    .0003643
                1991  |   .0007212   .0031366     0.23   0.819    -.0055963    .0070388
                1992  |   .0211836   .0040592     5.22   0.000     .0130079    .0293593
                1993  |   .0172242   .0039241     4.39   0.000     .0093205    .0251278
                1996  |   .0031914   .0042095     0.76   0.452    -.0052869    .0116698
                1997  |   .0149734    .003715     4.03   0.000      .007491    .0224558
                1998  |   .0426936   .0038642    11.05   0.000     .0349108    .0504765
                1999  |   .0586998   .0037918    15.48   0.000     .0510627    .0663369
                2000  |    .071493   .0042575    16.79   0.000      .062918     .080068
                2001  |   .0847559   .0045081    18.80   0.000     .0756762    .0938356
                2002  |   .0999824   .0047902    20.87   0.000     .0903345    .1096303
                2003  |   .1065072   .0047162    22.58   0.000     .0970082    .1160061
                2004  |   .0966494   .0047603    20.30   0.000     .0870616    .1062372
                2005  |   .0858046   .0050884    16.86   0.000      .075556    .0960532
                2006  |   .0802878   .0045253    17.74   0.000     .0711733    .0894023
                2007  |   .0799691   .0054111    14.78   0.000     .0690707    .0908676
                2008  |   .0754024   .0063268    11.92   0.000     .0626596    .0881453
                2009  |   .1015492   .0072807    13.95   0.000      .086885    .1162134
                2010  |   .1000743   .0064787    15.45   0.000     .0870257     .113123
                2011  |   .0797848    .005471    14.58   0.000     .0687657     .090804
                2012  |   .0600691   .0059919    10.03   0.000     .0480008    .0721374
                2013  |   .0611323   .0063649     9.60   0.000     .0483128    .0739519
                2014  |   .0534455    .005801     9.21   0.000     .0417617    .0651293
                2015  |      .0664   .0052792    12.58   0.000     .0557672    .0770329
                2016  |   .0778372   .0063239    12.31   0.000     .0651002    .0905742
                2017  |   .0848796   .0073784    11.50   0.000     .0700188    .0997404
                2018  |   .0877493   .0073135    12.00   0.000     .0730192    .1024794
                2019  |   .0986962   .0068594    14.39   0.000     .0848806    .1125119
                      |
                 nind |
                   2  |   .0611028    .042104     1.45   0.154    -.0236991    .1459047
                   3  |   .1355246   .0394917     3.43   0.001     .0559843    .2150649
                   4  |  -.0817881   .0399868    -2.05   0.047    -.1623256   -.0012505
                   5  |    .158441   .0386622     4.10   0.000     .0805713    .2363108
                   6  |   .0909867    .040319     2.26   0.029     .0097801    .1721933
                   7  |   .0364951     .04171     0.87   0.386    -.0475131    .1205032
                   8  |  -.0175191   .0427667    -0.41   0.684    -.1036556    .0686174
                   9  |  -.0698973   .0460439    -1.52   0.136    -.1626345    .0228398
                  10  |  -.0789932   .0408303    -1.93   0.059    -.1612297    .0032433
                  11  |    .073029   .0425662     1.72   0.093    -.0127037    .1587618
                      |
                 educ |   .0914145   .0023725    38.53   0.000     .0866361    .0961928
                exper |   .0481124   .0021577    22.30   0.000     .0437667    .0524582
               exper2 |  -.0015858   .0000979   -16.20   0.000     -.001783   -.0013887
               exper3 |   .0000248   2.75e-06     9.01   0.000     .0000193    .0000304
               exper4 |  -1.32e-07   2.79e-08    -4.72   0.000    -1.88e-07   -7.55e-08
                 edex |  -.0005273   .0000914    -5.77   0.000    -.0007114   -.0003433
                      |
                ee_cl |
                   2  |  -.1255353   .0051993   -24.14   0.000    -.1360073   -.1150633
                   3  |  -.1631426   .0079129   -20.62   0.000    -.1790801   -.1472052
                   4  |  -.1667946   .0126554   -13.18   0.000    -.1922839   -.1413053
                   5  |  -.1532754   .0083111   -18.44   0.000    -.1700148   -.1365361
                   6  |  -.1680589   .0089301   -18.82   0.000     -.186045   -.1500729
                   7  |  -.1753812   .0103314   -16.98   0.000    -.1961896   -.1545727
                   8  |   -.109552   .0133113    -8.23   0.000    -.1363624   -.0827417
                   9  |  -.1542756   .0102207   -15.09   0.000    -.1748612     -.13369
                  10  |  -.1755569   .0110797   -15.84   0.000    -.1978727   -.1532411
                  11  |  -.1692669   .0114257   -14.81   0.000    -.1922795   -.1462543
                  12  |  -.1158898   .0120389    -9.63   0.000    -.1401374   -.0916421
                  13  |  -.1082692   .0149332    -7.25   0.000    -.1383463   -.0781922
                  14  |  -.1554616   .0117413   -13.24   0.000    -.1791098   -.1318133
                  15  |   -.136716   .0120814   -11.32   0.000    -.1610492   -.1123829
                  16  |   -.101671    .012481    -8.15   0.000    -.1268091   -.0765329
                      |
                 marr |   .0337965   .0022315    15.15   0.000      .029302     .038291
                partt |  -.1409285   .0033584   -41.96   0.000    -.1476925   -.1341644
               public |   .0610058   .0060933    10.01   0.000     .0487332    .0732784
                 cmsa |   .1535616   .0081201    18.91   0.000     .1372068    .1699164
                      |
                nocc2 |
                   2  |  -.1309542   .0030626   -42.76   0.000    -.1371226   -.1247857
                   3  |  -.0392323   .0069247    -5.67   0.000    -.0531793   -.0252853
                   4  |  -.2794939    .006705   -41.68   0.000    -.2929985   -.2659893
                   5  |   .0505627   .0063171     8.00   0.000     .0378394    .0632859
                   6  |  -.3243265   .0043872   -73.93   0.000    -.3331627   -.3154903
                   7  |  -.3497448   .0043083   -81.18   0.000    -.3584222   -.3410674
                   8  |  -.1640911   .0078668   -20.86   0.000    -.1799357   -.1482466
                   9  |   -.403882   .0052265   -77.28   0.000    -.4144088   -.3933552
                  10  |  -.4084624   .0092307   -44.25   0.000    -.4270539   -.3898709
                  11  |  -.1651708   .0088942   -18.57   0.000    -.1830847   -.1472569
                  12  |  -.3809687   .0078367   -48.61   0.000    -.3967525   -.3651849
                      |
                unemp |  -.0026028   .0013071    -1.99   0.053    -.0052355    .0000298
                      |
              quarter |
                   2  |   .0087146    .001361     6.40   0.000     .0059734    .0114558
                   3  |   .0176983   .0016844    10.51   0.000     .0143057    .0210909
                   4  |   .0205414   .0011516    17.84   0.000      .018222    .0228608
                      |
                _cons |   .4396474   .0474334     9.27   0.000     .3441115    .5351832
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,861,640,823)

Linear regression                               Number of obs     =  1,014,977
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5021
                                                Root MSE          =     .39387

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0672272   .0065221   -10.31   0.000    -.0803633   -.0540911
             treat_st |  -.0571821   .0117081    -4.88   0.000    -.0807634   -.0336008
treat_stblackrelwhite |  -.0388667   .0080721    -4.81   0.000    -.0551247   -.0226087
                      |
                state |
                  RI  |  -.1053699   .0054008   -19.51   0.000    -.1162476   -.0944922
                  CT  |   .1678619   .0051839    32.38   0.000     .1574209    .1783028
                  NY  |   .0985782   .0038849    25.37   0.000     .0907537    .1064027
                  NJ  |   .1440495   .0058941    24.44   0.000     .1321782    .1559209
                  PA  |   .0889536   .0038083    23.36   0.000     .0812833    .0966238
                  OH  |    .047543   .0059066     8.05   0.000     .0356465    .0594394
                  IN  |  -.1075156   .0433759    -2.48   0.017    -.1948791   -.0201521
                  IL  |   .0191943   .0042501     4.52   0.000     .0106342    .0277545
                  MI  |   .0940848    .035829     2.63   0.012     .0219215    .1662481
                  WI  |  -.2185251   .0325361    -6.72   0.000    -.2840561   -.1529941
                  MN  |  -.0077441   .0038838    -1.99   0.052    -.0155664    .0000782
                  IA  |  -.0200838   .0125867    -1.60   0.118    -.0454347    .0052671
                  MO  |    .106814   .0043565    24.52   0.000     .0980395    .1155884
                  ND  |  -.7442113   .0140114   -53.11   0.000    -.7724318   -.7159909
                  SD  |  -.3214167   .0102772   -31.27   0.000    -.3421161   -.3007173
                  NE  |   -.258368   .0114704   -22.52   0.000    -.2814706   -.2352655
                  KS  |  -.0249984   .0102444    -2.44   0.019    -.0456317   -.0043651
                  DE  |    .283129   .0172543    16.41   0.000     .2483771    .3178809
                  MD  |  -.1991477   .0062912   -31.66   0.000    -.2118188   -.1864766
                  DC  |  -.1486505   .0152061    -9.78   0.000    -.1792772   -.1180238
                  VA  |  -.0583467   .0116616    -5.00   0.000    -.0818343    -.034859
                  NC  |     .16186   .0132548    12.21   0.000     .1351634    .1885566
                  SC  |   .1239838   .0126489     9.80   0.000     .0985076      .14946
                  GA  |   .2773997   .0113949    24.34   0.000     .2544491    .3003503
                  FL  |   .1282457   .0114112    11.24   0.000     .1052624     .151229
                  KY  |  -.0938231    .023247    -4.04   0.000    -.1406449   -.0470013
                  TN  |  -.0241402    .010928    -2.21   0.032    -.0461503   -.0021302
                  AL  |  -.0041118   .0119909    -0.34   0.733    -.0282626    .0200391
                  MS  |       .016   .0151938     1.05   0.298    -.0146019    .0466019
                  AR  |  -.0037797   .0189105    -0.20   0.842    -.0418673     .034308
                  LA  |   .0255111   .0139178     1.83   0.073    -.0025209     .053543
                  OK  |  -.2757943   .0537738    -5.13   0.000    -.3841003   -.1674882
                  TX  |  -.0579339   .0125034    -4.63   0.000    -.0831169   -.0327508
                  ID  |   .1852203   .0222977     8.31   0.000     .1403105    .2301301
                  WY  |   -.568373    .012847   -44.24   0.000    -.5942482   -.5424979
                  CO  |  -.0914687   .0030527   -29.96   0.000    -.0976172   -.0853202
                  NM  |  -.3645791   .0170062   -21.44   0.000    -.3988313   -.3303269
                  AZ  |  -.0276798   .0105031    -2.64   0.011    -.0488343   -.0065254
                  UT  |     -.0876    .011748    -7.46   0.000    -.1112616   -.0639384
                  NV  |   .1862474    .012122    15.36   0.000     .1618325    .2106623
                  WA  |  -.1784244   .0046392   -38.46   0.000    -.1877681   -.1690806
                  OR  |  -.0713086   .0058538   -12.18   0.000    -.0830987   -.0595185
                  CA  |    .047661    .005274     9.04   0.000     .0370386    .0582833
                  AK  |   .5088391   .0044299   114.86   0.000     .4999167    .5177614
                  HI  |  -.0159475   .0055089    -2.89   0.006     -.027043   -.0048519
                      |
        state#c.lyear |
                  MA  |   .0040766   .0000944    43.18   0.000     .0038864    .0042667
                  RI  |   .0044044   .0000964    45.68   0.000     .0042102    .0045986
                  CT  |   .0025779   .0000973    26.49   0.000     .0023819    .0027738
                  NY  |    .002811   .0000729    38.53   0.000      .002664    .0029579
                  NJ  |   .0029831   .0000799    37.35   0.000     .0028222     .003144
                  PA  |    .001979   .0000699    28.33   0.000     .0018382    .0021197
                  OH  |   .0020837   .0000519    40.16   0.000     .0019792    .0021882
                  IN  |   .0036041   .0004429     8.14   0.000     .0027121    .0044961
                  IL  |   .0029777   .0000835    35.65   0.000     .0028094    .0031459
                  MI  |   .0021354   .0003678     5.81   0.000     .0013945    .0028762
                  WI  |   .0051454   .0003309    15.55   0.000      .004479    .0058119
                  MN  |   .0036441   .0000854    42.69   0.000     .0034722     .003816
                  IA  |   .0032772   .0001002    32.72   0.000     .0030755    .0034789
                  MO  |   .0013068    .000085    15.38   0.000     .0011357     .001478
                  ND  |   .0100047   .0000924   108.33   0.000     .0098187    .0101907
                  SD  |   .0057737   .0000612    94.27   0.000     .0056503     .005897
                  NE  |   .0051992    .000113    46.00   0.000     .0049716    .0054269
                  KS  |   .0029974   .0000808    37.12   0.000     .0028348    .0031601
                  DE  |    .000724   .0001585     4.57   0.000     .0004048    .0010433
                  MD  |   .0059331   .0000776    76.50   0.000     .0057769    .0060893
                  DC  |    .006003   .0001446    41.51   0.000     .0057118    .0062942
                  VA  |   .0044524   .0001377    32.35   0.000     .0041751    .0047296
                  NC  |   .0014944   .0001612     9.27   0.000     .0011697    .0018191
                  SC  |   .0014789   .0001353    10.93   0.000     .0012064    .0017513
                  GA  |   .0006591   .0001341     4.92   0.000     .0003891    .0009291
                  FL  |   .0018297   .0000785    23.30   0.000     .0016716    .0019879
                  KY  |    .003202   .0002371    13.50   0.000     .0027244    .0036796
                  TN  |   .0028833   .0001105    26.09   0.000     .0026607    .0031059
                  AL  |   .0025712   .0001136    22.63   0.000     .0023424       .0028
                  MS  |   .0021579   .0001262    17.10   0.000     .0019037     .002412
                  AR  |   .0023267    .000183    12.72   0.000     .0019582    .0026952
                  LA  |   .0022144   .0001065    20.80   0.000         .002    .0024289
                  OK  |   .0046374   .0005851     7.93   0.000      .003459    .0058158
                  TX  |   .0038747   .0000898    43.15   0.000     .0036939    .0040556
                  ID  |   .0012017   .0002089     5.75   0.000     .0007809    .0016225
                  WY  |   .0087256   .0000835   104.53   0.000     .0085574    .0088937
                  CO  |   .0039315   .0000989    39.73   0.000     .0037322    .0041308
                  NM  |   .0057239   .0001987    28.80   0.000     .0053236    .0061242
                  AZ  |   .0036954   .0000894    41.34   0.000     .0035153    .0038754
                  UT  |   .0037261    .000084    44.37   0.000     .0035569    .0038952
                  NV  |   .0022612    .000083    27.25   0.000      .002094    .0024283
                  WA  |   .0054107   .0001162    46.55   0.000     .0051766    .0056448
                  OR  |   .0037899   .0001102    34.39   0.000     .0035679    .0040118
                  CA  |   .0039083   .0000711    55.00   0.000     .0037652    .0040514
                  AK  |  -.0000419   .0000546    -0.77   0.447    -.0001519     .000068
                  HI  |   .0039623   .0000811    48.86   0.000     .0037989    .0041256
                      |
                 nind |
                   2  |   .0638661   .0420243     1.52   0.136    -.0207751    .1485073
                   3  |   .1356075     .03944     3.44   0.001     .0561712    .2150438
                   4  |  -.0801311   .0399141    -2.01   0.051    -.1605221      .00026
                   5  |   .1605579   .0384463     4.18   0.000      .083123    .2379928
                   6  |   .0924979   .0402668     2.30   0.026     .0113964    .1735994
                   7  |   .0382433   .0416152     0.92   0.363     -.045574    .1220607
                   8  |  -.0157571   .0427337    -0.37   0.714    -.1018273     .070313
                   9  |  -.0678535   .0459879    -1.48   0.147    -.1604778    .0247708
                  10  |  -.0788685   .0407394    -1.94   0.059    -.1609219    .0031848
                  11  |   .0749068   .0424842     1.76   0.085    -.0106607    .1604744
                      |
                 educ |   .0896626   .0024298    36.90   0.000     .0847686    .0945565
                exper |   .0474327    .002136    22.21   0.000     .0431306    .0517349
               exper2 |  -.0015442    .000097   -15.92   0.000    -.0017396   -.0013488
               exper3 |   .0000235   2.77e-06     8.50   0.000     .0000179    .0000291
               exper4 |  -1.21e-07   2.84e-08    -4.25   0.000    -1.78e-07   -6.35e-08
                 edex |  -.0005037    .000092    -5.48   0.000     -.000689   -.0003185
                      |
                ee_cl |
                   2  |  -.1262668   .0053464   -23.62   0.000    -.1370351   -.1154986
                   3  |   -.160535   .0081372   -19.73   0.000    -.1769242   -.1441458
                   4  |  -.1602614   .0129488   -12.38   0.000    -.1863417   -.1341812
                   5  |  -.1585707   .0082862   -19.14   0.000      -.17526   -.1418813
                   6  |  -.1698403   .0089357   -19.01   0.000    -.1878377   -.1518428
                   7  |  -.1728005   .0105835   -16.33   0.000    -.1941167   -.1514843
                   8  |  -.1041307    .013665    -7.62   0.000    -.1316534   -.0766079
                   9  |  -.1584092   .0103041   -15.37   0.000    -.1791627   -.1376558
                  10  |  -.1746936   .0111657   -15.65   0.000    -.1971825   -.1522047
                  11  |   -.165375   .0116613   -14.18   0.000    -.1888621   -.1418879
                  12  |  -.1103706   .0123829    -8.91   0.000    -.1353109   -.0854302
                  13  |  -.1110821   .0149345    -7.44   0.000    -.1411617   -.0810026
                  14  |  -.1533685     .01186   -12.93   0.000    -.1772557   -.1294813
                  15  |  -.1335344   .0123532   -10.81   0.000    -.1584151   -.1086537
                  16  |  -.0981186   .0128013    -7.66   0.000    -.1239017   -.0723355
                      |
                 marr |   .0334425   .0022149    15.10   0.000     .0289815    .0379035
                partt |  -.1408994   .0033638   -41.89   0.000    -.1476744   -.1341243
               public |   .0607518   .0060653    10.02   0.000     .0485357     .072968
                 cmsa |   .1533602   .0081386    18.84   0.000     .1369683     .169752
                      |
                nocc2 |
                   2  |  -.1301706   .0031325   -41.55   0.000    -.1364798   -.1238613
                   3  |  -.0383723   .0069726    -5.50   0.000    -.0524159   -.0243287
                   4  |  -.2783561   .0066517   -41.85   0.000    -.2917533   -.2649588
                   5  |   .0504135   .0063361     7.96   0.000     .0376518    .0631751
                   6  |  -.3245212   .0044549   -72.85   0.000    -.3334938   -.3155486
                   7  |   -.349911   .0043519   -80.40   0.000    -.3586761   -.3411458
                   8  |  -.1630104   .0079414   -20.53   0.000    -.1790052   -.1470157
                   9  |  -.4038901   .0052725   -76.60   0.000    -.4145094   -.3932709
                  10  |  -.4100373   .0093733   -43.75   0.000     -.428916   -.3911586
                  11  |  -.1639382   .0087144   -18.81   0.000    -.1814899   -.1463865
                  12  |  -.3814654   .0079264   -48.13   0.000      -.39743   -.3655007
                      |
                unemp |  -.0022645   .0005035    -4.50   0.000    -.0032787   -.0012504
                      |
              quarter |
                   2  |   .0084102   .0013386     6.28   0.000     .0057142    .0111062
                   3  |   .0173345   .0016309    10.63   0.000     .0140497    .0206193
                   4  |   .0202085   .0011702    17.27   0.000     .0178515    .0225655
                      |
                _cons |   .0930859   .0429264     2.17   0.035     .0066277    .1795442
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_fem_all_sltt

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 7,459,437,111)

Linear regression                               Number of obs     =    825,912
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5400
                                                Root MSE          =      .4205

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.159087   .0050332   -31.61   0.000    -.1692244   -.1489496
             treat_st |  -.0266044   .0136334    -1.95   0.057    -.0540635    .0008548
treat_stblackrelwhite |  -.0030191   .0081139    -0.37   0.712    -.0193612    .0133231
                      |
                state |
                  RI  |  -.0916373   .0011631   -78.79   0.000    -.0939799   -.0892948
                  CT  |   .0073799   .0004604    16.03   0.000     .0064525    .0083073
                  NY  |   -.046181    .000905   -51.03   0.000    -.0480038   -.0443583
                  NJ  |   .0349921   .0007773    45.02   0.000     .0334265    .0365577
                  PA  |  -.1146703   .0021664   -52.93   0.000    -.1190335    -.110307
                  OH  |  -.1480619   .0025425   -58.24   0.000    -.1531827   -.1429411
                  IN  |  -.1200071   .0055537   -21.61   0.000    -.1311928   -.1088213
                  IL  |  -.0582454   .0012755   -45.67   0.000    -.0608144   -.0556765
                  MI  |  -.0998127   .0035765   -27.91   0.000    -.1070162   -.0926092
                  WI  |  -.1017923   .0048942   -20.80   0.000    -.1116496    -.091935
                  MN  |  -.0596902   .0023493   -25.41   0.000    -.0644219   -.0549586
                  IA  |  -.1053671   .0163977    -6.43   0.000    -.1383937   -.0723405
                  MO  |  -.1519223   .0027964   -54.33   0.000    -.1575546     -.14629
                  ND  |  -.0816639   .0181028    -4.51   0.000    -.1181249   -.0452029
                  SD  |  -.1506925   .0173626    -8.68   0.000    -.1856626   -.1157224
                  NE  |  -.1410851   .0153513    -9.19   0.000    -.1720042    -.110166
                  KS  |  -.1283558   .0150172    -8.55   0.000     -.158602   -.0981097
                  DE  |  -.0541632   .0094354    -5.74   0.000    -.0731671   -.0351593
                  MD  |   .0152705   .0021741     7.02   0.000     .0108917    .0196493
                  DC  |   .0698934   .0045714    15.29   0.000     .0606861    .0791008
                  VA  |   .0067973   .0142926     0.48   0.637    -.0219895    .0355842
                  NC  |  -.1009784   .0149348    -6.76   0.000    -.1310586   -.0708981
                  SC  |  -.1173293   .0149965    -7.82   0.000    -.1475339   -.0871247
                  GA  |  -.0608782   .0146461    -4.16   0.000     -.090377   -.0313794
                  FL  |  -.1297616   .0141672    -9.16   0.000    -.1582959   -.1012274
                  KY  |  -.1576345   .0052134   -30.24   0.000    -.1681349   -.1471341
                  TN  |  -.1486236   .0146938   -10.11   0.000    -.1782183   -.1190288
                  AL  |  -.1268428   .0152406    -8.32   0.000    -.1575389   -.0961467
                  MS  |  -.1416212   .0166594    -8.50   0.000    -.1751749   -.1080675
                  AR  |  -.1861312   .0159063   -11.70   0.000     -.218168   -.1540943
                  LA  |  -.0950059    .014568    -6.52   0.000    -.1243474   -.0656644
                  OK  |  -.1637747    .008864   -18.48   0.000    -.1816278   -.1459217
                  TX  |  -.0570132   .0140083    -4.07   0.000    -.0852274   -.0287991
                  ID  |  -.1190201   .0158644    -7.50   0.000    -.1509727   -.0870675
                  WY  |    .046824   .0185573     2.52   0.015     .0094477    .0842003
                  CO  |   -.072039   .0009296   -77.49   0.000    -.0739113   -.0701666
                  NM  |  -.1372982   .0037855   -36.27   0.000    -.1449226   -.1296739
                  AZ  |  -.0888882   .0138704    -6.41   0.000    -.1168247   -.0609518
                  UT  |  -.1118644   .0138247    -8.09   0.000    -.1397089     -.08402
                  NV  |   -.032275   .0141264    -2.28   0.027     -.060727    -.003823
                  WA  |   -.029444   .0013669   -21.54   0.000    -.0321971   -.0266909
                  OR  |  -.0992468   .0021244   -46.72   0.000    -.1035255   -.0949681
                  CA  |   .0293628    .000547    53.68   0.000     .0282611    .0304646
                  AK  |   .1145713   .0041164    27.83   0.000     .1062804    .1228621
                  HI  |   -.000627   .0029053    -0.22   0.830    -.0064786    .0052246
                      |
                 year |
                1990  |  -.0099091   .0029901    -3.31   0.002    -.0159314   -.0038868
                1991  |  -.0235049   .0045164    -5.20   0.000    -.0326014   -.0144083
                1992  |  -.0236419   .0038707    -6.11   0.000    -.0314378    -.015846
                1993  |  -.0318715   .0036394    -8.76   0.000    -.0392016   -.0245415
                1996  |  -.0353833   .0062174    -5.69   0.000    -.0479057   -.0228609
                1997  |  -.0177781   .0057979    -3.07   0.004    -.0294556   -.0061005
                1998  |   .0086322   .0055103     1.57   0.124    -.0024661    .0197306
                1999  |   .0346256   .0066823     5.18   0.000     .0211668    .0480844
                2000  |   .0449434   .0058976     7.62   0.000     .0330651    .0568218
                2001  |   .0623347   .0063128     9.87   0.000     .0496201    .0750493
                2002  |   .0693833   .0051236    13.54   0.000     .0590638    .0797027
                2003  |    .057572   .0067379     8.54   0.000     .0440011    .0711429
                2004  |    .050294   .0057809     8.70   0.000     .0386507    .0619374
                2005  |   .0367313   .0066251     5.54   0.000     .0233876    .0500749
                2006  |    .032846    .005792     5.67   0.000     .0211803    .0445117
                2007  |   .0330142   .0069548     4.75   0.000     .0190065    .0470219
                2008  |   .0287295    .007117     4.04   0.000     .0143951     .043064
                2009  |   .0424038   .0084741     5.00   0.000     .0253361    .0594715
                2010  |   .0307176   .0075947     4.04   0.000     .0154212    .0460141
                2011  |   .0081624   .0073847     1.11   0.275    -.0067111    .0230359
                2012  |   .0085268   .0084739     1.01   0.320    -.0085406    .0255942
                2013  |   .0054495   .0086632     0.63   0.533    -.0119992    .0228981
                2014  |   .0020045   .0093905     0.21   0.832    -.0169088    .0209179
                2015  |   .0267049      .0072     3.71   0.001     .0122034    .0412065
                2016  |   .0427393   .0076022     5.62   0.000     .0274277     .058051
                2017  |   .0457507   .0084491     5.41   0.000     .0287333    .0627682
                2018  |   .0565326   .0085146     6.64   0.000     .0393834    .0736819
                2019  |   .0783256   .0085605     9.15   0.000      .061084    .0955673
                      |
                 nind |
                   2  |   .0506917   .0238222     2.13   0.039     .0027113    .0986721
                   3  |   .1042291   .0223861     4.66   0.000     .0591412    .1493169
                   4  |  -.0637861   .0245145    -2.60   0.013    -.1131609   -.0144113
                   5  |   .1025145   .0240662     4.26   0.000     .0540426    .1509864
                   6  |   .1053412    .026984     3.90   0.000     .0509926    .1596898
                   7  |   .0105745   .0259081     0.41   0.685    -.0416072    .0627561
                   8  |  -.0416172   .0263984    -1.58   0.122    -.0947864    .0115519
                   9  |  -.0755662   .0265786    -2.84   0.007    -.1290983    -.022034
                  10  |  -.0852981    .026148    -3.26   0.002     -.137963   -.0326333
                  11  |   .0910333   .0269339     3.38   0.002     .0367856     .145281
                      |
                 educ |   .0648124   .0018072    35.86   0.000     .0611726    .0684522
                exper |   .0406566    .001806    22.51   0.000     .0370191    .0442941
               exper2 |  -.0007326   .0000884    -8.29   0.000    -.0009105   -.0005546
               exper3 |  -2.25e-06   2.93e-06    -0.77   0.446    -8.15e-06    3.64e-06
               exper4 |   1.14e-07   3.36e-08     3.40   0.001     4.64e-08    1.82e-07
                 edex |  -.0003353   .0000788    -4.26   0.000     -.000494   -.0001766
                      |
                ee_cl |
                   2  |  -.0630128   .0045235   -13.93   0.000    -.0721236    -.053902
                   3  |  -.0751308   .0055572   -13.52   0.000    -.0863237    -.063938
                   4  |  -.0250605   .0093746    -2.67   0.010    -.0439419   -.0061791
                   5  |  -.1245649   .0053794   -23.16   0.000    -.1353995   -.1137303
                   6  |  -.0977711   .0057443   -17.02   0.000    -.1093407   -.0862015
                   7  |  -.0783883   .0070122   -11.18   0.000    -.0925116    -.064265
                   8  |   .0395874   .0100963     3.92   0.000     .0192523    .0599224
                   9  |   -.150004   .0071359   -21.02   0.000    -.1643763   -.1356316
                  10  |  -.1141139   .0080127   -14.24   0.000    -.1302524   -.0979754
                  11  |  -.0687812   .0081692    -8.42   0.000    -.0852348   -.0523276
                  12  |   .0419837   .0108427     3.87   0.000     .0201455    .0638219
                  13  |   -.089661   .0133171    -6.73   0.000     -.116483   -.0628391
                  14  |  -.0873001   .0103338    -8.45   0.000    -.1081135   -.0664867
                  15  |  -.0503018    .009816    -5.12   0.000    -.0700723   -.0305313
                  16  |   .0404484   .0121162     3.34   0.002     .0160452    .0648517
                      |
                 marr |   .1294308   .0025913    49.95   0.000     .1242117      .13465
                partt |  -.2075221   .0047682   -43.52   0.000    -.2171256   -.1979185
               public |  -.0100528   .0061673    -1.63   0.110    -.0224744    .0023688
                 cmsa |   .1385121   .0082909    16.71   0.000     .1218133    .1552108
                      |
                nocc2 |
                   2  |  -.1487044   .0038488   -38.64   0.000    -.1564562   -.1409525
                   3  |   -.039224   .0063858    -6.14   0.000    -.0520857   -.0263622
                   4  |  -.3305809   .0074294   -44.50   0.000    -.3455445   -.3156173
                   5  |   -.097112   .0084782   -11.45   0.000     -.114188   -.0800361
                   6  |  -.3918831   .0066923   -58.56   0.000     -.405362   -.3784042
                   7  |  -.2471862   .0066191   -37.34   0.000    -.2605178   -.2338547
                   8  |  -.1105947    .010249   -10.79   0.000    -.1312374   -.0899521
                   9  |  -.4347107   .0058062   -74.87   0.000     -.446405   -.4230164
                  10  |  -.3729463   .0061241   -60.90   0.000    -.3852808   -.3606118
                  11  |   -.275742   .0063551   -43.39   0.000    -.2885418   -.2629422
                  12  |  -.4368157   .0088205   -49.52   0.000    -.4545811   -.4190503
                      |
              quarter |
                   2  |   .0041025   .0018535     2.21   0.032     .0003695    .0078356
                   3  |   .0046929   .0018608     2.52   0.015     .0009451    .0084407
                   4  |   .0156587   .0017582     8.91   0.000     .0121176    .0191999
                      |
                _cons |   .8104531   .0259218    31.27   0.000     .7582439    .8626624
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 7,459,437,111)

Linear regression                               Number of obs     =    825,912
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5400
                                                Root MSE          =     .42047

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1591284   .0050348   -31.61   0.000     -.169269   -.1489879
             treat_st |  -.0285748   .0143573    -1.99   0.053    -.0574918    .0003422
treat_stblackrelwhite |  -.0030084   .0081423    -0.37   0.713    -.0194078    .0133909
                      |
                state |
                  RI  |  -.0846389    .002163   -39.13   0.000    -.0889954   -.0802825
                  CT  |   .0078541   .0004394    17.88   0.000     .0069692    .0087391
                  NY  |  -.0413348   .0019293   -21.42   0.000    -.0452207   -.0374489
                  NJ  |   .0385382   .0012256    31.44   0.000     .0360697    .0410066
                  PA  |   -.112279   .0022242   -50.48   0.000    -.1167589   -.1077992
                  OH  |  -.1440041   .0026475   -54.39   0.000    -.1493364   -.1386718
                  IN  |  -.1195069   .0056799   -21.04   0.000    -.1309468    -.108067
                  IL  |  -.0515984   .0022002   -23.45   0.000    -.0560298   -.0471671
                  MI  |  -.0894393   .0051372   -17.41   0.000    -.0997862   -.0790924
                  WI  |  -.1047865    .004859   -21.57   0.000     -.114573   -.0950001
                  MN  |  -.0658296   .0030696   -21.45   0.000    -.0720122   -.0596471
                  IA  |  -.1125286   .0161431    -6.97   0.000    -.1450425   -.0800146
                  MO  |  -.1509049   .0028198   -53.52   0.000    -.1565842   -.1452255
                  ND  |  -.0927025   .0177453    -5.22   0.000    -.1284434   -.0569616
                  SD  |  -.1612358   .0168537    -9.57   0.000    -.1951809   -.1272907
                  NE  |  -.1532925   .0146778   -10.44   0.000    -.1828552   -.1237299
                  KS  |  -.1316758   .0150616    -8.74   0.000    -.1620114   -.1013403
                  DE  |  -.0589443   .0093176    -6.33   0.000    -.0777109   -.0401776
                  MD  |   .0126724   .0023049     5.50   0.000       .00803    .0173147
                  DC  |   .0817138   .0062845    13.00   0.000     .0690561    .0943716
                  VA  |   .0021327   .0140816     0.15   0.880    -.0262291    .0304945
                  NC  |  -.0973978   .0158289    -6.15   0.000    -.1292789   -.0655168
                  SC  |  -.1100773   .0164429    -6.69   0.000     -.143195   -.0769595
                  GA  |  -.0561561   .0157374    -3.57   0.001    -.0878528   -.0244594
                  FL  |  -.1248163   .0153458    -8.13   0.000    -.1557243   -.0939082
                  KY  |  -.1520702   .0056492   -26.92   0.000    -.1634482   -.1406922
                  TN  |  -.1441984   .0157335    -9.17   0.000    -.1758872   -.1125096
                  AL  |   -.119869   .0166228    -7.21   0.000    -.1533491   -.0863889
                  MS  |  -.1294977   .0187748    -6.90   0.000    -.1673121   -.0916833
                  AR  |   -.181373   .0169487   -10.70   0.000    -.2155095   -.1472365
                  LA  |  -.0866967   .0161658    -5.36   0.000    -.1192562   -.0541372
                  OK  |  -.1666992    .008808   -18.93   0.000    -.1844393    -.148959
                  TX  |   -.052647   .0150352    -3.50   0.001    -.0829293   -.0223646
                  ID  |   -.117469   .0165223    -7.11   0.000    -.1507465   -.0841914
                  WY  |   .0425694   .0187834     2.27   0.028     .0047377    .0804012
                  CO  |  -.0751347   .0013725   -54.74   0.000    -.0778991   -.0723703
                  NM  |  -.1323611   .0039463   -33.54   0.000    -.1403093   -.1244129
                  AZ  |   -.083224   .0151555    -5.49   0.000    -.1137489   -.0526992
                  UT  |   -.116606   .0137425    -8.49   0.000    -.1442849   -.0889271
                  NV  |  -.0250691   .0157195    -1.59   0.118    -.0567297    .0065915
                  WA  |  -.0238554   .0018522   -12.88   0.000    -.0275859   -.0201248
                  OR  |   -.091351   .0027464   -33.26   0.000    -.0968826   -.0858193
                  CA  |   .0399705   .0029669    13.47   0.000     .0339949    .0459461
                  AK  |   .1285646   .0055795    23.04   0.000     .1173268    .1398023
                  HI  |  -.0084252   .0031564    -2.67   0.011    -.0147825   -.0020679
                      |
                 year |
                1990  |   -.007965   .0031094    -2.56   0.014    -.0142277   -.0017024
                1991  |  -.0136623   .0058515    -2.33   0.024    -.0254479   -.0018767
                1992  |  -.0097364   .0053607    -1.82   0.076    -.0205334    .0010606
                1993  |  -.0220242    .004403    -5.00   0.000    -.0308923   -.0131561
                1996  |  -.0354544   .0058048    -6.11   0.000    -.0471459   -.0237628
                1997  |  -.0208903   .0050625    -4.13   0.000    -.0310868   -.0106939
                1998  |   .0026481   .0046502     0.57   0.572    -.0067178    .0120141
                1999  |   .0268394   .0060727     4.42   0.000     .0146083    .0390705
                2000  |   .0359566   .0060966     5.90   0.000     .0236773    .0482359
                2001  |   .0584562   .0060202     9.71   0.000     .0463308    .0705816
                2002  |   .0727452   .0049172    14.79   0.000     .0628415    .0826488
                2003  |   .0623468   .0068379     9.12   0.000     .0485745    .0761191
                2004  |   .0521058   .0059253     8.79   0.000     .0401716    .0640401
                2005  |   .0358901   .0065602     5.47   0.000     .0226771    .0491031
                2006  |   .0290523   .0056339     5.16   0.000     .0177049    .0403996
                2007  |    .028743   .0068589     4.19   0.000     .0149285    .0425576
                2008  |   .0321419   .0066841     4.81   0.000     .0186795    .0456044
                2009  |   .0690308   .0116712     5.91   0.000     .0455238    .0925377
                2010  |   .0596672    .010141     5.88   0.000     .0392423    .0800922
                2011  |   .0323362   .0097991     3.30   0.002     .0125997    .0520726
                2012  |   .0267277   .0104295     2.56   0.014     .0057215    .0477338
                2013  |   .0194085   .0095291     2.04   0.048     .0002159     .038601
                2014  |   .0078873   .0087815     0.90   0.374    -.0097996    .0255743
                2015  |   .0266736   .0066295     4.02   0.000     .0133211    .0400261
                2016  |   .0402022   .0070777     5.68   0.000      .025947    .0544574
                2017  |   .0397989    .008239     4.83   0.000     .0232048     .056393
                2018  |   .0476232   .0083973     5.67   0.000     .0307101    .0645362
                2019  |   .0679391   .0088188     7.70   0.000     .0501772    .0857011
                      |
                 nind |
                   2  |   .0507161   .0237947     2.13   0.039     .0027911    .0986412
                   3  |   .1042729   .0223638     4.66   0.000     .0592298     .149316
                   4  |  -.0636685   .0244807    -2.60   0.013    -.1129751   -.0143619
                   5  |   .1026441    .024004     4.28   0.000     .0542976    .1509906
                   6  |   .1054571   .0269461     3.91   0.000     .0511849    .1597293
                   7  |   .0106687   .0258733     0.41   0.682    -.0414429    .0627803
                   8  |  -.0414824   .0263653    -1.57   0.123    -.0945849    .0116201
                   9  |  -.0754488   .0265469    -2.84   0.007    -.1289171   -.0219805
                  10  |  -.0851353   .0260936    -3.26   0.002    -.1376904   -.0325801
                  11  |    .091154    .026893     3.39   0.001     .0369887    .1453194
                      |
                 educ |   .0648207   .0018025    35.96   0.000     .0611902    .0684512
                exper |   .0407101   .0018018    22.59   0.000     .0370811    .0443392
               exper2 |  -.0007361   .0000891    -8.26   0.000    -.0009156   -.0005566
               exper3 |  -2.14e-06   2.95e-06    -0.73   0.471    -8.08e-06    3.80e-06
               exper4 |   1.13e-07   3.38e-08     3.34   0.002     4.48e-08    1.81e-07
                 edex |  -.0003358   .0000783    -4.29   0.000    -.0004935   -.0001781
                      |
                ee_cl |
                   2  |  -.0628466   .0045396   -13.84   0.000    -.0719897   -.0537034
                   3  |  -.0749796   .0055787   -13.44   0.000    -.0862156   -.0637435
                   4  |  -.0249365   .0094011    -2.65   0.011    -.0438713   -.0060017
                   5  |  -.1246117   .0053826   -23.15   0.000    -.1354527   -.1137706
                   6  |  -.0976993   .0057277   -17.06   0.000    -.1092354   -.0861632
                   7  |  -.0782191   .0070267   -11.13   0.000    -.0923716   -.0640666
                   8  |   .0398038   .0101285     3.93   0.000      .019404    .0602036
                   9  |  -.1499373   .0071374   -21.01   0.000    -.1643127   -.1355618
                  10  |  -.1140419   .0079999   -14.26   0.000    -.1301546   -.0979293
                  11  |  -.0685712   .0081976    -8.36   0.000     -.085082   -.0520605
                  12  |   .0421904   .0108719     3.88   0.000     .0202933    .0640876
                  13  |  -.0897391   .0132727    -6.76   0.000    -.1164717   -.0630064
                  14  |  -.0872384   .0103328    -8.44   0.000    -.1080497    -.066427
                  15  |  -.0501932   .0098185    -5.11   0.000    -.0699686   -.0304177
                  16  |   .0405939   .0121299     3.35   0.002     .0161631    .0650247
                      |
                 marr |   .1294452   .0025912    49.96   0.000     .1242262    .1346642
                partt |  -.2072948   .0047951   -43.23   0.000    -.2169526   -.1976371
               public |  -.0100478   .0061541    -1.63   0.110    -.0224428    .0023472
                 cmsa |   .1384467   .0082991    16.68   0.000     .1217314    .1551619
                      |
                nocc2 |
                   2  |  -.1486806   .0038586   -38.53   0.000    -.1564523   -.1409089
                   3  |  -.0391993   .0063903    -6.13   0.000    -.0520701   -.0263285
                   4  |  -.3305529   .0074219   -44.54   0.000    -.3455013   -.3156045
                   5  |  -.0971198   .0084866   -11.44   0.000    -.1142127   -.0800268
                   6  |  -.3918055   .0067176   -58.32   0.000    -.4053355   -.3782755
                   7  |  -.2471238   .0066507   -37.16   0.000    -.2605191   -.2337285
                   8  |  -.1106992   .0102838   -10.76   0.000    -.1314119   -.0899866
                   9  |  -.4346147   .0058465   -74.34   0.000    -.4463902   -.4228393
                  10  |  -.3729248   .0061345   -60.79   0.000    -.3852803   -.3605693
                  11  |  -.2757249   .0063628   -43.33   0.000    -.2885402   -.2629095
                  12  |  -.4367899   .0088425   -49.40   0.000    -.4545997   -.4189802
                      |
                unemp |  -.0067341   .0019291    -3.49   0.001    -.0106195   -.0028487
                      |
              quarter |
                   2  |   .0040864   .0018448     2.22   0.032     .0003707    .0078021
                   3  |   .0046693   .0018695     2.50   0.016     .0009039    .0084348
                   4  |   .0156077   .0017545     8.90   0.000     .0120739    .0191414
                      |
                _cons |   .8426334   .0315375    26.72   0.000     .7791137    .9061531
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all_unemp 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 7,459,437,111)

Linear regression                               Number of obs     =    825,912
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5392
                                                Root MSE          =     .42087

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1595197   .0049826   -32.02   0.000    -.1695552   -.1494842
             treat_st |   -.019892   .0113665    -1.75   0.087    -.0427852    .0030013
treat_stblackrelwhite |  -.0033746   .0082025    -0.41   0.683    -.0198952     .013146
                      |
                state |
                  RI  |   -.020756   .0060662    -3.42   0.001    -.0329739    -.008538
                  CT  |   .1335463   .0065503    20.39   0.000     .1203534    .1467393
                  NY  |   .1649742   .0031769    51.93   0.000     .1585756    .1713728
                  NJ  |   .1976602   .0062027    31.87   0.000     .1851673    .2101531
                  PA  |  -.0399678   .0039067   -10.23   0.000    -.0478363   -.0320992
                  OH  |   .0587223   .0060176     9.76   0.000     .0466022    .0708423
                  IN  |   .0524179   .0437921     1.20   0.238     -.035784    .1406197
                  IL  |   .1298662   .0047543    27.32   0.000     .1202905    .1394419
                  MI  |   .3345135   .0354257     9.44   0.000     .2631626    .4058645
                  WI  |  -.1139241   .0327452    -3.48   0.001    -.1798764   -.0479718
                  MN  |  -.1572683   .0044185   -35.59   0.000    -.1661677   -.1483689
                  IA  |  -.1981082   .0127415   -15.55   0.000    -.2237709   -.1724455
                  MO  |   -.075246   .0048268   -15.59   0.000    -.0849677   -.0655243
                  ND  |  -1.150631   .0133276   -86.33   0.000    -1.177474   -1.123787
                  SD  |  -.5638598   .0109599   -51.45   0.000    -.5859342   -.5417854
                  NE  |   -.326175   .0122509   -26.62   0.000    -.3508496   -.3015003
                  KS  |   -.144082   .0101435   -14.20   0.000     -.164512    -.123652
                  DE  |   .1649097   .0132283    12.47   0.000     .1382665     .191553
                  MD  |  -.1331864   .0063486   -20.98   0.000    -.1459731   -.1203998
                  DC  |  -.1876381   .0102152   -18.37   0.000    -.2082126   -.1670636
                  VA  |  -.1224735   .0118622   -10.32   0.000    -.1463651   -.0985818
                  NC  |   .1131019   .0140867     8.03   0.000     .0847299    .1414739
                  SC  |   .1115658   .0122473     9.11   0.000     .0868985    .1362331
                  GA  |   .0699888    .011812     5.93   0.000     .0461981    .0937794
                  FL  |   .0581674   .0112207     5.18   0.000     .0355678    .0807669
                  KY  |   .0485359   .0210333     2.31   0.026     .0061726    .0908992
                  TN  |   .0114033   .0111527     1.02   0.312    -.0110594    .0338659
                  AL  |  -.1678227   .0128102   -13.10   0.000    -.1936238   -.1420216
                  MS  |  -.1370704   .0155255    -8.83   0.000    -.1683404   -.1058005
                  AR  |  -.0671655   .0205313    -3.27   0.002    -.1085177   -.0258133
                  LA  |   -.149567   .0153027    -9.77   0.000    -.1803881   -.1187458
                  OK  |  -.2397441   .0521772    -4.59   0.000    -.3448344   -.1346537
                  TX  |  -.1224183   .0126591    -9.67   0.000    -.1479149   -.0969216
                  ID  |   .1903572   .0219625     8.67   0.000     .1461224    .2345921
                  WY  |  -.7829669   .0114487   -68.39   0.000    -.8060257   -.7599081
                  CO  |  -.1567678   .0039424   -39.76   0.000    -.1647081   -.1488275
                  NM  |  -.2572203   .0203496   -12.64   0.000    -.2982064   -.2162341
                  AZ  |  -.1394027   .0106049   -13.15   0.000     -.160762   -.1180433
                  UT  |  -.1993943   .0109388   -18.23   0.000    -.2214261   -.1773624
                  NV  |  -.0257921   .0112621    -2.29   0.027    -.0484751   -.0031091
                  WA  |  -.3606601   .0045715   -78.89   0.000    -.3698675   -.3514527
                  OR  |  -.0047116   .0078224    -0.60   0.550    -.0204666    .0110434
                  CA  |   .0749242   .0050018    14.98   0.000     .0648499    .0849984
                  AK  |   .6523324   .0051985   125.48   0.000      .641862    .6628028
                  HI  |  -.2066094   .0076722   -26.93   0.000     -.222062   -.1911568
                      |
        state#c.lyear |
                  MA  |   .0027429    .000087    31.53   0.000     .0025677    .0029181
                  RI  |   .0021303    .000066    32.29   0.000     .0019974    .0022632
                  CT  |   .0015334   .0000838    18.30   0.000     .0013646    .0017021
                  NY  |   .0007392   .0000622    11.89   0.000     .0006139    .0008644
                  NJ  |   .0012163   .0000572    21.26   0.000     .0011011    .0013315
                  PA  |   .0020461   .0000603    33.95   0.000     .0019247    .0021675
                  OH  |    .000793   .0000432    18.36   0.000      .000706      .00088
                  IN  |   .0010756   .0004378     2.46   0.018     .0001939    .0019572
                  IL  |    .000981   .0000643    15.26   0.000     .0008516    .0011105
                  MI  |  -.0013899   .0003596    -3.86   0.000    -.0021142   -.0006656
                  WI  |   .0028149   .0003239     8.69   0.000     .0021625    .0034673
                  MN  |   .0036298   .0000676    53.73   0.000     .0034937    .0037659
                  IA  |   .0035002   .0000832    42.07   0.000     .0033326    .0036678
                  MO  |   .0020148   .0000817    24.65   0.000     .0018502    .0021794
                  ND  |   .0128207   .0000922   139.12   0.000      .012635    .0130063
                  SD  |   .0066345   .0000485   136.85   0.000     .0065368    .0067321
                  NE  |   .0043404   .0001046    41.49   0.000     .0041297     .004551
                  KS  |   .0027944    .000072    38.79   0.000     .0026493    .0029395
                  DE  |   .0004741   .0000921     5.15   0.000     .0002886    .0006595
                  MD  |   .0041377   .0000839    49.33   0.000     .0039687    .0043066
                  DC  |   .0053002   .0001073    49.40   0.000     .0050841    .0055163
                  VA  |   .0038782   .0001274    30.45   0.000     .0036217    .0041348
                  NC  |   .0006246   .0001521     4.11   0.000     .0003182    .0009309
                  SC  |   .0005145   .0001117     4.61   0.000     .0002896    .0007394
                  GA  |   .0014448   .0001216    11.88   0.000     .0011998    .0016897
                  FL  |   .0009137   .0000717    12.75   0.000     .0007694    .0010581
                  KY  |   .0008044   .0002127     3.78   0.000     .0003759    .0012328
                  TN  |   .0011621   .0000947    12.27   0.000     .0009713    .0013529
                  AL  |   .0031231   .0000997    31.32   0.000     .0029222    .0033239
                  MS  |   .0027251   .0001107    24.62   0.000     .0025022     .002948
                  AR  |   .0015673   .0001846     8.49   0.000     .0011956    .0019391
                  LA  |   .0032646   .0001236    26.41   0.000     .0030156    .0035136
                  OK  |   .0034297   .0005623     6.10   0.000     .0022971    .0045623
                  TX  |   .0033262   .0000849    39.17   0.000     .0031552    .0034972
                  ID  |  -.0002742   .0001959    -1.40   0.168    -.0006687    .0001203
                  WY  |   .0103656   .0000641   161.66   0.000     .0102365    .0104948
                  CO  |   .0035348   .0000862    40.99   0.000     .0033611    .0037085
                  NM  |   .0039399   .0002281    17.27   0.000     .0034805    .0043993
                  AZ  |   .0032123    .000091    35.29   0.000      .003029    .0033956
                  UT  |   .0034624   .0000893    38.79   0.000     .0032826    .0036422
                  NV  |     .00268   .0000734    36.51   0.000     .0025321    .0028278
                  WA  |   .0059564   .0000891    66.82   0.000     .0057769     .006136
                  OR  |   .0019131   .0001163    16.45   0.000      .001679    .0021473
                  CA  |    .002404   .0000612    39.28   0.000     .0022808    .0025273
                  AK  |  -.0023952    .000049   -48.87   0.000    -.0024939   -.0022965
                  HI  |   .0046878   .0000727    64.51   0.000     .0045414    .0048341
                      |
                 nind |
                   2  |   .0532184   .0237335     2.24   0.030     .0054166    .1010201
                   3  |   .1054966   .0222441     4.74   0.000     .0606947    .1502986
                   4  |  -.0618234   .0244292    -2.53   0.015    -.1110264   -.0126204
                   5  |    .104648   .0238142     4.39   0.000     .0566837    .1526123
                   6  |   .1074449   .0267906     4.01   0.000      .053486    .1614039
                   7  |   .0126721   .0257376     0.49   0.625    -.0391661    .0645103
                   8  |  -.0395802   .0263026    -1.50   0.139    -.0925563    .0133959
                   9  |  -.0735451   .0264439    -2.78   0.008    -.1268059   -.0202843
                  10  |  -.0833402   .0259623    -3.21   0.002     -.135631   -.0310495
                  11  |   .0924862   .0268585     3.44   0.001     .0383904     .146582
                      |
                 educ |   .0646623   .0017801    36.33   0.000     .0610771    .0682476
                exper |   .0403757   .0017843    22.63   0.000      .036782    .0439694
               exper2 |  -.0007051   .0000906    -7.78   0.000    -.0008877   -.0005226
               exper3 |  -3.13e-06   2.97e-06    -1.05   0.298    -9.11e-06    2.86e-06
               exper4 |   1.22e-07   3.37e-08     3.61   0.001     5.37e-08    1.90e-07
                 edex |  -.0003289   .0000767    -4.29   0.000    -.0004833   -.0001744
                      |
                ee_cl |
                   2  |  -.0641057   .0045882   -13.97   0.000    -.0733468   -.0548647
                   3  |  -.0756684   .0056999   -13.28   0.000    -.0871486   -.0641882
                   4  |  -.0257191   .0093839    -2.74   0.009    -.0446192    -.006819
                   5  |  -.1281862   .0053693   -23.87   0.000    -.1390005   -.1173718
                   6  |  -.0999957   .0057127   -17.50   0.000    -.1115017   -.0884896
                   7  |  -.0795276   .0071033   -11.20   0.000    -.0938343   -.0652208
                   8  |   .0391605   .0101498     3.86   0.000     .0187178    .0596032
                   9  |   -.151719   .0070519   -21.51   0.000    -.1659223   -.1375157
                  10  |  -.1141973     .00797   -14.33   0.000    -.1302497   -.0981449
                  11  |  -.0694294   .0082376    -8.43   0.000    -.0860207   -.0528381
                  12  |   .0406989   .0109081     3.73   0.001     .0187289     .062669
                  13  |  -.0904749   .0131828    -6.86   0.000    -.1170264   -.0639234
                  14  |  -.0880504   .0102494    -8.59   0.000    -.1086937   -.0674071
                  15  |   -.050487   .0097918    -5.16   0.000    -.0702088   -.0307653
                  16  |   .0389386   .0120524     3.23   0.002     .0146637    .0632135
                      |
                 marr |   .1293294   .0026164    49.43   0.000     .1240597     .134599
                partt |  -.2074604    .004757   -43.61   0.000    -.2170416   -.1978793
               public |  -.0101506   .0061069    -1.66   0.103    -.0224505    .0021493
                 cmsa |   .1377291   .0083504    16.49   0.000     .1209106    .1545476
                      |
                nocc2 |
                   2  |  -.1494195   .0038107   -39.21   0.000    -.1570945   -.1417444
                   3  |  -.0397056   .0063753    -6.23   0.000    -.0525462    -.026865
                   4  |  -.3304421   .0073534   -44.94   0.000    -.3452526   -.3156315
                   5  |  -.0976767   .0085049   -11.48   0.000    -.1148063    -.080547
                   6  |  -.3922356   .0066928   -58.61   0.000    -.4057156   -.3787555
                   7  |   -.247266   .0066655   -37.10   0.000    -.2606909    -.233841
                   8  |  -.1099323   .0102287   -10.75   0.000     -.130534   -.0893306
                   9  |  -.4349981    .005825   -74.68   0.000    -.4467302   -.4232661
                  10  |   -.373858   .0060481   -61.81   0.000    -.3860394   -.3616766
                  11  |  -.2759889   .0063351   -43.57   0.000    -.2887483   -.2632294
                  12  |  -.4373691   .0087877   -49.77   0.000    -.4550684   -.4196698
                      |
                unemp |  -.0061248   .0007307    -8.38   0.000    -.0075964   -.0046531
                      |
              quarter |
                   2  |   .0037489   .0018687     2.01   0.051    -.0000148    .0075126
                   3  |   .0043169   .0018566     2.33   0.025     .0005775    .0080562
                   4  |   .0150664   .0017543     8.59   0.000     .0115331    .0185998
                      |
                _cons |   .5806499   .0246966    23.51   0.000     .5309083    .6303915
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,592,798,535)

Linear regression                               Number of obs     =    868,290
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5061
                                                Root MSE          =     .39369

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0839526   .0070111   -11.97   0.000    -.0980737   -.0698314
             treat_st |  -.0253759   .0070636    -3.59   0.001    -.0396026   -.0111491
treat_stblackrelwhite |  -.0282325   .0082662    -3.42   0.001    -.0448816   -.0115835
                      |
                state |
                  RI  |  -.0954188    .000898  -106.25   0.000    -.0972275     -.09361
                  CT  |   .0047377   .0004192    11.30   0.000     .0038935     .005582
                  NY  |  -.0531547    .000933   -56.97   0.000    -.0550338   -.0512756
                  NJ  |   .0137075   .0008273    16.57   0.000     .0120414    .0153737
                  PA  |  -.1374701   .0018487   -74.36   0.000    -.1411936   -.1337466
                  OH  |  -.1685867   .0023732   -71.04   0.000    -.1733666   -.1638067
                  IN  |  -.1632905   .0043333   -37.68   0.000    -.1720182   -.1545629
                  IL  |  -.0973554   .0013702   -71.05   0.000     -.100115   -.0945957
                  MI  |  -.1378301    .002662   -51.78   0.000    -.1431916   -.1324686
                  WI  |  -.1143393   .0040403   -28.30   0.000    -.1224769   -.1062017
                  MN  |   -.056618   .0022122   -25.59   0.000    -.0610735   -.0521625
                  IA  |  -.1314486   .0105982   -12.40   0.000    -.1527944   -.1101027
                  MO  |  -.1757367   .0025641   -68.54   0.000     -.180901   -.1705724
                  ND  |  -.1506951   .0128099   -11.76   0.000    -.1764955   -.1248947
                  SD  |  -.1678182   .0120279   -13.95   0.000    -.1920437   -.1435927
                  NE  |  -.1615841   .0092368   -17.49   0.000     -.180188   -.1429801
                  KS  |  -.1594038   .0088854   -17.94   0.000       -.1773   -.1415077
                  DE  |  -.0552227   .0087282    -6.33   0.000    -.0728022   -.0376433
                  MD  |   -.000702   .0029592    -0.24   0.814    -.0066621    .0052581
                  DC  |   .0629957   .0056059    11.24   0.000     .0517049    .0742865
                  VA  |  -.0391511    .007735    -5.06   0.000    -.0547302   -.0235719
                  NC  |  -.1219501   .0086008   -14.18   0.000     -.139273   -.1046273
                  SC  |  -.1601681    .008859   -18.08   0.000     -.178011   -.1423251
                  GA  |  -.0951047   .0080736   -11.78   0.000    -.1113658   -.0788436
                  FL  |  -.1346081   .0073945   -18.20   0.000    -.1495014   -.1197148
                  KY  |  -.1833364   .0046918   -39.08   0.000    -.1927861   -.1738867
                  TN  |  -.1732631   .0083404   -20.77   0.000    -.1900614   -.1564647
                  AL  |  -.1853578   .0089294   -20.76   0.000    -.2033424   -.1673731
                  MS  |  -.2009964   .0106729   -18.83   0.000    -.2224929      -.1795
                  AR  |  -.2054702   .0097678   -21.04   0.000    -.2251437   -.1857968
                  LA  |  -.1915779   .0081003   -23.65   0.000    -.2078928    -.175263
                  OK  |  -.2254114   .0053751   -41.94   0.000    -.2362374   -.2145855
                  TX  |  -.0978026   .0074085   -13.20   0.000    -.1127241   -.0828811
                  ID  |  -.1377904   .0099415   -13.86   0.000    -.1578136   -.1177673
                  WY  |  -.0883998   .0125278    -7.06   0.000    -.1136322   -.0631675
                  CO  |  -.0948837   .0008071  -117.56   0.000    -.0965093   -.0932582
                  NM  |  -.1828038   .0037054   -49.34   0.000    -.1902668   -.1753408
                  AZ  |  -.0918741   .0072307   -12.71   0.000    -.1064375   -.0773107
                  UT  |  -.1449909    .007562   -19.17   0.000    -.1602216   -.1297603
                  NV  |  -.0452616   .0074037    -6.11   0.000    -.0601735   -.0303498
                  WA  |  -.0432677   .0010025   -43.16   0.000     -.045287   -.0412485
                  OR  |  -.1048678   .0016289   -64.38   0.000    -.1081487    -.101587
                  CA  |   .0152157   .0007887    19.29   0.000     .0136271    .0168043
                  AK  |   .0746392    .003797    19.66   0.000     .0669917    .0822866
                  HI  |  -.0228466   .0023153    -9.87   0.000    -.0275099   -.0181833
                      |
                 year |
                1990  |  -.0067065   .0025361    -2.64   0.011    -.0118146   -.0015985
                1991  |  -.0016127   .0025981    -0.62   0.538    -.0068456    .0036202
                1992  |    .017926    .003342     5.36   0.000     .0111948    .0246572
                1993  |   .0135303    .003481     3.89   0.000     .0065193    .0205413
                1996  |     .00007   .0039571     0.02   0.986    -.0079001    .0080401
                1997  |   .0155255   .0042208     3.68   0.001     .0070244    .0240266
                1998  |   .0470173   .0040133    11.72   0.000      .038934    .0551005
                1999  |     .06693   .0047904    13.97   0.000     .0572817    .0765783
                2000  |   .0822371   .0048158    17.08   0.000     .0725376    .0919366
                2001  |   .0932348   .0056364    16.54   0.000     .0818826    .1045871
                2002  |   .1065101    .005081    20.96   0.000     .0962765    .1167438
                2003  |   .1160175   .0052993    21.89   0.000     .1053443    .1266908
                2004  |   .1071381   .0056603    18.93   0.000     .0957377    .1185385
                2005  |   .0964946   .0059529    16.21   0.000      .084505    .1084843
                2006  |   .0921457   .0050046    18.41   0.000     .0820658    .1022256
                2007  |   .0935311   .0055398    16.88   0.000     .0823735    .1046888
                2008  |   .0851773   .0068488    12.44   0.000     .0713831    .0989715
                2009  |   .1012418   .0058126    17.42   0.000     .0895345    .1129491
                2010  |   .0983738    .005359    18.36   0.000     .0875803    .1091673
                2011  |   .0801297   .0059548    13.46   0.000     .0681361    .0921233
                2012  |   .0653395   .0067873     9.63   0.000     .0516692    .0790099
                2013  |    .066158   .0070139     9.43   0.000     .0520314    .0802847
                2014  |   .0639189   .0070645     9.05   0.000     .0496902    .0781476
                2015  |   .0781987     .00576    13.58   0.000     .0665974    .0897999
                2016  |   .0915907   .0071343    12.84   0.000     .0772216    .1059598
                2017  |   .1038848   .0075113    13.83   0.000     .0887564    .1190133
                2018  |   .1086653   .0075139    14.46   0.000     .0935317     .123799
                2019  |   .1208197   .0072377    16.69   0.000     .1062421    .1353973
                      |
                 nind |
                   2  |   .0516769   .0409306     1.26   0.213    -.0307616    .1341154
                   3  |   .1278568   .0389004     3.29   0.002     .0495074    .2062062
                   4  |  -.0826222   .0390639    -2.12   0.040     -.161301   -.0039434
                   5  |   .1119671   .0385188     2.91   0.006     .0343863    .1895479
                   6  |   .0894438   .0399325     2.24   0.030     .0090156     .169872
                   7  |   .0382188   .0413995     0.92   0.361     -.045164    .1216016
                   8  |   -.013752   .0421506    -0.33   0.746    -.0986476    .0711436
                   9  |  -.0868783   .0438234    -1.98   0.054    -.1751431    .0013866
                  10  |  -.0764062    .039957    -1.91   0.062    -.1568837    .0040713
                  11  |   .0892317   .0440761     2.02   0.049      .000458    .1780054
                      |
                 educ |   .0868877   .0019311    44.99   0.000     .0829982    .0907773
                exper |   .0474113   .0022404    21.16   0.000     .0428989    .0519238
               exper2 |  -.0015256   .0000972   -15.69   0.000    -.0017214   -.0013298
               exper3 |   .0000235   2.92e-06     8.04   0.000     .0000176    .0000293
               exper4 |  -1.18e-07   3.05e-08    -3.88   0.000    -1.80e-07   -5.70e-08
                 edex |  -.0005913   .0001002    -5.90   0.000    -.0007931   -.0003894
                      |
                ee_cl |
                   2  |  -.1200511   .0045673   -26.29   0.000    -.1292501   -.1108521
                   3  |  -.1510181   .0063426   -23.81   0.000    -.1637927   -.1382435
                   4  |   -.142795   .0104198   -13.70   0.000    -.1637816   -.1218085
                   5  |  -.1506924   .0083763   -17.99   0.000    -.1675632   -.1338216
                   6  |  -.1628074    .007969   -20.43   0.000    -.1788577   -.1467571
                   7  |  -.1617708   .0085566   -18.91   0.000    -.1790046    -.144537
                   8  |  -.0734305   .0103325    -7.11   0.000    -.0942412   -.0526197
                   9  |  -.1602766   .0108302   -14.80   0.000    -.1820898   -.1384634
                  10  |  -.1703688   .0102608   -16.60   0.000    -.1910352   -.1497025
                  11  |  -.1527471   .0093473   -16.34   0.000    -.1715736   -.1339206
                  12  |  -.0888433   .0093672    -9.48   0.000    -.1077099   -.0699767
                  13  |  -.1262594   .0160497    -7.87   0.000    -.1585851   -.0939337
                  14  |  -.1515823   .0113588   -13.34   0.000    -.1744601   -.1287046
                  15  |  -.1213962   .0103575   -11.72   0.000    -.1422572   -.1005352
                  16  |  -.0805298   .0111283    -7.24   0.000    -.1029433   -.0581163
                      |
                 marr |   .0386364   .0024349    15.87   0.000     .0337322    .0435406
                partt |  -.1388881   .0029028   -47.85   0.000    -.1447347   -.1330415
               public |   .0154133   .0058087     2.65   0.011      .003714    .0271126
                 cmsa |   .1535661    .007941    19.34   0.000     .1375721    .1695601
                      |
                nocc2 |
                   2  |  -.1382391   .0032295   -42.81   0.000    -.1447436   -.1317346
                   3  |  -.0377631    .007125    -5.30   0.000    -.0521136   -.0234126
                   4  |  -.3254992   .0045646   -71.31   0.000    -.3346928   -.3163057
                   5  |    .030333   .0063756     4.76   0.000     .0174919    .0431742
                   6  |  -.3378347   .0047483   -71.15   0.000    -.3473982   -.3282712
                   7  |   -.366925   .0046656   -78.65   0.000    -.3763219    -.357528
                   8  |  -.1757701   .0077508   -22.68   0.000    -.1913811   -.1601591
                   9  |  -.4261523   .0058372   -73.01   0.000     -.437909   -.4143956
                  10  |  -.4500708   .0087731   -51.30   0.000    -.4677407    -.432401
                  11  |  -.2358379   .0074516   -31.65   0.000    -.2508462   -.2208296
                  12  |  -.4245189   .0095653   -44.38   0.000    -.4437844   -.4052535
                      |
              quarter |
                   2  |   .0094887   .0014869     6.38   0.000      .006494    .0124835
                   3  |   .0182543   .0018623     9.80   0.000     .0145033    .0220052
                   4  |   .0217554   .0011851    18.36   0.000     .0193685    .0241422
                      |
                _cons |   .4903406   .0408293    12.01   0.000     .4081063     .572575
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,592,798,535)

Linear regression                               Number of obs     =    868,290
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5061
                                                Root MSE          =     .39368

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0839582   .0070112   -11.97   0.000    -.0980796   -.0698369
             treat_st |  -.0261833   .0072755    -3.60   0.001    -.0408368   -.0115297
treat_stblackrelwhite |  -.0282469   .0082792    -3.41   0.001     -.044922   -.0115718
                      |
                state |
                  RI  |  -.0924465   .0019741   -46.83   0.000    -.0964225   -.0884704
                  CT  |   .0049173    .000426    11.54   0.000     .0040592    .0057754
                  NY  |  -.0510784   .0013201   -38.69   0.000    -.0537372   -.0484195
                  NJ  |   .0151984   .0010645    14.28   0.000     .0130545    .0173424
                  PA  |  -.1364507    .001953   -69.87   0.000    -.1403842   -.1325172
                  OH  |  -.1668649   .0025661   -65.03   0.000    -.1720332   -.1616965
                  IN  |  -.1630569   .0043649   -37.36   0.000    -.1718483   -.1542655
                  IL  |  -.0945752   .0018859   -50.15   0.000    -.0983735   -.0907768
                  MI  |  -.1334864   .0035754   -37.33   0.000    -.1406877   -.1262852
                  WI  |  -.1155408   .0041112   -28.10   0.000    -.1238211   -.1072605
                  MN  |  -.0591464   .0026572   -22.26   0.000    -.0644982   -.0537946
                  IA  |  -.1344344   .0108052   -12.44   0.000    -.1561971   -.1126716
                  MO  |  -.1752851   .0025832   -67.85   0.000     -.180488   -.1700822
                  ND  |  -.1552309   .0131296   -11.82   0.000    -.1816752   -.1287866
                  SD  |  -.1722086   .0123445   -13.95   0.000    -.1970717   -.1473456
                  NE  |  -.1666453   .0096517   -17.27   0.000    -.1860849   -.1472057
                  KS  |  -.1607373   .0090272   -17.81   0.000    -.1789189   -.1425557
                  DE  |  -.0571502    .008816    -6.48   0.000    -.0749065    -.039394
                  MD  |  -.0018155   .0031193    -0.58   0.563     -.008098     .004467
                  DC  |   .0679594    .005792    11.73   0.000     .0562936    .0796251
                  VA  |  -.0411053   .0078916    -5.21   0.000    -.0569998   -.0252108
                  NC  |  -.1203353    .008845   -13.60   0.000      -.13815   -.1025207
                  SC  |  -.1570721   .0092687   -16.95   0.000    -.1757402   -.1384041
                  GA  |  -.0931324   .0083615   -11.14   0.000    -.1099733   -.0762915
                  FL  |  -.1325703   .0077523   -17.10   0.000    -.1481843   -.1169563
                  KY  |  -.1809881    .004906   -36.89   0.000    -.1908692    -.171107
                  TN  |  -.1714213   .0086174   -19.89   0.000    -.1887777   -.1540649
                  AL  |  -.1824279   .0093236   -19.57   0.000    -.2012065   -.1636493
                  MS  |  -.1959239   .0112676   -17.39   0.000    -.2186181   -.1732298
                  AR  |  -.2035139   .0100371   -20.28   0.000    -.2237297   -.1832981
                  LA  |  -.1881924   .0085892   -21.91   0.000     -.205492   -.1708928
                  OK  |  -.2266137   .0054706   -41.42   0.000    -.2376322   -.2155953
                  TX  |  -.0959813   .0076986   -12.47   0.000    -.1114871   -.0804755
                  ID  |  -.1371677   .0101195   -13.55   0.000    -.1575494    -.116786
                  WY  |  -.0902178   .0127556    -7.07   0.000     -.115909   -.0645267
                  CO  |  -.0961411   .0011815   -81.37   0.000    -.0985208   -.0937613
                  NM  |  -.1808584   .0037504   -48.22   0.000    -.1884121   -.1733046
                  AZ  |  -.0894843   .0076281   -11.73   0.000    -.1048482   -.0741205
                  UT  |  -.1469597   .0077098   -19.06   0.000     -.162488   -.1314314
                  NV  |   -.042232     .00794    -5.32   0.000    -.0582241     -.02624
                  WA  |  -.0409188   .0015873   -25.78   0.000    -.0441159   -.0377217
                  OR  |  -.1015553   .0024244   -41.89   0.000    -.1064383   -.0966723
                  CA  |   .0196827   .0024269     8.11   0.000     .0147946    .0245708
                  AK  |   .0805044   .0045403    17.73   0.000     .0713598     .089649
                  HI  |  -.0260496   .0030175    -8.63   0.000    -.0321272    -.019972
                      |
                 year |
                1990  |  -.0058346   .0025491    -2.29   0.027    -.0109688   -.0007004
                1991  |   .0025442   .0034762     0.73   0.468    -.0044573    .0095457
                1992  |   .0237976   .0047187     5.04   0.000     .0142937    .0333014
                1993  |   .0177123   .0042891     4.13   0.000     .0090735     .026351
                1996  |   .0000825   .0040969     0.02   0.984    -.0081691     .008334
                1997  |   .0142844   .0040549     3.52   0.001     .0061173    .0224514
                1998  |    .044552   .0043161    10.32   0.000      .035859     .053245
                1999  |   .0637384   .0045547    13.99   0.000     .0545648     .072912
                2000  |   .0785466   .0048665    16.14   0.000      .068745    .0883482
                2001  |   .0916876   .0055957    16.39   0.000     .0804173    .1029579
                2002  |   .1079421   .0052332    20.63   0.000     .0974019    .1184822
                2003  |   .1180496    .005656    20.87   0.000     .1066578    .1294415
                2004  |   .1079685   .0057198    18.88   0.000     .0964483    .1194888
                2005  |   .0962477   .0061081    15.76   0.000     .0839453    .1085502
                2006  |    .090615   .0051755    17.51   0.000      .080191     .101039
                2007  |   .0918518   .0056284    16.32   0.000     .0805157    .1031879
                2008  |   .0866879   .0067989    12.75   0.000     .0729942    .1003817
                2009  |   .1124674   .0084155    13.36   0.000     .0955177    .1294171
                2010  |   .1105282   .0072278    15.29   0.000     .0959706    .1250858
                2011  |    .090254   .0064168    14.07   0.000     .0773298    .1031781
                2012  |   .0730097   .0062614    11.66   0.000     .0603986    .0856208
                2013  |   .0720635   .0066456    10.84   0.000     .0586785    .0854485
                2014  |   .0664608   .0065681    10.12   0.000      .053232    .0796896
                2015  |   .0782882   .0056357    13.89   0.000     .0669373    .0896391
                2016  |   .0906251   .0071147    12.74   0.000     .0762953    .1049548
                2017  |    .101482   .0078789    12.88   0.000     .0856131    .1173509
                2018  |   .1050177   .0084827    12.38   0.000     .0879328    .1221027
                2019  |     .11659   .0082231    14.18   0.000     .1000278    .1331521
                      |
                 nind |
                   2  |   .0515432   .0409366     1.26   0.214    -.0309073    .1339937
                   3  |   .1277514   .0389167     3.28   0.002     .0493691    .2061337
                   4  |  -.0826769   .0390684    -2.12   0.040    -.1613646   -.0039891
                   5  |   .1119272   .0385061     2.91   0.006     .0343719    .1894825
                   6  |   .0893835   .0399435     2.24   0.030     .0089331    .1698339
                   7  |   .0381351   .0414036     0.92   0.362    -.0452561    .1215262
                   8  |  -.0138119   .0421548    -0.33   0.745    -.0987161    .0710923
                   9  |  -.0869591   .0438424    -1.98   0.053    -.1752623    .0013441
                  10  |  -.0764702   .0399567    -1.91   0.062    -.1569472    .0040068
                  11  |   .0891343   .0440954     2.02   0.049     .0003215     .177947
                      |
                 educ |   .0868874   .0019348    44.91   0.000     .0829905    .0907844
                exper |   .0474268    .002239    21.18   0.000     .0429172    .0519364
               exper2 |  -.0015268   .0000971   -15.72   0.000    -.0017224   -.0013312
               exper3 |   .0000235   2.92e-06     8.06   0.000     .0000176    .0000294
               exper4 |  -1.19e-07   3.05e-08    -3.89   0.000    -1.80e-07   -5.74e-08
                 edex |  -.0005913   .0001002    -5.90   0.000    -.0007932   -.0003895
                      |
                ee_cl |
                   2  |  -.1200127   .0045824   -26.19   0.000    -.1292421   -.1107832
                   3  |   -.150956   .0063673   -23.71   0.000    -.1637805   -.1381315
                   4  |  -.1427457   .0104526   -13.66   0.000    -.1637984   -.1216931
                   5  |  -.1507178   .0083784   -17.99   0.000    -.1675928   -.1338429
                   6  |  -.1627896   .0079901   -20.37   0.000    -.1788826   -.1466966
                   7  |   -.161702   .0085838   -18.84   0.000    -.1789907   -.1444132
                   8  |  -.0733755   .0103699    -7.08   0.000    -.0942616   -.0524895
                   9  |  -.1602559   .0108434   -14.78   0.000    -.1820957   -.1384161
                  10  |  -.1703333   .0102729   -16.58   0.000     -.191024   -.1496425
                  11  |  -.1526545   .0093695   -16.29   0.000    -.1715256   -.1337833
                  12  |  -.0887652   .0093954    -9.45   0.000    -.1076885   -.0698419
                  13  |  -.1262152    .016066    -7.86   0.000    -.1585738   -.0938566
                  14  |  -.1515079   .0113715   -13.32   0.000    -.1744113   -.1286045
                  15  |  -.1212937   .0103795   -11.69   0.000    -.1421992   -.1003883
                  16  |  -.0804658   .0111368    -7.23   0.000    -.1028965   -.0580351
                      |
                 marr |   .0386299   .0024314    15.89   0.000     .0337327    .0435271
                partt |  -.1388543   .0029079   -47.75   0.000    -.1447112   -.1329975
               public |   .0154318   .0058095     2.66   0.011     .0037309    .0271328
                 cmsa |    .153551    .007945    19.33   0.000      .137549    .1695531
                      |
                nocc2 |
                   2  |  -.1382591   .0032302   -42.80   0.000     -.144765   -.1317533
                   3  |  -.0377937   .0071168    -5.31   0.000    -.0521276   -.0234598
                   4  |  -.3254917   .0045601   -71.38   0.000    -.3346762   -.3163071
                   5  |   .0303118   .0063746     4.76   0.000     .0174726     .043151
                   6  |  -.3378327   .0047445   -71.21   0.000    -.3473887   -.3282768
                   7  |   -.366942   .0046648   -78.66   0.000    -.3763375   -.3575465
                   8  |  -.1757515   .0077614   -22.64   0.000    -.1913838   -.1601191
                   9  |  -.4261523   .0058344   -73.04   0.000    -.4379033   -.4144012
                  10  |   -.450185   .0087626   -51.38   0.000    -.4678338   -.4325362
                  11  |  -.2359107   .0074407   -31.71   0.000     -.250897   -.2209244
                  12  |  -.4245679   .0095511   -44.45   0.000    -.4438049   -.4053309
                      |
                unemp |  -.0028104   .0015345    -1.83   0.074     -.005901    .0002802
                      |
              quarter |
                   2  |   .0094935   .0014893     6.37   0.000     .0064939    .0124932
                   3  |   .0182484   .0018625     9.80   0.000     .0144972    .0219997
                   4  |    .021751   .0011825    18.39   0.000     .0193692    .0241327
                      |
                _cons |    .503901   .0432973    11.64   0.000     .4166958    .5911062
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,592,798,535)

Linear regression                               Number of obs     =    868,290
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5046
                                                Root MSE          =     .39427

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0847894   .0068193   -12.43   0.000    -.0985241   -.0710547
             treat_st |  -.0590177   .0119473    -4.94   0.000    -.0830807   -.0349546
treat_stblackrelwhite |  -.0274408   .0083187    -3.30   0.002    -.0441954   -.0106862
                      |
                state |
                  RI  |  -.0714575   .0053304   -13.41   0.000    -.0821936   -.0607215
                  CT  |   .1488027   .0055083    27.01   0.000     .1377083     .159897
                  NY  |   .0844491   .0036316    23.25   0.000     .0771347    .0917635
                  NJ  |   .1483728   .0060955    24.34   0.000     .1360959    .1606497
                  PA  |   .0601588    .003483    17.27   0.000     .0531438    .0671739
                  OH  |  -.0191035   .0062768    -3.04   0.004    -.0317456   -.0064614
                  IN  |  -.1588788   .0439516    -3.61   0.001    -.2474018   -.0703559
                  IL  |  -.0309266   .0040952    -7.55   0.000    -.0391747   -.0226785
                  MI  |  -.0423672   .0364237    -1.16   0.251    -.1157283    .0309938
                  WI  |  -.3091869   .0337701    -9.16   0.000    -.3772034   -.2411704
                  MN  |  -.1003928   .0044357   -22.63   0.000    -.1093268   -.0914588
                  IA  |  -.0565492   .0134758    -4.20   0.000    -.0836909   -.0294075
                  MO  |   .0656667   .0044808    14.66   0.000     .0566419    .0746916
                  ND  |  -.7752882   .0145372   -53.33   0.000    -.8045677   -.7460087
                  SD  |  -.3343614   .0111937   -29.87   0.000    -.3569068    -.311816
                  NE  |  -.2898491   .0125103   -23.17   0.000    -.3150461   -.2646521
                  KS  |  -.0698367   .0112324    -6.22   0.000    -.0924599   -.0472136
                  DE  |   .2465663   .0157512    15.65   0.000     .2148417    .2782908
                  MD  |  -.2398847   .0065057   -36.87   0.000    -.2529878   -.2267815
                  DC  |  -.1373199   .0163188    -8.41   0.000    -.1701877   -.1044522
                  VA  |   -.062711   .0124602    -5.03   0.000    -.0878072   -.0376147
                  NC  |   .1868803   .0131199    14.24   0.000     .1604555    .2133052
                  SC  |   .1544163   .0130028    11.88   0.000     .1282272    .1806053
                  GA  |   .2935031   .0121814    24.09   0.000     .2689685    .3180377
                  FL  |   .0858519   .0119718     7.17   0.000     .0617394    .1099644
                  KY  |  -.1295326   .0234819    -5.52   0.000    -.1768276   -.0822376
                  TN  |  -.0595338   .0115352    -5.16   0.000    -.0827668   -.0363008
                  AL  |  -.0354709   .0120409    -2.95   0.005    -.0597226   -.0112192
                  MS  |   .0244671   .0153356     1.60   0.118    -.0064204    .0553546
                  AR  |    .014089   .0193861     0.73   0.471    -.0249567    .0531347
                  LA  |   .0302247   .0139827     2.16   0.036      .002062    .0583874
                  OK  |  -.3419158   .0541885    -6.31   0.000    -.4510569   -.2327746
                  TX  |  -.0443904   .0131613    -3.37   0.002    -.0708986   -.0178821
                  ID  |   .1837777   .0229162     8.02   0.000     .1376222    .2299333
                  WY  |   -.601436   .0134265   -44.79   0.000    -.6284785   -.5743936
                  CO  |   -.152319   .0035271   -43.19   0.000     -.159423   -.1452151
                  NM  |  -.3935656   .0177339   -22.19   0.000    -.4292835   -.3578477
                  AZ  |  -.0626876   .0116823    -5.37   0.000     -.086217   -.0391583
                  UT  |  -.1044923   .0126577    -8.26   0.000    -.1299863   -.0789984
                  NV  |   .1321498   .0131515    10.05   0.000     .1056613    .1586382
                  WA  |  -.3310123   .0056617   -58.47   0.000    -.3424155   -.3196092
                  OR  |  -.0949621   .0061499   -15.44   0.000    -.1073487   -.0825756
                  CA  |  -.0144253   .0049415    -2.92   0.005     -.024378   -.0044725
                  AK  |   .4840856   .0040468   119.62   0.000      .475935    .4922362
                  HI  |  -.0841635   .0077439   -10.87   0.000    -.0997605   -.0685666
                      |
        state#c.lyear |
                  MA  |   .0043339   .0000947    45.74   0.000      .004143    .0045247
                  RI  |   .0041486    .000088    47.15   0.000     .0039714    .0043258
                  CT  |   .0029568    .000077    38.41   0.000     .0028018    .0031119
                  NY  |   .0030291   .0000686    44.17   0.000     .0028909    .0031672
                  NJ  |   .0030645   .0000668    45.91   0.000     .0029301     .003199
                  PA  |   .0024485   .0000711    34.46   0.000     .0023054    .0025916
                  OH  |   .0029254   .0000501    58.39   0.000     .0028245    .0030263
                  IN  |   .0043872   .0004492     9.77   0.000     .0034825     .005292
                  IL  |   .0037275   .0000801    46.56   0.000     .0035662    .0038887
                  MI  |   .0035267   .0003779     9.33   0.000     .0027655    .0042879
                  WI  |   .0062561   .0003458    18.09   0.000     .0055597    .0069526
                  MN  |   .0047489   .0000819    58.01   0.000      .004584    .0049138
                  IA  |   .0039205   .0001055    37.15   0.000      .003708    .0041331
                  MO  |    .002025   .0000869    23.30   0.000     .0018499    .0022001
                  ND  |   .0106545   .0001063   100.26   0.000     .0104405    .0108685
                  SD  |   .0062933   .0000663    94.87   0.000     .0061597    .0064269
                  NE  |   .0058615   .0001109    52.85   0.000     .0056381    .0060849
                  KS  |   .0038018   .0000754    50.41   0.000     .0036499    .0039537
                  DE  |   .0012797   .0001371     9.34   0.000     .0010036    .0015557
                  MD  |   .0066123   .0000839    78.78   0.000     .0064433    .0067814
                  DC  |   .0062901   .0001477    42.58   0.000     .0059926    .0065876
                  VA  |   .0048779   .0001387    35.16   0.000     .0045984    .0051573
                  NC  |   .0016971   .0001418    11.97   0.000     .0014114    .0019827
                  SC  |   .0016619   .0001239    13.41   0.000     .0014123    .0019115
                  GA  |    .000935   .0001286     7.27   0.000     .0006761     .001194
                  FL  |   .0025692   .0000774    33.20   0.000     .0024133    .0027251
                  KY  |   .0038829   .0002414    16.09   0.000     .0033968     .004369
                  TN  |    .003587   .0001002    35.81   0.000     .0033852    .0037888
                  AL  |    .003252   .0000978    33.26   0.000     .0030551    .0034489
                  MS  |   .0025426   .0001194    21.29   0.000     .0023021    .0027831
                  AR  |   .0025831   .0001811    14.26   0.000     .0022182    .0029479
                  LA  |   .0025439   .0001049    24.26   0.000     .0023327    .0027552
                  OK  |   .0056701   .0005936     9.55   0.000     .0044746    .0068656
                  TX  |   .0041546   .0000915    45.38   0.000     .0039702    .0043389
                  ID  |   .0016051   .0002122     7.56   0.000     .0011777    .0020325
                  WY  |   .0094494   .0000656   144.11   0.000     .0093173    .0095814
                  CO  |   .0048839   .0000917    53.25   0.000     .0046992    .0050687
                  NM  |   .0063999   .0002054    31.16   0.000     .0059862    .0068135
                  AZ  |   .0044067   .0000883    49.89   0.000     .0042288    .0045846
                  UT  |   .0042635   .0000802    53.19   0.000      .004102    .0044249
                  NV  |    .003005   .0000795    37.81   0.000     .0028449     .003165
                  WA  |    .007124   .0001192    59.78   0.000      .006884    .0073641
                  OR  |   .0042856   .0001095    39.13   0.000      .004065    .0045062
                  CA  |   .0046801   .0000689    67.94   0.000     .0045414    .0048189
                  AK  |   .0003881   .0000544     7.13   0.000     .0002785    .0004977
                  HI  |   .0049335   .0000552    89.33   0.000     .0048223    .0050448
                      |
                 nind |
                   2  |   .0544122   .0408593     1.33   0.190    -.0278827    .1367071
                   3  |   .1277541   .0388355     3.29   0.002     .0495355    .2059727
                   4  |  -.0809274   .0389636    -2.08   0.044    -.1594042   -.0024506
                   5  |   .1145951   .0382631     2.99   0.004     .0375294    .1916609
                   6  |   .0909334   .0398696     2.28   0.027      .010632    .1712349
                   7  |   .0399575   .0412946     0.97   0.338    -.0432141    .1231291
                   8  |   -.012022    .042096    -0.29   0.777    -.0968076    .0727636
                   9  |   -.085266   .0437366    -1.95   0.057     -.173356    .0028241
                  10  |  -.0763993   .0398488    -1.92   0.062    -.1566589    .0038603
                  11  |   .0911727    .044029     2.07   0.044     .0024938    .1798517
                      |
                 educ |   .0850815   .0019726    43.13   0.000     .0811085    .0890544
                exper |   .0466578   .0022259    20.96   0.000     .0421745     .051141
               exper2 |  -.0014831   .0000963   -15.41   0.000     -.001677   -.0012892
               exper3 |   .0000221   2.91e-06     7.61   0.000     .0000163     .000028
               exper4 |  -1.06e-07   3.04e-08    -3.49   0.001    -1.67e-07   -4.49e-08
                 edex |  -.0005625   .0001014    -5.55   0.000    -.0007666   -.0003583
                      |
                ee_cl |
                   2  |  -.1204953   .0046718   -25.79   0.000    -.1299048   -.1110858
                   3  |  -.1481013   .0065234   -22.70   0.000    -.1612402   -.1349625
                   4  |  -.1362472   .0105125   -12.96   0.000    -.1574204    -.115074
                   5  |   -.155904   .0083629   -18.64   0.000    -.1727478   -.1390602
                   6  |  -.1641833   .0079859   -20.56   0.000    -.1802677   -.1480989
                   7  |  -.1588333   .0088098   -18.03   0.000    -.1765772   -.1410894
                   8  |  -.0675165   .0105253    -6.41   0.000    -.0887156   -.0463175
                   9  |  -.1637961   .0108542   -15.09   0.000    -.1856577   -.1419346
                  10  |  -.1688928   .0103486   -16.32   0.000     -.189736   -.1480497
                  11  |   -.148515   .0095069   -15.62   0.000    -.1676628   -.1293672
                  12  |  -.0831169   .0093985    -8.84   0.000    -.1020464   -.0641873
                  13  |  -.1284762   .0160032    -8.03   0.000    -.1607082   -.0962442
                  14  |  -.1490219   .0114291   -13.04   0.000    -.1720413   -.1260024
                  15  |  -.1179139   .0105596   -11.17   0.000     -.139182   -.0966458
                  16  |  -.0774535   .0110496    -7.01   0.000    -.0997085   -.0551985
                      |
                 marr |   .0382967   .0024118    15.88   0.000     .0334391    .0431543
                partt |  -.1389282   .0029361   -47.32   0.000    -.1448418   -.1330147
               public |   .0151306   .0057336     2.64   0.011     .0035826    .0266786
                 cmsa |   .1535971   .0079287    19.37   0.000     .1376279    .1695663
                      |
                nocc2 |
                   2  |  -.1375791   .0033372   -41.23   0.000    -.1443005   -.1308576
                   3  |  -.0369249   .0071815    -5.14   0.000    -.0513891   -.0224607
                   4  |  -.3243025   .0046262   -70.10   0.000    -.3336202   -.3149847
                   5  |   .0301562    .006409     4.71   0.000     .0172479    .0430646
                   6  |  -.3379433     .00482   -70.11   0.000    -.3476514   -.3282352
                   7  |  -.3671301   .0047294   -77.63   0.000    -.3766557   -.3576046
                   8  |  -.1744606   .0079067   -22.06   0.000    -.1903855   -.1585356
                   9  |  -.4261075   .0058878   -72.37   0.000    -.4379662   -.4142488
                  10  |  -.4519038   .0087599   -51.59   0.000    -.4695471   -.4342605
                  11  |  -.2345814   .0074241   -31.60   0.000    -.2495343   -.2196285
                  12  |  -.4251873   .0096708   -43.97   0.000    -.4446653   -.4057092
                      |
                unemp |  -.0025672   .0005561    -4.62   0.000    -.0036873   -.0014471
                      |
              quarter |
                   2  |   .0091396   .0014329     6.38   0.000     .0062535    .0120256
                   3  |   .0178215   .0018079     9.86   0.000     .0141801    .0214628
                   4  |   .0213139   .0011995    17.77   0.000      .018898    .0237297
                      |
                _cons |   .1393049   .0418553     3.33   0.002      .055004    .2236058
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,585,364,402)

Linear regression                               Number of obs     =    178,512
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3410
                                                Root MSE          =     .36166

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1403164    .012255   -11.45   0.000    -.1649993   -.1156335
             treat_st |  -.0571942   .0313693    -1.82   0.075    -.1203752    .0059869
treat_stblackrelwhite |  -.0145271    .014724    -0.99   0.329    -.0441828    .0151287
                      |
                state |
                  RI  |  -.0613611   .0011021   -55.68   0.000    -.0635808   -.0591413
                  CT  |   .0467172   .0014786    31.60   0.000     .0437391    .0496953
                  NY  |    .015212   .0024957     6.10   0.000     .0101855    .0202385
                  NJ  |   .0857934   .0013757    62.36   0.000     .0830225    .0885642
                  PA  |  -.0905271   .0041393   -21.87   0.000    -.0988641     -.08219
                  OH  |  -.0915799   .0055412   -16.53   0.000    -.1027404   -.0804193
                  IN  |  -.0688004   .0093526    -7.36   0.000    -.0876374   -.0499634
                  IL  |  -.0075638   .0045254    -1.67   0.102    -.0166783    .0015508
                  MI  |  -.0082869   .0065445    -1.27   0.212    -.0214681    .0048944
                  WI  |  -.0683403   .0065041   -10.51   0.000    -.0814402   -.0552405
                  MN  |  -.0297501   .0033409    -8.90   0.000     -.036479   -.0230212
                  IA  |  -.0602379   .0347284    -1.73   0.090    -.1301844    .0097086
                  MO  |  -.0719615   .0062745   -11.47   0.000     -.084599   -.0593241
                  ND  |  -.0465098   .0368713    -1.26   0.214    -.1207725    .0277528
                  SD  |   -.091348   .0350964    -2.60   0.012    -.1620357   -.0206602
                  NE  |   -.099521   .0331426    -3.00   0.004    -.1662735   -.0327684
                  KS  |  -.0300111   .0325706    -0.92   0.362    -.0956117    .0355895
                  DE  |  -.0331503   .0128144    -2.59   0.013    -.0589598   -.0073407
                  MD  |   .0288039    .003906     7.37   0.000     .0209367     .036671
                  DC  |    .034922   .0084449     4.14   0.000     .0179131     .051931
                  VA  |    .068462   .0324556     2.11   0.041      .003093     .133831
                  NC  |  -.0402857   .0337977    -1.19   0.240    -.1083578    .0277864
                  SC  |  -.0883142   .0336728    -2.62   0.012    -.1561348   -.0204936
                  GA  |   .0039983   .0333067     0.12   0.905    -.0630848    .0710815
                  FL  |  -.0575975   .0324045    -1.78   0.082    -.1228636    .0076685
                  KY  |  -.1188074   .0088914   -13.36   0.000    -.1367157   -.1008991
                  TN  |  -.0784375   .0330541    -2.37   0.022    -.1450119    -.011863
                  AL  |  -.0752762   .0333509    -2.26   0.029    -.1424483    -.008104
                  MS  |  -.1024664   .0347858    -2.95   0.005    -.1725286   -.0324042
                  AR  |  -.1031662   .0345093    -2.99   0.005    -.1726715    -.033661
                  LA  |  -.0327194   .0323585    -1.01   0.317    -.0978928     .032454
                  OK  |  -.1327734   .0155552    -8.54   0.000    -.1641032   -.1014436
                  TX  |  -.0064978   .0322964    -0.20   0.841     -.071546    .0585505
                  ID  |  -.0521259   .0350687    -1.49   0.144    -.1227579    .0185061
                  WY  |   .1042923   .0374243     2.79   0.008      .028916    .1796687
                  CO  |  -.0843421   .0028609   -29.48   0.000    -.0901042     -.07858
                  NM  |      -.134   .0037985   -35.28   0.000    -.1416506   -.1263494
                  AZ  |  -.0159662   .0324437    -0.49   0.625    -.0813111    .0493787
                  UT  |  -.0771964   .0317029    -2.43   0.019    -.1410494   -.0133434
                  NV  |   .0533318    .033792     1.58   0.122    -.0147288    .1213923
                  WA  |   .0079401   .0033082     2.40   0.021     .0012771    .0146031
                  OR  |  -.0666392   .0030905   -21.56   0.000    -.0728637   -.0604146
                  CA  |   .0812335   .0017201    47.23   0.000     .0777691    .0846979
                  AK  |   .1419311    .005524    25.69   0.000     .1308051     .153057
                  HI  |   -.000694   .0050672    -0.14   0.892    -.0108999     .009512
                      |
                 year |
                1990  |  -.0182583   .0053117    -3.44   0.001    -.0289565     -.00756
                1991  |  -.0315919   .0050661    -6.24   0.000    -.0417957   -.0213882
                1992  |  -.0309077   .0071387    -4.33   0.000    -.0452857   -.0165297
                1993  |  -.0319165   .0060276    -5.30   0.000    -.0440567   -.0197763
                1996  |  -.0145699   .0060285    -2.42   0.020    -.0267119   -.0024278
                1997  |  -.0052619   .0070012    -0.75   0.456    -.0193631    .0088393
                1998  |   .0061547   .0061996     0.99   0.326     -.006332    .0186414
                1999  |   .0166476   .0070638     2.36   0.023     .0024204    .0308748
                2000  |   .0147113   .0066685     2.21   0.033     .0012804    .0281423
                2001  |   .0188989   .0060706     3.11   0.003     .0066721    .0311257
                2002  |   .0276399   .0088569     3.12   0.003     .0098012    .0454786
                2003  |   .0346805    .008285     4.19   0.000     .0179936    .0513674
                2004  |   .0267374   .0065549     4.08   0.000     .0135352    .0399396
                2005  |   .0238774    .008022     2.98   0.005     .0077203    .0400345
                2006  |   .0212772    .010215     2.08   0.043     .0007032    .0418513
                2007  |   .0254584   .0120553     2.11   0.040     .0011778    .0497389
                2008  |    .008481   .0080404     1.05   0.297    -.0077132    .0246752
                2009  |   .0183613   .0091857     2.00   0.052    -.0001397    .0368622
                2010  |   .0276637   .0102692     2.69   0.010     .0069805     .048347
                2011  |   .0082613    .011383     0.73   0.472    -.0146652    .0311879
                2012  |  -.0061315    .012259    -0.50   0.619    -.0308223    .0185594
                2013  |  -.0030074   .0103967    -0.29   0.774    -.0239475    .0179326
                2014  |   .0058165   .0112716     0.52   0.608    -.0168856    .0285187
                2015  |   .0094953    .009718     0.98   0.334    -.0100778    .0290685
                2016  |   .0105273   .0099051     1.06   0.294    -.0094225    .0304771
                2017  |   .0291336   .0091412     3.19   0.003     .0107222    .0475449
                2018  |   .0300113   .0099201     3.03   0.004     .0100312    .0499914
                2019  |    .043851   .0101379     4.33   0.000     .0234323    .0642697
                      |
                 nind |
                   2  |   .0867626   .0192418     4.51   0.000     .0480077    .1255174
                   3  |  -.0356407   .0168241    -2.12   0.040    -.0695262   -.0017551
                   4  |  -.2080127   .0221805    -9.38   0.000    -.2526866   -.1633388
                   5  |   .0856708   .0178061     4.81   0.000     .0498074    .1215342
                   6  |   -.064742   .0208729    -3.10   0.003    -.1067823   -.0227018
                   7  |  -.0781513   .0185386    -4.22   0.000    -.1154899   -.0408126
                   8  |  -.1766122   .0197651    -8.94   0.000    -.2164211   -.1368033
                   9  |  -.1284754   .0207339    -6.20   0.000    -.1702355   -.0867153
                  10  |  -.1456821   .0395013    -3.69   0.001    -.2252417   -.0661225
                  11  |   .0986227   .0200292     4.92   0.000     .0582818    .1389636
                      |
                 educ |   .0722953   .0041291    17.51   0.000     .0639789    .0806116
                exper |   .0715959   .0025223    28.39   0.000     .0665158     .076676
               exper2 |  -.0025705   .0001713   -15.01   0.000    -.0029154   -.0022255
               exper3 |   .0000516   4.87e-06    10.59   0.000     .0000418    .0000614
               exper4 |  -4.19e-07   4.75e-08    -8.82   0.000    -5.15e-07   -3.24e-07
                 edex |  -.0007831   .0001067    -7.34   0.000    -.0009979   -.0005682
                      |
                ee_cl |
                   2  |   .0705588   .0170227     4.14   0.000     .0362733    .1048444
                   3  |   .0571783   .0185212     3.09   0.003     .0198748    .0944819
                   4  |   .0131728    .025932     0.51   0.614     -.039057    .0654026
                   5  |   .0135367   .0213244     0.63   0.529    -.0294128    .0564863
                   6  |   .0459635    .016242     2.83   0.007     .0132503    .0786767
                   7  |   .0548613   .0209064     2.62   0.012     .0127536     .096969
                   8  |   .0152096   .0239649     0.63   0.529    -.0330582    .0634774
                   9  |   .0068213   .0227246     0.30   0.765    -.0389485     .052591
                  10  |   .0318868   .0190852     1.67   0.102    -.0065527    .0703264
                  11  |   .0450406   .0207253     2.17   0.035     .0032978    .0867834
                  12  |   .0596982   .0238321     2.50   0.016      .011698    .1076984
                  13  |   .0441861    .020996     2.10   0.041     .0018979    .0864743
                  14  |   .0234699   .0201138     1.17   0.249    -.0170415    .0639813
                  15  |   .0406571   .0218433     1.86   0.069    -.0033376    .0846518
                  16  |       .077   .0221711     3.47   0.001     .0323451     .121655
                      |
                 marr |   .0640017   .0027846    22.98   0.000     .0583932    .0696101
                partt |  -.0946556   .0178899    -5.29   0.000    -.1306877   -.0586235
               public |  -.0509355   .0082811    -6.15   0.000    -.0676145   -.0342566
                 cmsa |    .110608   .0110989     9.97   0.000     .0882536    .1329623
                      |
                nocc2 |
                   2  |  -.0358226   .0106781    -3.35   0.002    -.0573294   -.0143157
                   3  |  -.0195769   .0120181    -1.63   0.110    -.0437826    .0046288
                   4  |  -.0699366   .0140569    -4.98   0.000    -.0982486   -.0416245
                   5  |   .0075157   .0177732     0.42   0.674    -.0282814    .0433128
                   6  |  -.2404049   .0097343   -24.70   0.000    -.2600108    -.220799
                   7  |  -.1925537   .0106516   -18.08   0.000     -.214007   -.1711003
                   8  |  -.0843038   .0271503    -3.11   0.003    -.1389873   -.0296202
                   9  |   -.219483   .0100873   -21.76   0.000       -.2398   -.1991661
                  10  |  -.1425463   .0065173   -21.87   0.000    -.1556728   -.1294199
                  11  |  -.0673425   .0080792    -8.34   0.000    -.0836149   -.0510701
                  12  |  -.1871278   .0072393   -25.85   0.000    -.2017085   -.1725471
                      |
              quarter |
                   2  |   .0013234   .0029057     0.46   0.651     -.004529    .0071758
                   3  |    .007718      .0029     2.66   0.011     .0018772    .0135588
                   4  |   .0108067   .0020852     5.18   0.000     .0066069    .0150064
                      |
                _cons |   .5921184   .0589292    10.05   0.000      .473429    .7108078
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,585,364,402)

Linear regression                               Number of obs     =    178,512
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3411
                                                Root MSE          =     .36165

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.140303   .0122691   -11.44   0.000    -.1650142   -.1155918
             treat_st |  -.0580628    .032249    -1.80   0.078    -.1230155      .00689
treat_stblackrelwhite |  -.0144998   .0147217    -0.98   0.330    -.0441508    .0151513
                      |
                state |
                  RI  |  -.0578542   .0021982   -26.32   0.000    -.0622815   -.0534268
                  CT  |   .0466565   .0014913    31.28   0.000     .0436528    .0496602
                  NY  |   .0176189   .0031792     5.54   0.000     .0112158    .0240221
                  NJ  |   .0873191    .001602    54.51   0.000     .0840924    .0905457
                  PA  |  -.0894447   .0042407   -21.09   0.000     -.097986   -.0809034
                  OH  |  -.0897612   .0056095   -16.00   0.000    -.1010593    -.078463
                  IN  |  -.0692645   .0092927    -7.45   0.000     -.087981    -.050548
                  IL  |  -.0043126   .0050811    -0.85   0.401    -.0145466    .0059213
                  MI  |   -.003101   .0079595    -0.39   0.699    -.0191322    .0129303
                  WI  |  -.0705102   .0061797   -11.41   0.000    -.0829568   -.0580636
                  MN  |  -.0332111   .0033799    -9.83   0.000    -.0400186   -.0264037
                  IA  |  -.0643533   .0337106    -1.91   0.063    -.1322499    .0035433
                  MO  |  -.0715305   .0063033   -11.35   0.000    -.0842261    -.058835
                  ND  |  -.0527848    .035037    -1.51   0.139    -.1233529    .0177832
                  SD  |  -.0972035   .0334979    -2.90   0.006    -.1646717   -.0297354
                  NE  |  -.1067365   .0311117    -3.43   0.001    -.1693988   -.0440742
                  KS  |  -.0322093   .0323093    -1.00   0.324    -.0972835     .032865
                  DE  |  -.0359986   .0124389    -2.89   0.006    -.0610519   -.0109453
                  MD  |   .0271332   .0042199     6.43   0.000     .0186338    .0356327
                  DC  |   .0409685   .0089666     4.57   0.000     .0229087    .0590282
                  VA  |   .0657355   .0319995     2.05   0.046     .0012853    .1301858
                  NC  |  -.0395131   .0346061    -1.14   0.260    -.1092134    .0301873
                  SC  |  -.0846189   .0356611    -2.37   0.022    -.1564441   -.0127937
                  GA  |   .0058288   .0345456     0.17   0.867    -.0637496    .0754072
                  FL  |  -.0552926   .0338868    -1.63   0.110    -.1235441    .0129589
                  KY  |  -.1161267   .0095734   -12.13   0.000    -.1354085    -.096845
                  TN  |   -.076784   .0342179    -2.24   0.030    -.1457024   -.0078657
                  AL  |  -.0715444   .0353044    -2.03   0.049    -.1426512   -.0004377
                  MS  |  -.0963313   .0377665    -2.55   0.014    -.1723969   -.0202658
                  AR  |  -.1005074    .036057    -2.79   0.008      -.17313   -.0278848
                  LA  |  -.0286337   .0344959    -0.83   0.411     -.098112    .0408446
                  OK  |  -.1343349   .0152407    -8.81   0.000    -.1650312   -.1036386
                  TX  |  -.0043614   .0336573    -0.13   0.897    -.0721506    .0634278
                  ID  |  -.0512057   .0359704    -1.42   0.161    -.1236538    .0212425
                  WY  |   .1018953   .0370997     2.75   0.009     .0271726     .176618
                  CO  |   -.086294   .0029198   -29.55   0.000    -.0921748   -.0804131
                  NM  |  -.1317671   .0046572   -28.29   0.000    -.1411472   -.1223871
                  AZ  |   -.013467   .0339921    -0.40   0.694    -.0819306    .0549967
                  UT  |  -.0801042   .0312294    -2.57   0.014    -.1430035   -.0172049
                  NV  |   .0567948   .0358667     1.58   0.120    -.0154444     .129034
                  WA  |   .0106306   .0038173     2.78   0.008     .0029421     .018319
                  OR  |  -.0628204   .0045403   -13.84   0.000    -.0719649   -.0536759
                  CA  |   .0866472   .0041798    20.73   0.000     .0782285    .0950658
                  AK  |   .1488742   .0086123    17.29   0.000     .1315282    .1662202
                  HI  |  -.0055208   .0040884    -1.35   0.184    -.0137554    .0027137
                      |
                 year |
                1990  |  -.0169581   .0049618    -3.42   0.001    -.0269517   -.0069645
                1991  |  -.0257114   .0062013    -4.15   0.000    -.0382014   -.0132213
                1992  |  -.0225997      .0074    -3.05   0.004     -.037504   -.0076954
                1993  |  -.0257743   .0069718    -3.70   0.001    -.0398163   -.0117323
                1996  |  -.0141779   .0059889    -2.37   0.022    -.0262402   -.0021157
                1997  |  -.0064171   .0067178    -0.96   0.345    -.0199475    .0071132
                1998  |   .0033743    .006756     0.50   0.620    -.0102329    .0169816
                1999  |   .0128923   .0066898     1.93   0.060    -.0005817    .0263663
                2000  |   .0102922   .0059487     1.73   0.090    -.0016891    .0222735
                2001  |    .017178   .0068548     2.51   0.016     .0033717    .0309843
                2002  |   .0297775   .0087475     3.40   0.001     .0121592    .0473958
                2003  |   .0376911   .0083597     4.51   0.000     .0208538    .0545283
                2004  |   .0282016   .0064161     4.40   0.000      .015279    .0411243
                2005  |   .0236593   .0080709     2.93   0.005     .0074036     .039915
                2006  |   .0195508   .0107244     1.82   0.075    -.0020492    .0411509
                2007  |    .023726   .0126002     1.88   0.066    -.0016522    .0491042
                2008  |   .0107997   .0073882     1.46   0.151     -.004081    .0256803
                2009  |   .0329013   .0121086     2.72   0.009     .0085132    .0572893
                2010  |   .0435346   .0117917     3.69   0.001     .0197849    .0672844
                2011  |   .0215943   .0121422     1.78   0.082    -.0028614    .0460499
                2012  |   .0043088   .0123602     0.35   0.729    -.0205859    .0292036
                2013  |   .0052128   .0105774     0.49   0.625    -.0160911    .0265167
                2014  |   .0095041    .011555     0.82   0.415    -.0137689    .0327772
                2015  |   .0098387   .0097876     1.01   0.320    -.0098746    .0295519
                2016  |   .0093241   .0104953     0.89   0.379    -.0118145    .0304627
                2017  |   .0262772   .0097373     2.70   0.010     .0066653    .0458891
                2018  |   .0255338    .009829     2.60   0.013     .0057372    .0453304
                2019  |   .0386618   .0108035     3.58   0.001     .0169023    .0604213
                      |
                 nind |
                   2  |   .0866063   .0192569     4.50   0.000      .047821    .1253917
                   3  |  -.0358301   .0168393    -2.13   0.039    -.0697462    -.001914
                   4  |  -.2081408    .022204    -9.37   0.000    -.2528619   -.1634197
                   5  |   .0855656   .0178325     4.80   0.000     .0496492    .1214821
                   6  |  -.0647586   .0208595    -3.10   0.003    -.1067717   -.0227454
                   7  |  -.0783476   .0186045    -4.21   0.000    -.1158191   -.0408762
                   8  |  -.1767606   .0198048    -8.93   0.000    -.2166495   -.1368717
                   9  |  -.1286058   .0207456    -6.20   0.000    -.1703896    -.086822
                  10  |  -.1458578   .0395665    -3.69   0.001    -.2255487   -.0661668
                  11  |   .0984588   .0200572     4.91   0.000     .0580615    .1388562
                      |
                 educ |   .0723214   .0041324    17.50   0.000     .0639983    .0806444
                exper |   .0716487   .0025214    28.42   0.000     .0665702    .0767271
               exper2 |  -.0025722   .0001711   -15.03   0.000    -.0029168   -.0022275
               exper3 |   .0000516   4.88e-06    10.59   0.000     .0000418    .0000615
               exper4 |  -4.20e-07   4.76e-08    -8.82   0.000    -5.16e-07   -3.24e-07
                 edex |   -.000785   .0001072    -7.33   0.000    -.0010008   -.0005692
                      |
                ee_cl |
                   2  |   .0705985   .0170139     4.15   0.000     .0363307    .1048663
                   3  |   .0571858   .0185015     3.09   0.003      .019922    .0944497
                   4  |    .013129   .0259244     0.51   0.615    -.0390855    .0653435
                   5  |   .0135351   .0213788     0.63   0.530     -.029524    .0565942
                   6  |   .0459373   .0162428     2.83   0.007     .0132226    .0786521
                   7  |   .0548614    .020898     2.63   0.012     .0127708    .0969521
                   8  |   .0151887   .0239236     0.63   0.529    -.0329959    .0633734
                   9  |   .0067483   .0227636     0.30   0.768    -.0390999    .0525965
                  10  |   .0317202   .0190909     1.66   0.104    -.0067308    .0701712
                  11  |   .0449802   .0207174     2.17   0.035     .0032532    .0867072
                  12  |   .0597425   .0237974     2.51   0.016     .0118121    .1076729
                  13  |   .0439425   .0210344     2.09   0.042      .001577     .086308
                  14  |   .0233588   .0201184     1.16   0.252    -.0171618    .0638794
                  15  |    .040611   .0218296     1.86   0.069    -.0033561    .0845781
                  16  |   .0770337   .0221242     3.48   0.001     .0324732    .1215941
                      |
                 marr |   .0640189   .0027762    23.06   0.000     .0584273    .0696105
                partt |  -.0944184   .0178836    -5.28   0.000    -.1304378   -.0583989
               public |  -.0508557   .0083003    -6.13   0.000    -.0675733    -.034138
                 cmsa |    .110601   .0110995     9.96   0.000     .0882454    .1329566
                      |
                nocc2 |
                   2  |  -.0358126   .0106563    -3.36   0.002    -.0572754   -.0143498
                   3  |  -.0195527   .0120265    -1.63   0.111    -.0437753    .0046699
                   4  |  -.0699632   .0140385    -4.98   0.000    -.0982383   -.0416882
                   5  |    .007478   .0177952     0.42   0.676    -.0283633    .0433193
                   6  |  -.2403905   .0097564   -24.64   0.000     -.260041     -.22074
                   7  |  -.1924956   .0106526   -18.07   0.000     -.213951   -.1710403
                   8  |  -.0845212   .0271154    -3.12   0.003    -.1391344    -.029908
                   9  |   -.219421   .0100949   -21.74   0.000    -.2397532   -.1990888
                  10  |   -.142522   .0065118   -21.89   0.000    -.1556375   -.1294066
                  11  |  -.0673322    .008081    -8.33   0.000    -.0836083   -.0510562
                  12  |  -.1871058   .0072428   -25.83   0.000    -.2016936   -.1725181
                      |
                unemp |  -.0035777   .0023175    -1.54   0.130    -.0082454      .00109
                      |
              quarter |
                   2  |   .0013108   .0029062     0.45   0.654    -.0045426    .0071643
                   3  |   .0077483   .0028969     2.67   0.010     .0019137    .0135829
                   4  |   .0109347   .0020752     5.27   0.000     .0067549    .0151144
                      |
                _cons |   .6088142   .0592896    10.27   0.000     .4893988    .7282296
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,585,364,402)

Linear regression                               Number of obs     =    178,512
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3412
                                                Root MSE          =     .36163

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1413249   .0121932   -11.59   0.000    -.1658833   -.1167666
             treat_st |   -.046997   .0189745    -2.48   0.017    -.0852137   -.0087804
treat_stblackrelwhite |   -.013431   .0144682    -0.93   0.358    -.0425714    .0157094
                      |
                state |
                  RI  |  -.0844315   .0098872    -8.54   0.000    -.1043453   -.0645178
                  CT  |   .0561002   .0121291     4.63   0.000      .031671    .0805294
                  NY  |   .0974281   .0083843    11.62   0.000     .0805412     .114315
                  NJ  |   .0397174   .0118236     3.36   0.002     .0159034    .0635314
                  PA  |  -.0244122   .0082226    -2.97   0.005    -.0409733   -.0078511
                  OH  |   .2144154   .0154878    13.84   0.000     .1832214    .2456094
                  IN  |   .0859435   .0608729     1.41   0.165    -.0366609    .2085479
                  IL  |   .1717549    .010524    16.32   0.000     .1505584    .1929513
                  MI  |   .5806835   .0580511    10.00   0.000     .4637626    .6976044
                  WI  |  -.1105112   .0448497    -2.46   0.018    -.2008431   -.0201793
                  MN  |   .0544792   .0066819     8.15   0.000     .0410212    .0679373
                  IA  |   .3115122   .0196587    15.85   0.000     .2719176    .3511068
                  MO  |   .2239894   .0080251    27.91   0.000     .2078261    .2401527
                  ND  |  -.4524293   .0278281   -16.26   0.000     -.508478   -.3963806
                  SD  |  -.2472086   .0203077   -12.17   0.000    -.2881104   -.2063069
                  NE  |  -.1432113   .0197523    -7.25   0.000    -.1829945   -.1034282
                  KS  |   .0895124   .0157009     5.70   0.000     .0578891    .1211357
                  DE  |   .5003679    .028072    17.82   0.000     .4438281    .5569078
                  MD  |  -.1253119   .0113256   -11.06   0.000    -.1481228   -.1025009
                  DC  |  -.0988984   .0236235    -4.19   0.000    -.1464786   -.0513183
                  VA  |   .2604743    .018508    14.07   0.000     .2231973    .2977513
                  NC  |   .2946845    .020584    14.32   0.000     .2532261    .3361429
                  SC  |   .3238698   .0223841    14.47   0.000     .2787859    .3689538
                  GA  |   .2998103     .01737    17.26   0.000     .2648253    .3347954
                  FL  |    .245464   .0196673    12.48   0.000     .2058519    .2850761
                  KY  |   .3126263   .0347831     8.99   0.000     .2425696     .382683
                  TN  |  -.0426754   .0166865    -2.56   0.014    -.0762837   -.0090671
                  AL  |  -.0009095   .0269333    -0.03   0.973    -.0551558    .0533369
                  MS  |   .0484277    .029418     1.65   0.107    -.0108232    .1076786
                  AR  |  -.0649563   .0275353    -2.36   0.023    -.1204151   -.0094974
                  LA  |   .0298081   .0256998     1.16   0.252    -.0219539    .0815701
                  OK  |   -.322978   .0893632    -3.61   0.001    -.5029646   -.1429913
                  TX  |   .0952492   .0195193     4.88   0.000     .0559354     .134563
                  ID  |   .1991462   .0340429     5.85   0.000     .1305802    .2677122
                  WY  |  -.7159936   .0220299   -32.50   0.000    -.7603641   -.6716231
                  CO  |   .1481356    .010981    13.49   0.000     .1260188    .1702524
                  NM  |  -.2173375   .0235233    -9.24   0.000    -.2647159    -.169959
                  AZ  |  -.0046281   .0185127    -0.25   0.804    -.0419146    .0326585
                  UT  |  -.1469067   .0247823    -5.93   0.000    -.1968207   -.0969927
                  NV  |  -.1031221   .0354769    -2.91   0.006    -.1745762    -.031668
                  WA  |   .1579719   .0084528    18.69   0.000     .1409471    .1749966
                  OR  |   .2046544   .0109193    18.74   0.000     .1826618    .2266471
                  CA  |   .3368983    .007943    42.41   0.000     .3209002    .3528963
                  AK  |   .8284877   .0096692    85.68   0.000     .8090129    .8479624
                  HI  |   .0879967   .0217889     4.04   0.000     .0441115    .1318818
                      |
        state#c.lyear |
                  MA  |    .003236   .0001791    18.07   0.000     .0028754    .0035967
                  RI  |   .0035074   .0001343    26.12   0.000     .0032369    .0037779
                  CT  |   .0031444   .0002152    14.61   0.000     .0027109     .003578
                  NY  |   .0024683   .0001026    24.05   0.000     .0022616     .002675
                  NJ  |   .0037035   .0002062    17.96   0.000     .0032882    .0041189
                  PA  |   .0026075   .0001565    16.66   0.000     .0022923    .0029228
                  OH  |   .0002591   .0001895     1.37   0.178    -.0001227    .0006408
                  IN  |   .0017096   .0005959     2.87   0.006     .0005095    .0029098
                  IL  |   .0015266   .0001788     8.54   0.000     .0011665    .0018868
                  MI  |   -.002553   .0005654    -4.52   0.000    -.0036919   -.0014141
                  WI  |   .0036411   .0004236     8.60   0.000     .0027879    .0044942
                  MN  |   .0023705    .000129    18.38   0.000     .0021107    .0026302
                  IA  |  -.0005794   .0001377    -4.21   0.000    -.0008567   -.0003021
                  MO  |   .0003551   .0001488     2.39   0.021     .0000554    .0006549
                  ND  |   .0070243   .0000944    74.44   0.000     .0068343    .0072144
                  SD  |   .0046509    .000112    41.51   0.000     .0044252    .0048765
                  NE  |   .0034782   .0002099    16.57   0.000     .0030555    .0039009
                  KS  |   .0019405   .0001611    12.04   0.000      .001616    .0022651
                  DE  |  -.0022811    .000277    -8.24   0.000    -.0028389   -.0017232
                  MD  |   .0046982   .0001635    28.74   0.000     .0043689    .0050275
                  DC  |   .0046331   .0002228    20.80   0.000     .0041845    .0050818
                  VA  |   .0012027   .0001685     7.14   0.000     .0008633    .0015421
                  NC  |  -.0001666   .0002353    -0.71   0.483    -.0006404    .0003073
                  SC  |   -.000802   .0002406    -3.33   0.002    -.0012865   -.0003175
                  GA  |   .0002459   .0002005     1.23   0.226    -.0001579    .0006498
                  FL  |   .0002061    .000166     1.24   0.221    -.0001283    .0005405
                  KY  |  -.0009423   .0003379    -2.79   0.008    -.0016228   -.0002617
                  TN  |   .0028113   .0001723    16.31   0.000     .0024642    .0031584
                  AL  |   .0024481   .0002655     9.22   0.000     .0019133    .0029829
                  MS  |   .0017288   .0002198     7.87   0.000     .0012861    .0021715
                  AR  |   .0027921   .0002462    11.34   0.000     .0022964    .0032879
                  LA  |   .0025791   .0001895    13.61   0.000     .0021975    .0029607
                  OK  |    .005064     .00094     5.39   0.000     .0031708    .0069572
                  TX  |    .002153   .0001782    12.08   0.000     .0017941    .0025118
                  ID  |   .0006862   .0002678     2.56   0.014     .0001468    .0012256
                  WY  |    .010805   .0000656   164.66   0.000     .0106729    .0109372
                  CO  |    .000945   .0001234     7.66   0.000     .0006964    .0011936
                  NM  |   .0040234    .000326    12.34   0.000     .0033669      .00468
                  AZ  |   .0030394   .0002122    14.32   0.000     .0026121    .0034668
                  UT  |    .003778   .0000639    59.14   0.000     .0036494    .0039067
                  NV  |    .004647   .0001922    24.18   0.000       .00426    .0050341
                  WA  |   .0018049   .0001375    13.13   0.000      .001528    .0020818
                  OR  |   .0006359   .0001909     3.33   0.002     .0002514    .0010205
                  CA  |   .0008013    .000131     6.12   0.000     .0005375     .001065
                  AK  |  -.0034193   .0001182   -28.94   0.000    -.0036573   -.0031813
                  HI  |   .0023019   .0001989    11.57   0.000     .0019013    .0027025
                      |
                 nind |
                   2  |   .0882428    .019362     4.56   0.000     .0492457      .12724
                   3  |  -.0362288   .0166788    -2.17   0.035    -.0698217    -.002636
                   4  |  -.2074584   .0223145    -9.30   0.000    -.2524022   -.1625147
                   5  |   .0865979   .0179471     4.83   0.000     .0504505    .1227453
                   6  |  -.0643357   .0213126    -3.02   0.004    -.1072614     -.02141
                   7  |  -.0779362   .0189014    -4.12   0.000    -.1160055   -.0398668
                   8  |  -.1753369   .0198972    -8.81   0.000     -.215412   -.1352618
                   9  |  -.1266802   .0207247    -6.11   0.000    -.1684219   -.0849384
                  10  |  -.1447721   .0394383    -3.67   0.001    -.2242048   -.0653393
                  11  |   .0992125   .0202695     4.89   0.000     .0583875    .1400375
                      |
                 educ |   .0716202   .0041471    17.27   0.000     .0632676    .0799728
                exper |   .0712394   .0024301    29.32   0.000     .0663449     .076134
               exper2 |  -.0025409   .0001677   -15.15   0.000    -.0028787   -.0022032
               exper3 |   .0000506   4.83e-06    10.48   0.000     .0000409    .0000603
               exper4 |  -4.10e-07   4.73e-08    -8.67   0.000    -5.05e-07   -3.15e-07
                 edex |  -.0007754   .0001084    -7.15   0.000    -.0009938    -.000557
                      |
                ee_cl |
                   2  |   .0699342   .0172516     4.05   0.000     .0351876    .1046807
                   3  |    .056963   .0188068     3.03   0.004     .0190842    .0948419
                   4  |   .0141874   .0267637     0.53   0.599    -.0397174    .0680923
                   5  |   .0114098   .0216006     0.53   0.600    -.0320961    .0549157
                   6  |   .0439667   .0165944     2.65   0.011     .0105438    .0773895
                   7  |   .0541891   .0212638     2.55   0.014     .0113616    .0970167
                   8  |   .0159168   .0245877     0.65   0.521    -.0336054     .065439
                   9  |   .0039401     .02304     0.17   0.865    -.0424649     .050345
                  10  |    .030699   .0195784     1.57   0.124     -.008734     .070132
                  11  |    .044265   .0211716     2.09   0.042     .0016231    .0869068
                  12  |   .0601396   .0245117     2.45   0.018     .0107706    .1095087
                  13  |   .0428358   .0216315     1.98   0.054    -.0007323    .0864039
                  14  |   .0231537   .0205926     1.12   0.267    -.0183219    .0646293
                  15  |   .0421954   .0223971     1.88   0.066    -.0029147    .0873054
                  16  |   .0785462   .0227929     3.45   0.001     .0326389    .1244535
                      |
                 marr |   .0640564   .0027242    23.51   0.000     .0585696    .0695431
                partt |  -.0940504   .0178739    -5.26   0.000    -.1300502   -.0580505
               public |  -.0509076   .0083133    -6.12   0.000    -.0676515   -.0341638
                 cmsa |   .1102368   .0110827     9.95   0.000     .0879151    .1325584
                      |
                nocc2 |
                   2  |  -.0351922   .0106575    -3.30   0.002    -.0566575    -.013727
                   3  |  -.0191981   .0120432    -1.59   0.118    -.0434543    .0050581
                   4  |   -.070012   .0141409    -4.95   0.000    -.0984932   -.0415308
                   5  |   .0077716   .0177924     0.44   0.664    -.0280642    .0436074
                   6  |  -.2400817     .00982   -24.45   0.000    -.2598601   -.2203032
                   7  |  -.1930074   .0106729   -18.08   0.000    -.2145038    -.171511
                   8  |  -.0838948   .0273971    -3.06   0.004    -.1390754   -.0287141
                   9  |  -.2192708   .0101075   -21.69   0.000    -.2396284   -.1989132
                  10  |  -.1424032   .0065378   -21.78   0.000    -.1555709   -.1292355
                  11  |  -.0673611   .0080082    -8.41   0.000    -.0834904   -.0512318
                  12  |  -.1870362   .0072203   -25.90   0.000    -.2015786   -.1724939
                      |
                unemp |  -.0045461   .0011401    -3.99   0.000    -.0068424   -.0022499
                      |
              quarter |
                   2  |   .0012423   .0028567     0.43   0.666    -.0045114    .0069959
                   3  |   .0073552   .0029832     2.47   0.018     .0013466    .0133637
                   4  |   .0106659   .0020743     5.14   0.000     .0064881    .0148438
                      |
                _cons |   .2997676   .0548714     5.46   0.000      .189251    .4102842
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,257,671,705)

Linear regression                               Number of obs     =    145,102
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4294
                                                Root MSE          =     .36601

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0555007   .0100059    -5.55   0.000    -.0756536   -.0353479
             treat_st |  -.0606662   .0184159    -3.29   0.002    -.0977578   -.0235745
treat_stblackrelwhite |   .0004992   .0156155     0.03   0.975     -.030952    .0319503
                      |
                state |
                  RI  |   .0053604   .0012691     4.22   0.000     .0028042    .0079165
                  CT  |   .0380345   .0020022    19.00   0.000     .0340018    .0420672
                  NY  |   -.008485   .0028624    -2.96   0.005    -.0142502   -.0027197
                  NJ  |   .0810536   .0018221    44.48   0.000     .0773836    .0847236
                  PA  |  -.0948323   .0026768   -35.43   0.000    -.1002236    -.089441
                  OH  |   -.115789   .0032593   -35.53   0.000    -.1223535   -.1092246
                  IN  |  -.1311365   .0066781   -19.64   0.000    -.1445868   -.1176861
                  IL  |  -.0950725   .0034249   -27.76   0.000    -.1019707   -.0881744
                  MI  |  -.0457175   .0047862    -9.55   0.000    -.0553574   -.0360776
                  WI  |  -.0879711   .0049638   -17.72   0.000    -.0979686   -.0779736
                  MN  |  -.0451206   .0034834   -12.95   0.000    -.0521366   -.0381046
                  IA  |  -.0872013   .0207172    -4.21   0.000     -.128928   -.0454747
                  MO  |  -.1756659   .0034913   -50.31   0.000    -.1826978    -.168634
                  ND  |  -.1222131   .0223737    -5.46   0.000     -.167276   -.0771502
                  SD  |  -.1706334   .0210681    -8.10   0.000    -.2130667      -.1282
                  NE  |  -.1672821   .0189547    -8.83   0.000    -.2054588   -.1291055
                  KS  |  -.1264575   .0182046    -6.95   0.000    -.1631234   -.0897916
                  DE  |   .0110407   .0120304     0.92   0.364    -.0131897    .0352711
                  MD  |   .0324489   .0056021     5.79   0.000     .0211657     .043732
                  DC  |   .0507614   .0092326     5.50   0.000      .032166    .0693568
                  VA  |   .0138233   .0179103     0.77   0.444    -.0222498    .0498964
                  NC  |  -.0814513    .018979    -4.29   0.000     -.119677   -.0432256
                  SC  |   -.162685    .018978    -8.57   0.000    -.2009087   -.1244612
                  GA  |  -.0754978   .0183652    -4.11   0.000    -.1124872   -.0385085
                  FL  |  -.0837694   .0177958    -4.71   0.000    -.1196119   -.0479269
                  KY  |  -.1708858   .0047777   -35.77   0.000    -.1805085    -.161263
                  TN  |  -.1071628    .018079    -5.93   0.000    -.1435758   -.0707498
                  AL  |  -.1836338   .0186839    -9.83   0.000     -.221265   -.1460026
                  MS  |  -.2033044   .0199297   -10.20   0.000    -.2434448    -.163164
                  AR  |  -.1950603   .0194314   -10.04   0.000    -.2341971   -.1559235
                  LA  |  -.1485704   .0181745    -8.17   0.000    -.1851758   -.1119649
                  OK  |  -.2293531    .009468   -24.22   0.000    -.2484227   -.2102836
                  TX  |   -.079544   .0178692    -4.45   0.000    -.1155345   -.0435536
                  ID  |  -.1361429   .0202284    -6.73   0.000     -.176885   -.0954008
                  WY  |  -.0357684   .0225973    -1.58   0.120    -.0812817    .0097448
                  CO  |  -.1260933    .001388   -90.85   0.000    -.1288888   -.1232978
                  NM  |  -.1986888   .0047216   -42.08   0.000    -.2081986    -.189179
                  AZ  |  -.0734543   .0185283    -3.96   0.000    -.1107722   -.0361364
                  UT  |  -.1277716   .0182456    -7.00   0.000    -.1645203    -.091023
                  NV  |    .017432   .0197908     0.88   0.383    -.0224286    .0572926
                  WA  |  -.0480975   .0028411   -16.93   0.000    -.0538198   -.0423753
                  OR  |  -.1162576   .0021504   -54.06   0.000    -.1205887   -.1119265
                  CA  |   .0579446   .0015423    37.57   0.000     .0548383    .0610509
                  AK  |   .0919725   .0054977    16.73   0.000     .0808995    .1030455
                  HI  |  -.0571208   .0051142   -11.17   0.000    -.0674213   -.0468204
                      |
                 year |
                1990  |  -.0016298   .0050378    -0.32   0.748    -.0117764    .0085168
                1991  |  -.0094397   .0069864    -1.35   0.183    -.0235109    .0046316
                1992  |   .0025375   .0084596     0.30   0.766     -.014501    .0195759
                1993  |   .0115735   .0072956     1.59   0.120    -.0031206    .0262676
                1996  |    .022559   .0081757     2.76   0.008     .0060923    .0390258
                1997  |   .0245694   .0068865     3.57   0.001     .0106993    .0384395
                1998  |   .0425215   .0068887     6.17   0.000      .028647    .0563961
                1999  |   .0448713   .0064615     6.94   0.000     .0318571    .0578855
                2000  |   .0397841   .0075665     5.26   0.000     .0245444    .0550238
                2001  |   .0537231   .0075695     7.10   0.000     .0384774    .0689688
                2002  |   .0615915   .0073058     8.43   0.000     .0468768    .0763062
                2003  |   .0508674    .006335     8.03   0.000      .038108    .0636267
                2004  |    .046019   .0089091     5.17   0.000     .0280751    .0639629
                2005  |   .0416833   .0089494     4.66   0.000     .0236584    .0597083
                2006  |   .0406881   .0075997     5.35   0.000     .0253815    .0559947
                2007  |   .0339833   .0084624     4.02   0.000     .0169392    .0510274
                2008  |   .0288602   .0120466     2.40   0.021      .004597    .0531233
                2009  |   .0523846   .0107995     4.85   0.000     .0306333    .0741358
                2010  |   .0579053   .0116187     4.98   0.000      .034504    .0813065
                2011  |   .0374378   .0102736     3.64   0.001     .0167457    .0581298
                2012  |   .0078931   .0100143     0.79   0.435    -.0122767     .028063
                2013  |   .0205188   .0094201     2.18   0.035     .0015458    .0394918
                2014  |   .0058024   .0178598     0.32   0.747    -.0301692     .041774
                2015  |    .022924   .0134066     1.71   0.094    -.0040784    .0499263
                2016  |   .0305067   .0089595     3.40   0.001     .0124613    .0485522
                2017  |   .0145551    .012339     1.18   0.244    -.0102969    .0394072
                2018  |   .0161745   .0112781     1.43   0.158    -.0065407    .0388896
                2019  |   .0230692   .0096362     2.39   0.021     .0036609    .0424774
                      |
                 nind |
                   2  |   .0625113   .0535521     1.17   0.249    -.0453481    .1703707
                   3  |   .0512131   .0402311     1.27   0.210    -.0298166    .1322428
                   4  |   -.227758   .0519641    -4.38   0.000    -.3324191   -.1230969
                   5  |   .1468444    .044416     3.31   0.002      .057386    .2363028
                   6  |  -.0369743   .0491924    -0.75   0.456    -.1360528    .0621043
                   7  |   -.093694   .0474372    -1.98   0.054    -.1892375    .0018496
                   8  |  -.1291348   .0511094    -2.53   0.015    -.2320745   -.0261951
                   9  |  -.1769274   .0467163    -3.79   0.000    -.2710189   -.0828359
                  10  |  -.1409265    .061869    -2.28   0.028     -.265537   -.0163161
                  11  |   .0106931   .0477315     0.22   0.824    -.0854431    .1068292
                      |
                 educ |   .1047572   .0057461    18.23   0.000     .0931841    .1163304
                exper |   .0504473   .0034341    14.69   0.000     .0435306    .0573639
               exper2 |  -.0017582   .0002656    -6.62   0.000    -.0022931   -.0012233
               exper3 |   .0000314   9.20e-06     3.41   0.001     .0000128    .0000499
               exper4 |  -2.16e-07   1.03e-07    -2.10   0.042    -4.24e-07   -8.38e-09
                 edex |  -.0004613   .0001259    -3.66   0.001    -.0007149   -.0002077
                      |
                ee_cl |
                   2  |  -.0587161   .0140047    -4.19   0.000     -.086923   -.0305092
                   3  |  -.1188193   .0181449    -6.55   0.000    -.1553649   -.0822736
                   4  |  -.1680191   .0338017    -4.97   0.000    -.2360991    -.099939
                   5  |   -.070214   .0209472    -3.35   0.002     -.112404   -.0280241
                   6  |  -.0901693    .017423    -5.18   0.000    -.1252612   -.0550775
                   7  |  -.1353554   .0223958    -6.04   0.000    -.1804628    -.090248
                   8  |  -.1638148   .0352932    -4.64   0.000     -.234899   -.0927307
                   9  |  -.0448021   .0166696    -2.69   0.010    -.0783764   -.0112277
                  10  |  -.1100039   .0234036    -4.70   0.000    -.1571411   -.0628667
                  11  |   -.149174   .0248304    -6.01   0.000     -.199185    -.099163
                  12  |  -.1414467    .031832    -4.44   0.000    -.2055596   -.0773338
                  13  |   .0033543   .0211624     0.16   0.875    -.0392688    .0459775
                  14  |  -.1008485    .022181    -4.55   0.000    -.1455233   -.0561737
                  15  |  -.1135786    .026327    -4.31   0.000     -.166604   -.0605533
                  16  |  -.1098086   .0326017    -3.37   0.002    -.1754718   -.0441454
                      |
                 marr |   .0062561   .0035165     1.78   0.082    -.0008265    .0133387
                partt |  -.0646504   .0071437    -9.05   0.000    -.0790386   -.0502623
               public |   .0237076   .0123299     1.92   0.061    -.0011261    .0485413
                 cmsa |    .121496   .0097208    12.50   0.000     .1019173    .1410746
                      |
                nocc2 |
                   2  |  -.0385299   .0109854    -3.51   0.001    -.0606556   -.0164043
                   3  |  -.0219385   .0139078    -1.58   0.122    -.0499502    .0060733
                   4  |  -.1059334   .0111016    -9.54   0.000    -.1282931   -.0835737
                   5  |   .1401321   .0166057     8.44   0.000     .1066865    .1735777
                   6  |  -.2344584   .0097706   -24.00   0.000    -.2541375   -.2147793
                   7  |  -.2419697   .0236688   -10.22   0.000    -.2896411   -.1942983
                   8  |  -.0910951    .047189    -1.93   0.060    -.1861387    .0039485
                   9  |  -.2887393     .01553   -18.59   0.000    -.3200183   -.2574604
                  10  |  -.2583972   .0178078   -14.51   0.000     -.294264   -.2225304
                  11  |   .0071837   .0190395     0.38   0.708    -.0311639    .0455312
                  12  |  -.2417341   .0134267   -18.00   0.000    -.2687769   -.2146913
                      |
              quarter |
                   2  |   .0047699    .002745     1.74   0.089    -.0007588    .0102986
                   3  |   .0140964   .0025979     5.43   0.000     .0088639    .0193289
                   4  |   .0181685   .0029065     6.25   0.000     .0123145    .0240226
                      |
                _cons |   .2948406   .0622624     4.74   0.000     .1694376    .4202435
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,257,671,705)

Linear regression                               Number of obs     =    145,102
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4294
                                                Root MSE          =       .366

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0555219   .0099991    -5.55   0.000    -.0756611   -.0353827
             treat_st |  -.0614392   .0189997    -3.23   0.002    -.0997066   -.0231718
treat_stblackrelwhite |   .0005463   .0155934     0.04   0.972    -.0308603     .031953
                      |
                state |
                  RI  |   .0077585   .0022313     3.48   0.001     .0032644    .0122527
                  CT  |   .0383262   .0019314    19.84   0.000     .0344361    .0422163
                  NY  |  -.0068642   .0031163    -2.20   0.033    -.0131408   -.0005876
                  NJ  |   .0822178     .00179    45.93   0.000     .0786125    .0858231
                  PA  |  -.0940208   .0028625   -32.85   0.000    -.0997862   -.0882555
                  OH  |  -.1144064   .0035684   -32.06   0.000    -.1215936   -.1072192
                  IN  |  -.1311241   .0066634   -19.68   0.000    -.1445448   -.1177034
                  IL  |   -.092788   .0038404   -24.16   0.000    -.1005229    -.085053
                  MI  |  -.0421311   .0061848    -6.81   0.000    -.0545879   -.0296743
                  WI  |  -.0890481    .004702   -18.94   0.000    -.0985185   -.0795778
                  MN  |  -.0471532   .0030529   -15.45   0.000    -.0533021   -.0410042
                  IA  |  -.0894069   .0204892    -4.36   0.000    -.1306743   -.0481396
                  MO  |  -.1752584    .003553   -49.33   0.000    -.1824145   -.1681023
                  ND  |  -.1258288    .021856    -5.76   0.000    -.1698491   -.0818085
                  SD  |  -.1739899   .0206531    -8.42   0.000    -.2155874   -.1323923
                  NE  |  -.1714827   .0184707    -9.28   0.000    -.2086846   -.1342808
                  KS  |   -.127466   .0183407    -6.95   0.000    -.1644061   -.0905259
                  DE  |   .0094565   .0118267     0.80   0.428    -.0143637    .0332768
                  MD  |   .0316727   .0057483     5.51   0.000      .020095    .0432504
                  DC  |   .0547643   .0091781     5.97   0.000     .0362787    .0732498
                  VA  |   .0124497   .0180188     0.69   0.493    -.0238421    .0487414
                  NC  |   -.080318   .0196216    -4.09   0.000    -.1198379   -.0407982
                  SC  |  -.1597515   .0201342    -7.93   0.000    -.2003038   -.1191992
                  GA  |  -.0737752   .0191859    -3.85   0.000    -.1124175   -.0351328
                  FL  |  -.0819246   .0186629    -4.39   0.000    -.1195137   -.0443355
                  KY  |  -.1689873    .005342   -31.63   0.000    -.1797466   -.1582281
                  TN  |   -.105635   .0188726    -5.60   0.000    -.1436463   -.0676237
                  AL  |  -.1811229   .0197184    -9.19   0.000    -.2208378   -.1414081
                  MS  |  -.1990886   .0216104    -9.21   0.000    -.2426142   -.1555629
                  AR  |  -.1929476   .0203945    -9.46   0.000    -.2340242    -.151871
                  LA  |  -.1454002   .0194509    -7.48   0.000    -.1845763   -.1062242
                  OK  |  -.2302094   .0094276   -24.42   0.000    -.2491976   -.2112212
                  TX  |  -.0778764   .0186969    -4.17   0.000    -.1155339   -.0402189
                  ID  |  -.1352919   .0207875    -6.51   0.000      -.17716   -.0934239
                  WY  |   -.036798   .0226888    -1.62   0.112    -.0824955    .0088995
                  CO  |  -.1271367   .0016536   -76.89   0.000    -.1304672   -.1238063
                  NM  |  -.1972054   .0049449   -39.88   0.000     -.207165   -.1872459
                  AZ  |  -.0715241   .0193925    -3.69   0.001    -.1105827   -.0324656
                  UT  |  -.1292356   .0183642    -7.04   0.000    -.1662231   -.0922482
                  NV  |   .0200136   .0209294     0.96   0.344    -.0221403    .0621676
                  WA  |  -.0461648   .0034964   -13.20   0.000    -.0532069   -.0391227
                  OR  |  -.1135738   .0032851   -34.57   0.000    -.1201903   -.1069573
                  CA  |   .0615804   .0029045    21.20   0.000     .0557305    .0674303
                  AK  |   .0965344   .0068235    14.15   0.000     .0827913    .1102776
                  HI  |  -.0599251   .0047422   -12.64   0.000    -.0694763   -.0503739
                      |
                 year |
                1990  |  -.0007703   .0053649    -0.14   0.886    -.0115758    .0100351
                1991  |  -.0055862   .0083196    -0.67   0.505    -.0223428    .0111703
                1992  |   .0079447   .0111331     0.71   0.479    -.0144786    .0303679
                1993  |   .0156734   .0095114     1.65   0.106    -.0034836    .0348304
                1996  |   .0230531   .0086568     2.66   0.011     .0056175    .0404887
                1997  |   .0240986   .0071332     3.38   0.002     .0097317    .0384656
                1998  |   .0410241   .0069822     5.88   0.000     .0269612     .055087
                1999  |   .0427123    .006753     6.32   0.000      .029111    .0563136
                2000  |   .0371724   .0075812     4.90   0.000     .0219032    .0524417
                2001  |   .0526751   .0075466     6.98   0.000     .0374755    .0678747
                2002  |    .062993   .0073345     8.59   0.000     .0482206    .0777654
                2003  |   .0528582    .006597     8.01   0.000     .0395712    .0661452
                2004  |   .0470118   .0092847     5.06   0.000     .0283115    .0657121
                2005  |   .0415503   .0089538     4.64   0.000     .0235165    .0595841
                2006  |   .0396656   .0077599     5.11   0.000     .0240364    .0552948
                2007  |   .0329577    .008482     3.89   0.000     .0158741    .0500413
                2008  |   .0304633   .0125293     2.43   0.019     .0052279    .0556987
                2009  |   .0616788   .0148772     4.15   0.000     .0317145    .0916431
                2010  |   .0679721   .0151553     4.49   0.000     .0374476    .0984965
                2011  |   .0459239   .0134991     3.40   0.001     .0187353    .0731125
                2012  |    .014643   .0124327     1.18   0.245    -.0103978    .0396838
                2013  |   .0258206   .0117322     2.20   0.033     .0021907    .0494505
                2014  |   .0082262   .0187663     0.44   0.663    -.0295711    .0460235
                2015  |   .0232456   .0136131     1.71   0.095    -.0041725    .0506637
                2016  |   .0298656   .0088404     3.38   0.002     .0120601    .0476712
                2017  |   .0128563   .0126045     1.02   0.313    -.0125305     .038243
                2018  |   .0134986   .0107942     1.25   0.218    -.0082421    .0352392
                2019  |   .0198721   .0093207     2.13   0.038     .0010994    .0386449
                      |
                 nind |
                   2  |   .0620263   .0536114     1.16   0.253    -.0459526    .1700052
                   3  |   .0508578   .0402892     1.26   0.213    -.0302889    .1320044
                   4  |  -.2280447   .0520313    -4.38   0.000    -.3328411   -.1232483
                   5  |   .1465366   .0445127     3.29   0.002     .0568835    .2361897
                   6  |  -.0373429   .0492579    -0.76   0.452    -.1365534    .0618676
                   7  |  -.0940697   .0475345    -1.98   0.054    -.1898092    .0016698
                   8  |  -.1294472   .0512076    -2.53   0.015    -.2325845   -.0263099
                   9  |  -.1772798    .046799    -3.79   0.000    -.2715378   -.0830218
                  10  |  -.1412743   .0619707    -2.28   0.027    -.2660897    -.016459
                  11  |   .0102967   .0478081     0.22   0.830    -.0859937     .106587
                      |
                 educ |   .1047477   .0057509    18.21   0.000     .0931647    .1163307
                exper |   .0504701   .0034376    14.68   0.000     .0435464    .0573938
               exper2 |  -.0017599   .0002656    -6.63   0.000    -.0022949   -.0012249
               exper3 |   .0000314   9.20e-06     3.42   0.001     .0000129      .00005
               exper4 |  -2.17e-07   1.03e-07    -2.10   0.041    -4.24e-07   -9.05e-09
                 edex |  -.0004612   .0001261    -3.66   0.001    -.0007152   -.0002073
                      |
                ee_cl |
                   2  |  -.0587207   .0139789    -4.20   0.000    -.0868756   -.0305659
                   3  |  -.1188176   .0181222    -6.56   0.000    -.1553176   -.0823175
                   4  |  -.1679922   .0337756    -4.97   0.000    -.2360198   -.0999646
                   5  |  -.0702806    .020907    -3.36   0.002    -.1123895   -.0281717
                   6  |  -.0901867   .0173952    -5.18   0.000    -.1252224   -.0551511
                   7  |  -.1353493   .0223466    -6.06   0.000    -.1803578   -.0903408
                   8  |  -.1638067   .0352622    -4.65   0.000    -.2348285    -.092785
                   9  |  -.0449345   .0166678    -2.70   0.010    -.0785052   -.0113639
                  10  |   -.110076   .0233753    -4.71   0.000    -.1571563   -.0629956
                  11  |   -.149227   .0248223    -6.01   0.000    -.1992217   -.0992322
                  12  |   -.141478   .0318009    -4.45   0.000    -.2055282   -.0774278
                  13  |   .0032538   .0211796     0.15   0.879    -.0394041    .0459116
                  14  |   -.100883   .0221621    -4.55   0.000    -.1455198   -.0562461
                  15  |  -.1136393   .0263152    -4.32   0.000    -.1666409   -.0606377
                  16  |  -.1098567   .0325776    -3.37   0.002    -.1754713   -.0442421
                      |
                 marr |   .0062494   .0035178     1.78   0.082    -.0008358    .0133345
                partt |  -.0645877   .0071308    -9.06   0.000    -.0789498   -.0502256
               public |   .0237845   .0123379     1.93   0.060    -.0010653    .0486342
                 cmsa |   .1214679   .0097089    12.51   0.000     .1019132    .1410226
                      |
                nocc2 |
                   2  |  -.0384917   .0109946    -3.50   0.001    -.0606359   -.0163476
                   3  |  -.0218543   .0139125    -1.57   0.123    -.0498755    .0061669
                   4  |  -.1059096   .0110938    -9.55   0.000    -.1282538   -.0835655
                   5  |   .1401566   .0165911     8.45   0.000     .1067405    .1735728
                   6  |  -.2344346   .0097769   -23.98   0.000    -.2541262    -.214743
                   7  |  -.2419633   .0236723   -10.22   0.000    -.2896417   -.1942848
                   8  |   -.091126   .0472051    -1.93   0.060     -.186202      .00395
                   9  |  -.2887036   .0155329   -18.59   0.000    -.3199884   -.2574188
                  10  |  -.2584218   .0178141   -14.51   0.000    -.2943012   -.2225425
                  11  |   .0073359   .0190227     0.39   0.702    -.0309778    .0456495
                  12  |  -.2417051   .0134071   -18.03   0.000    -.2687083   -.2147018
                      |
                unemp |  -.0022474    .001532    -1.47   0.149    -.0053329    .0008382
                      |
              quarter |
                   2  |    .004806   .0027496     1.75   0.087    -.0007321     .010344
                   3  |   .0140986   .0026064     5.41   0.000      .008849    .0193482
                   4  |   .0182243   .0029238     6.23   0.000     .0123354    .0241131
                      |
                _cons |   .3055866   .0585243     5.22   0.000     .1877126    .4234605
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,257,671,705)

Linear regression                               Number of obs     =    145,102
                                                F(44, 45)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4291
                                                Root MSE          =     .36614

                                          (Std. Err. adjusted for 46 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0564921   .0096917    -5.83   0.000    -.0760122   -.0369721
             treat_st |  -.0539215   .0213236    -2.53   0.015    -.0968693   -.0109736
treat_stblackrelwhite |     .00063    .014951     0.04   0.967    -.0294828    .0307427
                      |
                state |
                  RI  |  -.1377756   .0092235   -14.94   0.000    -.1563527   -.1191986
                  CT  |   .3124193   .0096934    32.23   0.000     .2928958    .3319427
                  NY  |   .0985563   .0060767    16.22   0.000     .0863172    .1107953
                  NJ  |    .029885   .0100624     2.97   0.005     .0096183    .0501517
                  PA  |    .073886   .0113447     6.51   0.000     .0510367    .0967353
                  OH  |   .2332793    .012063    19.34   0.000     .2089832    .2575753
                  IN  |   .0510316    .082157     0.62   0.538    -.1144411    .2165042
                  IL  |   .2750785   .0113212    24.30   0.000     .2522764    .2978806
                  MI  |   .4625751   .0630379     7.34   0.000     .3356101      .58954
                  WI  |   .0506637   .0480599     1.05   0.297    -.0461339    .1474612
                  MN  |   .2593754   .0082544    31.42   0.000     .2427502    .2760006
                  IA  |   .2260746   .0178873    12.64   0.000     .1900478    .2621013
                  MO  |    .393453   .0182631    21.54   0.000     .3566692    .4302368
                  ND  |  -.4965387   .0239834   -20.70   0.000    -.5448438   -.4482336
                  SD  |  -.1463124   .0193736    -7.55   0.000    -.1853328    -.107292
                  NE  |  -.0189568   .0235076    -0.81   0.424    -.0663036    .0283901
                  KS  |   .4464476   .0193135    23.12   0.000     .4075482    .4853469
                  DE  |   .3770542   .0427872     8.81   0.000     .2908763     .463232
                  MD  |  -.0844433   .0081199   -10.40   0.000    -.1007975   -.0680891
                  DC  |  -.1143037   .0222851    -5.13   0.000    -.1591882   -.0694192
                  VA  |  -.0763072   .0190734    -4.00   0.000     -.114723   -.0378914
                  NC  |   .2814323    .019376    14.52   0.000      .242407    .3204577
                  SC  |   .2917611   .0233124    12.52   0.000     .2448074    .3387148
                  GA  |    .295611   .0219521    13.47   0.000     .2513971    .3398249
                  FL  |   .4968855   .0230835    21.53   0.000      .450393     .543378
                  KY  |   .2492652     .04277     5.83   0.000      .163122    .3354084
                  TN  |   .3079419   .0219627    14.02   0.000     .2637069     .352177
                  AL  |    .234076   .0265224     8.83   0.000     .1806572    .2874948
                  MS  |   .1052604   .0244011     4.31   0.000     .0561141    .1544067
                  AR  |  -.2149591   .0239089    -8.99   0.000    -.2631141   -.1668041
                  LA  |    .166294   .0264915     6.28   0.000     .1129374    .2196507
                  OK  |   .3970723   .1052875     3.77   0.000     .1850124    .6091322
                  TX  |   .0072469   .0226366     0.32   0.750    -.0383456    .0528394
                  ID  |   .3194614    .028947    11.04   0.000     .2611593    .3777636
                  WY  |  -.4082131   .0243405   -16.77   0.000    -.4572373   -.3591888
                  CO  |   .3937469   .0166553    23.64   0.000     .3602015    .4272923
                  NM  |   .1764523   .0205833     8.57   0.000     .1349954    .2179093
                  AZ  |   .6519262   .0191348    34.07   0.000     .6133867    .6904657
                  UT  |   .0703934   .0213031     3.30   0.002     .0274867    .1133001
                  NV  |   .2508575   .0450939     5.56   0.000     .1600338    .3416812
                  WA  |    .288972    .005897    49.00   0.000     .2770948    .3008491
                  OR  |   .0307466   .0130265     2.36   0.023     .0045099    .0569834
                  CA  |   .2977219   .0091001    32.72   0.000     .2793933    .3160505
                  AK  |   .5889973   .0176588    33.35   0.000     .5534308    .6245639
                  HI  |   .1214159   .0321221     3.78   0.000     .0567187    .1861132
                      |
        state#c.lyear |
                  MA  |   .0031004   .0001511    20.52   0.000      .002796    .0034047
                  RI  |   .0044975   .0001583    28.42   0.000     .0041787    .0048162
                  CT  |   .0004714   .0002253     2.09   0.042     .0000176    .0009252
                  NY  |   .0021027   .0001207    17.43   0.000     .0018597    .0023457
                  NJ  |   .0036182    .000223    16.23   0.000     .0031691    .0040672
                  PA  |   .0015081   .0002005     7.52   0.000     .0011043    .0019119
                  OH  |  -.0002436   .0001839    -1.32   0.192    -.0006139    .0001267
                  IN  |   .0013882   .0008413     1.65   0.106    -.0003061    .0030826
                  IL  |  -.0004511   .0002089    -2.16   0.036    -.0008718   -.0000304
                  MI  |  -.0018153   .0006338    -2.86   0.006    -.0030919   -.0005388
                  WI  |   .0018107   .0004961     3.65   0.001     .0008115    .0028099
                  MN  |   .0001793   .0001788     1.00   0.321    -.0001809    .0005394
                  IA  |   .0000357   .0001521     0.23   0.815    -.0002707    .0003422
                  MO  |  -.0023825   .0002797    -8.52   0.000    -.0029458   -.0018191
                  ND  |   .0067131   .0001175    57.14   0.000     .0064765    .0069498
                  SD  |   .0028712   .0001025    28.02   0.000     .0026649    .0030776
                  NE  |   .0016212   .0002884     5.62   0.000     .0010404     .002202
                  KS  |  -.0024936   .0002342   -10.65   0.000    -.0029653   -.0020219
                  DE  |  -.0005058   .0004469    -1.13   0.264    -.0014058    .0003943
                  MD  |    .004248   .0001669    25.45   0.000     .0039119    .0045841
                  DC  |    .004766   .0001832    26.02   0.000     .0043971    .0051349
                  VA  |   .0039824    .000197    20.22   0.000     .0035856    .0043792
                  NC  |  -.0004689   .0001858    -2.52   0.015    -.0008431   -.0000947
                  SC  |  -.0013005   .0002273    -5.72   0.000    -.0017584   -.0008427
                  GA  |  -.0005223   .0002451    -2.13   0.039    -.0010159   -.0000286
                  FL  |  -.0025429   .0001225   -20.76   0.000    -.0027896   -.0022963
                  KY  |   -.000928   .0004247    -2.19   0.034    -.0017834   -.0000727
                  TN  |   -.000971   .0003068    -3.17   0.003    -.0015889   -.0003532
                  AL  |  -.0009674   .0003223    -3.00   0.004    -.0016166   -.0003182
                  MS  |   .0001069   .0002537     0.42   0.676    -.0004042     .000618
                  AR  |   .0033168   .0002786    11.90   0.000     .0027556    .0038779
                  LA  |   .0000511   .0001608     0.32   0.752    -.0002728    .0003749
                  OK  |  -.0030146   .0011087    -2.72   0.009    -.0052477   -.0007816
                  TX  |   .0022096   .0001785    12.38   0.000       .00185    .0025691
                  ID  |  -.0013168   .0002437    -5.40   0.000    -.0018077   -.0008258
                  WY  |   .0065742   .0001461    44.99   0.000     .0062799    .0068685
                  CO  |  -.0018607   .0001186   -15.68   0.000    -.0020996   -.0016217
                  NM  |  -.0004276   .0001273    -3.36   0.002     -.000684   -.0001711
                  AZ  |  -.0039323    .000153   -25.71   0.000    -.0042404   -.0036242
                  UT  |   .0011613   .0001155    10.05   0.000     .0009287     .001394
                  NV  |   .0008167    .000365     2.24   0.030     .0000816    .0015518
                  WA  |  -.0001282   .0001291    -0.99   0.326    -.0003882    .0001317
                  OR  |   .0017099   .0001275    13.41   0.000     .0014531    .0019667
                  CA  |    .000814   .0000979     8.32   0.000     .0006169    .0010111
                  AK  |  -.0016896    .000097   -17.42   0.000    -.0018849   -.0014942
                  HI  |   .0013912    .000362     3.84   0.000     .0006621    .0021203
                      |
                 nind |
                   2  |   .0651577    .053946     1.21   0.233    -.0434952    .1738105
                   3  |   .0497543   .0399184     1.25   0.219    -.0306454     .130154
                   4  |    -.22661   .0523805    -4.33   0.000    -.3321098   -.1211102
                   5  |   .1466822    .044727     3.28   0.002     .0565974    .2367671
                   6  |  -.0344898   .0490929    -0.70   0.486    -.1333679    .0643884
                   7  |  -.0924368   .0478013    -1.93   0.059    -.1887136      .00384
                   8  |  -.1273968    .051554    -2.47   0.017     -.231232   -.0235616
                   9  |  -.1746986   .0469859    -3.72   0.001    -.2693329   -.0800642
                  10  |  -.1391786   .0625696    -2.22   0.031    -.2652003    -.013157
                  11  |   .0119503   .0480651     0.25   0.805    -.0848578    .1087585
                      |
                 educ |   .1032415   .0056964    18.12   0.000     .0917684    .1147146
                exper |   .0495683   .0034169    14.51   0.000     .0426863    .0564504
               exper2 |  -.0016759   .0002701    -6.20   0.000    -.0022199   -.0011319
               exper3 |   .0000291   9.38e-06     3.10   0.003     .0000102     .000048
               exper4 |  -1.98e-07   1.05e-07    -1.88   0.067    -4.10e-07    1.42e-08
                 edex |  -.0004606   .0001243    -3.71   0.001    -.0007109   -.0002104
                      |
                ee_cl |
                   2  |  -.0598464   .0147462    -4.06   0.000    -.0895468    -.030146
                   3  |  -.1165976   .0180091    -6.47   0.000    -.1528697   -.0803255
                   4  |  -.1602106   .0338157    -4.74   0.000     -.228319   -.0921023
                   5  |   -.075747   .0203694    -3.72   0.001     -.116773    -.034721
                   6  |   -.093856    .017743    -5.29   0.000    -.1295921   -.0581198
                   7  |  -.1332912   .0223571    -5.96   0.000    -.1783207   -.0882618
                   8  |  -.1587703    .035171    -4.51   0.000    -.2296084   -.0879322
                   9  |  -.0510187    .017454    -2.92   0.005    -.0861729   -.0158645
                  10  |  -.1113325   .0234477    -4.75   0.000    -.1585586   -.0641064
                  11  |  -.1462097   .0251323    -5.82   0.000    -.1968288   -.0955906
                  12  |  -.1350566   .0320943    -4.21   0.000    -.1996978   -.0704154
                  13  |  -.0002824   .0213163    -0.01   0.989    -.0432156    .0426507
                  14  |  -.0999425   .0225193    -4.44   0.000    -.1452988   -.0545862
                  15  |  -.1106624   .0267238    -4.14   0.000    -.1644869   -.0568379
                  16  |  -.1035479   .0329828    -3.14   0.003    -.1699787   -.0371172
                      |
                 marr |   .0057921   .0034861     1.66   0.104    -.0012291    .0128134
                partt |   -.063434   .0070694    -8.97   0.000    -.0776724   -.0491955
               public |   .0237586   .0123596     1.92   0.061     -.001135    .0486522
                 cmsa |   .1218783   .0097099    12.55   0.000     .1023215    .1414351
                      |
                nocc2 |
                   2  |  -.0372746   .0107609    -3.46   0.001    -.0589482   -.0156011
                   3  |  -.0214721   .0136383    -1.57   0.122    -.0489411     .005997
                   4  |  -.1053161   .0111075    -9.48   0.000    -.1276878   -.0829444
                   5  |     .14059   .0161802     8.69   0.000     .1080015    .1731786
                   6  |  -.2343426   .0098206   -23.86   0.000    -.2541224   -.2145628
                   7  |   -.242291   .0234691   -10.32   0.000    -.2895602   -.1950218
                   8  |  -.0961429   .0476525    -2.02   0.050      -.19212   -.0001658
                   9  |  -.2881824   .0152675   -18.88   0.000    -.3189327    -.257432
                  10  |   -.258107   .0176421   -14.63   0.000      -.29364    -.222574
                  11  |   .0089666   .0187947     0.48   0.636    -.0288879    .0468211
                  12  |  -.2409847   .0130345   -18.49   0.000    -.2672376   -.2147318
                      |
                unemp |  -.0005072   .0008543    -0.59   0.556    -.0022278    .0012134
                      |
              quarter |
                   2  |   .0051624   .0026898     1.92   0.061     -.000255    .0105798
                   3  |   .0142019   .0025386     5.59   0.000     .0090889    .0193148
                   4  |   .0184722   .0029742     6.21   0.000     .0124818    .0244625
                      |
                _cons |   .0183418   .0587268     0.31   0.756      -.09994    .1366236
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_fem_all_sltt

. 
. ** RUST BELT ONLY BLACK-WHITE + WV, KY - IA
. ** keep if inrange(state, 31, 35) | inlist(state, 23, 41, 43) | inlist(state, 55, 61)
. 
. ** DROP ALWAYS RTW BLACK-WHITE
. ** drop if alwaysr2w == 1
. 
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl ma
> rr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo covstagdid_mal_cf 
.         
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl ma
> rr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo covstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo wagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo wagstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_fem_cf
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_fem_cf 
. 
. label variable blackrelwhite "$ Black $"

. label variable treat_st "$ Treat_{st} $"

. label variable treat_stblackrelwhite "$ Treat_{st} \times Black $"

. 
. ** FIXME ignore rust best stuff, dropping always rtw
. esttab covstagdid_mal_all covstagdid_mal_all_unemp covstagdid_mal_all_sltt covstagdid_fem_all covstagdid_fem_all_unemp covstagdid
> _fem_all_sltt using $tabs/fin_covstagdid.tex, se title(Difference in Differences of Union Coverage on Right to Work Laws Treatmen
> t in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule
> (lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) scala
> rs("unemp_level State Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time Trends")
(output written to /Users/amedeusdsouza/econ499/tabs/fin_covstagdid.tex)

. 
. esttab wagstagdid_mal_all wagstagdid_mal_all_unemp wagstagdid_mal_all_sltt wagstagdid_fem_all wagstagdid_fem_all_unemp wagstagdid
> _fem_all_sltt using $tabs/wagstagdid1.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment i
> n State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr
> ){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) 
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid1.tex)

. 
. esttab nwagstagdid_mal_all nwagstagdid_mal_all_unemp nwagstagdid_mal_all_sltt nwagstagdid_fem_all nwagstagdid_fem_all_unemp nwags
> tagdid_fem_all_sltt using $tabs/wagstagdid2.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treat
> ment in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidr
> ule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01)
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid2.tex)

. 
. esttab uwagstagdid_mal_all uwagstagdid_mal_all_unemp uwagstagdid_mal_all_sltt uwagstagdid_fem_all uwagstagdid_fem_all_unemp uwags
> tagdid_fem_all_sltt using $tabs/wagstagdid3.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treat
> ment in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidr
> ule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) sc
> alars("unemp_level State Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time Trends")
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid3.tex)

. 
. panelcombine, use($tabs/wagstagdid1.tex $tabs/wagstagdid2.tex $tabs/wagstagdid3.tex) paneltitles("All (Black and White) People" "
> People Not Covered by Union - Spillover Effect" "People Covered by Union - Direct Effect") columncount(3) save($tabs/fin_wagstagd
> id.tex)

. 
. *** esttab wagstagdid_mal_all wagstagdid_fem_all nwagstagdid_mal_all nwagstagdid_fem_all uwagstagdid_mal_all uwagstagdid_fem_all 
> using $tabs/wagstagdid.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Tim
> e) nonumbers mtitles("men" "women" "men not covered by union" "women not covered by union" "men covered by union" "women covered 
> by union") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
. 
. ** esttab wagstagdid_mal_cf wagstagdid_fem_cf nwagstagdid_mal_cf nwagstagdid_fem_cf uwagstagdid_mal_cf uwagstagdid_fem_cf using $
> tabs/wagstagdid_cf.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Time) n
> onumbers mtitles("men" "women" "men not covered by union" "women not covered by union" "men covered by union" "women covered by u
> nion") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
. 
. ** panelcombine, use($tabs/wagstagdid_all.tex $tabs/wagstagdid_cf.tex) paneltitles("All States" "W/O Always RTW States") columnco
> unt(3) save($tabs/wagstagdid.tex)
. 
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 closed on:   2 Apr 2021, 13:33:49
-----------------------------------------------------------------------------------------------------------------------------------
