-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-wo-ar2w.log
  log type:  text
 opened on:  26 Mar 2021, 17:35:00

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt public marr hisprace hi
> spracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effective; signed Dec2012) Ma
> r1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82) //incl Idaho wh
> ich changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. gen lyear = year - 1900

. 
. drop if alwaysr2w == 1
(1,149,124 observations deleted)

. 
. eststo clear

. 
. drop if state == 55 | state == 81
(76,583 observations deleted)

. 
. ** BLACK-WHITE
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 5,787,533,775)

Linear regression                               Number of obs     =    652,709
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2556
                                                Root MSE          =     .35715

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0512777   .0074359     6.90   0.000     .0360205    .0665349
             treat_st |  -.0267635   .0111459    -2.40   0.023    -.0496329   -.0038941
treat_stblackrelwhite |  -.0254717   .0114523    -2.22   0.035    -.0489698   -.0019735
                      |
                state |
                  NH  |  -.0354551    .004038    -8.78   0.000    -.0437403   -.0271698
                  VT  |  -.0423991    .000952   -44.54   0.000    -.0443523   -.0404458
                  MA  |   .0069103   .0072457     0.95   0.349    -.0079565    .0217772
                  RI  |   .0080709   .0073164     1.10   0.280    -.0069411    .0230829
                  CT  |    .007342   .0071402     1.03   0.313    -.0073084    .0219924
                  NY  |   .0897024   .0065323    13.73   0.000     .0762993    .1031054
                  NJ  |    .042449    .007792     5.45   0.000     .0264611    .0584368
                  PA  |   .0190454   .0057894     3.29   0.003     .0071665    .0309243
                  OH  |    .007942   .0057806     1.37   0.181    -.0039189    .0198028
                  IN  |  -.0091971   .0054033    -1.70   0.100    -.0202837    .0018895
                  IL  |   .0403118   .0062445     6.46   0.000     .0274991    .0531245
                  MI  |   .0523793   .0064819     8.08   0.000     .0390795    .0656791
                  WI  |  -.0011834   .0047983    -0.25   0.807    -.0110286    .0086619
                  MN  |   .0239292   .0057183     4.18   0.000     .0121963    .0356622
                  MO  |  -.0125888   .0057181    -2.20   0.036    -.0243213   -.0008563
                  DE  |  -.0581887   .0024703   -23.56   0.000    -.0632574   -.0531201
                  MD  |  -.0541991   .0081909    -6.62   0.000    -.0710055   -.0373927
                  DC  |  -.0542031   .0090838    -5.97   0.000    -.0728415   -.0355647
                  KY  |  -.0485935   .0040137   -12.11   0.000    -.0568289   -.0403582
                  OK  |  -.0887558   .0077318   -11.48   0.000    -.1046202   -.0728915
                  CO  |  -.0533118   .0073711    -7.23   0.000    -.0684361   -.0381874
                  NM  |  -.1072792   .0054688   -19.62   0.000    -.1185002   -.0960582
                  WA  |   .0485045   .0065515     7.40   0.000     .0350619    .0619471
                  OR  |   .0117899   .0058943     2.00   0.056    -.0003043    .0238841
                  CA  |    .029147   .0074324     3.92   0.001     .0138969    .0443971
                  AK  |   .0247017   .0052078     4.74   0.000     .0140162    .0353873
                  HI  |   .0177978   .0057039     3.12   0.004     .0060943    .0295013
                      |
                 year |
                1990  |  -.0063351    .003395    -1.87   0.073     -.013301    .0006308
                1991  |  -.0086886   .0041877    -2.07   0.048    -.0172811   -.0000962
                1992  |  -.0151511   .0033644    -4.50   0.000    -.0220543   -.0082479
                1993  |  -.0197289    .004765    -4.14   0.000     -.029506   -.0099518
                1996  |  -.0281922   .0051343    -5.49   0.000     -.038727   -.0176574
                1997  |  -.0313908    .005147    -6.10   0.000    -.0419516   -.0208299
                1998  |  -.0360851   .0052662    -6.85   0.000    -.0468904   -.0252798
                1999  |  -.0380126   .0041509    -9.16   0.000    -.0465296   -.0294956
                2000  |  -.0422358   .0043574    -9.69   0.000    -.0511765   -.0332951
                2001  |  -.0428221   .0059152    -7.24   0.000    -.0549591   -.0306851
                2002  |  -.0463355   .0067157    -6.90   0.000     -.060115    -.032556
                2003  |  -.0533095   .0059959    -8.89   0.000     -.065612    -.041007
                2004  |  -.0555922   .0067003    -8.30   0.000    -.0693401   -.0418444
                2005  |  -.0647533   .0070125    -9.23   0.000    -.0791417   -.0503649
                2006  |  -.0682403    .007838    -8.71   0.000    -.0843226   -.0521579
                2007  |   -.063888   .0079126    -8.07   0.000    -.0801233   -.0476526
                2008  |  -.0551026   .0082012    -6.72   0.000      -.07193   -.0382751
                2009  |  -.0591562   .0068425    -8.65   0.000    -.0731958   -.0451166
                2010  |  -.0649669   .0093682    -6.93   0.000    -.0841888    -.045745
                2011  |  -.0676678    .006842    -9.89   0.000    -.0817064   -.0536292
                2012  |  -.0683716    .007214    -9.48   0.000    -.0831736   -.0535696
                2013  |  -.0659075   .0074106    -8.89   0.000    -.0811128   -.0507022
                2014  |  -.0688433   .0063873   -10.78   0.000    -.0819489   -.0557376
                2015  |  -.0715296   .0070865   -10.09   0.000    -.0860698   -.0569894
                2016  |  -.0688105   .0078886    -8.72   0.000    -.0849965   -.0526245
                2017  |  -.0585725   .0071927    -8.14   0.000    -.0733307   -.0438142
                2018  |  -.0589099   .0054142   -10.88   0.000    -.0700189   -.0478009
                2019  |  -.0669541   .0065063   -10.29   0.000    -.0803039   -.0536042
                      |
                 nind |
                   2  |   .1583965   .0135751    11.67   0.000     .1305426    .1862504
                   3  |   .1217377   .0122517     9.94   0.000     .0965992    .1468762
                   4  |   .0364319   .0098136     3.71   0.001      .016296    .0565677
                   5  |   .2051324   .0110367    18.59   0.000     .1824869    .2277778
                   6  |   .0284519   .0103333     2.75   0.010     .0072497     .049654
                   7  |   .0166958   .0093505     1.79   0.085    -.0024898    .0358814
                   8  |   .0470243   .0159063     2.96   0.006     .0143873    .0796613
                   9  |   .1674315   .0123538    13.55   0.000     .1420835    .1927795
                  10  |   .0255113   .0203333     1.25   0.220    -.0162091    .0672317
                  11  |   .1238564   .0198944     6.23   0.000     .0830365    .1646763
                      |
                 educ |   .0099288   .0017903     5.55   0.000     .0062554    .0136022
                exper |   .0094075   .0013863     6.79   0.000      .006563     .012252
               exper2 |  -.0000954   .0000874    -1.09   0.284    -.0002747    .0000838
               exper3 |   3.49e-06   2.66e-06     1.31   0.201    -1.97e-06    8.94e-06
               exper4 |  -7.51e-08   2.72e-08    -2.76   0.010    -1.31e-07   -1.92e-08
                 edex |  -.0002967   .0000541    -5.49   0.000    -.0004077   -.0001858
                      |
                ee_cl |
                   2  |   -.023594    .007344    -3.21   0.003    -.0386627   -.0085254
                   3  |  -.0172757   .0080652    -2.14   0.041    -.0338242   -.0007273
                   4  |  -.0347164   .0099711    -3.48   0.002    -.0551754   -.0142574
                   5  |    -.08837    .009155    -9.65   0.000    -.1071545   -.0695855
                   6  |  -.0064654   .0068199    -0.95   0.352    -.0204588    .0075279
                   7  |   .0064048   .0081507     0.79   0.439    -.0103189    .0231286
                   8  |  -.0482286   .0122867    -3.93   0.001    -.0734388   -.0230185
                   9  |  -.0668421   .0092954    -7.19   0.000    -.0859147   -.0477694
                  10  |   .0120889   .0080113     1.51   0.143     -.004349    .0285268
                  11  |   .0058913   .0097903     0.60   0.552    -.0141968    .0259794
                  12  |  -.0647819   .0147261    -4.40   0.000    -.0949974   -.0345665
                  13  |   .0144657   .0092376     1.57   0.129    -.0044882    .0334197
                  14  |   .0235806   .0082221     2.87   0.008     .0067102     .040451
                  15  |  -.0040161   .0101586    -0.40   0.696    -.0248598    .0168276
                  16  |  -.0719672   .0158682    -4.54   0.000     -.104526   -.0394084
                      |
                 marr |   .0194513    .001722    11.30   0.000     .0159181    .0229845
                partt |   -.075995   .0043624   -17.42   0.000    -.0849459    -.067044
               public |   .3390568   .0214874    15.78   0.000     .2949682    .3831454
                 cmsa |   .0494712   .0072977     6.78   0.000     .0344975    .0644449
                      |
                nocc2 |
                   2  |   .0575588    .003466    16.61   0.000     .0504471    .0646705
                   3  |   .0415671   .0057107     7.28   0.000     .0298496    .0532845
                   4  |   .1952726   .0051691    37.78   0.000     .1846664    .2058787
                   5  |   .1884515   .0170664    11.04   0.000     .1534341    .2234689
                   6  |   .1540557   .0059404    25.93   0.000     .1418669    .1662444
                   7  |   .0828285   .0029723    27.87   0.000     .0767299    .0889271
                   8  |   .0710291   .0092019     7.72   0.000     .0521483    .0899098
                   9  |   .1979432   .0065842    30.06   0.000     .1844335    .2114529
                  10  |   .2340296    .008235    28.42   0.000     .2171328    .2509265
                  11  |   .2537747   .0096316    26.35   0.000     .2340123    .2735371
                  12  |   .2587934   .0086671    29.86   0.000       .24101    .2765768
                      |
              quarter |
                   2  |  -.0016768   .0020364    -0.82   0.417    -.0058551    .0025016
                   3  |  -.0036142   .0016791    -2.15   0.040    -.0070595   -.0001689
                   4  |  -.0046381   .0013365    -3.47   0.002    -.0073804   -.0018957
                      |
                _cons |  -.2828523   .0290188    -9.75   0.000     -.342394   -.2233106
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 5,787,533,775)

Linear regression                               Number of obs     =    652,709
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2556
                                                Root MSE          =     .35713

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0512633   .0074448     6.89   0.000     .0359878    .0665389
             treat_st |  -.0277417   .0107456    -2.58   0.016    -.0497897   -.0056936
treat_stblackrelwhite |  -.0256425    .011369    -2.26   0.032    -.0489698   -.0023153
                      |
                state |
                  NH  |   -.039974   .0036474   -10.96   0.000    -.0474578   -.0324902
                  VT  |  -.0466085   .0012582   -37.04   0.000    -.0491902   -.0440268
                  MA  |    .007133   .0072882     0.98   0.336    -.0078211    .0220871
                  RI  |   .0121747   .0078786     1.55   0.134    -.0039908    .0283402
                  CT  |   .0077569   .0071922     1.08   0.290    -.0070004    .0225141
                  NY  |   .0926202   .0069245    13.38   0.000     .0784123     .106828
                  NJ  |   .0445845    .008086     5.51   0.000     .0279934    .0611756
                  PA  |   .0205633   .0059572     3.45   0.002       .00834    .0327866
                  OH  |   .0103696   .0060031     1.73   0.096    -.0019477    .0226868
                  IN  |  -.0088653    .005379    -1.65   0.111    -.0199021    .0021716
                  IL  |   .0442115   .0067059     6.59   0.000     .0304521    .0579709
                  MI  |   .0583461   .0069647     8.38   0.000     .0440556    .0726366
                  WI  |  -.0027812   .0047319    -0.59   0.562    -.0124902    .0069278
                  MN  |   .0206633   .0054732     3.78   0.001     .0094333    .0318933
                  MO  |  -.0118229   .0058129    -2.03   0.052      -.02375    .0001042
                  DE  |  -.0607527   .0030173   -20.13   0.000    -.0669436   -.0545617
                  MD  |  -.0554962    .008055    -6.89   0.000    -.0720237   -.0389688
                  DC  |  -.0473791   .0099292    -4.77   0.000    -.0677522    -.027006
                  KY  |  -.0453238   .0044829   -10.11   0.000     -.054522   -.0361257
                  OK  |  -.0902657   .0074503   -12.12   0.000    -.1055525   -.0749789
                  CO  |  -.0548649   .0071643    -7.66   0.000    -.0695649    -.040165
                  NM  |  -.1043425   .0060777   -17.17   0.000    -.1168129    -.091872
                  WA  |   .0518098   .0070598     7.34   0.000     .0373242    .0662954
                  OR  |   .0163601   .0066445     2.46   0.020     .0027268    .0299934
                  CA  |   .0352866   .0084496     4.18   0.000     .0179494    .0526238
                  AK  |   .0326948   .0070441     4.64   0.000     .0182415    .0471482
                  HI  |   .0134602   .0050847     2.65   0.013     .0030273     .023893
                      |
                 year |
                1990  |  -.0045652   .0035355    -1.29   0.208    -.0118195    .0026891
                1991  |  -.0017189   .0048137    -0.36   0.724    -.0115957    .0081579
                1992  |  -.0056521   .0045835    -1.23   0.228    -.0150567    .0037525
                1993  |  -.0124043   .0054155    -2.29   0.030     -.023516   -.0012927
                1996  |  -.0272395   .0052071    -5.23   0.000    -.0379235   -.0165555
                1997  |  -.0322216    .005182    -6.22   0.000    -.0428541    -.021589
                1998  |  -.0385933   .0054074    -7.14   0.000    -.0496883   -.0274983
                1999  |  -.0417017   .0046716    -8.93   0.000    -.0512871   -.0321164
                2000  |  -.0466359   .0047579    -9.80   0.000    -.0563984   -.0368735
                2001  |  -.0444294   .0062084    -7.16   0.000    -.0571679   -.0316909
                2002  |  -.0437182   .0067627    -6.46   0.000     -.057594   -.0298424
                2003  |  -.0494844   .0057953    -8.54   0.000    -.0613754   -.0375934
                2004  |   -.053361   .0065078    -8.20   0.000    -.0667139    -.040008
                2005  |  -.0642741   .0069506    -9.25   0.000    -.0785356   -.0500126
                2006  |  -.0691768   .0078037    -8.86   0.000    -.0851886    -.053165
                2007  |  -.0648105   .0080645    -8.04   0.000    -.0813576   -.0482634
                2008  |  -.0520035   .0079121    -6.57   0.000    -.0682379   -.0357691
                2009  |  -.0429662   .0064209    -6.69   0.000    -.0561408   -.0297916
                2010  |  -.0476251   .0086401    -5.51   0.000    -.0653532   -.0298971
                2011  |  -.0533144   .0065282    -8.17   0.000    -.0667092   -.0399195
                2012  |  -.0568209   .0064209    -8.85   0.000    -.0699955   -.0436463
                2013  |  -.0564836   .0069898    -8.08   0.000    -.0708256   -.0421417
                2014  |  -.0644748   .0064237   -10.04   0.000    -.0776552   -.0512944
                2015  |  -.0709304   .0074586    -9.51   0.000    -.0862343   -.0556266
                2016  |  -.0696269    .008199    -8.49   0.000    -.0864499   -.0528039
                2017  |  -.0611397   .0074074    -8.25   0.000    -.0763384   -.0459409
                2018  |  -.0630734   .0062213   -10.14   0.000    -.0758384   -.0503085
                2019  |  -.0717573   .0078794    -9.11   0.000    -.0879245   -.0555901
                      |
                 nind |
                   2  |   .1583739   .0135455    11.69   0.000     .1305809    .1861669
                   3  |   .1217555   .0122316     9.95   0.000     .0966584    .1468525
                   4  |   .0364845   .0097885     3.73   0.001     .0164002    .0565689
                   5  |   .2051798   .0110132    18.63   0.000     .1825825     .227777
                   6  |   .0284925   .0103075     2.76   0.010     .0073432    .0496418
                   7  |   .0166984   .0093313     1.79   0.085    -.0024479    .0358447
                   8  |    .047088   .0158858     2.96   0.006      .014493     .079683
                   9  |   .1674736   .0123211    13.59   0.000     .1421929    .1927543
                  10  |   .0255559   .0203131     1.26   0.219    -.0161232     .067235
                  11  |   .1238861   .0198577     6.24   0.000     .0831414    .1646307
                      |
                 educ |   .0099441   .0018045     5.51   0.000     .0062415    .0136467
                exper |   .0094571   .0013855     6.83   0.000     .0066143    .0122998
               exper2 |  -.0000977   .0000873    -1.12   0.273    -.0002767    .0000814
               exper3 |   3.56e-06   2.66e-06     1.34   0.192    -1.90e-06    9.02e-06
               exper4 |  -7.59e-08   2.73e-08    -2.78   0.010    -1.32e-07   -2.00e-08
                 edex |  -.0002982   .0000544    -5.49   0.000    -.0004098   -.0001867
                      |
                ee_cl |
                   2  |  -.0235138   .0073479    -3.20   0.003    -.0385904   -.0084372
                   3  |  -.0172498   .0080623    -2.14   0.042    -.0337923   -.0007072
                   4  |  -.0347048   .0100011    -3.47   0.002    -.0552254   -.0141841
                   5  |  -.0884348   .0091518    -9.66   0.000    -.1072128   -.0696569
                   6  |   -.006461   .0068349    -0.95   0.353     -.020485     .007563
                   7  |   .0064589   .0081561     0.79   0.435    -.0102761    .0231939
                   8  |  -.0481713   .0123134    -3.91   0.001    -.0734364   -.0229063
                   9  |  -.0668668   .0092998    -7.19   0.000    -.0859484   -.0477852
                  10  |   .0119934   .0080318     1.49   0.147    -.0044864    .0284733
                  11  |   .0059095   .0098099     0.60   0.552    -.0142188    .0260378
                  12  |  -.0647109   .0147409    -4.39   0.000    -.0949567   -.0344651
                  13  |   .0142637   .0092535     1.54   0.135     -.004723    .0332503
                  14  |   .0234823   .0082497     2.85   0.008     .0065554    .0404092
                  15  |  -.0040322   .0101717    -0.40   0.695    -.0249029    .0168385
                  16  |   -.071876   .0158797    -4.53   0.000    -.1044585   -.0392934
                      |
                 marr |   .0194615    .001723    11.29   0.000     .0159261    .0229969
                partt |  -.0758871   .0043533   -17.43   0.000    -.0848194   -.0669549
               public |   .3390751   .0215044    15.77   0.000     .2949518    .3831984
                 cmsa |   .0494498   .0073221     6.75   0.000     .0344262    .0644735
                      |
                nocc2 |
                   2  |   .0575625   .0034648    16.61   0.000     .0504532    .0646717
                   3  |   .0415695   .0057067     7.28   0.000     .0298603    .0532787
                   4  |   .1952664   .0051734    37.74   0.000     .1846515    .2058812
                   5  |   .1884078   .0170836    11.03   0.000     .1533551    .2234605
                   6  |   .1540746    .005956    25.87   0.000      .141854    .1662953
                   7  |   .0828426   .0029725    27.87   0.000     .0767436    .0889416
                   8  |   .0709495   .0091955     7.72   0.000     .0520818    .0898171
                   9  |   .1979591   .0065943    30.02   0.000     .1844289    .2114894
                  10  |   .2340094   .0082345    28.42   0.000     .2171137    .2509052
                  11  |   .2537577    .009636    26.33   0.000     .2339863    .2735291
                  12  |    .258777   .0086678    29.85   0.000     .2409921     .276562
                      |
                unemp |  -.0037843   .0012766    -2.96   0.006    -.0064037   -.0011649
                      |
              quarter |
                   2  |   -.001676   .0020437    -0.82   0.419    -.0058692    .0025173
                   3  |  -.0035688   .0016828    -2.12   0.043    -.0070216    -.000116
                   4  |  -.0045608   .0013302    -3.43   0.002    -.0072902   -.0018315
                      |
                _cons |  -.2660703   .0283267    -9.39   0.000    -.3241919   -.2079487
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee
> _cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 5,787,533,775)

Linear regression                               Number of obs     =    652,709
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2561
                                                Root MSE          =     .35701

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0514045   .0074202     6.93   0.000     .0361795    .0666295
             treat_st |   .0186324   .0088921     2.10   0.046     .0003873    .0368776
treat_stblackrelwhite |  -.0250222    .011881    -2.11   0.045       -.0494   -.0006444
                      |
                state |
                  NH  |  -.1689948   .0079901   -21.15   0.000    -.1853892   -.1526004
                  VT  |  -.2390027    .008203   -29.14   0.000    -.2558339   -.2221716
                  MA  |  -.0635282   .0121826    -5.21   0.000    -.0885249   -.0385315
                  RI  |  -.0489639   .0147416    -3.32   0.003    -.0792112   -.0187166
                  CT  |  -.0751968   .0138852    -5.42   0.000    -.1036868   -.0467068
                  NY  |   .0511403   .0146702     3.49   0.002     .0210396    .0812409
                  NJ  |   .0622786    .014676     4.24   0.000      .032166    .0923912
                  PA  |   .1073316   .0117358     9.15   0.000     .0832518    .1314113
                  OH  |   .2269761   .0148195    15.32   0.000     .1965691    .2573831
                  IN  |   .3872818    .030185    12.83   0.000     .3253473    .4492163
                  IL  |   .1197933   .0111655    10.73   0.000     .0968836     .142703
                  MI  |   .3705736   .0288584    12.84   0.000     .3113612    .4297861
                  WI  |   .2789715   .0237757    11.73   0.000     .2301878    .3277553
                  MN  |   .0521105   .0122235     4.26   0.000       .02703    .0771909
                  MO  |   .0019362   .0102494     0.19   0.852    -.0190937    .0229662
                  DE  |   .0245627   .0136552     1.80   0.083    -.0034554    .0525809
                  MD  |  -.1526758    .015706    -9.72   0.000    -.1849019   -.1204497
                  DC  |  -.2253871   .0228868    -9.85   0.000    -.2723469   -.1784273
                  KY  |  -.1375632   .0173909    -7.91   0.000    -.1732464   -.1018799
                  OK  |  -.0547185   .0419808    -1.30   0.203     -.140856     .031419
                  CO  |  -.3103644   .0112616   -27.56   0.000    -.3334712   -.2872576
                  NM  |  -.3145611   .0095854   -32.82   0.000    -.3342286   -.2948935
                  WA  |   .1279559   .0093557    13.68   0.000     .1087597    .1471522
                  OR  |   .0078942   .0067529     1.17   0.253    -.0059616      .02175
                  CA  |  -.0737354   .0147452    -5.00   0.000    -.1039901   -.0434807
                  AK  |  -.1179448   .0147444    -8.00   0.000    -.1481977   -.0876918
                  HI  |   .1766586   .0146251    12.08   0.000     .1466503    .2066669
                      |
        state#c.lyear |
                  ME  |   -.002067   .0000958   -21.58   0.000    -.0022635   -.0018704
                  NH  |  -.0008257   .0001802    -4.58   0.000    -.0011955   -.0004559
                  VT  |  -.0001761   .0000487    -3.62   0.001    -.0002761   -.0000762
                  MA  |  -.0013775   .0000608   -22.64   0.000    -.0015023   -.0012527
                  RI  |  -.0015075   .0000677   -22.26   0.000    -.0016465   -.0013686
                  CT  |  -.0012652   .0000946   -13.37   0.000    -.0014593   -.0010711
                  NY  |  -.0016805   .0000587   -28.64   0.000    -.0018009   -.0015601
                  NJ  |  -.0022578   .0000707   -31.92   0.000     -.002403   -.0021127
                  PA  |  -.0029198    .000058   -50.37   0.000    -.0030387   -.0028008
                  OH  |   -.004183     .00005   -83.65   0.000    -.0042856   -.0040804
                  IN  |   -.006015   .0003053   -19.70   0.000    -.0066414   -.0053886
                  IL  |  -.0028324   .0000689   -41.11   0.000    -.0029737    -.002691
                  MI  |  -.0052476   .0002551   -20.57   0.000    -.0057711   -.0047241
                  WI  |  -.0048507   .0002205   -22.00   0.000    -.0053031   -.0043982
                  MN  |  -.0023462   .0000446   -52.59   0.000    -.0024377   -.0022547
                  MO  |  -.0022065   .0000508   -43.47   0.000    -.0023106   -.0021023
                  DE  |  -.0029011   .0001473   -19.70   0.000    -.0032034   -.0025989
                  MD  |  -.0011365   .0000584   -19.45   0.000    -.0012564   -.0010166
                  DC  |    -.00041   .0001643    -2.49   0.019    -.0007472   -.0000728
                  KY  |  -.0012502    .000167    -7.49   0.000    -.0015928   -.0009077
                  OK  |  -.0026493   .0004357    -6.08   0.000    -.0035432   -.0017553
                  CO  |   .0003861   .0000577     6.70   0.000     .0002678    .0005044
                  NM  |   -.000101   .0001839    -0.55   0.588    -.0004783    .0002764
                  WA  |   -.002825   .0000819   -34.47   0.000    -.0029931   -.0026568
                  OR  |   -.002029   .0000925   -21.94   0.000    -.0022188   -.0018393
                  CA  |  -.0010526   .0000508   -20.71   0.000    -.0011569   -.0009483
                  AK  |  -.0006429   .0000289   -22.23   0.000    -.0007022   -.0005835
                  HI  |    -.00363   .0000407   -89.27   0.000    -.0037134   -.0035466
                      |
                 nind |
                   2  |   .1573521   .0136581    11.52   0.000     .1293279    .1853763
                   3  |      .1208   .0122244     9.88   0.000     .0957175    .1458825
                   4  |   .0353403   .0099138     3.56   0.001     .0149988    .0556817
                   5  |    .203981   .0110517    18.46   0.000     .1813048    .2266571
                   6  |   .0275197   .0103956     2.65   0.013     .0061896    .0488497
                   7  |   .0153484   .0094099     1.63   0.114    -.0039591    .0346559
                   8  |   .0460717   .0159484     2.89   0.008     .0133484    .0787951
                   9  |   .1663372   .0123347    13.49   0.000     .1410285    .1916458
                  10  |   .0250252   .0203477     1.23   0.229    -.0167249    .0667752
                  11  |   .1229513   .0199185     6.17   0.000     .0820819    .1638206
                      |
                 educ |   .0105726   .0017045     6.20   0.000     .0070752      .01407
                exper |   .0098494   .0013841     7.12   0.000     .0070095    .0126894
               exper2 |  -.0001239   .0000864    -1.43   0.163    -.0003012    .0000534
               exper3 |   4.38e-06   2.63e-06     1.67   0.107    -1.02e-06    9.77e-06
               exper4 |  -8.34e-08   2.69e-08    -3.10   0.004    -1.39e-07   -2.83e-08
                 edex |  -.0003101   .0000539    -5.75   0.000    -.0004208   -.0001994
                      |
                ee_cl |
                   2  |  -.0241136   .0071623    -3.37   0.002    -.0388095   -.0094178
                   3  |  -.0186834   .0075236    -2.48   0.020    -.0341206   -.0032462
                   4  |   -.037577   .0093443    -4.02   0.000    -.0567498   -.0184041
                   5  |  -.0870047   .0092909    -9.36   0.000     -.106068   -.0679414
                   6  |   -.006838   .0065895    -1.04   0.309    -.0203584    .0066825
                   7  |   .0057843   .0077943     0.74   0.464    -.0102082    .0217768
                   8  |  -.0503577   .0115658    -4.35   0.000    -.0740887   -.0266267
                   9  |  -.0661846   .0091647    -7.22   0.000     -.084989   -.0473803
                  10  |   .0111602   .0077253     1.44   0.160    -.0046908    .0270112
                  11  |   .0050339   .0094217     0.53   0.598    -.0142979    .0243656
                  12  |  -.0665078   .0139394    -4.77   0.000     -.095109   -.0379066
                  13  |   .0141467   .0090573     1.56   0.130    -.0044372    .0327307
                  14  |    .022862   .0080926     2.83   0.009     .0062573    .0394667
                  15  |  -.0054338   .0097725    -0.56   0.583    -.0254853    .0146178
                  16  |  -.0739668   .0152669    -4.84   0.000    -.1052919   -.0426417
                      |
                 marr |   .0192422   .0017227    11.17   0.000     .0157076    .0227768
                partt |  -.0759261    .004336   -17.51   0.000    -.0848229   -.0670294
               public |   .3391089    .021535    15.75   0.000     .2949227     .383295
                 cmsa |    .049049   .0077696     6.31   0.000     .0331071     .064991
                      |
                nocc2 |
                   2  |   .0572734   .0034771    16.47   0.000     .0501389    .0644078
                   3  |   .0415229   .0057686     7.20   0.000     .0296866    .0533591
                   4  |   .1946328   .0051772    37.59   0.000     .1840101    .2052554
                   5  |   .1883396    .017134    10.99   0.000     .1531835    .2234956
                   6  |   .1543065   .0059011    26.15   0.000     .1421985    .1664145
                   7  |   .0830797   .0029333    28.32   0.000      .077061    .0890984
                   8  |   .0708781   .0092566     7.66   0.000     .0518851    .0898711
                   9  |    .197892   .0065163    30.37   0.000     .1845216    .2112624
                  10  |   .2337847   .0081896    28.55   0.000      .216981    .2505884
                  11  |   .2537046   .0095771    26.49   0.000     .2340539    .2733552
                  12  |   .2590596   .0086472    29.96   0.000      .241317    .2768023
                      |
                unemp |  -.0005634   .0004848    -1.16   0.255     -.001558    .0004313
                      |
              quarter |
                   2  |  -.0016818   .0020424    -0.82   0.417    -.0058724    .0025088
                   3  |  -.0036854   .0016791    -2.19   0.037    -.0071307   -.0002402
                   4  |   -.004679   .0013551    -3.45   0.002    -.0074595   -.0018986
                      |
                _cons |  -.1171955   .0330586    -3.55   0.001    -.1850262   -.0493648
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_mal_all_sltt 

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,661,379,632)

Linear regression                               Number of obs     =    660,309
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3172
                                                Root MSE          =     .31647

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |    .072011   .0112165     6.42   0.000     .0489966    .0950253
             treat_st |  -.0254167   .0119036    -2.14   0.042    -.0498409   -.0009924
treat_stblackrelwhite |  -.0247007   .0204557    -1.21   0.238    -.0666724     .017271
                      |
                state |
                  NH  |  -.0121717   .0019262    -6.32   0.000     -.016124   -.0082194
                  VT  |  -.0051621   .0006089    -8.48   0.000    -.0064114   -.0039128
                  MA  |   .0211009   .0042687     4.94   0.000     .0123423    .0298596
                  RI  |   .0356432   .0041781     8.53   0.000     .0270705     .044216
                  CT  |   .0293381   .0041923     7.00   0.000     .0207363      .03794
                  NY  |   .0940065    .004257    22.08   0.000     .0852719    .1027411
                  NJ  |    .035833    .004435     8.08   0.000      .026733    .0449329
                  PA  |   .0137759   .0037327     3.69   0.001     .0061169    .0214349
                  OH  |  -.0031398   .0034963    -0.90   0.377    -.0103137    .0040341
                  IN  |  -.0407047   .0040569   -10.03   0.000    -.0490287   -.0323806
                  IL  |   .0046235   .0040173     1.15   0.260    -.0036194    .0128664
                  MI  |   .0460244   .0040855    11.27   0.000     .0376417    .0544071
                  WI  |   .0005368   .0033501     0.16   0.874     -.006337    .0074105
                  MN  |   .0408353   .0031502    12.96   0.000     .0343717     .047299
                  MO  |  -.0485294   .0035439   -13.69   0.000    -.0558008    -.041258
                  DE  |  -.0309575   .0028301   -10.94   0.000    -.0367644   -.0251506
                  MD  |  -.0458976   .0068152    -6.73   0.000    -.0598812   -.0319141
                  DC  |  -.0647504   .0085986    -7.53   0.000    -.0823933   -.0471075
                  KY  |  -.0606603   .0024124   -25.15   0.000    -.0656102   -.0557104
                  OK  |  -.0710944   .0065301   -10.89   0.000    -.0844929   -.0576958
                  CO  |  -.0416955    .003967   -10.51   0.000    -.0498352   -.0335558
                  NM  |  -.0844616   .0032153   -26.27   0.000    -.0910588   -.0778644
                  WA  |   .0626689   .0035486    17.66   0.000     .0553879      .06995
                  OR  |   .0456734   .0032297    14.14   0.000     .0390465    .0523002
                  CA  |   .0449201   .0040192    11.18   0.000     .0366733    .0531668
                  AK  |   .0562201   .0037833    14.86   0.000     .0484574    .0639828
                  HI  |   .0518426   .0025634    20.22   0.000     .0465829    .0571022
                      |
                 year |
                1990  |  -.0009213   .0021244    -0.43   0.668    -.0052801    .0034376
                1991  |  -.0033793   .0022163    -1.52   0.139    -.0079268    .0011681
                1992  |  -.0020306   .0027243    -0.75   0.462    -.0076203    .0035592
                1993  |  -.0016853   .0030415    -0.55   0.584    -.0079258    .0045553
                1996  |  -.0004353   .0031962    -0.14   0.893    -.0069934    .0061228
                1997  |  -.0034404     .00318    -1.08   0.289    -.0099653    .0030845
                1998  |   -.009026   .0040411    -2.23   0.034    -.0173177   -.0007343
                1999  |  -.0107074   .0036049    -2.97   0.006     -.018104   -.0033107
                2000  |  -.0066437   .0031058    -2.14   0.042    -.0130162   -.0002712
                2001  |  -.0066432   .0024856    -2.67   0.013    -.0117432   -.0015432
                2002  |  -.0072731   .0046035    -1.58   0.126    -.0167186    .0021725
                2003  |  -.0143758   .0035339    -4.07   0.000    -.0216269   -.0071248
                2004  |  -.0168118   .0042418    -3.96   0.000    -.0255152   -.0081084
                2005  |  -.0195825   .0047172    -4.15   0.000    -.0292613   -.0099037
                2006  |  -.0211971   .0044977    -4.71   0.000    -.0304256   -.0119686
                2007  |  -.0174797   .0058559    -2.98   0.006     -.029495   -.0054643
                2008  |  -.0174507   .0053735    -3.25   0.003    -.0284762   -.0064252
                2009  |  -.0153839   .0052882    -2.91   0.007    -.0262344   -.0045334
                2010  |   -.019551   .0053205    -3.67   0.001    -.0304677   -.0086343
                2011  |  -.0166087   .0049611    -3.35   0.002    -.0267882   -.0064293
                2012  |  -.0234441   .0054369    -4.31   0.000    -.0345998   -.0122885
                2013  |  -.0212715   .0063945    -3.33   0.003    -.0343919   -.0081511
                2014  |  -.0219361   .0061867    -3.55   0.001    -.0346301   -.0092421
                2015  |  -.0267513    .006997    -3.82   0.001     -.041108   -.0123945
                2016  |  -.0189355   .0060735    -3.12   0.004    -.0313972   -.0064737
                2017  |  -.0229193   .0069367    -3.30   0.003    -.0371523   -.0086863
                2018  |  -.0289432   .0045999    -6.29   0.000    -.0383815   -.0195049
                2019  |   -.026257   .0070081    -3.75   0.001    -.0406363   -.0118776
                      |
                 nind |
                   2  |   .0603577   .0117058     5.16   0.000     .0363393    .0843761
                   3  |   .0739146    .012002     6.16   0.000     .0492886    .0985406
                   4  |   .0657568   .0079942     8.23   0.000     .0493541    .0821596
                   5  |   .1980703   .0099788    19.85   0.000     .1775956    .2185451
                   6  |   .0342848   .0089214     3.84   0.001     .0159795      .05259
                   7  |   .0234064   .0087807     2.67   0.013     .0053899    .0414228
                   8  |   .0540735   .0105456     5.13   0.000     .0324358    .0757112
                   9  |    .193308   .0130994    14.76   0.000     .1664303    .2201858
                  10  |   .0192893   .0086942     2.22   0.035     .0014503    .0371283
                  11  |    .040914   .0221697     1.85   0.076    -.0045745    .0864026
                      |
                 educ |   .0152992    .002379     6.43   0.000     .0104178    .0201806
                exper |   .0111012   .0015009     7.40   0.000     .0080217    .0141808
               exper2 |   -.000426   .0000925    -4.60   0.000    -.0006159   -.0002362
               exper3 |   .0000105   3.04e-06     3.46   0.002     4.30e-06    .0000168
               exper4 |  -1.02e-07   3.25e-08    -3.13   0.004    -1.68e-07   -3.51e-08
                 edex |  -.0001905   .0000538    -3.54   0.001    -.0003009   -.0000802
                      |
                ee_cl |
                   2  |  -.0365744   .0057082    -6.41   0.000    -.0482866   -.0248622
                   3  |  -.0695191   .0067365   -10.32   0.000    -.0833412   -.0556971
                   4  |  -.0994645   .0138184    -7.20   0.000    -.1278175   -.0711115
                   5  |  -.0479195   .0082712    -5.79   0.000    -.0648906   -.0309484
                   6  |  -.0421694   .0062718    -6.72   0.000     -.055038   -.0293007
                   7  |  -.0635685    .008705    -7.30   0.000    -.0814298   -.0457073
                   8  |  -.0914869   .0131663    -6.95   0.000     -.118502   -.0644718
                   9  |    -.02763   .0093464    -2.96   0.006    -.0468072   -.0084527
                  10  |  -.0425065   .0078264    -5.43   0.000    -.0585649   -.0264481
                  11  |  -.0634295    .009586    -6.62   0.000    -.0830984   -.0437606
                  12  |  -.0840705   .0123344    -6.82   0.000    -.1093787   -.0587623
                  13  |  -.0009508   .0088637    -0.11   0.915    -.0191377    .0172361
                  14  |  -.0376971   .0089233    -4.22   0.000    -.0560062    -.019388
                  15  |  -.0602175   .0104675    -5.75   0.000     -.081695   -.0387401
                  16  |  -.0777299   .0139961    -5.55   0.000    -.1064476   -.0490122
                      |
                 marr |  -.0004767    .001196    -0.40   0.693    -.0029306    .0019772
                partt |  -.0669624   .0055304   -12.11   0.000    -.0783098    -.055615
               public |   .3685104   .0228107    16.16   0.000     .3217067    .4153141
                 cmsa |   .0261688   .0041072     6.37   0.000     .0177415    .0345961
                      |
                nocc2 |
                   2  |   .0235405   .0023296    10.10   0.000     .0187605    .0283205
                   3  |   .0426153   .0069451     6.14   0.000     .0283651    .0568656
                   4  |   .1699571   .0042471    40.02   0.000     .1612428    .1786714
                   5  |   .1760888   .0145719    12.08   0.000     .1461897     .205988
                   6  |   .0762622   .0036334    20.99   0.000     .0688072    .0837172
                   7  |   .1050849   .0057864    18.16   0.000     .0932122    .1169576
                   8  |   .0580116    .004715    12.30   0.000     .0483373     .067686
                   9  |   .1198353   .0083571    14.34   0.000     .1026879    .1369826
                  10  |   .2251413   .0093023    24.20   0.000     .2060547     .244228
                  11  |   .2577842   .0094972    27.14   0.000     .2382975    .2772708
                  12  |   .2242913    .011836    18.95   0.000     .2000057    .2485768
                      |
              quarter |
                   2  |  -.0022978   .0012333    -1.86   0.073    -.0048283    .0002328
                   3  |    -.00026   .0011667    -0.22   0.825    -.0026539    .0021339
                   4  |  -.0038876   .0016039    -2.42   0.022    -.0071786   -.0005966
                      |
                _cons |  -.2994309   .0337921    -8.86   0.000    -.3687665   -.2300953
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,661,379,632)

Linear regression                               Number of obs     =    660,309
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3172
                                                Root MSE          =     .31647

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0720037    .011212     6.42   0.000     .0489986    .0950088
             treat_st |  -.0260054   .0117022    -2.22   0.035    -.0500164   -.0019944
treat_stblackrelwhite |  -.0248623   .0204747    -1.21   0.235     -.066873    .0171483
                      |
                state |
                  NH  |   -.014849   .0020804    -7.14   0.000    -.0191176   -.0105803
                  VT  |  -.0076259   .0015754    -4.84   0.000    -.0108584   -.0043934
                  MA  |   .0212151   .0042835     4.95   0.000     .0124262     .030004
                  RI  |   .0381127   .0045754     8.33   0.000     .0287249    .0475006
                  CT  |   .0296144   .0042057     7.04   0.000     .0209851    .0382437
                  NY  |   .0957514   .0042141    22.72   0.000     .0871047     .104398
                  NJ  |   .0371216     .00451     8.23   0.000     .0278679    .0463753
                  PA  |   .0146938   .0038158     3.85   0.001     .0068645    .0225231
                  OH  |  -.0016579   .0036252    -0.46   0.651    -.0090963    .0057804
                  IN  |  -.0404353   .0040332   -10.03   0.000    -.0487108   -.0321598
                  IL  |    .006956    .004218     1.65   0.111    -.0016986    .0156107
                  MI  |   .0496036   .0047449    10.45   0.000     .0398679    .0593393
                  WI  |  -.0003292   .0032815    -0.10   0.921    -.0070622    .0064038
                  MN  |   .0389325   .0031454    12.38   0.000     .0324787    .0453862
                  MO  |   -.048052   .0035606   -13.50   0.000    -.0553579   -.0407462
                  DE  |  -.0323877   .0033772    -9.59   0.000    -.0393171   -.0254583
                  MD  |   -.046651   .0069238    -6.74   0.000    -.0608574   -.0324445
                  DC  |  -.0606788   .0081659    -7.43   0.000    -.0774338   -.0439237
                  KY  |  -.0586854   .0026664   -22.01   0.000    -.0641563   -.0532144
                  OK  |  -.0719603   .0063291   -11.37   0.000    -.0849465   -.0589742
                  CO  |  -.0425753   .0039109   -10.89   0.000    -.0505998   -.0345508
                  NM  |  -.0828015   .0033336   -24.84   0.000    -.0896415   -.0759616
                  WA  |   .0646654   .0039444    16.39   0.000     .0565721    .0727586
                  OR  |   .0484241   .0039271    12.33   0.000     .0403663    .0564818
                  CA  |   .0485962   .0046499    10.45   0.000     .0390554     .058137
                  AK  |   .0609823   .0046055    13.24   0.000     .0515327    .0704319
                  HI  |   .0493456   .0027695    17.82   0.000     .0436631     .055028
                      |
                 year |
                1990  |   .0001576   .0024107     0.07   0.948    -.0047888    .0051039
                1991  |   .0007841   .0038096     0.21   0.838    -.0070325    .0086007
                1992  |   .0036247   .0034559     1.05   0.304    -.0034661    .0107155
                1993  |   .0027212   .0037575     0.72   0.475    -.0049885    .0104309
                1996  |   .0001796   .0032107     0.06   0.956    -.0064081    .0067674
                1997  |  -.0038647    .003166    -1.22   0.233    -.0103607    .0026313
                1998  |  -.0104455   .0040889    -2.55   0.017    -.0188352   -.0020558
                1999  |  -.0128131   .0036659    -3.50   0.002    -.0203348   -.0052914
                2000  |  -.0091813    .002972    -3.09   0.005    -.0152794   -.0030832
                2001  |   -.007541   .0024699    -3.05   0.005    -.0126089   -.0024731
                2002  |  -.0057147   .0048205    -1.19   0.246    -.0156055    .0041761
                2003  |  -.0120869   .0038648    -3.13   0.004    -.0200168    -.004157
                2004  |   -.015443   .0045219    -3.42   0.002    -.0247211   -.0061648
                2005  |  -.0192534   .0047924    -4.02   0.000    -.0290866   -.0094203
                2006  |  -.0216952   .0045636    -4.75   0.000    -.0310589   -.0123314
                2007  |  -.0179547   .0060732    -2.96   0.006    -.0304159   -.0054934
                2008  |  -.0155608   .0057082    -2.73   0.011    -.0272731   -.0038485
                2009  |  -.0057672   .0073744    -0.78   0.441    -.0208981    .0093637
                2010  |  -.0092714   .0074336    -1.25   0.223     -.024524    .0059811
                2011  |  -.0081234   .0068182    -1.19   0.244    -.0221132    .0058664
                2012  |  -.0165866   .0068408    -2.42   0.022    -.0306228   -.0025503
                2013  |   -.015658   .0072518    -2.16   0.040    -.0305374   -.0007786
                2014  |  -.0193169   .0063705    -3.03   0.005     -.032388   -.0062458
                2015  |  -.0263405   .0071597    -3.68   0.001    -.0410309   -.0116501
                2016  |  -.0193455   .0060923    -3.18   0.004    -.0318459   -.0068451
                2017  |  -.0243545   .0070598    -3.45   0.002      -.03884   -.0098691
                2018  |  -.0313409   .0051599    -6.07   0.000    -.0419281   -.0207537
                2019  |  -.0290201   .0076835    -3.78   0.001    -.0447853   -.0132548
                      |
                 nind |
                   2  |   .0602493   .0117026     5.15   0.000     .0362376     .084261
                   3  |   .0738355    .011987     6.16   0.000     .0492403    .0984307
                   4  |   .0656842   .0080084     8.20   0.000     .0492523    .0821162
                   5  |   .1980032   .0100016    19.80   0.000     .1774817    .2185247
                   6  |   .0342061   .0089333     3.83   0.001     .0158764    .0525358
                   7  |    .023309   .0087887     2.65   0.013      .005276     .041342
                   8  |   .0540051    .010545     5.12   0.000     .0323686    .0756416
                   9  |   .1932161   .0130918    14.76   0.000     .1663539    .2200783
                  10  |   .0192066    .008721     2.20   0.036     .0013125    .0371007
                  11  |   .0407881   .0221694     1.84   0.077    -.0046999     .086276
                      |
                 educ |   .0152913    .002382     6.42   0.000     .0104039    .0201787
                exper |   .0111136   .0015001     7.41   0.000     .0080357    .0141915
               exper2 |  -.0004272   .0000924    -4.63   0.000    -.0006167   -.0002377
               exper3 |   .0000106   3.04e-06     3.48   0.002     4.35e-06    .0000168
               exper4 |  -1.02e-07   3.24e-08    -3.15   0.004    -1.69e-07   -3.56e-08
                 edex |  -.0001905   .0000537    -3.55   0.001    -.0003007   -.0000804
                      |
                ee_cl |
                   2  |  -.0365209   .0056997    -6.41   0.000    -.0482158   -.0248261
                   3  |  -.0694457   .0067099   -10.35   0.000    -.0832133    -.055678
                   4  |   -.099375   .0138047    -7.20   0.000       -.1277     -.07105
                   5  |  -.0478742   .0082483    -5.80   0.000    -.0647983     -.03095
                   6  |   -.042114   .0062543    -6.73   0.000    -.0549467   -.0292812
                   7  |  -.0634654   .0086688    -7.32   0.000    -.0812524   -.0456784
                   8  |  -.0913785   .0131342    -6.96   0.000    -.1183277   -.0644292
                   9  |  -.0275784   .0093429    -2.95   0.006    -.0467483   -.0084084
                  10  |  -.0424482   .0077992    -5.44   0.000    -.0584508   -.0264457
                  11  |  -.0633212   .0095447    -6.63   0.000    -.0829053   -.0437371
                  12  |  -.0839507   .0122953    -6.83   0.000    -.1091785   -.0587228
                  13  |   -.000889   .0088369    -0.10   0.921    -.0190208    .0172428
                  14  |  -.0376013   .0088824    -4.23   0.000    -.0558265   -.0193761
                  15  |  -.0600859    .010414    -5.77   0.000    -.0814536   -.0387181
                  16  |  -.0776064   .0139647    -5.56   0.000    -.1062596   -.0489532
                      |
                 marr |  -.0004773   .0011958    -0.40   0.693    -.0029309    .0019764
                partt |  -.0669355   .0055171   -12.13   0.000    -.0782557   -.0556153
               public |   .3685347   .0228185    16.15   0.000     .3217149    .4153544
                 cmsa |    .026168   .0041126     6.36   0.000     .0177296    .0346064
                      |
                nocc2 |
                   2  |   .0235232   .0023263    10.11   0.000     .0187499    .0282964
                   3  |   .0426035   .0069397     6.14   0.000     .0283644    .0568426
                   4  |   .1699495    .004246    40.03   0.000     .1612375    .1786615
                   5  |   .1760689   .0145749    12.08   0.000     .1461637    .2059741
                   6  |   .0762632   .0036321    21.00   0.000     .0688107    .0837158
                   7  |   .1050746   .0057792    18.18   0.000     .0932167    .1169326
                   8  |   .0580534   .0047243    12.29   0.000       .04836    .0677468
                   9  |   .1198292   .0083562    14.34   0.000     .1026837    .1369747
                  10  |   .2250933   .0092866    24.24   0.000     .2060387    .2441479
                  11  |   .2577505    .009499    27.13   0.000     .2382602    .2772408
                  12  |    .224252   .0118487    18.93   0.000     .1999405    .2485636
                      |
                unemp |  -.0022346   .0012921    -1.73   0.095    -.0048857    .0004165
                      |
              quarter |
                   2  |  -.0022871   .0012321    -1.86   0.074    -.0048151    .0002409
                   3  |  -.0002384   .0011573    -0.21   0.838     -.002613    .0021362
                   4  |   -.003846   .0015789    -2.44   0.022    -.0070857   -.0006063
                      |
                _cons |  -.2892922   .0316226    -9.15   0.000    -.3541763   -.2244081
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee
> _cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,661,379,632)

Linear regression                               Number of obs     =    660,309
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3177
                                                Root MSE          =     .31636

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0721752    .011197     6.45   0.000     .0492008    .0951496
             treat_st |  -.0080307   .0120858    -0.66   0.512    -.0328287    .0167672
treat_stblackrelwhite |  -.0272562   .0202254    -1.35   0.189    -.0687552    .0142428
                      |
                state |
                  NH  |  -.1412812   .0042574   -33.18   0.000    -.1500167   -.1325457
                  VT  |  -.1475274   .0053524   -27.56   0.000    -.1585097   -.1365452
                  MA  |  -.0125145   .0100203    -1.25   0.222    -.0330744    .0080454
                  RI  |   -.050666   .0095298    -5.32   0.000    -.0702195   -.0311125
                  CT  |  -.0835323   .0120678    -6.92   0.000    -.1082933   -.0587712
                  NY  |   .0050565   .0117052     0.43   0.669    -.0189605    .0290736
                  NJ  |   .1341663   .0122046    10.99   0.000     .1091245    .1592082
                  PA  |   .1169127    .010554    11.08   0.000     .0952577    .1385677
                  OH  |    .113182   .0102755    11.01   0.000     .0920985    .1342655
                  IN  |   .1272571   .0402013     3.17   0.004     .0447707    .2097435
                  IL  |   .0235364   .0097316     2.42   0.023     .0035688    .0435041
                  MI  |   .1175361   .0378791     3.10   0.004     .0398147    .1952576
                  WI  |   .3115069   .0315865     9.86   0.000     .2466968    .3763171
                  MN  |   .1608246   .0101808    15.80   0.000     .1399353    .1817138
                  MO  |   .0260806   .0070202     3.72   0.001     .0116764    .0404848
                  DE  |   .0049115   .0167056     0.29   0.771    -.0293656    .0391886
                  MD  |   .0969884   .0147172     6.59   0.000     .0667911    .1271856
                  DC  |   -.099026   .0389362    -2.54   0.017    -.1789165   -.0191355
                  KY  |  -.0985531   .0217472    -4.53   0.000    -.1431746   -.0539315
                  OK  |  -.0274885   .0541446    -0.51   0.616     -.138584     .083607
                  CO  |   -.164837   .0103906   -15.86   0.000    -.1861567   -.1435173
                  NM  |  -.1464426   .0056464   -25.94   0.000     -.158028   -.1348572
                  WA  |   .1305358   .0101755    12.83   0.000     .1096573    .1514142
                  OR  |  -.0102799    .007001    -1.47   0.154    -.0246449    .0040851
                  CA  |  -.0413435   .0117153    -3.53   0.002    -.0653814   -.0173057
                  AK  |   -.028027   .0102608    -2.73   0.011    -.0490804   -.0069736
                  HI  |   .1884161   .0130719    14.41   0.000     .1615949    .2152374
                      |
        state#c.lyear |
                  ME  |  -.0007206   .0001005    -7.17   0.000    -.0009269   -.0005143
                  NH  |   .0004833   .0001271     3.80   0.001     .0002226    .0007441
                  VT  |   .0006543   .0000594    11.02   0.000     .0005325    .0007762
                  MA  |  -.0003945   .0000608    -6.48   0.000    -.0005194   -.0002697
                  RI  |   .0001134    .000081     1.40   0.173    -.0000528    .0002795
                  CT  |   .0003717   .0000837     4.44   0.000        .0002    .0005434
                  NY  |   .0001476   .0000428     3.45   0.002     .0000598    .0002354
                  NJ  |   -.001665   .0000461   -36.11   0.000    -.0017596   -.0015704
                  PA  |  -.0017152   .0000352   -48.71   0.000    -.0017875    -.001643
                  OH  |  -.0018422   .0000489   -37.66   0.000    -.0019426   -.0017418
                  IN  |  -.0023824   .0004061    -5.87   0.000    -.0032155   -.0015492
                  IL  |   -.000903   .0000449   -20.10   0.000    -.0009952   -.0008108
                  MI  |   -.001445   .0003582    -4.03   0.000      -.00218   -.0007101
                  WI  |  -.0037519   .0003109   -12.07   0.000    -.0043898   -.0031141
                  MN  |  -.0018747   .0000413   -45.41   0.000    -.0019594     -.00179
                  MO  |  -.0014388   .0000637   -22.60   0.000    -.0015694   -.0013081
                  DE  |  -.0010756   .0001271    -8.46   0.000    -.0013364   -.0008148
                  MD  |  -.0020827   .0000555   -37.51   0.000    -.0021966   -.0019687
                  DC  |  -.0003934   .0002334    -1.69   0.103    -.0008723    .0000855
                  KY  |  -.0003738   .0002008    -1.86   0.074    -.0007857    .0000382
                  OK  |  -.0012355   .0005729    -2.16   0.040    -.0024109     -.00006
                  CO  |   .0004567   .0000664     6.88   0.000     .0003205     .000593
                  NM  |  -.0001322   .0001047    -1.26   0.218     -.000347    .0000827
                  WA  |  -.0013731    .000041   -33.47   0.000    -.0014573   -.0012889
                  OR  |  -.0001835   .0000718    -2.56   0.017    -.0003307   -.0000362
                  CA  |     .00012   .0000613     1.96   0.061    -5.85e-06    .0002458
                  AK  |   .0001115    .000085     1.31   0.201    -.0000629    .0002859
                  HI  |  -.0020643   .0001018   -20.27   0.000    -.0022733   -.0018554
                      |
                 nind |
                   2  |   .0595819   .0117901     5.05   0.000     .0353906    .0837731
                   3  |   .0734962   .0120076     6.12   0.000     .0488586    .0981339
                   4  |   .0650374    .008057     8.07   0.000     .0485058    .0815689
                   5  |   .1971927   .0100061    19.71   0.000      .176662    .2177234
                   6  |   .0338267   .0089766     3.77   0.001     .0154083    .0522451
                   7  |   .0227119   .0088545     2.57   0.016      .004544    .0408798
                   8  |    .053456    .010671     5.01   0.000     .0315608    .0753511
                   9  |   .1926718   .0132301    14.56   0.000     .1655259    .2198176
                  10  |   .0187893   .0086491     2.17   0.039     .0010429    .0365358
                  11  |   .0401046   .0222806     1.80   0.083    -.0056116    .0858207
                      |
                 educ |   .0151916   .0022581     6.73   0.000     .0105584    .0198248
                exper |   .0111348   .0014977     7.43   0.000     .0080618    .0142078
               exper2 |  -.0004261   .0000915    -4.65   0.000    -.0006139   -.0002382
               exper3 |   .0000105   3.01e-06     3.49   0.002     4.33e-06    .0000167
               exper4 |  -1.01e-07   3.22e-08    -3.14   0.004    -1.67e-07   -3.51e-08
                 edex |  -.0001916   .0000538    -3.56   0.001    -.0003021   -.0000811
                      |
                ee_cl |
                   2  |   -.036998   .0056073    -6.60   0.000    -.0485031   -.0254928
                   3  |  -.0693363   .0064611   -10.73   0.000    -.0825935   -.0560791
                   4  |  -.0992453   .0133016    -7.46   0.000     -.126538   -.0719527
                   5  |  -.0486338   .0084506    -5.76   0.000     -.065973   -.0312945
                   6  |   -.043009   .0063258    -6.80   0.000    -.0559884   -.0300296
                   7  |  -.0631606   .0085308    -7.40   0.000    -.0806644   -.0456567
                   8  |  -.0911366   .0127608    -7.14   0.000    -.1173197   -.0649535
                   9  |  -.0284788   .0095053    -3.00   0.006    -.0479822   -.0089755
                  10  |  -.0430243   .0078289    -5.50   0.000    -.0590879   -.0269608
                  11  |  -.0631526   .0094392    -6.69   0.000    -.0825202    -.043785
                  12  |   -.083715   .0118927    -7.04   0.000    -.1081169   -.0593131
                  13  |  -.0018667   .0090455    -0.21   0.838    -.0204265    .0166932
                  14  |  -.0378748   .0088467    -4.28   0.000    -.0560267   -.0197229
                  15  |  -.0601704    .010277    -5.85   0.000     -.081257   -.0390838
                  16  |  -.0777938   .0135321    -5.75   0.000    -.1055593   -.0500282
                      |
                 marr |  -.0004493   .0011932    -0.38   0.709    -.0028975    .0019989
                partt |  -.0669631   .0054784   -12.22   0.000    -.0782038   -.0557224
               public |   .3684721   .0228405    16.13   0.000     .3216073    .4153368
                 cmsa |   .0259108   .0042482     6.10   0.000     .0171942    .0346274
                      |
                nocc2 |
                   2  |   .0236922   .0023055    10.28   0.000     .0189617    .0284228
                   3  |   .0425578   .0069364     6.14   0.000     .0283255      .05679
                   4  |   .1697378   .0042644    39.80   0.000     .1609879    .1784877
                   5  |   .1760119   .0145855    12.07   0.000     .1460849    .2059388
                   6  |   .0761957   .0036428    20.92   0.000     .0687212    .0836702
                   7  |   .1051597   .0056876    18.49   0.000     .0934897    .1168297
                   8  |   .0579534   .0047602    12.17   0.000     .0481862    .0677206
                   9  |   .1196034   .0083373    14.35   0.000     .1024966    .1367101
                  10  |   .2244325   .0093301    24.05   0.000     .2052886    .2435763
                  11  |   .2578878   .0095402    27.03   0.000     .2383129    .2774627
                  12  |   .2242628    .011884    18.87   0.000     .1998789    .2486467
                      |
                unemp |   .0000986   .0004201     0.23   0.816    -.0007634    .0009607
                      |
              quarter |
                   2  |   -.002394   .0012324    -1.94   0.063    -.0049226    .0001347
                   3  |  -.0003536   .0012013    -0.29   0.771    -.0028185    .0021114
                   4  |  -.0039523   .0016142    -2.45   0.021    -.0072644   -.0006402
                      |
                _cons |  -.2358892   .0319039    -7.39   0.000    -.3013506   -.1704277
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,795,577,340)

Linear regression                               Number of obs     =    653,801
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5101
                                                Root MSE          =     .41698

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |    -.14402   .0066914   -21.52   0.000    -.1577496   -.1302905
             treat_st |   -.034876   .0186092    -1.87   0.072    -.0730589    .0033069
treat_stblackrelwhite |  -.0112339   .0075838    -1.48   0.150    -.0267945    .0043267
                      |
                state |
                  NH  |   .0901988   .0052444    17.20   0.000     .0794381    .1009595
                  VT  |   .0259255   .0010228    25.35   0.000     .0238268    .0280241
                  MA  |   .1195693   .0120609     9.91   0.000     .0948223    .1443163
                  RI  |    .031044   .0124738     2.49   0.019     .0054499    .0566382
                  CT  |   .1322394   .0119716    11.05   0.000     .1076757    .1568031
                  NY  |   .0975778   .0115121     8.48   0.000     .0739569    .1211987
                  NJ  |   .1707027   .0128657    13.27   0.000     .1443045     .197101
                  PA  |   .0111846   .0093922     1.19   0.244    -.0080866    .0304557
                  OH  |  -.0169478   .0091376    -1.85   0.075    -.0356966    .0018009
                  IN  |   .0065983    .006874     0.96   0.346    -.0075061    .0207027
                  IL  |   .0815585   .0101475     8.04   0.000     .0607375    .1023795
                  MI  |   .0467315   .0088218     5.30   0.000     .0286308    .0648323
                  WI  |    .022166   .0066334     3.34   0.002     .0085553    .0357767
                  MN  |   .0698354   .0087217     8.01   0.000     .0519399     .087731
                  MO  |  -.0198945   .0088202    -2.26   0.032    -.0379921    -.001797
                  DE  |   .0517558   .0020661    25.05   0.000     .0475166     .055995
                  MD  |   .1239481   .0126756     9.78   0.000       .09794    .1499562
                  DC  |   .1704585   .0152492    11.18   0.000     .1391698    .2017472
                  KY  |    -.04206   .0058395    -7.20   0.000    -.0540417   -.0300783
                  OK  |  -.0565607   .0120622    -4.69   0.000    -.0813103   -.0318111
                  CO  |   .0360157   .0114039     3.16   0.004     .0126168    .0594145
                  NM  |  -.0348401   .0074052    -4.70   0.000    -.0500344   -.0196459
                  WA  |   .0984308   .0106236     9.27   0.000      .076633    .1202286
                  OR  |   .0261894   .0095516     2.74   0.011     .0065912    .0457876
                  CA  |   .1591491   .0126082    12.62   0.000     .1332792     .185019
                  AK  |   .2359157   .0067197    35.11   0.000      .222128    .2497034
                  HI  |   .1123512   .0095398    11.78   0.000     .0927772    .1319252
                      |
                 year |
                1990  |  -.0083868   .0033444    -2.51   0.018    -.0152489   -.0015246
                1991  |  -.0218378   .0034301    -6.37   0.000    -.0288758   -.0147997
                1992  |  -.0228657   .0036569    -6.25   0.000    -.0303689   -.0153624
                1993  |  -.0326124   .0039326    -8.29   0.000    -.0406815   -.0245433
                1996  |  -.0289674   .0069384    -4.17   0.000    -.0432038   -.0147311
                1997  |  -.0184401   .0070043    -2.63   0.014    -.0328118   -.0040685
                1998  |   .0016087   .0053716     0.30   0.767    -.0094129    .0126303
                1999  |   .0238012   .0071792     3.32   0.003     .0090707    .0385317
                2000  |   .0343584     .00676     5.08   0.000     .0204881    .0482287
                2001  |   .0491256   .0073284     6.70   0.000     .0340891    .0641621
                2002  |   .0565077   .0073163     7.72   0.000     .0414959    .0715194
                2003  |   .0418706   .0080599     5.19   0.000     .0253331    .0584081
                2004  |    .036749   .0078998     4.65   0.000     .0205399     .052958
                2005  |   .0211327   .0076115     2.78   0.010     .0055152    .0367501
                2006  |   .0154375    .008555     1.80   0.082    -.0021159    .0329909
                2007  |   .0158159   .0098348     1.61   0.119    -.0043634    .0359953
                2008  |   .0066143   .0104685     0.63   0.533    -.0148652    .0280938
                2009  |   .0189254   .0094317     2.01   0.055    -.0004269    .0382777
                2010  |    .012874   .0109793     1.17   0.251    -.0096536    .0354016
                2011  |  -.0055682    .008946    -0.62   0.539    -.0239238    .0127874
                2012  |   -.013812   .0104597    -1.32   0.198    -.0352735    .0076495
                2013  |  -.0117958   .0090727    -1.30   0.205    -.0304113    .0068198
                2014  |  -.0124186   .0074473    -1.67   0.107    -.0276991    .0028619
                2015  |   .0115866   .0075239     1.54   0.135    -.0038512    .0270244
                2016  |   .0184963   .0094874     1.95   0.062    -.0009702    .0379629
                2017  |   .0327822   .0104634     3.13   0.004     .0113131    .0542514
                2018  |   .0399082   .0099791     4.00   0.000     .0194329    .0603835
                2019  |   .0606568   .0088951     6.82   0.000     .0424056    .0789079
                      |
                 nind |
                   2  |   .1430437   .0283946     5.04   0.000     .0847829    .2013045
                   3  |   .1328536   .0247353     5.37   0.000     .0821009    .1836062
                   4  |  -.0539023   .0253744    -2.12   0.043    -.1059664   -.0018383
                   5  |   .1624435   .0244639     6.64   0.000     .1122477    .2126393
                   6  |   .1361327   .0298966     4.55   0.000     .0747899    .1974755
                   7  |   .0329363   .0274665     1.20   0.241    -.0234202    .0892928
                   8  |   -.033722   .0257837    -1.31   0.202    -.0866258    .0191818
                   9  |  -.0238169   .0275676    -0.86   0.395     -.080381    .0327472
                  10  |  -.0657346   .0284682    -2.31   0.029    -.1241465   -.0073226
                  11  |   .1497595   .0277442     5.40   0.000     .0928331    .2066859
                      |
                 educ |   .0670501   .0025515    26.28   0.000     .0618148    .0722853
                exper |   .0453366   .0024933    18.18   0.000     .0402208    .0504525
               exper2 |   -.001019   .0001143    -8.92   0.000    -.0012535   -.0007845
               exper3 |   6.62e-06   2.73e-06     2.43   0.022     1.02e-06    .0000122
               exper4 |   1.39e-08   2.60e-08     0.53   0.598    -3.94e-08    6.72e-08
                 edex |  -.0003347   .0000729    -4.59   0.000    -.0004842   -.0001852
                      |
                ee_cl |
                   2  |  -.0636792     .00571   -11.15   0.000    -.0753951   -.0519633
                   3  |  -.0746249   .0070961   -10.52   0.000    -.0891849    -.060065
                   4  |  -.0359674   .0115502    -3.11   0.004    -.0596664   -.0122684
                   5  |  -.1367393   .0092597   -14.77   0.000    -.1557385     -.11774
                   6  |  -.0838597   .0071155   -11.79   0.000    -.0984594     -.06926
                   7  |  -.0666644   .0080538    -8.28   0.000    -.0831895   -.0501393
                   8  |   .0137511    .011178     1.23   0.229    -.0091842    .0366864
                   9  |  -.1426662   .0107948   -13.22   0.000    -.1648153   -.1205172
                  10  |   -.090118   .0098376    -9.16   0.000    -.1103031    -.069933
                  11  |   -.060367    .009646    -6.26   0.000     -.080159    -.040575
                  12  |   .0129734   .0121189     1.07   0.294    -.0118925    .0378393
                  13  |  -.0505347   .0119347    -4.23   0.000    -.0750227   -.0260467
                  14  |  -.0696473   .0115582    -6.03   0.000    -.0933629   -.0459318
                  15  |  -.0517557   .0103878    -4.98   0.000    -.0730697   -.0304417
                  16  |   .0060608   .0128473     0.47   0.641    -.0202997    .0324213
                      |
                 marr |   .1205205   .0032536    37.04   0.000     .1138447    .1271963
                partt |   -.224651   .0059285   -37.89   0.000    -.2368153   -.2124868
               public |   .0337464   .0071801     4.70   0.000     .0190142    .0484787
                 cmsa |   .1452748   .0127808    11.37   0.000     .1190508    .1714988
                      |
                nocc2 |
                   2  |  -.1427289   .0044819   -31.85   0.000     -.151925   -.1335327
                   3  |  -.0442097   .0079839    -5.54   0.000    -.0605913    -.027828
                   4  |  -.2812253   .0124872   -22.52   0.000    -.3068469   -.2556036
                   5  |  -.0724218   .0094009    -7.70   0.000    -.0917109   -.0531328
                   6  |  -.3737607   .0078145   -47.83   0.000    -.3897948   -.3577266
                   7  |  -.2310707   .0067325   -34.32   0.000    -.2448847   -.2172567
                   8  |   -.093601   .0147352    -6.35   0.000    -.1238351    -.063367
                   9  |  -.3859955    .005128   -75.27   0.000    -.3965173   -.3754737
                  10  |  -.3271171   .0066638   -49.09   0.000      -.34079   -.3134441
                  11  |  -.2160074   .0058974   -36.63   0.000    -.2281078    -.203907
                  12  |  -.3797054    .007692   -49.36   0.000     -.395488   -.3639228
                      |
              quarter |
                   2  |   .0011791   .0022104     0.53   0.598    -.0033562    .0057145
                   3  |   .0026672   .0027249     0.98   0.336    -.0029238    .0082581
                   4  |   .0130924   .0020454     6.40   0.000     .0088955    .0172892
                      |
                _cons |   .6038771   .0435943    13.85   0.000     .5144291    .6933251
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,795,577,340)

Linear regression                               Number of obs     =    653,801
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5101
                                                Root MSE          =     .41697

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1440378   .0066948   -21.51   0.000    -.1577744   -.1303012
             treat_st |  -.0360998   .0192993    -1.87   0.072    -.0756987    .0034991
treat_stblackrelwhite |  -.0114478   .0077184    -1.48   0.150    -.0272847     .004389
                      |
                state |
                  NH  |   .0845551   .0053491    15.81   0.000     .0735797    .0955305
                  VT  |   .0206664   .0023016     8.98   0.000     .0159439    .0253889
                  MA  |   .1198542   .0120908     9.91   0.000     .0950459    .1446625
                  RI  |   .0361709   .0130935     2.76   0.010     .0093053    .0630366
                  CT  |   .1327556   .0120059    11.06   0.000     .1081215    .1573897
                  NY  |   .1012254   .0119814     8.45   0.000     .0766415    .1258093
                  NJ  |   .1733704   .0131532    13.18   0.000     .1463821    .2003586
                  PA  |    .013082   .0095473     1.37   0.182    -.0065075    .0326715
                  OH  |  -.0139162   .0093396    -1.49   0.148    -.0330795    .0052471
                  IN  |   .0070131   .0069388     1.01   0.321    -.0072242    .0212504
                  IL  |   .0864323   .0107199     8.06   0.000      .064437    .1084277
                  MI  |   .0541912   .0103379     5.24   0.000     .0329796    .0754028
                  WI  |   .0201677    .006369     3.17   0.004     .0070997    .0332357
                  MN  |   .0657536   .0086942     7.56   0.000     .0479145    .0835926
                  MO  |  -.0189373   .0088836    -2.13   0.042    -.0371649   -.0007097
                  DE  |   .0485498   .0031866    15.24   0.000     .0420115    .0550882
                  MD  |   .1223272   .0125595     9.74   0.000     .0965572    .1480972
                  DC  |   .1789808   .0167362    10.69   0.000      .144641    .2133206
                  KY  |  -.0379745   .0066955    -5.67   0.000    -.0517125   -.0242364
                  OK  |  -.0584432   .0115729    -5.05   0.000    -.0821888   -.0346975
                  CO  |   .0340733   .0112463     3.03   0.005     .0109978    .0571488
                  NM  |  -.0311681   .0079873    -3.90   0.001    -.0475566   -.0147796
                  WA  |   .1025593   .0110978     9.24   0.000     .0797885    .1253301
                  OR  |   .0318964   .0103458     3.08   0.005     .0106686    .0531242
                  CA  |   .1668222   .0137815    12.10   0.000     .1385449    .1950995
                  AK  |   .2459016   .0093537    26.29   0.000     .2267094    .2650938
                  HI  |   .1069184   .0092066    11.61   0.000     .0880281    .1258087
                      |
                 year |
                1990  |   -.006175   .0035127    -1.76   0.090    -.0133825    .0010324
                1991  |  -.0131259   .0056559    -2.32   0.028    -.0247308    -.001521
                1992  |  -.0109908    .007283    -1.51   0.143    -.0259343    .0039528
                1993  |  -.0234516    .005153    -4.55   0.000    -.0340247   -.0128785
                1996  |  -.0277749   .0062588    -4.44   0.000    -.0406168   -.0149329
                1997  |   -.019476   .0062175    -3.13   0.004    -.0322333   -.0067187
                1998  |  -.0015231   .0047993    -0.32   0.753    -.0113705    .0083244
                1999  |   .0191938   .0069818     2.75   0.011     .0048683    .0335193
                2000  |   .0288626   .0071996     4.01   0.000     .0140904    .0436349
                2001  |   .0471195   .0076333     6.17   0.000     .0314573    .0627816
                2002  |   .0597801   .0071942     8.31   0.000     .0450189    .0745414
                2003  |   .0466522   .0078979     5.91   0.000     .0304469    .0628574
                2004  |   .0395391   .0077181     5.12   0.000     .0237029    .0553753
                2005  |   .0217336   .0075899     2.86   0.008     .0061604    .0373069
                2006  |   .0142695   .0086678     1.65   0.111    -.0035153    .0320543
                2007  |   .0146655   .0101527     1.44   0.160    -.0061661     .035497
                2008  |   .0104888   .0100032     1.05   0.304    -.0100361    .0310138
                2009  |   .0391568   .0121078     3.23   0.003     .0143135        .064
                2010  |   .0345445   .0098311     3.51   0.002     .0143727    .0547163
                2011  |   .0123684   .0094058     1.31   0.200    -.0069307    .0316675
                2012  |   .0006227   .0114168     0.05   0.957    -.0228026    .0240481
                2013  |  -.0000184   .0098456    -0.00   0.999    -.0202199     .020183
                2014  |  -.0069579   .0073917    -0.94   0.355    -.0221245    .0082086
                2015  |   .0123377   .0078274     1.58   0.127    -.0037228    .0283982
                2016  |   .0174788   .0098069     1.78   0.086    -.0026433    .0376008
                2017  |   .0295771   .0106511     2.78   0.010     .0077229    .0514313
                2018  |   .0347085   .0106206     3.27   0.003     .0129168    .0565002
                2019  |   .0546578   .0101977     5.36   0.000     .0337338    .0755817
                      |
                 nind |
                   2  |   .1430179   .0283617     5.04   0.000     .0848244    .2012113
                   3  |   .1328769   .0247012     5.38   0.000     .0821943    .1835596
                   4  |  -.0538357   .0253323    -2.13   0.043    -.1058132   -.0018581
                   5  |   .1625036   .0244199     6.65   0.000     .1123982    .2126091
                   6  |   .1361846   .0298535     4.56   0.000     .0749303     .197439
                   7  |   .0329404   .0274387     1.20   0.240    -.0233592    .0892399
                   8  |  -.0336402   .0257415    -1.31   0.202    -.0864573     .019177
                   9  |   -.023764   .0275198    -0.86   0.395    -.0802299    .0327019
                  10  |  -.0656779   .0284267    -2.31   0.029    -.1240048    -.007351
                  11  |   .1497974   .0276917     5.41   0.000     .0929787    .2066161
                      |
                 educ |   .0670685   .0025484    26.32   0.000     .0618396    .0722974
                exper |   .0453982   .0024811    18.30   0.000     .0403075     .050489
               exper2 |  -.0010218   .0001144    -8.94   0.000    -.0012564   -.0007872
               exper3 |   6.71e-06   2.74e-06     2.45   0.021     1.09e-06    .0000123
               exper4 |   1.28e-08   2.61e-08     0.49   0.627    -4.07e-08    6.64e-08
                 edex |  -.0003365   .0000725    -4.64   0.000    -.0004853   -.0001878
                      |
                ee_cl |
                   2  |  -.0635769   .0057177   -11.12   0.000    -.0753086   -.0518451
                   3  |  -.0745894   .0070891   -10.52   0.000     -.089135   -.0600438
                   4  |  -.0359478   .0115596    -3.11   0.004    -.0596661   -.0122295
                   5  |  -.1368184   .0092489   -14.79   0.000    -.1557955   -.1178413
                   6  |   -.083852   .0070976   -11.81   0.000     -.098415   -.0692889
                   7  |  -.0665946   .0080513    -8.27   0.000    -.0831146   -.0500747
                   8  |   .0138278   .0111844     1.24   0.227    -.0091206    .0367762
                   9  |  -.1426978   .0107869   -13.23   0.000    -.1648307   -.1205649
                  10  |  -.0902364   .0098273    -9.18   0.000    -.1104004   -.0700724
                  11  |  -.0603416   .0096502    -6.25   0.000    -.0801422   -.0405409
                  12  |   .0130645    .012124     1.08   0.291    -.0118119    .0379408
                  13  |  -.0507857   .0119174    -4.26   0.000    -.0752381   -.0263333
                  14  |  -.0697697   .0115317    -6.05   0.000    -.0934307   -.0461087
                  15  |   -.051774   .0103798    -4.99   0.000    -.0730716   -.0304764
                  16  |   .0061776   .0128602     0.48   0.635    -.0202094    .0325646
                      |
                 marr |   .1205331   .0032486    37.10   0.000     .1138676    .1271987
                partt |  -.2245173   .0059151   -37.96   0.000    -.2366541   -.2123805
               public |   .0337693   .0071904     4.70   0.000     .0190159    .0485227
                 cmsa |   .1452482   .0127853    11.36   0.000     .1190149    .1714814
                      |
                nocc2 |
                   2  |  -.1427233   .0044889   -31.79   0.000    -.1519339   -.1335128
                   3  |  -.0442059   .0079881    -5.53   0.000    -.0605961   -.0278157
                   4  |  -.2812327   .0124752   -22.54   0.000    -.3068296   -.2556357
                   5  |  -.0724781   .0093964    -7.71   0.000    -.0917579   -.0531984
                   6  |  -.3737368   .0078351   -47.70   0.000     -.389813   -.3576605
                   7  |  -.2310528   .0067519   -34.22   0.000    -.2449066    -.217199
                   8  |  -.0937006   .0147667    -6.35   0.000    -.1239993   -.0634018
                   9  |  -.3859759   .0051283   -75.26   0.000    -.3964984   -.3754535
                  10  |  -.3271426   .0066634   -49.10   0.000    -.3408148   -.3134703
                  11  |  -.2160293    .005897   -36.63   0.000     -.228129   -.2039296
                  12  |   -.379726   .0076973   -49.33   0.000    -.3955196   -.3639323
                      |
                unemp |  -.0047284   .0024481    -1.93   0.064    -.0097514    .0002946
                      |
              quarter |
                   2  |    .001181   .0022155     0.53   0.598    -.0033648    .0057269
                   3  |   .0027256   .0027354     1.00   0.328     -.002887    .0083381
                   4  |   .0131909   .0020234     6.52   0.000     .0090393    .0173424
                      |
                _cons |   .6248482   .0490726    12.73   0.000     .5241596    .7255369
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all_unemp

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,795,577,340)

Linear regression                               Number of obs     =    653,801
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5096
                                                Root MSE          =     .41718

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1448421    .006581   -22.01   0.000    -.1583451   -.1313391
             treat_st |  -.0215461   .0110881    -1.94   0.062    -.0442969    .0012047
treat_stblackrelwhite |  -.0070709    .006993    -1.01   0.321    -.0214193    .0072774
                      |
                state |
                  NH  |   .1396962   .0131096    10.66   0.000     .1127976    .1665949
                  VT  |  -.0317512   .0124954    -2.54   0.017    -.0573897   -.0061128
                  MA  |  -.0010983    .019174    -0.06   0.955    -.0404401    .0382434
                  RI  |  -.0312698   .0248932    -1.26   0.220    -.0823463    .0198067
                  CT  |   .1111729   .0217189     5.12   0.000     .0666095    .1557364
                  NY  |   .1803024   .0234716     7.68   0.000     .1321427    .2284621
                  NJ  |    .188892   .0241872     7.81   0.000     .1392639    .2385201
                  PA  |  -.0197578   .0198629    -0.99   0.329     -.060513    .0209975
                  OH  |   .1531674      .0243     6.30   0.000      .103308    .2030269
                  IN  |   .1444828   .0425606     3.39   0.002     .0571556      .23181
                  IL  |   .1848585   .0189987     9.73   0.000     .1458763    .2238406
                  MI  |     .48933   .0401047    12.20   0.000     .4070421     .571618
                  WI  |  -.0646561   .0349669    -1.85   0.075    -.1364023      .00709
                  MN  |  -.0914374    .019466    -4.70   0.000    -.1313782   -.0514965
                  MO  |   .0193519   .0150326     1.29   0.209    -.0114924    .0501961
                  DE  |   .2333303   .0179314    13.01   0.000      .196538    .2701226
                  MD  |  -.1725397   .0274239    -6.29   0.000    -.2288089   -.1162705
                  DC  |   -.226512   .0254644    -8.90   0.000    -.2787607   -.1742634
                  KY  |   .0844996   .0193431     4.37   0.000     .0448108    .1241884
                  OK  |  -.2458582   .0502729    -4.89   0.000    -.3490097   -.1427068
                  CO  |  -.1422518   .0168314    -8.45   0.000    -.1767871   -.1077166
                  NM  |  -.3013693    .017856   -16.88   0.000    -.3380068   -.2647318
                  WA  |  -.2167062   .0159681   -13.57   0.000    -.2494701   -.1839423
                  OR  |   .0581357   .0113462     5.12   0.000     .0348553     .081416
                  CA  |    .128977   .0250291     5.15   0.000     .0776216    .1803325
                  AK  |   .6918278   .0207849    33.29   0.000     .6491807     .734475
                  HI  |  -.0835151    .023859    -3.50   0.002    -.1324698   -.0345604
                      |
        state#c.lyear |
                  ME  |   .0014138   .0001582     8.94   0.000     .0010893    .0017383
                  NH  |    .000875   .0003079     2.84   0.008     .0002433    .0015067
                  VT  |   .0019014   .0000826    23.03   0.000      .001732    .0020709
                  MA  |    .002594   .0001058    24.51   0.000     .0023769    .0028112
                  RI  |   .0021004   .0001068    19.67   0.000     .0018812    .0023195
                  CT  |   .0016362   .0001393    11.74   0.000     .0013503    .0019221
                  NY  |   .0006639   .0000756     8.79   0.000     .0005089    .0008189
                  NJ  |   .0012863   .0001041    12.36   0.000     .0010728    .0014999
                  PA  |   .0017461   .0000796    21.94   0.000     .0015828    .0019094
                  OH  |  -.0001808   .0000724    -2.50   0.019    -.0003293   -.0000323
                  IN  |   .0000626   .0004568     0.14   0.892    -.0008747    .0009998
                  IL  |   .0004806   .0001038     4.63   0.000     .0002676    .0006935
                  MI  |  -.0028316   .0003606    -7.85   0.000    -.0035715   -.0020917
                  WI  |   .0022084   .0003275     6.74   0.000     .0015365    .0028804
                  MN  |   .0029239   .0000859    34.02   0.000     .0027475    .0031002
                  MO  |    .001057   .0001085     9.74   0.000     .0008344    .0012796
                  DE  |  -.0005069   .0001554    -3.26   0.003    -.0008257   -.0001881
                  MD  |   .0042415   .0001153    36.78   0.000     .0040049    .0044781
                  DC  |   .0053452   .0001403    38.09   0.000     .0050573    .0056332
                  KY  |   .0002413   .0002329     1.04   0.309    -.0002366    .0007192
                  OK  |   .0031673   .0005662     5.59   0.000     .0020055     .004329
                  CO  |   .0031102    .000114    27.29   0.000     .0028764     .003344
                  NM  |   .0040219   .0003489    11.53   0.000     .0033061    .0047378
                  WA  |   .0045034   .0001122    40.12   0.000     .0042731    .0047337
                  OR  |   .0011942    .000159     7.51   0.000     .0008679    .0015204
                  CA  |   .0018215   .0000808    22.54   0.000     .0016557    .0019873
                  AK  |  -.0029147   .0000601   -48.51   0.000    -.0030379   -.0027914
                  HI  |   .0032622   .0000774    42.16   0.000     .0031035     .003421
                      |
                 nind |
                   2  |   .1446558   .0281784     5.13   0.000     .0868385    .2024731
                   3  |    .133367   .0244136     5.46   0.000     .0832743    .1834596
                   4  |  -.0529118   .0251428    -2.10   0.045    -.1045006   -.0013231
                   5  |   .1635029   .0241465     6.77   0.000     .1139583    .2130474
                   6  |   .1372587    .029462     4.66   0.000     .0768075    .1977098
                   7  |   .0338571   .0271662     1.25   0.223    -.0218833    .0895975
                   8  |  -.0326176   .0254664    -1.28   0.211    -.0848703    .0196351
                   9  |  -.0225479   .0272637    -0.83   0.415    -.0784884    .0333925
                  10  |  -.0644447   .0282849    -2.28   0.031    -.1224806   -.0064088
                  11  |    .150281   .0275625     5.45   0.000     .0937273    .2068346
                      |
                 educ |   .0670466   .0025427    26.37   0.000     .0618293    .0722639
                exper |     .04532   .0024363    18.60   0.000     .0403211    .0503189
               exper2 |  -.0010018   .0001134    -8.83   0.000    -.0012345   -.0007691
               exper3 |   6.02e-06   2.73e-06     2.20   0.036     4.12e-07    .0000116
               exper4 |   1.91e-08   2.62e-08     0.73   0.470    -3.45e-08    7.28e-08
                 edex |  -.0003391   .0000724    -4.69   0.000    -.0004876   -.0001907
                      |
                ee_cl |
                   2  |  -.0651621   .0057523   -11.33   0.000    -.0769648   -.0533594
                   3  |   -.076163    .007054   -10.80   0.000    -.0906366   -.0616895
                   4  |  -.0376559   .0112933    -3.33   0.002    -.0608279   -.0144838
                   5  |  -.1399856   .0093122   -15.03   0.000    -.1590926   -.1208787
                   6  |  -.0867173   .0067577   -12.83   0.000    -.1005829   -.0728517
                   7  |  -.0683445   .0078428    -8.71   0.000    -.0844367   -.0522524
                   8  |   .0125156   .0108504     1.15   0.259    -.0097475    .0347787
                   9  |  -.1451807   .0106026   -13.69   0.000    -.1669353    -.123426
                  10  |   -.091678   .0094611    -9.69   0.000    -.1110905   -.0722655
                  11  |  -.0616754   .0094185    -6.55   0.000    -.0810005   -.0423503
                  12  |   .0112419   .0118023     0.95   0.349    -.0129744    .0354583
                  13  |   -.053247     .01189    -4.48   0.000    -.0776433   -.0288507
                  14  |   -.071161   .0113829    -6.25   0.000    -.0945169   -.0478052
                  15  |  -.0522075   .0102025    -5.12   0.000    -.0731412   -.0312738
                  16  |   .0044974   .0125979     0.36   0.724    -.0213513    .0303461
                      |
                 marr |    .120234   .0032255    37.28   0.000     .1136159    .1268521
                partt |  -.2244266    .005812   -38.61   0.000    -.2363519   -.2125013
               public |   .0337136   .0071356     4.72   0.000     .0190726    .0483545
                 cmsa |   .1438949   .0128871    11.17   0.000     .1174527     .170337
                      |
                nocc2 |
                   2  |  -.1436416   .0043348   -33.14   0.000    -.1525359   -.1347474
                   3  |  -.0448698   .0079265    -5.66   0.000    -.0611336   -.0286059
                   4  |  -.2816228   .0124044   -22.70   0.000    -.3070746    -.256171
                   5  |  -.0731024   .0095172    -7.68   0.000    -.0926301   -.0535747
                   6  |  -.3741846   .0077064   -48.56   0.000    -.3899968   -.3583724
                   7  |  -.2311568    .006692   -34.54   0.000    -.2448876   -.2174261
                   8  |  -.0925713   .0146014    -6.34   0.000    -.1225309   -.0626117
                   9  |  -.3866029   .0051215   -75.49   0.000    -.3971114   -.3760945
                  10  |  -.3284603   .0063976   -51.34   0.000     -.341587   -.3153336
                  11  |  -.2165219   .0057602   -37.59   0.000    -.2283409   -.2047029
                  12  |  -.3804951   .0075707   -50.26   0.000    -.3960288   -.3649613
                      |
                unemp |  -.0064396   .0010201    -6.31   0.000    -.0085326   -.0043466
                      |
              quarter |
                   2  |   .0009365   .0022157     0.42   0.676    -.0036098    .0054828
                   3  |   .0022961   .0027233     0.84   0.407    -.0032917    .0078838
                   4  |   .0127558   .0020187     6.32   0.000     .0086137    .0168979
                      |
                _cons |   .5019572   .0377374    13.30   0.000     .4245264    .5793879
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_mal_all_sltt  

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,669,642,725)

Linear regression                               Number of obs     =    661,491
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5049
                                                Root MSE          =     .39584

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0670862   .0065898   -10.18   0.000    -.0806074   -.0535651
             treat_st |  -.0370791   .0086016    -4.31   0.000    -.0547281   -.0194302
treat_stblackrelwhite |  -.0165349   .0075018    -2.20   0.036    -.0319272   -.0011426
                      |
                state |
                  NH  |   .0568264   .0047281    12.02   0.000     .0471251    .0665277
                  VT  |   .0357762   .0010467    34.18   0.000     .0336285    .0379239
                  MA  |   .1005515   .0115284     8.72   0.000     .0768971    .1242058
                  RI  |   .0242337   .0115465     2.10   0.045     .0005423     .047925
                  CT  |   .1107026    .011464     9.66   0.000     .0871805    .1342248
                  NY  |   .0639361   .0107223     5.96   0.000     .0419359    .0859364
                  NJ  |   .1276657   .0122471    10.42   0.000     .1025368    .1527946
                  PA  |  -.0302984   .0091145    -3.32   0.003    -.0489998   -.0115969
                  OH  |  -.0623812   .0087932    -7.09   0.000    -.0804234   -.0443389
                  IN  |  -.0640064   .0063568   -10.07   0.000    -.0770495   -.0509633
                  IL  |   .0027721   .0098733     0.28   0.781    -.0174862    .0230303
                  MI  |  -.0154736   .0088029    -1.76   0.090    -.0335356    .0025885
                  WI  |  -.0108457   .0062972    -1.72   0.096    -.0237664    .0020751
                  MN  |   .0482399    .008202     5.88   0.000     .0314107     .065069
                  MO  |  -.0821578   .0084343    -9.74   0.000    -.0994636    -.064852
                  DE  |   .0499144   .0029792    16.75   0.000     .0438015    .0560273
                  MD  |   .0947946   .0123241     7.69   0.000     .0695077    .1200816
                  DC  |   .1499749   .0153213     9.79   0.000     .1185382    .1814117
                  KY  |  -.0914126   .0054983   -16.63   0.000    -.1026942   -.0801309
                  OK  |   -.133576   .0080732   -16.55   0.000    -.1501409   -.1170112
                  CO  |  -.0050046    .010988    -0.46   0.652    -.0275501    .0175408
                  NM  |  -.0984741   .0068534   -14.37   0.000    -.1125361   -.0844121
                  WA  |   .0584541   .0101255     5.77   0.000     .0376783    .0792299
                  OR  |  -.0050049   .0092513    -0.54   0.593     -.023987    .0139772
                  CA  |   .1247036   .0121643    10.25   0.000     .0997446    .1496626
                  AK  |   .1805674   .0061781    29.23   0.000     .1678909    .1932439
                  HI  |   .0721504   .0082518     8.74   0.000     .0552191    .0890818
                      |
                 year |
                1990  |  -.0043325     .00399    -1.09   0.287    -.0125192    .0038542
                1991  |  -.0011514   .0030017    -0.38   0.704    -.0073103    .0050076
                1992  |   .0180275   .0038536     4.68   0.000     .0101206    .0259343
                1993  |   .0146049   .0049298     2.96   0.006     .0044898      .02472
                1996  |    .008785    .004982     1.76   0.089    -.0014372    .0190073
                1997  |   .0151839    .004927     3.08   0.005     .0050746    .0252932
                1998  |   .0477403   .0042722    11.17   0.000     .0389745     .056506
                1999  |   .0610595   .0055295    11.04   0.000     .0497139    .0724051
                2000  |   .0727595   .0057439    12.67   0.000     .0609741     .084545
                2001  |   .0886582   .0057388    15.45   0.000     .0768831    .1004333
                2002  |   .0989621   .0061921    15.98   0.000      .086257    .1116672
                2003  |   .1060285   .0059455    17.83   0.000     .0938294    .1182276
                2004  |   .0981947   .0067075    14.64   0.000     .0844321    .1119573
                2005  |   .0915994   .0062678    14.61   0.000      .078739    .1044598
                2006  |   .0812296    .006056    13.41   0.000     .0688038    .0936555
                2007  |    .079094   .0076215    10.38   0.000     .0634561    .0947319
                2008  |    .072735   .0084872     8.57   0.000     .0553207    .0901492
                2009  |   .0931326   .0069142    13.47   0.000     .0789458    .1073195
                2010  |   .0922109   .0061833    14.91   0.000     .0795237    .1048981
                2011  |   .0715271   .0061071    11.71   0.000     .0589964    .0840577
                2012  |   .0560362   .0064901     8.63   0.000     .0427197    .0693528
                2013  |   .0596451   .0059636    10.00   0.000     .0474088    .0718814
                2014  |   .0564157   .0064915     8.69   0.000     .0430963    .0697351
                2015  |   .0686614   .0067249    10.21   0.000     .0548631    .0824597
                2016  |   .0806419   .0086126     9.36   0.000     .0629703    .0983135
                2017  |   .0936087   .0090209    10.38   0.000     .0750994     .112118
                2018  |   .0990499   .0091392    10.84   0.000     .0802979    .1178019
                2019  |   .1080821   .0070668    15.29   0.000     .0935822     .122582
                      |
                 nind |
                   2  |   .1151641   .0236754     4.86   0.000     .0665862     .163742
                   3  |   .1844053   .0222777     8.28   0.000     .1386952    .2301154
                   4  |   -.037896   .0235756    -1.61   0.120    -.0862691    .0104772
                   5  |   .2000953   .0220225     9.09   0.000     .1549089    .2452817
                   6  |   .1409792   .0243036     5.80   0.000     .0911124     .190846
                   7  |    .085551   .0244282     3.50   0.002     .0354284    .1356736
                   8  |   .0327495   .0224237     1.46   0.156    -.0132601    .0787592
                   9  |  -.0057435   .0238351    -0.24   0.811    -.0546491    .0431621
                  10  |  -.0365208   .0224063    -1.63   0.115    -.0824946    .0094531
                  11  |   .1195726   .0240633     4.97   0.000     .0701986    .1689465
                      |
                 educ |   .0899257   .0029405    30.58   0.000     .0838923     .095959
                exper |   .0486693   .0031236    15.58   0.000     .0422603    .0550783
               exper2 |  -.0016937   .0001267   -13.37   0.000    -.0019537   -.0014337
               exper3 |   .0000267   3.67e-06     7.28   0.000     .0000192    .0000342
               exper4 |  -1.40e-07   3.82e-08    -3.66   0.001    -2.18e-07   -6.14e-08
                 edex |  -.0004062   .0001108    -3.67   0.001    -.0006335   -.0001789
                      |
                ee_cl |
                   2  |  -.1246023   .0070523   -17.67   0.000    -.1390725   -.1101321
                   3  |  -.1656004   .0105413   -15.71   0.000    -.1872293   -.1439715
                   4  |  -.1743954   .0170318   -10.24   0.000    -.2093417    -.139449
                   5  |  -.1635832   .0127013   -12.88   0.000    -.1896441   -.1375223
                   6  |  -.1660142    .013053   -12.72   0.000    -.1927966   -.1392317
                   7  |  -.1773425   .0144899   -12.24   0.000    -.2070733   -.1476118
                   8  |  -.1144661   .0184856    -6.19   0.000    -.1523954   -.0765368
                   9  |  -.1524409   .0136791   -11.14   0.000    -.1805081   -.1243737
                  10  |  -.1720303   .0162785   -10.57   0.000    -.2054309   -.1386297
                  11  |  -.1722138   .0159978   -10.76   0.000    -.2050386   -.1393891
                  12  |  -.1305029   .0148217    -8.80   0.000    -.1609145   -.1000914
                  13  |  -.0934079   .0205078    -4.55   0.000    -.1354865   -.0513293
                  14  |  -.1532995   .0171696    -8.93   0.000    -.1885287   -.1180703
                  15  |  -.1404537   .0169962    -8.26   0.000    -.1753271   -.1055803
                  16  |  -.1219684   .0146725    -8.31   0.000    -.1520738    -.091863
                      |
                 marr |   .0351988   .0033223    10.59   0.000      .028382    .0420156
                partt |  -.1458618   .0037589   -38.80   0.000    -.1535745   -.1381492
               public |   .0706949   .0081046     8.72   0.000     .0540656    .0873242
                 cmsa |   .1533623    .011856    12.94   0.000     .1290358    .1776887
                      |
                nocc2 |
                   2  |  -.1271789    .004489   -28.33   0.000    -.1363896   -.1179682
                   3  |  -.0470355   .0088261    -5.33   0.000    -.0651452   -.0289259
                   4  |  -.2707817    .007992   -33.88   0.000      -.28718   -.2543834
                   5  |   .0601078    .007538     7.97   0.000     .0446412    .0755744
                   6  |  -.3253682   .0056479   -57.61   0.000    -.3369566   -.3137797
                   7  |  -.3478198   .0054428   -63.90   0.000    -.3589876    -.336652
                   8  |   -.160193   .0094027   -17.04   0.000    -.1794857   -.1409003
                   9  |  -.4052344   .0070306   -57.64   0.000    -.4196599   -.3908089
                  10  |  -.4072213   .0138542   -29.39   0.000    -.4356479   -.3787947
                  11  |   -.147195   .0105989   -13.89   0.000    -.1689422   -.1254478
                  12  |  -.3818648   .0114797   -33.26   0.000    -.4054192   -.3583104
                      |
              quarter |
                   2  |   .0088085   .0019483     4.52   0.000     .0048109    .0128062
                   3  |   .0159497   .0020795     7.67   0.000     .0116828    .0202165
                   4  |   .0208494   .0014106    14.78   0.000     .0179551    .0237437
                      |
                _cons |   .2844711   .0412877     6.89   0.000     .1997557    .3691865
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,669,642,725)

Linear regression                               Number of obs     =    661,491
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5049
                                                Root MSE          =     .39584

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0670884   .0065875   -10.18   0.000    -.0806049   -.0535719
             treat_st |  -.0372495   .0089256    -4.17   0.000    -.0555633   -.0189358
treat_stblackrelwhite |  -.0165817   .0075304    -2.20   0.036    -.0320328   -.0011306
                      |
                state |
                  NH  |   .0560521   .0045384    12.35   0.000     .0467401    .0653641
                  VT  |   .0350636   .0020305    17.27   0.000     .0308974    .0392298
                  MA  |   .1005857   .0115525     8.71   0.000     .0768819    .1242894
                  RI  |   .0249482   .0121235     2.06   0.049     .0000728    .0498236
                  CT  |   .1107823   .0115164     9.62   0.000     .0871526    .1344119
                  NY  |   .0644411   .0110797     5.82   0.000     .0417075    .0871746
                  NJ  |   .1280385   .0125063    10.24   0.000     .1023778    .1536992
                  PA  |  -.0300328   .0093094    -3.23   0.003    -.0491341   -.0109316
                  OH  |  -.0619527   .0091089    -6.80   0.000    -.0806427   -.0432628
                  IN  |  -.0639287   .0064429    -9.92   0.000    -.0771485    -.050709
                  IL  |   .0034469   .0103936     0.33   0.743    -.0178791    .0247729
                  MI  |  -.0144376    .009959    -1.45   0.159    -.0348717    .0059965
                  WI  |  -.0110968   .0060706    -1.83   0.079    -.0235527    .0013592
                  MN  |   .0476891   .0079309     6.01   0.000     .0314163    .0639619
                  MO  |  -.0820195   .0085279    -9.62   0.000    -.0995174   -.0645217
                  DE  |   .0495008   .0032669    15.15   0.000     .0427978    .0562039
                  MD  |   .0945764   .0122211     7.74   0.000     .0695009    .1196519
                  DC  |    .151152   .0160356     9.43   0.000     .1182496    .1840544
                  KY  |  -.0908413   .0061193   -14.85   0.000     -.103397   -.0782856
                  OK  |  -.1338264   .0076994   -17.38   0.000    -.1496243   -.1180285
                  CO  |  -.0052594   .0108284    -0.49   0.631    -.0274775    .0169587
                  NM  |  -.0979938   .0072329   -13.55   0.000    -.1128345   -.0831532
                  WA  |   .0590315    .010577     5.58   0.000     .0373293    .0807336
                  OR  |  -.0042099    .009932    -0.42   0.675    -.0245886    .0161688
                  CA  |   .1257672   .0130269     9.65   0.000     .0990382    .1524961
                  AK  |   .1819446   .0074795    24.33   0.000      .166598    .1972913
                  HI  |   .0714271     .00792     9.02   0.000     .0551765    .0876777
                      |
                 year |
                1990  |  -.0040201   .0039968    -1.01   0.323    -.0122208    .0041805
                1991  |    .000054    .004546     0.01   0.991    -.0092736    .0093817
                1992  |   .0196649   .0060313     3.26   0.003     .0072896    .0320402
                1993  |   .0158803   .0063427     2.50   0.019     .0028661    .0288945
                1996  |   .0089634   .0049749     1.80   0.083    -.0012443    .0191712
                1997  |   .0150616   .0049368     3.05   0.005     .0049322     .025191
                1998  |     .04733   .0043708    10.83   0.000     .0383619    .0562982
                1999  |   .0604507   .0054142    11.17   0.000     .0493417    .0715597
                2000  |   .0720258   .0060501    11.90   0.000      .059612    .0844397
                2001  |   .0883989   .0057322    15.42   0.000     .0766374    .1001604
                2002  |   .0994134   .0061839    16.08   0.000     .0867252    .1121017
                2003  |   .1066913   .0061616    17.32   0.000     .0940487    .1193338
                2004  |   .0985912   .0069542    14.18   0.000     .0843223    .1128601
                2005  |   .0916951   .0062895    14.58   0.000     .0787901       .1046
                2006  |    .081086   .0060497    13.40   0.000     .0686729     .093499
                2007  |   .0789571   .0076433    10.33   0.000     .0632742    .0946399
                2008  |   .0732822    .008571     8.55   0.000      .055696    .0908685
                2009  |   .0959154   .0101608     9.44   0.000     .0750671    .1167637
                2010  |   .0951855   .0086097    11.06   0.000     .0775199     .112851
                2011  |   .0739825   .0071288    10.38   0.000     .0593555    .0886096
                2012  |   .0580208   .0070545     8.22   0.000     .0435462    .0724953
                2013  |   .0612697   .0075348     8.13   0.000     .0458096    .0767298
                2014  |   .0571739   .0068383     8.36   0.000     .0431429    .0712049
                2015  |   .0687808   .0067578    10.18   0.000     .0549149    .0826467
                2016  |   .0805238   .0085656     9.40   0.000     .0629485     .098099
                2017  |    .093194     .00892    10.45   0.000     .0748916    .1114964
                2018  |   .0983567   .0092179    10.67   0.000     .0794432    .1172702
                2019  |   .1072831   .0069391    15.46   0.000     .0930452    .1215211
                      |
                 nind |
                   2  |   .1151325   .0236945     4.86   0.000     .0665154    .1637497
                   3  |   .1843826   .0222785     8.28   0.000     .1386709    .2300942
                   4  |  -.0379168   .0235894    -1.61   0.120    -.0863182    .0104845
                   5  |   .2000757   .0220326     9.08   0.000     .1548686    .2452829
                   6  |   .1409564   .0243181     5.80   0.000     .0910598     .190853
                   7  |   .0855228   .0244419     3.50   0.002     .0353721    .1356734
                   8  |   .0327298   .0224316     1.46   0.156    -.0132961    .0787556
                   9  |    -.00577   .0238414    -0.24   0.811    -.0546886    .0431485
                  10  |  -.0365444   .0224163    -1.63   0.115     -.082539    .0094501
                  11  |   .1195363   .0240633     4.97   0.000     .0701625    .1689101
                      |
                 educ |   .0899234   .0029432    30.55   0.000     .0838845    .0959623
                exper |   .0486728    .003121    15.60   0.000     .0422691    .0550766
               exper2 |   -.001694   .0001266   -13.38   0.000    -.0019539   -.0014342
               exper3 |   .0000267   3.67e-06     7.28   0.000     .0000192    .0000342
               exper4 |  -1.40e-07   3.82e-08    -3.66   0.001    -2.18e-07   -6.15e-08
                 edex |  -.0004062   .0001108    -3.67   0.001    -.0006335   -.0001789
                      |
                ee_cl |
                   2  |  -.1245869   .0070649   -17.63   0.000    -.1390829    -.110091
                   3  |  -.1655793   .0105645   -15.67   0.000    -.1872558   -.1439029
                   4  |  -.1743699    .017056   -10.22   0.000    -.2093659   -.1393739
                   5  |  -.1635701   .0127068   -12.87   0.000    -.1896424   -.1374978
                   6  |  -.1659985   .0130707   -12.70   0.000    -.1928174   -.1391795
                   7  |   -.177313   .0145223   -12.21   0.000    -.2071103   -.1475157
                   8  |   -.114435   .0185204    -6.18   0.000    -.1524356   -.0764343
                   9  |  -.1524263   .0136858   -11.14   0.000    -.1805073   -.1243453
                  10  |  -.1720138   .0162908   -10.56   0.000    -.2054397   -.1385879
                  11  |  -.1721828   .0160286   -10.74   0.000    -.2050708   -.1392947
                  12  |  -.1304687   .0148578    -8.78   0.000    -.1609544   -.0999829
                  13  |  -.0933901   .0205147    -4.55   0.000    -.1354827   -.0512975
                  14  |  -.1532721   .0171911    -8.92   0.000    -.1885454   -.1179988
                  15  |  -.1404159   .0170273    -8.25   0.000     -.175353   -.1054788
                  16  |  -.1219329   .0147071    -8.29   0.000    -.1521094   -.0917564
                      |
                 marr |   .0351986   .0033217    10.60   0.000      .028383    .0420142
                partt |  -.1458542   .0037588   -38.80   0.000    -.1535665   -.1381419
               public |   .0707018   .0081059     8.72   0.000     .0540698    .0873338
                 cmsa |    .153362   .0118562    12.94   0.000     .1290351     .177689
                      |
                nocc2 |
                   2  |  -.1271838   .0044891   -28.33   0.000    -.1363948   -.1179729
                   3  |  -.0470389   .0088226    -5.33   0.000    -.0651413   -.0289364
                   4  |  -.2707838   .0079908   -33.89   0.000    -.2871796    -.254388
                   5  |   .0601021   .0075359     7.98   0.000     .0446397    .0755646
                   6  |  -.3253679   .0056478   -57.61   0.000    -.3369562   -.3137796
                   7  |  -.3478227    .005442   -63.91   0.000    -.3589887   -.3366567
                   8  |  -.1601805   .0093979   -17.04   0.000    -.1794635   -.1408976
                   9  |  -.4052362   .0070293   -57.65   0.000    -.4196591   -.3908133
                  10  |  -.4072355   .0138449   -29.41   0.000    -.4356428   -.3788282
                  11  |  -.1472048   .0105921   -13.90   0.000    -.1689381   -.1254715
                  12  |  -.3818761   .0114691   -33.30   0.000    -.4054088   -.3583433
                      |
                unemp |  -.0006465   .0014214    -0.45   0.653    -.0035631      .00227
                      |
              quarter |
                   2  |   .0088118   .0019514     4.52   0.000     .0048079    .0128156
                   3  |   .0159561   .0020817     7.66   0.000     .0116848    .0202274
                   4  |   .0208617   .0014223    14.67   0.000     .0179434      .02378
                      |
                _cons |   .2874035   .0431355     6.66   0.000     .1988969    .3759102
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,669,642,725)

Linear regression                               Number of obs     =    661,491
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5036
                                                Root MSE          =     .39636

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0678958   .0065113   -10.43   0.000    -.0812559   -.0545358
             treat_st |  -.0590538   .0120933    -4.88   0.000    -.0838671   -.0342405
treat_stblackrelwhite |  -.0141747   .0068002    -2.08   0.047    -.0281277   -.0002218
                      |
                state |
                  NH  |   .1097316   .0126654     8.66   0.000     .0837443    .1357189
                  VT  |  -.1263966   .0117325   -10.77   0.000    -.1504697   -.1023235
                  MA  |  -.1093479   .0200197    -5.46   0.000     -.150425   -.0682709
                  RI  |  -.2130082   .0229226    -9.29   0.000    -.2600416   -.1659749
                  CT  |   .0615818   .0230575     2.67   0.013     .0142716     .108892
                  NY  |  -.0138387   .0232325    -0.60   0.556    -.0615078    .0338303
                  NJ  |   .0342094   .0249798     1.37   0.182    -.0170449    .0854637
                  PA  |  -.0261349   .0213701    -1.22   0.232    -.0699828    .0177129
                  OH  |  -.0644454   .0258226    -2.50   0.019    -.1174291   -.0114617
                  IN  |  -.2172479   .0441338    -4.92   0.000    -.3078029   -.1266929
                  IL  |  -.0930021   .0196749    -4.73   0.000    -.1333717   -.0526324
                  MI  |  -.0149431   .0407181    -0.37   0.716    -.0984898    .0686036
                  WI  |  -.3291756   .0349071    -9.43   0.000    -.4007992   -.2575521
                  MN  |   -.118351   .0190863    -6.20   0.000    -.1575128   -.0791892
                  MO  |  -.0049065   .0159452    -0.31   0.761    -.0376233    .0278104
                  DE  |   .1648963   .0175917     9.37   0.000      .128801    .2009916
                  MD  |  -.3122283   .0267793   -11.66   0.000    -.3671749   -.2572817
                  DC  |  -.2711054   .0262705   -10.32   0.000    -.3250081   -.2172026
                  KY  |  -.2084345   .0226677    -9.20   0.000    -.2549448   -.1619242
                  OK  |  -.3828756   .0528036    -7.25   0.000    -.4912195   -.2745316
                  CO  |  -.1968322   .0182602   -10.78   0.000     -.234299   -.1593654
                  NM  |  -.4782121   .0078611   -60.83   0.000    -.4943418   -.4620824
                  WA  |  -.2872321   .0140877   -20.39   0.000    -.3161377   -.2583264
                  OR  |  -.1834336    .012461   -14.72   0.000    -.2090014   -.1578657
                  CA  |   -.061955   .0255925    -2.42   0.022    -.1144665   -.0094435
                  AK  |   .3958376   .0225157    17.58   0.000     .3496392    .4420359
                  HI  |  -.1220075   .0239366    -5.10   0.000    -.1711212   -.0728937
                      |
        state#c.lyear |
                  ME  |   .0020437   .0001859    10.99   0.000     .0016621    .0024252
                  NH  |   .0015514   .0003295     4.71   0.000     .0008753    .0022275
                  VT  |    .003592   .0001191    30.15   0.000     .0033476    .0038365
                  MA  |   .0040682   .0001288    31.58   0.000     .0038039    .0043325
                  RI  |    .004372   .0001441    30.34   0.000     .0040763    .0046677
                  CT  |    .002529   .0001395    18.13   0.000     .0022427    .0028152
                  NY  |   .0028163   .0001042    27.02   0.000     .0026024    .0030302
                  NJ  |   .0029713   .0001162    25.57   0.000     .0027329    .0032097
                  PA  |   .0020196   .0001001    20.18   0.000     .0018142     .002225
                  OH  |   .0020912   .0000777    26.91   0.000     .0019318    .0022507
                  IN  |   .0035869   .0004916     7.30   0.000     .0025782    .0045957
                  IL  |   .0029949    .000123    24.35   0.000     .0027425    .0032472
                  MI  |   .0021143   .0003917     5.40   0.000     .0013105    .0029181
                  WI  |    .005144   .0003655    14.07   0.000      .004394    .0058939
                  MN  |   .0036459   .0001261    28.92   0.000     .0033873    .0039046
                  MO  |   .0013143   .0001222    10.76   0.000     .0010636     .001565
                  DE  |   .0007773   .0002222     3.50   0.002     .0003214    .0012331
                  MD  |   .0059495   .0001089    54.66   0.000     .0057261    .0061728
                  DC  |   .0061312   .0001704    35.98   0.000     .0057816    .0064809
                  KY  |   .0032211   .0002779    11.59   0.000     .0026509    .0037914
                  OK  |   .0045897   .0006219     7.38   0.000     .0033138    .0058657
                  CO  |    .003891   .0001415    27.49   0.000     .0036006    .0041814
                  NM  |   .0057339   .0002803    20.46   0.000     .0051587     .006309
                  WA  |   .0053961   .0001677    32.17   0.000     .0050519    .0057402
                  OR  |   .0038032   .0001602    23.74   0.000     .0034745     .004132
                  CA  |   .0038943    .000102    38.20   0.000     .0036851    .0041035
                  AK  |  -.0000341   .0000697    -0.49   0.629    -.0001771    .0001089
                  HI  |   .0039124    .000113    34.63   0.000     .0036806    .0041442
                      |
                 nind |
                   2  |   .1167196   .0234695     4.97   0.000     .0685642     .164875
                   3  |   .1840621    .022138     8.31   0.000     .1386386    .2294856
                   4  |   -.037403   .0234966    -1.59   0.123     -.085614     .010808
                   5  |   .2012533   .0218739     9.20   0.000     .1563717     .246135
                   6  |   .1417902   .0241109     5.88   0.000     .0923188    .1912616
                   7  |   .0863033   .0242696     3.56   0.001     .0365061    .1361004
                   8  |   .0337151   .0223452     1.51   0.143    -.0121334    .0795636
                   9  |  -.0043693   .0237422    -0.18   0.855    -.0530842    .0443457
                  10  |  -.0369493   .0222386    -1.66   0.108    -.0825791    .0086806
                  11  |   .1205605   .0239808     5.03   0.000     .0713559     .169765
                      |
                 educ |   .0882729   .0030158    29.27   0.000     .0820851    .0944607
                exper |   .0480665   .0030659    15.68   0.000     .0417758    .0543573
               exper2 |  -.0016534   .0001243   -13.31   0.000    -.0019083   -.0013984
               exper3 |   .0000255   3.67e-06     6.94   0.000     .0000179     .000033
               exper4 |  -1.30e-07   3.87e-08    -3.35   0.002    -2.09e-07   -5.02e-08
                 edex |  -.0003872   .0001107    -3.50   0.002    -.0006144     -.00016
                      |
                ee_cl |
                   2  |  -.1256685    .007208   -17.43   0.000    -.1404582   -.1108789
                   3  |  -.1635777   .0107807   -15.17   0.000    -.1856979   -.1414574
                   4  |  -.1686243   .0173783    -9.70   0.000    -.2042816    -.132967
                   5  |  -.1682868   .0126707   -13.28   0.000    -.1942849   -.1422887
                   6  |  -.1683481   .0130059   -12.94   0.000    -.1950339   -.1416623
                   7  |  -.1752463   .0147667   -11.87   0.000    -.2055451   -.1449475
                   8  |  -.1095704   .0189706    -5.78   0.000    -.1484949   -.0706459
                   9  |   -.156652   .0136969   -11.44   0.000    -.1847557   -.1285483
                  10  |  -.1721524   .0163333   -10.54   0.000    -.2056655   -.1386392
                  11  |  -.1688494   .0162896   -10.37   0.000    -.2022729    -.135426
                  12  |   -.125539   .0153709    -8.17   0.000    -.1570774   -.0940006
                  13  |  -.0974405     .02046    -4.76   0.000    -.1394209   -.0554601
                  14  |  -.1522953   .0172584    -8.82   0.000    -.1877066    -.116884
                  15  |  -.1381259   .0173005    -7.98   0.000    -.1736236   -.1026282
                  16  |  -.1190395   .0150962    -7.89   0.000    -.1500143   -.0880647
                      |
                 marr |    .034843   .0032644    10.67   0.000      .028145     .041541
                partt |  -.1457805   .0037395   -38.98   0.000    -.1534534   -.1381077
               public |   .0704093   .0080723     8.72   0.000     .0538462    .0869723
                 cmsa |   .1524616   .0118939    12.82   0.000     .1280574    .1768659
                      |
                nocc2 |
                   2  |  -.1265236   .0045978   -27.52   0.000    -.1359574   -.1170897
                   3  |  -.0461811   .0088838    -5.20   0.000    -.0644092    -.027953
                   4  |  -.2698707   .0079806   -33.82   0.000    -.2862455   -.2534959
                   5  |   .0598873   .0075878     7.89   0.000     .0443184    .0754563
                   6  |  -.3257188   .0057576   -56.57   0.000    -.3375325   -.3139051
                   7  |  -.3479972   .0054961   -63.32   0.000    -.3592743   -.3367201
                   8  |  -.1593178   .0096055   -16.59   0.000    -.1790267   -.1396089
                   9  |  -.4052782   .0070514   -57.48   0.000    -.4197464     -.39081
                  10  |  -.4082091   .0139887   -29.18   0.000    -.4369115   -.3795067
                  11  |  -.1463252   .0104596   -13.99   0.000    -.1677865   -.1248638
                  12  |  -.3822333   .0115777   -33.01   0.000    -.4059889   -.3584777
                      |
                unemp |  -.0021482   .0006652    -3.23   0.003    -.0035131   -.0007834
                      |
              quarter |
                   2  |   .0085075   .0019294     4.41   0.000     .0045487    .0124662
                   3  |    .015664   .0020108     7.79   0.000     .0115381    .0197898
                   4  |   .0205258   .0014245    14.41   0.000      .017603    .0234485
                      |
                _cons |   .1633895    .034442     4.74   0.000     .0927203    .2340587
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_fem_all_sltt

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 4,517,187,003)

Linear regression                               Number of obs     =    510,058
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5476
                                                Root MSE          =     .42201

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1567121   .0050512   -31.02   0.000    -.1670763   -.1463479
             treat_st |  -.0254417   .0143068    -1.78   0.087    -.0547968    .0039133
treat_stblackrelwhite |    .002803   .0068928     0.41   0.687    -.0113399    .0169459
                      |
                state |
                  NH  |   .0951458   .0051666    18.42   0.000     .0845447    .1057468
                  VT  |    .038617   .0008087    47.75   0.000     .0369578    .0402763
                  MA  |   .1157775   .0120709     9.59   0.000     .0910101    .1405449
                  RI  |   .0249999   .0119658     2.09   0.046     .0004481    .0495516
                  CT  |   .1224489   .0119738    10.23   0.000     .0978807     .147017
                  NY  |   .0691726   .0114404     6.05   0.000     .0456989    .0926464
                  NJ  |   .1506959   .0127842    11.79   0.000     .1244649    .1769268
                  PA  |     .00144   .0092044     0.16   0.877    -.0174458    .0203258
                  OH  |  -.0318787   .0090208    -3.53   0.001    -.0503879   -.0133695
                  IN  |  -.0047254   .0066481    -0.71   0.483    -.0183662    .0089155
                  IL  |   .0579702   .0103582     5.60   0.000      .036717    .0792234
                  MI  |   .0161719   .0089299     1.81   0.081    -.0021507    .0344945
                  WI  |   .0138605    .006555     2.11   0.044     .0004108    .0273102
                  MN  |   .0568656   .0087243     6.52   0.000     .0389649    .0747663
                  MO  |  -.0361042   .0084097    -4.29   0.000    -.0533595   -.0188489
                  DE  |   .0589032    .001777    33.15   0.000      .055257    .0625493
                  MD  |   .1297805   .0122158    10.62   0.000     .1047158    .1548452
                  DC  |   .1843315    .015693    11.75   0.000     .1521321     .216531
                  KY  |   -.041602   .0053737    -7.74   0.000     -.052628    -.030576
                  OK  |  -.0484234   .0099893    -4.85   0.000    -.0689198   -.0279271
                  CO  |   .0436467   .0110082     3.96   0.000     .0210599    .0662336
                  NM  |  -.0220897   .0068123    -3.24   0.003    -.0360673   -.0081122
                  WA  |   .0863955   .0104651     8.26   0.000     .0649229    .1078681
                  OR  |   .0174684   .0093048     1.88   0.071    -.0016234    .0365603
                  CA  |   .1447526   .0124571    11.62   0.000     .1191927    .1703124
                  AK  |   .2299698   .0060992    37.71   0.000     .2174553    .2424843
                  HI  |   .1138715   .0088953    12.80   0.000     .0956199    .1321232
                      |
                 year |
                1990  |  -.0037464   .0036162    -1.04   0.309    -.0111661    .0036734
                1991  |  -.0166865   .0052719    -3.17   0.004    -.0275036   -.0058694
                1992  |  -.0175676   .0052118    -3.37   0.002    -.0282613   -.0068738
                1993  |  -.0293615   .0043918    -6.69   0.000    -.0383726   -.0203503
                1996  |  -.0270551   .0090505    -2.99   0.006    -.0456251    -.008485
                1997  |  -.0164299   .0084179    -1.95   0.061    -.0337019    .0008422
                1998  |   .0094444   .0076159     1.24   0.226    -.0061821    .0250709
                1999  |   .0354518   .0091833     3.86   0.001     .0166091    .0542944
                2000  |   .0499551   .0079504     6.28   0.000     .0336423     .066268
                2001  |   .0680508    .009151     7.44   0.000     .0492745    .0868271
                2002  |   .0751658   .0071492    10.51   0.000     .0604967    .0898348
                2003  |    .055407   .0100564     5.51   0.000     .0347731     .076041
                2004  |   .0532183   .0086869     6.13   0.000     .0353943    .0710423
                2005  |   .0371827   .0095092     3.91   0.001     .0176716    .0566939
                2006  |   .0312161   .0087484     3.57   0.001     .0132659    .0491663
                2007  |   .0306597   .0098932     3.10   0.005     .0103606    .0509588
                2008  |   .0221251   .0096816     2.29   0.030     .0022601    .0419902
                2009  |   .0366073   .0109078     3.36   0.002     .0142265    .0589882
                2010  |   .0258374   .0106051     2.44   0.022     .0040775    .0475973
                2011  |   .0080752   .0093081     0.87   0.393    -.0110235    .0271738
                2012  |   .0019986   .0112819     0.18   0.861      -.02115    .0251472
                2013  |   .0039043   .0094645     0.41   0.683    -.0155153     .023324
                2014  |   .0024555   .0086935     0.28   0.780     -.015382     .020293
                2015  |   .0305824   .0077815     3.93   0.001     .0146162    .0465486
                2016  |   .0393906   .0099455     3.96   0.000      .018984    .0597971
                2017  |    .049506   .0110836     4.47   0.000     .0267643    .0722477
                2018  |    .058146   .0112625     5.16   0.000     .0350372    .0812548
                2019  |   .0817241   .0097037     8.42   0.000     .0618137    .1016344
                      |
                 nind |
                   2  |   .0839562   .0286516     2.93   0.007     .0251678    .1427445
                   3  |   .1256168   .0259824     4.83   0.000     .0723053    .1789282
                   4  |   -.043079   .0272117    -1.58   0.125    -.0989128    .0127548
                   5  |   .1142533    .026199     4.36   0.000     .0604973    .1680093
                   6  |   .1353291   .0317579     4.26   0.000     .0701673     .200491
                   7  |   .0354653   .0289031     1.23   0.230     -.023839    .0947697
                   8  |  -.0236232   .0287519    -0.82   0.418    -.0826173    .0353709
                   9  |  -.0540162   .0271784    -1.99   0.057    -.1097817    .0017492
                  10  |  -.0636433   .0283816    -2.24   0.033    -.1218776   -.0054091
                  11  |   .0949157   .0283431     3.35   0.002     .0367605    .1530709
                      |
                 educ |    .062381   .0026601    23.45   0.000      .056923    .0678389
                exper |   .0381237   .0023422    16.28   0.000      .033318    .0429295
               exper2 |   -.000707   .0000943    -7.50   0.000    -.0009005   -.0005135
               exper3 |  -3.37e-06   2.70e-06    -1.25   0.222    -8.91e-06    2.16e-06
               exper4 |   1.25e-07   3.20e-08     3.90   0.001     5.93e-08    1.91e-07
                 edex |  -.0001421   .0000842    -1.69   0.103    -.0003149    .0000307
                      |
                ee_cl |
                   2  |  -.0671363   .0058557   -11.47   0.000    -.0791512   -.0551215
                   3  |  -.0810145   .0068687   -11.79   0.000    -.0951079    -.066921
                   4  |  -.0301257   .0112789    -2.67   0.013    -.0532681   -.0069833
                   5  |  -.1278841   .0089687   -14.26   0.000    -.1462864   -.1094818
                   6  |  -.0989261   .0071419   -13.85   0.000    -.1135801   -.0842722
                   7  |  -.0863107   .0086531    -9.97   0.000    -.1040655   -.0685559
                   8  |   .0310419   .0117489     2.64   0.014     .0069352    .0551487
                   9  |  -.1485335   .0102128   -14.54   0.000    -.1694884   -.1275787
                  10  |   -.109636   .0096267   -11.39   0.000    -.1293884   -.0898836
                  11  |   -.071259   .0092069    -7.74   0.000      -.09015    -.052368
                  12  |   .0286552   .0132247     2.17   0.039     .0015204      .05579
                  13  |  -.0706859   .0132126    -5.35   0.000     -.097796   -.0435758
                  14  |  -.0789787    .011922    -6.62   0.000    -.1034407   -.0545168
                  15  |   -.052114   .0105002    -4.96   0.000    -.0736586   -.0305693
                  16  |   .0197907   .0142262     1.39   0.176    -.0093991    .0489805
                      |
                 marr |   .1279749   .0039183    32.66   0.000     .1199352    .1360146
                partt |  -.2192871   .0043548   -50.35   0.000    -.2282225   -.2103518
               public |   .0070045   .0058413     1.20   0.241    -.0049809    .0189899
                 cmsa |   .1372841   .0116731    11.76   0.000     .1133329    .1612353
                      |
                nocc2 |
                   2  |  -.1524431   .0045582   -33.44   0.000    -.1617957   -.1430904
                   3  |  -.0445726     .00841    -5.30   0.000    -.0618285   -.0273167
                   4  |  -.3304468   .0115861   -28.52   0.000    -.3542194   -.3066741
                   5  |  -.0957037   .0119033    -8.04   0.000    -.1201272   -.0712801
                   6  |  -.3991628   .0074101   -53.87   0.000    -.4143672   -.3839584
                   7  |  -.2516158    .008435   -29.83   0.000    -.2689231   -.2343086
                   8  |  -.1043078   .0137474    -7.59   0.000     -.132515   -.0761005
                   9  |  -.4448347   .0074997   -59.31   0.000    -.4602228   -.4294465
                  10  |  -.3807581   .0077209   -49.31   0.000    -.3966002   -.3649161
                  11  |  -.2778899   .0083311   -33.36   0.000     -.294984   -.2607959
                  12  |  -.4527051   .0113618   -39.84   0.000    -.4760177   -.4293926
                      |
              quarter |
                   2  |   .0014631   .0022206     0.66   0.516    -.0030931    .0060193
                   3  |   .0020588   .0026253     0.78   0.440    -.0033279    .0074455
                   4  |   .0142289   .0025933     5.49   0.000     .0089078      .01955
                      |
                _cons |   .7150058   .0378224    18.90   0.000     .6374006    .7926111
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 4,517,187,003)

Linear regression                               Number of obs     =    510,058
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5477
                                                Root MSE          =       .422

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1567403   .0050457   -31.06   0.000    -.1670932   -.1463875
             treat_st |  -.0266647   .0149321    -1.79   0.085    -.0573029    .0039735
treat_stblackrelwhite |   .0025759   .0069364     0.37   0.713    -.0116564    .0168081
                      |
                state |
                  NH  |   .0897832   .0054127    16.59   0.000     .0786773    .1008891
                  VT  |   .0336834    .002705    12.45   0.000     .0281331    .0392336
                  MA  |   .1160692   .0121095     9.58   0.000     .0912226    .1409159
                  RI  |   .0299675   .0127708     2.35   0.027      .003764    .0561709
                  CT  |   .1230417   .0120423    10.22   0.000     .0983329    .1477504
                  NY  |   .0727118   .0121084     6.01   0.000     .0478673    .0975563
                  NJ  |   .1533611   .0132026    11.62   0.000     .1262716    .1804507
                  PA  |   .0033155   .0094474     0.35   0.728    -.0160691    .0227001
                  OH  |  -.0288742   .0093941    -3.07   0.005    -.0481493   -.0095991
                  IN  |  -.0041243   .0067455    -0.61   0.546    -.0179648    .0097163
                  IL  |   .0627196   .0112261     5.59   0.000     .0396856    .0857536
                  MI  |   .0234028   .0108004     2.17   0.039     .0012423    .0455634
                  WI  |   .0121233    .006254     1.94   0.063    -.0007088    .0249555
                  MN  |    .053045   .0086072     6.16   0.000     .0353844    .0707056
                  MO  |  -.0351365    .008514    -4.13   0.000    -.0526058   -.0176671
                  DE  |   .0559388   .0026867    20.82   0.000     .0504262    .0614514
                  MD  |    .128326   .0120617    10.64   0.000     .1035774    .1530746
                  DC  |   .1925531   .0177291    10.86   0.000     .1561759    .2289302
                  KY  |  -.0376071   .0063444    -5.93   0.000    -.0506248   -.0245894
                  OK  |  -.0501564   .0094641    -5.30   0.000    -.0695751   -.0307376
                  CO  |   .0418906    .010831     3.87   0.001     .0196672     .064114
                  NM  |  -.0184776   .0073761    -2.51   0.019    -.0336122    -.003343
                  WA  |   .0904405   .0110984     8.15   0.000     .0676684    .1132125
                  OR  |   .0230383   .0102578     2.25   0.033      .001991    .0440855
                  CA  |   .1521581   .0139459    10.91   0.000     .1235435    .1807728
                  AK  |   .2396908   .0088971    26.94   0.000     .2214354    .2579463
                  HI  |   .1089316   .0085897    12.68   0.000      .091307    .1265562
                      |
                 year |
                1990  |  -.0016199   .0039615    -0.41   0.686    -.0097482    .0065083
                1991  |  -.0083994   .0084577    -0.99   0.329    -.0257532    .0089544
                1992  |  -.0063526   .0088808    -0.72   0.481    -.0245745    .0118693
                1993  |  -.0207026   .0062809    -3.30   0.003    -.0335901   -.0078152
                1996  |  -.0259421   .0082814    -3.13   0.004    -.0429342     -.00895
                1997  |   -.017483   .0074778    -2.34   0.027    -.0328262   -.0021398
                1998  |   .0064233   .0064374     1.00   0.327    -.0067851    .0196318
                1999  |   .0310028   .0086946     3.57   0.001      .013163    .0488425
                2000  |   .0446682   .0081995     5.45   0.000     .0278441    .0614923
                2001  |   .0660757   .0089852     7.35   0.000     .0476395    .0845118
                2002  |   .0782318   .0072111    10.85   0.000     .0634358    .0930277
                2003  |   .0599318   .0104699     5.72   0.000     .0384492    .0814143
                2004  |   .0558597   .0088725     6.30   0.000     .0376548    .0740646
                2005  |   .0377701   .0095335     3.96   0.000      .018209    .0573312
                2006  |   .0301298   .0086633     3.48   0.002     .0123542    .0479053
                2007  |   .0295717    .009927     2.98   0.006     .0092033    .0499402
                2008  |   .0258094   .0097001     2.66   0.013     .0059064    .0457123
                2009  |   .0559401   .0164092     3.41   0.002     .0222712    .0896091
                2010  |   .0464914   .0140093     3.32   0.003     .0177468     .075236
                2011  |   .0251301   .0134981     1.86   0.074    -.0025657     .052826
                2012  |   .0156735   .0146831     1.07   0.295    -.0144537    .0458006
                2013  |   .0150942   .0118474     1.27   0.214    -.0092147    .0394031
                2014  |   .0076155   .0090685     0.84   0.408    -.0109915    .0262226
                2015  |   .0312625   .0079133     3.95   0.001     .0150258    .0474992
                2016  |   .0384328   .0099505     3.86   0.001      .018016    .0588496
                2017  |   .0464287   .0109682     4.23   0.000     .0239239    .0689336
                2018  |   .0531934   .0114185     4.66   0.000     .0297646    .0766221
                2019  |   .0760077   .0106371     7.15   0.000     .0541821    .0978332
                      |
                 nind |
                   2  |   .0839464   .0286268     2.93   0.007     .0252091    .1426838
                   3  |   .1256916   .0259537     4.84   0.000     .0724389    .1789442
                   4  |  -.0429839   .0271712    -1.58   0.125    -.0987347    .0127668
                   5  |   .1143317   .0261552     4.37   0.000     .0606657    .1679977
                   6  |   .1353978   .0317116     4.27   0.000      .070331    .2004646
                   7  |    .035492   .0288782     1.23   0.230    -.0237613    .0947453
                   8  |  -.0235106   .0287085    -0.82   0.420    -.0824156    .0353945
                   9  |  -.0539421   .0271358    -1.99   0.057    -.1096201    .0017359
                  10  |  -.0635736   .0283422    -2.24   0.033     -.121727   -.0054202
                  11  |   .0950456   .0283007     3.36   0.002     .0369774    .1531138
                      |
                 educ |   .0623991   .0026493    23.55   0.000     .0569633     .067835
                exper |   .0381804   .0023264    16.41   0.000     .0334071    .0429537
               exper2 |  -.0007097   .0000945    -7.51   0.000    -.0009037   -.0005157
               exper3 |  -3.29e-06   2.71e-06    -1.21   0.236    -8.85e-06    2.28e-06
               exper4 |   1.24e-07   3.22e-08     3.86   0.001     5.81e-08    1.90e-07
                 edex |  -.0001436   .0000835    -1.72   0.097    -.0003149    .0000277
                      |
                ee_cl |
                   2  |  -.0670402   .0058794   -11.40   0.000    -.0791038   -.0549766
                   3  |  -.0809922   .0068681   -11.79   0.000    -.0950843      -.0669
                   4  |  -.0301144   .0112721    -2.67   0.013     -.053243   -.0069859
                   5  |  -.1280037   .0089484   -14.30   0.000    -.1463644   -.1096431
                   6  |  -.0989255   .0071218   -13.89   0.000    -.1135381   -.0843128
                   7  |  -.0862583   .0086516    -9.97   0.000    -.1040099   -.0685067
                   8  |   .0311067   .0117598     2.65   0.013     .0069776    .0552358
                   9  |  -.1485761   .0102011   -14.56   0.000    -.1695071   -.1276451
                  10  |    -.10972   .0095993   -11.43   0.000    -.1294162   -.0900239
                  11  |  -.0712303    .009205    -7.74   0.000    -.0901174   -.0523433
                  12  |   .0287057   .0132302     2.17   0.039     .0015596    .0558518
                  13  |  -.0709258   .0131289    -5.40   0.000    -.0978642   -.0439875
                  14  |  -.0791121   .0118625    -6.67   0.000     -.103452   -.0547722
                  15  |  -.0521489   .0104682    -4.98   0.000    -.0736279   -.0306699
                  16  |   .0198673   .0142512     1.39   0.175    -.0093737    .0491083
                      |
                 marr |   .1279764   .0039123    32.71   0.000     .1199491    .1360038
                partt |  -.2191702   .0043566   -50.31   0.000    -.2281092   -.2102311
               public |   .0069815   .0058281     1.20   0.241    -.0049767    .0189397
                 cmsa |   .1372619   .0116719    11.76   0.000     .1133132    .1612105
                      |
                nocc2 |
                   2  |  -.1524341   .0045675   -33.37   0.000    -.1618057   -.1430624
                   3  |  -.0445666   .0084144    -5.30   0.000    -.0618316   -.0273016
                   4  |  -.3304315    .011585   -28.52   0.000    -.3542019   -.3066611
                   5  |   -.095714   .0119081    -8.04   0.000    -.1201475   -.0712806
                   6  |  -.3991122   .0074343   -53.68   0.000    -.4143662   -.3838582
                   7  |  -.2515978   .0084544   -29.76   0.000    -.2689447   -.2342508
                   8  |  -.1043818   .0137845    -7.57   0.000    -.1326653   -.0760983
                   9  |  -.4448171   .0075247   -59.11   0.000    -.4602565   -.4293777
                  10  |  -.3807587   .0077326   -49.24   0.000    -.3966246   -.3648927
                  11  |   -.277872   .0083444   -33.30   0.000    -.2949932   -.2607508
                  12  |  -.4527168   .0113721   -39.81   0.000    -.4760503   -.4293832
                      |
                unemp |   -.004515   .0026157    -1.73   0.096     -.009882     .000852
                      |
              quarter |
                   2  |   .0014624   .0022264     0.66   0.517    -.0031059    .0060307
                   3  |   .0021012   .0026398     0.80   0.433    -.0033152    .0075176
                   4  |    .014275    .002581     5.53   0.000     .0089792    .0195707
                      |
                _cons |   .7349569   .0455889    16.12   0.000     .6414162    .8284976
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all_unemp 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 4,517,187,003)

Linear regression                               Number of obs     =    510,058
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5469
                                                Root MSE          =     .42238

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1572189   .0049991   -31.45   0.000    -.1674761   -.1469616
             treat_st |  -.0214531   .0118424    -1.81   0.081    -.0457518    .0028456
treat_stblackrelwhite |   .0052302   .0072539     0.72   0.477    -.0096535     .020114
                      |
                state |
                  NH  |   .2611292   .0125676    20.78   0.000     .2353426    .2869158
                  VT  |   .0969875   .0118308     8.20   0.000     .0727126    .1212623
                  MA  |   .0618017   .0190371     3.25   0.003     .0227407    .1008626
                  RI  |   .0368728   .0236651     1.56   0.131     -.011684    .0854296
                  CT  |   .1890125   .0208703     9.06   0.000     .1461902    .2318349
                  NY  |   .2224489   .0224904     9.89   0.000     .1763024    .2685953
                  NJ  |   .2542623   .0242846    10.47   0.000     .2044344    .3040903
                  PA  |   .0152514   .0190879     0.80   0.431    -.0239138    .0544166
                  OH  |   .1159117   .0252616     4.59   0.000     .0640792    .1677443
                  IN  |   .1010432   .0460262     2.20   0.037     .0066053    .1954812
                  IL  |   .1838022   .0198025     9.28   0.000     .1431708    .2244335
                  MI  |    .389686   .0415859     9.37   0.000     .3043587    .4750133
                  WI  |  -.0625682   .0363803    -1.72   0.097    -.1372143    .0120779
                  MN  |  -.0991571   .0188666    -5.26   0.000    -.1378682   -.0604461
                  MO  |   -.012883   .0146338    -0.88   0.386     -.042909     .017143
                  DE  |   .2185261   .0175284    12.47   0.000     .1825607    .2544915
                  MD  |    -.07719   .0251298    -3.07   0.005    -.1287522   -.0256278
                  DC  |  -.1365959   .0246216    -5.55   0.000    -.1871153   -.0860764
                  KY  |   .1043904   .0202406     5.16   0.000     .0628601    .1459206
                  OK  |  -.1863747   .0536222    -3.48   0.002    -.2963984   -.0763509
                  CO  |   -.101245    .016407    -6.17   0.000    -.1349094   -.0675806
                  NM  |  -.1905671   .0169506   -11.24   0.000    -.2253467   -.1557874
                  WA  |  -.3053895   .0157872   -19.34   0.000    -.3377822   -.2729968
                  OR  |   .0483324   .0116009     4.17   0.000     .0245293    .0721355
                  CA  |    .129281    .024498     5.28   0.000     .0790152    .1795468
                  AK  |   .7159771   .0199981    35.80   0.000     .6749443    .7570099
                  HI  |   -.155328   .0256312    -6.06   0.000    -.2079188   -.1027372
                      |
        state#c.lyear |
                  ME  |   .0021691   .0001599    13.57   0.000      .001841    .0024971
                  NH  |   .0005281   .0003071     1.72   0.097     -.000102    .0011582
                  VT  |   .0015316   .0000889    17.23   0.000     .0013492     .001714
                  MA  |   .0026992   .0001119    24.12   0.000     .0024696    .0029289
                  RI  |   .0021404   .0000984    21.76   0.000     .0019386    .0023423
                  CT  |   .0015445   .0001254    12.31   0.000     .0012871    .0018018
                  NY  |    .000739   .0000861     8.58   0.000     .0005622    .0009158
                  NJ  |    .001223   .0000825    14.82   0.000     .0010537    .0013924
                  PA  |   .0020694   .0000799    25.89   0.000     .0019054    .0022334
                  OH  |   .0007993   .0000645    12.40   0.000      .000667    .0009315
                  IN  |   .0011566   .0004842     2.39   0.024     .0001632      .00215
                  IL  |   .0010237   .0000853    12.00   0.000     .0008486    .0011988
                  MI  |  -.0013527   .0003825    -3.54   0.001    -.0021376   -.0005679
                  WI  |     .00287   .0003512     8.17   0.000     .0021495    .0035906
                  MN  |   .0036195   .0000958    37.76   0.000     .0034229    .0038162
                  MO  |   .0019651   .0001076    18.26   0.000     .0017442    .0021859
                  DE  |   .0004841   .0001381     3.51   0.002     .0002007    .0007674
                  MD  |   .0041324   .0001156    35.75   0.000     .0038953    .0043696
                  DC  |    .005358   .0001315    40.75   0.000     .0050882    .0056278
                  KY  |   .0008236   .0002434     3.38   0.002     .0003241     .001323
                  OK  |   .0034704   .0006001     5.78   0.000      .002239    .0047017
                  CO  |   .0035454   .0001191    29.78   0.000     .0033011    .0037897
                  NM  |   .0038448   .0003401    11.30   0.000     .0031469    .0045427
                  WA  |    .005979   .0001175    50.90   0.000      .005738      .00622
                  OR  |   .0019668   .0001545    12.73   0.000     .0016497    .0022839
                  CA  |   .0024405   .0000812    30.05   0.000     .0022739    .0026071
                  AK  |  -.0024406   .0000636   -38.35   0.000    -.0025712     -.00231
                  HI  |   .0047278   .0000921    51.34   0.000     .0045389    .0049168
                      |
                 nind |
                   2  |   .0857226   .0284309     3.02   0.006     .0273872     .144058
                   3  |   .1266074   .0256965     4.93   0.000     .0738825    .1793323
                   4  |  -.0419417   .0269056    -1.56   0.131    -.0971474    .0132639
                   5  |   .1153264   .0258399     4.46   0.000     .0623073    .1683454
                   6  |   .1368253   .0312694     4.38   0.000     .0726659    .2009847
                   7  |   .0367637    .028578     1.29   0.209    -.0218736    .0954009
                   8  |  -.0222117   .0284145    -0.78   0.441    -.0805135      .03609
                   9  |  -.0527771   .0268217    -1.97   0.059    -.1078106    .0022564
                  10  |  -.0621342   .0281316    -2.21   0.036    -.1198555    -.004413
                  11  |   .0957108   .0281806     3.40   0.002      .037889    .1535326
                      |
                 educ |   .0623729   .0026368    23.65   0.000     .0569626    .0677832
                exper |   .0379955   .0023235    16.35   0.000     .0332281    .0427628
               exper2 |  -.0006829   .0000969    -7.05   0.000    -.0008817   -.0004842
               exper3 |  -4.16e-06   2.75e-06    -1.52   0.141    -9.80e-06    1.47e-06
               exper4 |   1.32e-07   3.20e-08     4.13   0.000     6.63e-08    1.98e-07
                 edex |  -.0001431   .0000834    -1.72   0.098    -.0003142     .000028
                      |
                ee_cl |
                   2  |  -.0688269    .005882   -11.70   0.000    -.0808958    -.056758
                   3  |  -.0827036   .0069148   -11.96   0.000    -.0968915   -.0685156
                   4  |  -.0320418   .0110203    -2.91   0.007    -.0546535     -.00943
                   5  |  -.1316039   .0089978   -14.63   0.000    -.1500659   -.1131418
                   6  |  -.1019395   .0068281   -14.93   0.000    -.1159497   -.0879294
                   7  |  -.0881818   .0085397   -10.33   0.000    -.1057038   -.0706598
                   8  |   .0295817   .0114778     2.58   0.016     .0060313    .0531321
                   9  |  -.1508192   .0098321   -15.34   0.000     -.170993   -.1306454
                  10  |  -.1107076    .009288   -11.92   0.000    -.1297649   -.0916503
                  11  |  -.0726449   .0090454    -8.03   0.000    -.0912044   -.0540854
                  12  |   .0264175   .0129479     2.04   0.051    -.0001494    .0529843
                  13  |  -.0727744   .0129123    -5.64   0.000    -.0992682   -.0462806
                  14  |  -.0806622   .0115299    -7.00   0.000    -.1043196   -.0570047
                  15  |  -.0532279   .0101451    -5.25   0.000     -.074044   -.0324118
                  16  |   .0174309   .0138654     1.26   0.219    -.0110186    .0458803
                      |
                 marr |   .1276944   .0039289    32.50   0.000      .119633    .1357557
                partt |  -.2191905   .0042977   -51.00   0.000    -.2280087   -.2103724
               public |   .0068058   .0057784     1.18   0.249    -.0050506    .0186622
                 cmsa |   .1360366   .0117051    11.62   0.000     .1120197    .1600536
                      |
                nocc2 |
                   2  |  -.1533293   .0044373   -34.55   0.000    -.1624339   -.1442247
                   3  |  -.0452625   .0083273    -5.44   0.000    -.0623487   -.0281763
                   4  |  -.3306703   .0114582   -28.86   0.000    -.3541806   -.3071601
                   5  |  -.0965005    .012003    -8.04   0.000    -.1211287   -.0718722
                   6  |   -.399592   .0073644   -54.26   0.000    -.4147026   -.3844814
                   7  |  -.2516792    .008396   -29.98   0.000    -.2689064    -.234452
                   8  |  -.1031632   .0135647    -7.61   0.000    -.1309955   -.0753308
                   9  |  -.4453672   .0074489   -59.79   0.000     -.460651   -.4300834
                  10  |   -.381832    .007539   -50.65   0.000    -.3973007   -.3663633
                  11  |  -.2781047   .0083111   -33.46   0.000    -.2951577   -.2610516
                  12  |  -.4533087   .0112583   -40.26   0.000     -.476409   -.4302085
                      |
                unemp |  -.0068156   .0010523    -6.48   0.000    -.0089748   -.0046565
                      |
              quarter |
                   2  |   .0011878   .0022458     0.53   0.601    -.0034203    .0057959
                   3  |   .0017242    .002601     0.66   0.513    -.0036127    .0070611
                   4  |   .0137813   .0025696     5.36   0.000      .008509    .0190537
                      |
                _cons |    .548814   .0316154    17.36   0.000     .4839446    .6136834
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 4,650,629,625)

Linear regression                               Number of obs     =    542,633
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5102
                                                Root MSE          =     .39674

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0849001   .0070574   -12.03   0.000    -.0993808   -.0704194
             treat_st |   -.032219   .0072641    -4.44   0.000    -.0471236   -.0173144
treat_stblackrelwhite |  -.0166691   .0087185    -1.91   0.067    -.0345581    .0012198
                      |
                state |
                  NH  |   .0581916   .0047896    12.15   0.000     .0483641    .0680192
                  VT  |   .0450507   .0008508    52.95   0.000     .0433049    .0467965
                  MA  |   .0930348   .0117536     7.92   0.000     .0689185    .1171511
                  RI  |  -.0025165   .0116752    -0.22   0.831     -.026472     .021439
                  CT  |   .0971587   .0115924     8.38   0.000     .0733731    .1209443
                  NY  |   .0403123   .0108871     3.70   0.001     .0179739    .0626507
                  NJ  |   .1064649   .0123936     8.59   0.000     .0810353    .1318945
                  PA  |  -.0451634   .0092384    -4.89   0.000     -.064119   -.0262078
                  OH  |  -.0760688   .0088053    -8.64   0.000    -.0941358   -.0580018
                  IN  |  -.0692726   .0064959   -10.66   0.000    -.0826012   -.0559441
                  IL  |  -.0040501   .0099814    -0.41   0.688    -.0245303    .0164301
                  MI  |  -.0435609   .0089833    -4.85   0.000    -.0619931   -.0251287
                  WI  |  -.0200892   .0063802    -3.15   0.004    -.0331804   -.0069981
                  MN  |   .0366502    .008548     4.29   0.000     .0191113    .0541892
                  MO  |  -.0833755   .0083648    -9.97   0.000    -.1005386   -.0662123
                  DE  |   .0390689   .0029245    13.36   0.000     .0330684    .0450694
                  MD  |    .091871   .0121556     7.56   0.000     .0669297    .1168123
                  DC  |   .1575154   .0153095    10.29   0.000      .126103    .1889279
                  KY  |  -.0903206   .0054332   -16.62   0.000    -.1014687   -.0791725
                  OK  |  -.1289166   .0078537   -16.41   0.000    -.1450311   -.1128022
                  CO  |  -.0014785   .0110582    -0.13   0.895     -.024168     .021211
                  NM  |  -.0886834   .0065209   -13.60   0.000     -.102063   -.0753037
                  WA  |   .0501928   .0104918     4.78   0.000     .0286655    .0717201
                  OR  |  -.0113476   .0095176    -1.19   0.244     -.030876    .0081808
                  CA  |   .1085571   .0124301     8.73   0.000     .0830527    .1340616
                  AK  |   .1686387   .0062165    27.13   0.000     .1558834     .181394
                  HI  |   .0711483   .0086618     8.21   0.000     .0533758    .0889207
                      |
                 year |
                1990  |  -.0051109   .0036996    -1.38   0.178    -.0127018    .0024799
                1991  |  -.0000576   .0031946    -0.02   0.986    -.0066124    .0064972
                1992  |   .0211009   .0039713     5.31   0.000     .0129525    .0292492
                1993  |   .0143561   .0050838     2.82   0.009     .0039251    .0247871
                1996  |   .0051365   .0047575     1.08   0.290    -.0046252    .0148982
                1997  |   .0123642   .0057834     2.14   0.042     .0004977    .0242308
                1998  |   .0500631   .0054411     9.20   0.000     .0388988    .0612273
                1999  |   .0672209   .0070646     9.52   0.000     .0527255    .0817162
                2000  |   .0813201   .0070828    11.48   0.000     .0667874    .0958527
                2001  |   .0972238   .0076608    12.69   0.000     .0815052    .1129424
                2002  |   .1074745   .0070422    15.26   0.000      .093025     .121924
                2003  |    .119754   .0074384    16.10   0.000     .1044916    .1350164
                2004  |   .1106689   .0085565    12.93   0.000     .0931124    .1282255
                2005  |   .1051365   .0074414    14.13   0.000      .089868    .1204051
                2006  |   .0935654   .0070956    13.19   0.000     .0790065    .1081244
                2007  |   .0927161   .0082487    11.24   0.000     .0757912     .109641
                2008  |     .08514   .0094485     9.01   0.000     .0657532    .1045268
                2009  |   .1043189   .0083793    12.45   0.000     .0871259    .1215119
                2010  |   .1025614   .0061592    16.65   0.000     .0899238     .115199
                2011  |   .0831402   .0069888    11.90   0.000     .0688004      .09748
                2012  |   .0704808   .0070611     9.98   0.000     .0559926    .0849691
                2013  |   .0719193   .0071936    10.00   0.000     .0571592    .0866794
                2014  |   .0724571   .0081093     8.94   0.000     .0558182    .0890959
                2015  |   .0842587   .0071425    11.80   0.000     .0696036    .0989139
                2016  |   .0967592   .0098055     9.87   0.000       .07664    .1168785
                2017  |   .1142685   .0098736    11.57   0.000     .0940095    .1345276
                2018  |   .1214132   .0101649    11.94   0.000     .1005566    .1422698
                2019  |   .1312024   .0084667    15.50   0.000     .1138302    .1485747
                      |
                 nind |
                   2  |    .098931   .0229488     4.31   0.000      .051844    .1460181
                   3  |   .1728291   .0218069     7.93   0.000     .1280849    .2175733
                   4  |   -.041159   .0231869    -1.78   0.087    -.0887345    .0064165
                   5  |   .1506661    .022398     6.73   0.000     .1047092    .1966231
                   6  |   .1367329   .0245323     5.57   0.000     .0863968     .187069
                   7  |   .0857543   .0245315     3.50   0.002     .0354198    .1360887
                   8  |   .0346391   .0220273     1.57   0.127    -.0105572    .0798355
                   9  |  -.0332959   .0230311    -1.45   0.160    -.0805518    .0139601
                  10  |   -.035382   .0220253    -1.61   0.120    -.0805742    .0098102
                  11  |   .1434482   .0279418     5.13   0.000     .0861163    .2007801
                      |
                 educ |   .0842039   .0021584    39.01   0.000     .0797752    .0886326
                exper |   .0476055   .0032759    14.53   0.000     .0408838    .0543271
               exper2 |   -.001617   .0001268   -12.75   0.000    -.0018772   -.0013569
               exper3 |   .0000247   3.74e-06     6.61   0.000      .000017    .0000324
               exper4 |  -1.18e-07   3.87e-08    -3.05   0.005    -1.97e-07   -3.85e-08
                 edex |  -.0004676   .0001233    -3.79   0.001    -.0007206   -.0002147
                      |
                ee_cl |
                   2  |  -.1173605   .0065372   -17.95   0.000    -.1307737   -.1039474
                   3  |  -.1496053   .0088784   -16.85   0.000    -.1678223   -.1313883
                   4  |  -.1443529   .0149781    -9.64   0.000    -.1750853   -.1136204
                   5  |  -.1614507   .0127916   -12.62   0.000    -.1876969   -.1352046
                   6  |  -.1582859   .0123562   -12.81   0.000    -.1836387   -.1329332
                   7  |  -.1594539   .0126665   -12.59   0.000    -.1854433   -.1334644
                   8  |  -.0693682    .015125    -4.59   0.000    -.1004022   -.0383342
                   9  |  -.1608406   .0156148   -10.30   0.000    -.1928795   -.1288016
                  10  |  -.1633319   .0158753   -10.29   0.000    -.1959052   -.1307585
                  11  |  -.1495823   .0138303   -10.82   0.000    -.1779597   -.1212049
                  12  |  -.0970439   .0121498    -7.99   0.000    -.1219731   -.0721146
                  13  |  -.1149992   .0239695    -4.80   0.000    -.1641805   -.0658178
                  14  |  -.1450014   .0178025    -8.15   0.000    -.1815291   -.1084738
                  15  |  -.1184772   .0157385    -7.53   0.000    -.1507699   -.0861845
                  16  |   -.094279   .0151649    -6.22   0.000    -.1253949   -.0631631
                      |
                 marr |   .0412182   .0036403    11.32   0.000     .0337489    .0486876
                partt |  -.1426267   .0030458   -46.83   0.000    -.1488761   -.1363773
               public |   .0083677   .0078727     1.06   0.297    -.0077857     .024521
                 cmsa |   .1542521   .0117419    13.14   0.000     .1301597    .1783445
                      |
                nocc2 |
                   2  |  -.1345706   .0047482   -28.34   0.000    -.1443132   -.1248281
                   3  |  -.0456515   .0091961    -4.96   0.000    -.0645203   -.0267827
                   4  |  -.3300984     .00672   -49.12   0.000    -.3438866   -.3163102
                   5  |   .0345296   .0085393     4.04   0.000     .0170084    .0520507
                   6  |  -.3413819   .0059237   -57.63   0.000    -.3535364   -.3292274
                   7  |  -.3690509   .0059317   -62.22   0.000    -.3812218   -.3568801
                   8  |  -.1725789   .0096177   -17.94   0.000    -.1923127   -.1528451
                   9  |  -.4324014   .0076648   -56.41   0.000    -.4481282   -.4166746
                  10  |  -.4598851   .0121997   -37.70   0.000    -.4849169   -.4348534
                  11  |  -.2350698   .0111427   -21.10   0.000    -.2579327   -.2122068
                  12  |  -.4404124   .0141159   -31.20   0.000    -.4693759   -.4114489
                      |
              quarter |
                   2  |   .0102402   .0021835     4.69   0.000     .0057601    .0147203
                   3  |   .0161455    .002399     6.73   0.000     .0112232    .0210679
                   4  |   .0220727    .001398    15.79   0.000     .0192042    .0249411
                      |
                _cons |    .378124   .0355278    10.64   0.000     .3052269    .4510211
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 4,650,629,625)

Linear regression                               Number of obs     =    542,633
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5102
                                                Root MSE          =     .39674

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.084901   .0070564   -12.03   0.000    -.0993796   -.0704224
             treat_st |  -.0323553   .0075541    -4.28   0.000    -.0478549   -.0168557
treat_stblackrelwhite |  -.0167041   .0087577    -1.91   0.067    -.0346734    .0012651
                      |
                state |
                  NH  |   .0575716   .0045788    12.57   0.000     .0481767    .0669666
                  VT  |   .0444828   .0021421    20.77   0.000     .0400875    .0488781
                  MA  |   .0930633   .0117872     7.90   0.000      .068878    .1172486
                  RI  |  -.0019406   .0124638    -0.16   0.877    -.0275142    .0236329
                  CT  |   .0972185    .011662     8.34   0.000       .07329     .121147
                  NY  |   .0407244   .0114235     3.56   0.001     .0172853    .0641634
                  NJ  |   .1067691   .0127611     8.37   0.000     .0805854    .1329528
                  PA  |  -.0449479   .0095025    -4.73   0.000    -.0644454   -.0254504
                  OH  |  -.0757222   .0092324    -8.20   0.000    -.0946655   -.0567789
                  IN  |  -.0692044   .0066027   -10.48   0.000    -.0827521   -.0556568
                  IL  |  -.0035069   .0107065    -0.33   0.746    -.0254748    .0184609
                  MI  |  -.0427292   .0104346    -4.09   0.000    -.0641393   -.0213192
                  WI  |  -.0202856   .0061141    -3.32   0.003    -.0328308   -.0077405
                  MN  |    .036209   .0081953     4.42   0.000     .0193937    .0530243
                  MO  |  -.0832642   .0084875    -9.81   0.000     -.100679   -.0658493
                  DE  |   .0387388   .0031546    12.28   0.000     .0322661    .0452115
                  MD  |   .0916925   .0120166     7.63   0.000     .0670364    .1163486
                  DC  |   .1584642   .0163454     9.69   0.000     .1249263    .1920021
                  KY  |  -.0898594   .0061975   -14.50   0.000    -.1025755   -.0771432
                  OK  |  -.1291189   .0074462   -17.34   0.000    -.1443972   -.1138405
                  CO  |  -.0016808   .0108615    -0.15   0.878    -.0239667    .0206052
                  NM  |  -.0882923   .0069884   -12.63   0.000    -.1026312   -.0739534
                  WA  |   .0506578   .0110867     4.57   0.000     .0279098    .0734058
                  OR  |  -.0107064   .0104124    -1.03   0.313    -.0320709    .0106582
                  CA  |   .1094128   .0136252     8.03   0.000     .0814562    .1373695
                  AK  |   .1697591   .0079576    21.33   0.000     .1534314    .1860868
                  HI  |   .0705822   .0082262     8.58   0.000     .0537034    .0874609
                      |
                 year |
                1990  |  -.0048584   .0036386    -1.34   0.193    -.0123242    .0026075
                1991  |   .0009045   .0048112     0.19   0.852    -.0089673    .0107763
                1992  |   .0224018   .0068265     3.28   0.003     .0083949    .0364086
                1993  |   .0153667   .0070905     2.17   0.039     .0008182    .0299151
                1996  |   .0052657   .0047209     1.12   0.275    -.0044208    .0149521
                1997  |   .0122491   .0057662     2.12   0.043     .0004179    .0240803
                1998  |   .0497178    .005247     9.48   0.000     .0389518    .0604838
                1999  |   .0667169   .0068225     9.78   0.000     .0527182    .0807156
                2000  |   .0807187   .0070787    11.40   0.000     .0661945     .095243
                2001  |   .0970099    .007529    12.88   0.000     .0815617    .1124582
                2002  |   .1078305   .0072886    14.79   0.000     .0928756    .1227854
                2003  |   .1202806   .0080279    14.98   0.000     .1038087    .1367525
                2004  |    .110985   .0090165    12.31   0.000     .0924848    .1294852
                2005  |   .1052179   .0075092    14.01   0.000     .0898102    .1206255
                2006  |   .0934517   .0070476    13.26   0.000     .0789912    .1079121
                2007  |   .0926076   .0082054    11.29   0.000     .0757715    .1094436
                2008  |   .0855756   .0096487     8.87   0.000      .065778    .1053731
                2009  |   .1065609   .0127794     8.34   0.000     .0803398     .132782
                2010  |   .1049528   .0106344     9.87   0.000     .0831329    .1267727
                2011  |   .0851039   .0096033     8.86   0.000     .0653997    .1048082
                2012  |   .0720619   .0084735     8.50   0.000     .0546758    .0894481
                2013  |   .0732183   .0091377     8.01   0.000     .0544693    .0919674
                2014  |   .0730581   .0086086     8.49   0.000     .0553947    .0907214
                2015  |   .0843477    .007182    11.74   0.000     .0696115     .099084
                2016  |   .0966639   .0097306     9.93   0.000     .0766983    .1166296
                2017  |   .1139318   .0096729    11.78   0.000     .0940847    .1337789
                2018  |   .1208509   .0100833    11.99   0.000     .1001618    .1415401
                2019  |   .1305607   .0082387    15.85   0.000     .1136563     .147465
                      |
                 nind |
                   2  |   .0989117   .0229693     4.31   0.000     .0517826    .1460408
                   3  |   .1728165   .0218147     7.92   0.000     .1280564    .2175765
                   4  |  -.0411722   .0232013    -1.77   0.087    -.0887773     .006433
                   5  |    .150654   .0224091     6.72   0.000     .1046743    .1966337
                   6  |   .1367187   .0245505     5.57   0.000     .0863452    .1870921
                   7  |   .0857353   .0245505     3.49   0.002     .0353619    .1361087
                   8  |   .0346267   .0220365     1.57   0.128    -.0105884    .0798418
                   9  |  -.0333116   .0230446    -1.45   0.160    -.0805953    .0139721
                  10  |  -.0353985   .0220393    -1.61   0.120    -.0806193    .0098224
                  11  |   .1434297   .0279451     5.13   0.000     .0860911    .2007684
                      |
                 educ |   .0842028   .0021614    38.96   0.000      .079768    .0886375
                exper |   .0476083   .0032713    14.55   0.000     .0408961    .0543205
               exper2 |  -.0016173   .0001265   -12.78   0.000     -.001877   -.0013577
               exper3 |   .0000247   3.73e-06     6.62   0.000      .000017    .0000324
               exper4 |  -1.18e-07   3.86e-08    -3.05   0.005    -1.97e-07   -3.86e-08
                 edex |  -.0004676   .0001233    -3.79   0.001    -.0007205   -.0002147
                      |
                ee_cl |
                   2  |  -.1173492   .0065538   -17.91   0.000    -.1307965   -.1039018
                   3  |  -.1495903   .0089127   -16.78   0.000    -.1678776   -.1313029
                   4  |  -.1443358   .0150078    -9.62   0.000    -.1751293   -.1135422
                   5  |  -.1614365   .0128127   -12.60   0.000    -.1877259    -.135147
                   6  |  -.1582729   .0123848   -12.78   0.000    -.1836844   -.1328614
                   7  |  -.1594291   .0127221   -12.53   0.000    -.1855327   -.1333256
                   8  |  -.0693455   .0151713    -4.57   0.000    -.1004744   -.0382166
                   9  |  -.1608187   .0156345   -10.29   0.000    -.1928981   -.1287393
                  10  |   -.163315   .0159031   -10.27   0.000    -.1959456   -.1306845
                  11  |  -.1495528   .0138926   -10.76   0.000    -.1780581   -.1210475
                  12  |  -.0970169   .0121989    -7.95   0.000    -.1220469    -.071987
                  13  |   -.114979   .0239913    -4.79   0.000     -.164205    -.065753
                  14  |  -.1449769   .0178447    -8.12   0.000    -.1815912   -.1083626
                  15  |  -.1184418   .0158042    -7.49   0.000    -.1508694   -.0860143
                  16  |  -.0942496   .0151984    -6.20   0.000    -.1254343    -.063065
                      |
                 marr |   .0412182   .0036397    11.32   0.000     .0337501    .0486862
                partt |   -.142622   .0030491   -46.78   0.000    -.1488782   -.1363658
               public |   .0083694   .0078747     1.06   0.297    -.0077882    .0245269
                 cmsa |   .1542532   .0117409    13.14   0.000     .1301629    .1783435
                      |
                nocc2 |
                   2  |  -.1345749   .0047472   -28.35   0.000    -.1443154   -.1248343
                   3  |  -.0456563   .0091861    -4.97   0.000    -.0645045   -.0268081
                   4  |  -.3300989   .0067195   -49.13   0.000    -.3438863   -.3163115
                   5  |   .0345264   .0085371     4.04   0.000     .0170098     .052043
                   6  |  -.3413816   .0059236   -57.63   0.000    -.3535358   -.3292273
                   7  |   -.369053   .0059311   -62.22   0.000    -.3812227   -.3568833
                   8  |  -.1725694   .0096104   -17.96   0.000    -.1922883   -.1528506
                   9  |  -.4324027   .0076634   -56.42   0.000    -.4481267   -.4166787
                  10  |  -.4598925   .0121972   -37.70   0.000     -.484919   -.4348659
                  11  |  -.2350866   .0111222   -21.14   0.000    -.2579076   -.2122657
                  12  |  -.4404222   .0141073   -31.22   0.000    -.4693679   -.4114765
                      |
                unemp |  -.0005208   .0017024    -0.31   0.762    -.0040138    .0029722
                      |
              quarter |
                   2  |   .0102413   .0021853     4.69   0.000     .0057574    .0147251
                   3  |   .0161503   .0024024     6.72   0.000      .011221    .0210796
                   4  |   .0220808   .0014087    15.67   0.000     .0191904    .0249712
                      |
                _cons |   .3804834   .0392585     9.69   0.000     .2999316    .4610352
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 4,650,629,625)

Linear regression                               Number of obs     =    542,633
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5088
                                                Root MSE          =     .39731

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0854363   .0068425   -12.49   0.000     -.099476   -.0713965
             treat_st |  -.0600331   .0121085    -4.96   0.000    -.0848777   -.0351884
treat_stblackrelwhite |  -.0160263   .0080369    -1.99   0.056    -.0325166    .0004639
                      |
                state |
                  NH  |     .16434   .0128327    12.81   0.000     .1380096    .1906705
                  VT  |  -.1106167   .0112977    -9.79   0.000    -.1337977   -.0874357
                  MA  |  -.0990121   .0196961    -5.03   0.000    -.1394252    -.058599
                  RI  |  -.1669556   .0224653    -7.43   0.000    -.2130506   -.1208605
                  CT  |   .0465643   .0231691     2.01   0.055    -.0009747    .0941032
                  NY  |   -.015772   .0233731    -0.67   0.506    -.0637296    .0321857
                  NJ  |    .047412   .0254246     1.86   0.073    -.0047549    .0995789
                  PA  |  -.0404004   .0206348    -1.96   0.061    -.0827395    .0019388
                  OH  |   -.116342   .0262495    -4.43   0.000    -.1702014   -.0624825
                  IN  |   -.254947    .045579    -5.59   0.000    -.3484674   -.1614266
                  IL  |   -.130792   .0193933    -6.74   0.000    -.1705837   -.0910003
                  MI  |   -.136836   .0416207    -3.29   0.003    -.2222348   -.0514373
                  WI  |  -.4046368   .0361601   -11.19   0.000    -.4788313   -.3304424
                  MN  |  -.1969913   .0189189   -10.41   0.000    -.2358098   -.1581729
                  MO  |  -.0304368   .0151555    -2.01   0.055    -.0615334    .0006598
                  DE  |    .149153   .0180863     8.25   0.000      .112043     .186263
                  MD  |  -.3417479   .0266488   -12.82   0.000    -.3964266   -.2870691
                  DC  |  -.2365798   .0265941    -8.90   0.000    -.2911463   -.1820133
                  KY  |   -.227064   .0235325    -9.65   0.000    -.2753487   -.1787793
                  OK  |  -.4341203   .0537814    -8.07   0.000    -.5444707     -.32377
                  CO  |  -.2500157     .01769   -14.13   0.000    -.2863125    -.213719
                  NM  |  -.4872157   .0086034   -56.63   0.000    -.5048685   -.4695629
                  WA  |  -.4271207     .01356   -31.50   0.000    -.4549434   -.3992979
                  OR  |  -.1908116   .0124014   -15.39   0.000    -.2162572    -.165366
                  CA  |  -.1145062   .0247939    -4.62   0.000    -.1653792   -.0636333
                  AK  |   .3855988   .0209664    18.39   0.000     .3425793    .4286183
                  HI  |  -.1863437   .0267202    -6.97   0.000    -.2411689   -.1315184
                      |
        state#c.lyear |
                  ME  |   .0025417   .0001765    14.40   0.000     .0021795    .0029038
                  NH  |   .0015503   .0003214     4.82   0.000     .0008909    .0022098
                  VT  |   .0040227   .0001148    35.04   0.000     .0037871    .0042582
                  MA  |    .004394   .0001225    35.88   0.000     .0041427    .0046453
                  RI  |   .0041722   .0001322    31.56   0.000      .003901    .0044434
                  CT  |   .0030403   .0001097    27.72   0.000     .0028153    .0032654
                  NY  |   .0031025   .0000932    33.30   0.000     .0029113    .0032936
                  NJ  |   .0031412   .0000955    32.88   0.000     .0029452    .0033372
                  PA  |   .0025148   .0000995    25.27   0.000     .0023106     .002719
                  OH  |   .0029615   .0000764    38.77   0.000     .0028048    .0031182
                  IN  |   .0044105   .0004946     8.92   0.000     .0033958    .0054252
                  IL  |   .0037957   .0001152    32.94   0.000     .0035592    .0040321
                  MI  |   .0035413   .0004042     8.76   0.000     .0027119    .0043708
                  WI  |   .0062809   .0003782    16.61   0.000      .005505    .0070569
                  MN  |   .0047853   .0001215    39.39   0.000      .004536    .0050346
                  MO  |    .002049   .0001214    16.88   0.000     .0017999    .0022982
                  DE  |   .0013145   .0002001     6.57   0.000      .000904     .001725
                  MD  |   .0066962     .00011    60.89   0.000     .0064706    .0069219
                  DC  |   .0063708    .000188    33.89   0.000     .0059851    .0067565
                  KY  |   .0039199   .0002816    13.92   0.000     .0033421    .0044978
                  OK  |   .0056605   .0006341     8.93   0.000     .0043594    .0069616
                  CO  |   .0049351   .0001327    37.18   0.000     .0046628    .0052075
                  NM  |   .0064164   .0002913    22.02   0.000     .0058186    .0070142
                  WA  |   .0071603   .0001709    41.90   0.000     .0068097    .0075109
                  OR  |    .004318   .0001591    27.14   0.000     .0039915    .0046445
                  CA  |   .0047526   .0000989    48.07   0.000     .0045498    .0049555
                  AK  |   .0004493   .0000681     6.60   0.000     .0003096    .0005891
                  HI  |   .0050276   .0000777    64.70   0.000     .0048682    .0051871
                      |
                 nind |
                   2  |   .1006644    .022811     4.41   0.000       .05386    .1474687
                   3  |   .1726018   .0217015     7.95   0.000     .1280739    .2171296
                   4  |  -.0405348   .0231327    -1.75   0.091    -.0879992    .0069295
                   5  |   .1523473   .0222815     6.84   0.000     .1066295    .1980651
                   6  |   .1376783   .0243477     5.65   0.000     .0877209    .1876357
                   7  |   .0866713   .0244061     3.55   0.001     .0365941    .1367486
                   8  |   .0357382   .0219757     1.63   0.116    -.0093522    .0808286
                   9  |  -.0323485   .0229471    -1.41   0.170     -.079432    .0147349
                  10  |  -.0358559   .0218427    -1.64   0.112    -.0806733    .0089616
                  11  |   .1447132   .0279463     5.18   0.000     .0873721    .2020543
                      |
                 educ |   .0825045    .002206    37.40   0.000     .0779782    .0870309
                exper |   .0468773   .0032403    14.47   0.000     .0402287    .0535259
               exper2 |  -.0015743   .0001259   -12.50   0.000    -.0018327   -.0013159
               exper3 |   .0000234   3.77e-06     6.20   0.000     .0000156    .0000311
               exper4 |  -1.06e-07   3.92e-08    -2.70   0.012    -1.86e-07   -2.55e-08
                 edex |  -.0004414   .0001239    -3.56   0.001    -.0006957   -.0001871
                      |
                ee_cl |
                   2  |   -.118116   .0066984   -17.63   0.000      -.13186   -.1043719
                   3  |  -.1474079   .0091416   -16.13   0.000    -.1661648   -.1286509
                   4  |  -.1387357   .0151208    -9.18   0.000     -.169761   -.1077104
                   5  |   -.165631   .0127366   -13.00   0.000    -.1917643   -.1394978
                   6  |  -.1601223   .0123226   -12.99   0.000    -.1854062   -.1348384
                   7  |  -.1570559    .012977   -12.10   0.000    -.1836824   -.1304294
                   8  |  -.0641506   .0154476    -4.15   0.000    -.0958465   -.0324547
                   9  |   -.163966   .0154475   -10.61   0.000    -.1956616   -.1322704
                  10  |  -.1628453   .0160003   -10.18   0.000    -.1956751   -.1300155
                  11  |  -.1460615   .0140925   -10.36   0.000    -.1749769    -.117146
                  12  |  -.0921022   .0123019    -7.49   0.000    -.1173437   -.0668607
                  13  |  -.1181103   .0237637    -4.97   0.000    -.1668694   -.0693512
                  14  |  -.1435959   .0179319    -8.01   0.000    -.1803892   -.1068026
                  15  |  -.1160743   .0160927    -7.21   0.000    -.1490937   -.0830548
                  16  |   -.092111   .0150421    -6.12   0.000    -.1229748   -.0612472
                      |
                 marr |   .0408945   .0035699    11.46   0.000     .0335696    .0482194
                partt |  -.1426873   .0030537   -46.73   0.000    -.1489529   -.1364217
               public |   .0078208   .0077409     1.01   0.321    -.0080623    .0237039
                 cmsa |   .1533849   .0117236    13.08   0.000     .1293301    .1774397
                      |
                nocc2 |
                   2  |   -.134096   .0048917   -27.41   0.000    -.1441331    -.124059
                   3  |  -.0447931    .009266    -4.83   0.000    -.0638054   -.0257807
                   4  |  -.3293327   .0067311   -48.93   0.000    -.3431437   -.3155217
                   5  |   .0342672   .0085895     3.99   0.000      .016643    .0518914
                   6  |  -.3416872   .0060082   -56.87   0.000    -.3540149   -.3293595
                   7  |  -.3692818   .0060046   -61.50   0.000    -.3816021   -.3569615
                   8  |  -.1715345    .009875   -17.37   0.000    -.1917963   -.1512727
                   9  |  -.4323597   .0076941   -56.19   0.000    -.4481466   -.4165727
                  10  |   -.460492   .0123543   -37.27   0.000    -.4858411    -.435143
                  11  |  -.2344222   .0112248   -20.88   0.000    -.2574536   -.2113908
                  12  |  -.4408304   .0143298   -30.76   0.000    -.4702327    -.411428
                      |
                unemp |  -.0026199   .0007768    -3.37   0.002    -.0042137   -.0010261
                      |
              quarter |
                   2  |   .0098806   .0021125     4.68   0.000     .0055461    .0142151
                   3  |   .0158118   .0023308     6.78   0.000     .0110294    .0205941
                   4  |    .021605   .0013919    15.52   0.000     .0187491     .024461
                      |
                _cons |   .2175237   .0325408     6.68   0.000     .1507554    .2842919
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,270,346,772)

Linear regression                               Number of obs     =    142,651
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3495
                                                Root MSE          =     .35725

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1372123   .0123841   -11.08   0.000    -.1626225   -.1118022
             treat_st |  -.0554937   .0310939    -1.78   0.086    -.1192931    .0083057
treat_stblackrelwhite |  -.0235474   .0187482    -1.26   0.220    -.0620155    .0149207
                      |
                state |
                  NH  |   .0379435   .0068801     5.51   0.000     .0238267    .0520604
                  VT  |  -.0192905   .0040086    -4.81   0.000    -.0275155   -.0110654
                  MA  |   .0869066   .0123931     7.01   0.000     .0614781    .1123351
                  RI  |   .0246475   .0134235     1.84   0.077    -.0028952    .0521902
                  CT  |   .1338557   .0119183    11.23   0.000     .1094014      .15831
                  NY  |   .1030018   .0105507     9.76   0.000     .0813535    .1246501
                  NJ  |    .172976   .0121749    14.21   0.000     .1479952    .1979568
                  PA  |  -.0008877   .0086149    -0.10   0.919     -.018564    .0167886
                  OH  |  -.0010065   .0082122    -0.12   0.903    -.0178566    .0158436
                  IN  |   .0231807   .0063338     3.66   0.001     .0101848    .0361767
                  IL  |   .0814954    .008788     9.27   0.000     .0634639    .0995269
                  MI  |   .0817477   .0079008    10.35   0.000     .0655366    .0979588
                  WI  |   .0218335    .006435     3.39   0.002       .00863     .035037
                  MN  |   .0596859   .0090977     6.56   0.000      .041019    .0783529
                  MO  |   .0191464   .0083467     2.29   0.030     .0020204    .0362724
                  DE  |   .0584845   .0049254    11.87   0.000     .0483784    .0685905
                  MD  |   .1149674     .01068    10.76   0.000      .093054    .1368809
                  DC  |   .1214602   .0110369    11.00   0.000     .0988143    .1441062
                  KY  |  -.0241064   .0058687    -4.11   0.000    -.0361479   -.0120649
                  OK  |  -.0427653   .0144096    -2.97   0.006    -.0723313   -.0131994
                  CO  |   .0072311   .0110636     0.65   0.519    -.0154696    .0299318
                  NM  |  -.0442453   .0095363    -4.64   0.000    -.0638121   -.0246784
                  WA  |   .0981655   .0101125     9.71   0.000     .0774163    .1189147
                  OR  |   .0242352    .009656     2.51   0.018     .0044227    .0440477
                  CA  |   .1685004   .0126118    13.36   0.000     .1426232    .1943777
                  AK  |   .2314136   .0077103    30.01   0.000     .2155933    .2472339
                  HI  |   .0849106   .0098602     8.61   0.000     .0646792    .1051421
                      |
                 year |
                1990  |  -.0160782   .0063166    -2.55   0.017    -.0290389   -.0031175
                1991  |  -.0274955   .0049865    -5.51   0.000    -.0377269   -.0172641
                1992  |   -.026383   .0076912    -3.43   0.002     -.042164    -.010602
                1993  |  -.0254185   .0053045    -4.79   0.000    -.0363025   -.0145345
                1996  |  -.0110982     .00614    -1.81   0.082    -.0236965       .0015
                1997  |   .0009347   .0064595     0.14   0.886    -.0123192    .0141886
                1998  |   .0051435   .0058567     0.88   0.388    -.0068734    .0171605
                1999  |   .0155221   .0065367     2.37   0.025       .00211    .0289342
                2000  |    .014978   .0080838     1.85   0.075    -.0016086    .0315645
                2001  |   .0180826   .0068539     2.64   0.014     .0040196    .0321455
                2002  |   .0335753   .0085952     3.91   0.001     .0159394    .0512112
                2003  |   .0407731   .0088272     4.62   0.000     .0226611    .0588851
                2004  |   .0275199   .0074906     3.67   0.001     .0121504    .0428894
                2005  |    .025245   .0077275     3.27   0.003     .0093895    .0411004
                2006  |   .0213146   .0106097     2.01   0.055    -.0004548     .043084
                2007  |    .022037   .0131549     1.68   0.105    -.0049547    .0490287
                2008  |   .0050899   .0094174     0.54   0.593    -.0142329    .0244127
                2009  |   .0139704   .0104437     1.34   0.192    -.0074584    .0353992
                2010  |   .0314573   .0123421     2.55   0.017     .0061335    .0567811
                2011  |   .0110864   .0114335     0.97   0.341    -.0123732    .0345459
                2012  |  -.0034852   .0133958    -0.26   0.797    -.0309713    .0240008
                2013  |  -.0042608   .0089519    -0.48   0.638    -.0226285    .0141069
                2014  |   .0025967   .0102753     0.25   0.802    -.0184865    .0236799
                2015  |    .011821   .0092191     1.28   0.211    -.0070951     .030737
                2016  |   .0073138   .0103701     0.71   0.487     -.013964    .0285915
                2017  |   .0309057   .0097498     3.17   0.004     .0109008    .0509105
                2018  |   .0304228   .0111616     2.73   0.011     .0075211    .0533245
                2019  |   .0447947   .0122621     3.65   0.001     .0196349    .0699545
                      |
                 nind |
                   2  |   .1101891   .0217702     5.06   0.000     .0655203     .154858
                   3  |  -.0312328   .0207434    -1.51   0.144    -.0737947    .0113292
                   4  |  -.1930289   .0269843    -7.15   0.000    -.2483961   -.1376617
                   5  |   .0771365   .0218686     3.53   0.002     .0322658    .1220072
                   6  |   -.061284   .0267331    -2.29   0.030    -.1161359   -.0064321
                   7  |  -.0769629   .0241404    -3.19   0.004     -.126495   -.0274308
                   8  |   -.176938   .0240516    -7.36   0.000    -.2262879   -.1275882
                   9  |  -.1054108   .0225131    -4.68   0.000    -.1516039   -.0592177
                  10  |  -.1226742   .0469454    -2.61   0.014    -.2189982   -.0263503
                  11  |   .1109463   .0247282     4.49   0.000     .0602083    .1616842
                      |
                 educ |   .0693532   .0048052    14.43   0.000     .0594937    .0792126
                exper |    .068973   .0029635    23.27   0.000     .0628923    .0750537
               exper2 |  -.0025351   .0002051   -12.36   0.000    -.0029561   -.0021142
               exper3 |   .0000507   5.79e-06     8.74   0.000     .0000388    .0000625
               exper4 |  -4.09e-07   5.62e-08    -7.28   0.000    -5.24e-07   -2.93e-07
                 edex |  -.0006535   .0001195    -5.47   0.000    -.0008986   -.0004084
                      |
                ee_cl |
                   2  |   .0630954   .0182239     3.46   0.002     .0257031    .1004877
                   3  |   .0500791   .0187681     2.67   0.013       .01157    .0885881
                   4  |   .0037919   .0243494     0.16   0.877    -.0461689    .0537527
                   5  |   .0197532   .0246026     0.80   0.429    -.0307273    .0702336
                   6  |   .0452763   .0177023     2.56   0.016     .0089543    .0815984
                   7  |   .0521057   .0228519     2.28   0.031     .0052175    .0989939
                   8  |    .003988   .0226197     0.18   0.861    -.0424238    .0503998
                   9  |   .0309045   .0254384     1.21   0.235    -.0212908    .0830999
                  10  |   .0332835    .021125     1.58   0.127    -.0100615    .0766285
                  11  |    .044673   .0223354     2.00   0.056    -.0011554    .0905015
                  12  |   .0482245   .0238918     2.02   0.054    -.0007975    .0972465
                  13  |   .0595513   .0230983     2.58   0.016     .0121576    .1069451
                  14  |   .0256081   .0221696     1.16   0.258    -.0198802    .0710964
                  15  |   .0406526   .0235287     1.73   0.095    -.0076243    .0889295
                  16  |   .0602186    .021476     2.80   0.009     .0161535    .1042837
                      |
                 marr |   .0638297   .0032864    19.42   0.000     .0570866    .0705727
                partt |  -.1234104   .0156392    -7.89   0.000    -.1554994   -.0913214
               public |  -.0483518   .0103562    -4.67   0.000     -.069601   -.0271026
                 cmsa |   .1159781   .0136526     8.49   0.000     .0879653    .1439908
                      |
                nocc2 |
                   2  |  -.0252069   .0119372    -2.11   0.044       -.0497   -.0007137
                   3  |  -.0121306   .0156142    -0.78   0.444    -.0441683    .0199071
                   4  |  -.0483618   .0114858    -4.21   0.000    -.0719287   -.0247949
                   5  |   .0338155    .015784     2.14   0.041     .0014294    .0662016
                   6  |  -.2412643   .0129221   -18.67   0.000    -.2677783   -.2147502
                   7  |  -.1888819   .0100566   -18.78   0.000    -.2095162   -.1682475
                   8  |   -.083956   .0315366    -2.66   0.013    -.1486638   -.0192483
                   9  |  -.2083886   .0087649   -23.78   0.000    -.2263727   -.1904045
                  10  |  -.1450005   .0073308   -19.78   0.000    -.1600421   -.1299588
                  11  |  -.0591993   .0088994    -6.65   0.000    -.0774593   -.0409394
                  12  |  -.1949403   .0079488   -24.52   0.000    -.2112498   -.1786307
                      |
              quarter |
                   2  |  -.0000132   .0027413    -0.00   0.996    -.0056379    .0056115
                   3  |   .0072335   .0034411     2.10   0.045      .000173    .0142939
                   4  |   .0124645   .0019488     6.40   0.000     .0084659    .0164631
                      |
                _cons |   .5342701   .0686322     7.78   0.000     .3934485    .6750918
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,270,346,772)

Linear regression                               Number of obs     =    142,651
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3496
                                                Root MSE          =     .35724

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.137194   .0123982   -11.07   0.000    -.1626331    -.111755
             treat_st |  -.0563016   .0319987    -1.76   0.090    -.1219576    .0093544
treat_stblackrelwhite |  -.0235872   .0188252    -1.25   0.221    -.0622134    .0150389
                      |
                state |
                  NH  |   .0336201   .0078939     4.26   0.000     .0174232     .049817
                  VT  |  -.0236224   .0043347    -5.45   0.000    -.0325165   -.0147283
                  MA  |   .0870483   .0123524     7.05   0.000     .0617032    .1123933
                  RI  |   .0283206    .012612     2.25   0.033     .0024428    .0541983
                  CT  |   .1339335   .0118855    11.27   0.000     .1095465    .1583206
                  NY  |   .1055666    .010043    10.51   0.000     .0849601     .126173
                  NJ  |   .1746631    .011747    14.87   0.000     .1505602     .198766
                  PA  |   .0003408   .0082824     0.04   0.967    -.0166532    .0173349
                  OH  |   .0009743   .0075977     0.13   0.899    -.0146149    .0165635
                  IN  |   .0228438   .0063767     3.58   0.001     .0097599    .0359277
                  IL  |   .0849168   .0081306    10.44   0.000     .0682341    .1015995
                  MI  |   .0871276   .0076923    11.33   0.000     .0713444    .1029108
                  WI  |   .0197756   .0069209     2.86   0.008     .0055751     .033976
                  MN  |   .0563194   .0101126     5.57   0.000     .0355702    .0770687
                  MO  |   .0197204   .0082083     2.40   0.023     .0028783    .0365625
                  DE  |   .0557309   .0049608    11.23   0.000     .0455521    .0659096
                  MD  |   .1134264   .0112341    10.10   0.000     .0903759     .136477
                  DC  |   .1277206   .0099491    12.84   0.000     .1073067    .1481346
                  KY  |  -.0212681   .0062172    -3.42   0.002    -.0340248   -.0085115
                  OK  |  -.0442424   .0142252    -3.11   0.004      -.07343   -.0150548
                  CO  |   .0054106   .0115343     0.47   0.643    -.0182558    .0290769
                  NM  |  -.0418701   .0091875    -4.56   0.000    -.0607212    -.023019
                  WA  |   .1010266   .0094925    10.64   0.000     .0815496    .1205037
                  OR  |   .0282302    .009201     3.07   0.005     .0093513    .0471092
                  CA  |    .174108   .0119307    14.59   0.000     .1496283    .1985877
                  AK  |     .23857   .0086468    27.59   0.000     .2208282    .2563119
                  HI  |   .0801238   .0107209     7.47   0.000     .0581263    .1021213
                      |
                 year |
                1990  |  -.0144239   .0056607    -2.55   0.017    -.0260388   -.0028091
                1991  |  -.0207847   .0064083    -3.24   0.003    -.0339334    -.007636
                1992  |  -.0170555   .0066689    -2.56   0.016    -.0307389   -.0033722
                1993  |  -.0182555   .0056768    -3.22   0.003    -.0299033   -.0066076
                1996  |  -.0101581   .0059955    -1.69   0.102    -.0224599    .0021438
                1997  |   .0002701   .0061411     0.04   0.965    -.0123303    .0128705
                1998  |   .0027868   .0069152     0.40   0.690    -.0114019    .0169756
                1999  |   .0120877   .0066841     1.81   0.082     -.001627    .0258023
                2000  |   .0108365   .0073093     1.48   0.150    -.0041609     .025834
                2001  |   .0166634   .0078229     2.13   0.042     .0006121    .0327148
                2002  |   .0361869   .0078723     4.60   0.000     .0200344    .0523395
                2003  |   .0444909   .0085654     5.19   0.000      .026916    .0620657
                2004  |   .0296582   .0073125     4.06   0.000     .0146542    .0446621
                2005  |   .0255891   .0076506     3.34   0.002     .0098915    .0412868
                2006  |   .0202441   .0112813     1.79   0.084    -.0029033    .0433915
                2007  |   .0210523    .013777     1.53   0.138    -.0072157    .0493203
                2008  |   .0080313   .0084935     0.95   0.353     -.009396    .0254586
                2009  |   .0293246   .0140418     2.09   0.046     .0005132    .0581361
                2010  |   .0480749   .0143908     3.34   0.002     .0185475    .0776023
                2011  |   .0249677   .0115845     2.16   0.040     .0011983    .0487372
                2012  |   .0078492   .0117095     0.67   0.508    -.0161768    .0318752
                2013  |   .0048599   .0072967     0.67   0.511    -.0101117    .0198315
                2014  |   .0068825   .0106509     0.65   0.524    -.0149712    .0287363
                2015  |   .0124504   .0093897     1.33   0.196    -.0068157    .0317164
                2016  |   .0064041   .0110869     0.58   0.568    -.0163445    .0291526
                2017  |   .0284394   .0106128     2.68   0.012     .0066638     .050215
                2018  |    .026332   .0109466     2.41   0.023     .0038713    .0487926
                2019  |   .0400766   .0130776     3.06   0.005     .0132437    .0669095
                      |
                 nind |
                   2  |     .11005   .0217688     5.06   0.000     .0653842    .1547158
                   3  |  -.0314373   .0207522    -1.51   0.141    -.0740174    .0111427
                   4  |  -.1931788   .0270174    -7.15   0.000    -.2486139   -.1377436
                   5  |   .0770417   .0218881     3.52   0.002     .0321309    .1219524
                   6  |  -.0613237   .0267244    -2.29   0.030    -.1161576   -.0064899
                   7  |  -.0771296   .0241891    -3.19   0.004    -.1267615   -.0274977
                   8  |  -.1770658   .0240777    -7.35   0.000    -.2264691   -.1276626
                   9  |  -.1054797   .0224937    -4.69   0.000     -.151633   -.0593264
                  10  |  -.1227048   .0469253    -2.61   0.014    -.2189875   -.0264221
                  11  |   .1107816   .0247559     4.47   0.000     .0599868    .1615764
                      |
                 educ |   .0693667   .0048064    14.43   0.000     .0595048    .0792286
                exper |   .0690275   .0029608    23.31   0.000     .0629526    .0751025
               exper2 |  -.0025374   .0002047   -12.40   0.000    -.0029573   -.0021174
               exper3 |   .0000507   5.79e-06     8.76   0.000     .0000389    .0000626
               exper4 |  -4.10e-07   5.62e-08    -7.29   0.000    -5.25e-07   -2.94e-07
                 edex |  -.0006555   .0001202    -5.45   0.000    -.0009022   -.0004088
                      |
                ee_cl |
                   2  |   .0631709   .0182204     3.47   0.002     .0257858     .100556
                   3  |   .0501663   .0187551     2.67   0.013      .011684    .0886485
                   4  |   .0038316   .0243599     0.16   0.876    -.0461508     .053814
                   5  |   .0198624   .0246992     0.80   0.428    -.0308161    .0705409
                   6  |   .0453241   .0177204     2.56   0.016     .0089648    .0816834
                   7  |   .0522269   .0228459     2.29   0.030     .0053511    .0991028
                   8  |   .0040747    .022593     0.18   0.858    -.0422823    .0504318
                   9  |   .0309423   .0255037     1.21   0.236    -.0213869    .0832716
                  10  |   .0331885   .0211631     1.57   0.128    -.0102346    .0766117
                  11  |   .0447277   .0223417     2.00   0.055    -.0011137    .0905691
                  12  |   .0484203   .0238485     2.03   0.052    -.0005127    .0973533
                  13  |    .059382   .0231664     2.56   0.016     .0118485    .1069155
                  14  |   .0255898   .0221802     1.15   0.259    -.0199202    .0710998
                  15  |   .0407223    .023517     1.73   0.095    -.0075306    .0889753
                  16  |    .060409   .0214391     2.82   0.009     .0164195    .1043984
                      |
                 marr |   .0638666   .0032744    19.50   0.000      .057148    .0705852
                partt |  -.1232143   .0155708    -7.91   0.000     -.155163   -.0912657
               public |  -.0482862   .0103899    -4.65   0.000    -.0696046   -.0269678
                 cmsa |   .1159498   .0136448     8.50   0.000      .087953    .1439467
                      |
                nocc2 |
                   2  |  -.0251825   .0119163    -2.11   0.044    -.0496327   -.0007323
                   3  |  -.0121185   .0156309    -0.78   0.445    -.0441905    .0199535
                   4  |  -.0483816    .011455    -4.22   0.000    -.0718854   -.0248778
                   5  |   .0337046   .0158506     2.13   0.043     .0011818    .0662273
                   6  |    -.24128   .0129564   -18.62   0.000    -.2678643   -.2146956
                   7  |  -.1888154   .0100753   -18.74   0.000    -.2094883   -.1681425
                   8  |  -.0842173   .0314738    -2.68   0.013    -.1487961   -.0196384
                   9  |   -.208329   .0087829   -23.72   0.000      -.22635   -.1903081
                  10  |  -.1449875   .0073294   -19.78   0.000    -.1600263   -.1299488
                  11  |  -.0592274   .0089168    -6.64   0.000    -.0775232   -.0409316
                  12  |  -.1949157   .0079666   -24.47   0.000    -.2112618   -.1785695
                      |
                unemp |   -.003615   .0026269    -1.38   0.180     -.009005     .001775
                      |
              quarter |
                   2  |  -7.52e-06   .0027398    -0.00   0.998    -.0056292    .0056142
                   3  |   .0073086   .0034205     2.14   0.042     .0002903    .0143269
                   4  |   .0126675   .0019472     6.51   0.000     .0086722    .0166629
                      |
                _cons |   .5505717   .0693928     7.93   0.000     .4081894     .692954
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,270,346,772)

Linear regression                               Number of obs     =    142,651
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3498
                                                Root MSE          =     .35718

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1382484   .0123188   -11.22   0.000    -.1635244   -.1129724
             treat_st |  -.0452957   .0196567    -2.30   0.029    -.0856279   -.0049636
treat_stblackrelwhite |  -.0153468   .0172892    -0.89   0.383    -.0508212    .0201277
                      |
                state |
                  NH  |  -.2869238    .011728   -24.46   0.000    -.3109876     -.26286
                  VT  |   -.388931    .019945   -19.50   0.000    -.4298549   -.3480072
                  MA  |  -.1990614   .0243474    -8.18   0.000    -.2490182   -.1491047
                  RI  |   -.291037   .0333771    -8.72   0.000    -.3595211    -.222553
                  CT  |  -.1396598    .026566    -5.26   0.000    -.1941688   -.0851509
                  NY  |  -.1134098   .0309889    -3.66   0.001    -.1769938   -.0498259
                  NJ  |  -.1585955   .0259633    -6.11   0.000    -.2118678   -.1053231
                  PA  |  -.2181441   .0250026    -8.72   0.000    -.2694452   -.1668431
                  OH  |   .0173472    .028083     0.62   0.542    -.0402743    .0749687
                  IN  |   -.100814   .0668762    -1.51   0.143    -.2380327    .0364046
                  IL  |  -.0276805    .021124    -1.31   0.201    -.0710234    .0156624
                  MI  |   .3788182   .0683541     5.54   0.000     .2385672    .5190693
                  WI  |  -.3134868   .0564091    -5.56   0.000    -.4292286   -.1977449
                  MN  |  -.1403875   .0271501    -5.17   0.000    -.1960948   -.0846802
                  MO  |   .0345697   .0201722     1.71   0.098    -.0068202    .0759596
                  DE  |   .2869544   .0245869    11.67   0.000     .2365063    .3374025
                  MD  |  -.3321536   .0324402   -10.24   0.000    -.3987153   -.2655919
                  DC  |  -.3337728   .0249453   -13.38   0.000    -.3849563   -.2825892
                  KY  |   .1146939    .039736     2.89   0.008     .0331623    .1962255
                  OK  |  -.5103886   .0965426    -5.29   0.000    -.7084777   -.3122995
                  CO  |  -.0453712   .0277847    -1.63   0.114    -.1023806    .0116383
                  NM  |  -.4059906     .02415   -16.81   0.000    -.4555423   -.3564388
                  WA  |   -.040398    .021412    -1.89   0.070    -.0843319    .0035359
                  OR  |   .0060937   .0163419     0.37   0.712     -.027437    .0396244
                  CA  |    .131979   .0290949     4.54   0.000     .0722812    .1916769
                  AK  |   .6256531   .0264015    23.70   0.000     .5714817    .6798245
                  HI  |  -.1361886    .023945    -5.69   0.000    -.1853197   -.0870575
                      |
        state#c.lyear |
                  ME  |   .0002788   .0002874     0.97   0.341    -.0003108    .0008685
                  NH  |   .0033476   .0003548     9.43   0.000     .0026195    .0040757
                  VT  |   .0038348   .0002298    16.69   0.000     .0033634    .0043063
                  MA  |   .0030908   .0002018    15.32   0.000     .0026767    .0035048
                  RI  |   .0034237   .0001523    22.48   0.000     .0031111    .0037362
                  CT  |   .0029689    .000242    12.27   0.000     .0024723    .0034654
                  NY  |   .0024447   .0001219    20.05   0.000     .0021946    .0026948
                  NJ  |   .0035515   .0002342    15.16   0.000     .0030709     .004032
                  PA  |   .0024345   .0001675    14.53   0.000     .0020908    .0027782
                  OH  |   .0001285   .0002165     0.59   0.558    -.0003156    .0005727
                  IN  |   .0014914    .000644     2.32   0.028     .0001699    .0028128
                  IL  |   .0014025   .0002096     6.69   0.000     .0009725    .0018325
                  MI  |  -.0026451   .0006076    -4.35   0.000    -.0038917   -.0013984
                  WI  |   .0035682   .0004559     7.83   0.000     .0026328    .0045036
                  MN  |    .002212   .0001344    16.45   0.000     .0019361    .0024878
                  MO  |   .0001563   .0001591     0.98   0.335    -.0001701    .0004827
                  DE  |  -.0022275   .0003358    -6.63   0.000    -.0029166   -.0015384
                  MD  |   .0046221    .000192    24.07   0.000     .0042282    .0050161
                  DC  |    .004831   .0002563    18.85   0.000     .0043052    .0053569
                  KY  |  -.0010265   .0003809    -2.69   0.012    -.0018081   -.0002449
                  OK  |   .0048316   .0009878     4.89   0.000     .0028049    .0068583
                  CO  |   .0007934   .0001477     5.37   0.000     .0004905    .0010964
                  NM  |   .0038007   .0004055     9.37   0.000     .0029687    .0046327
                  WA  |   .0016816   .0001622    10.37   0.000     .0013489    .0020144
                  OR  |   .0005197   .0002362     2.20   0.037     .0000351    .0010042
                  CA  |   .0007114   .0001501     4.74   0.000     .0004033    .0010194
                  AK  |  -.0035081   .0001363   -25.74   0.000    -.0037877   -.0032284
                  HI  |   .0023992   .0002415     9.93   0.000     .0019036    .0028947
                      |
                 nind |
                   2  |   .1111464   .0222289     5.00   0.000     .0655364    .1567563
                   3  |   -.032404   .0206655    -1.57   0.129     -.074806    .0099981
                   4  |  -.1926582   .0274364    -7.02   0.000     -.248953   -.1363634
                   5  |   .0778973   .0222741     3.50   0.002     .0321947    .1235999
                   6  |  -.0610089   .0274708    -2.22   0.035    -.1173744   -.0046435
                   7  |  -.0772542   .0247736    -3.12   0.004    -.1280854   -.0264229
                   8  |  -.1758335   .0244236    -7.20   0.000    -.2259466   -.1257204
                   9  |  -.1036733   .0227874    -4.55   0.000    -.1504291   -.0569175
                  10  |  -.1229788   .0473353    -2.60   0.015    -.2201027   -.0258549
                  11  |   .1112645   .0252825     4.40   0.000      .059389      .16314
                      |
                 educ |   .0684747   .0047637    14.37   0.000     .0587003    .0782491
                exper |   .0686744   .0028279    24.29   0.000     .0628721    .0744767
               exper2 |  -.0025094   .0001984   -12.65   0.000    -.0029164   -.0021024
               exper3 |   .0000497   5.65e-06     8.80   0.000     .0000381    .0000613
               exper4 |  -4.00e-07   5.48e-08    -7.28   0.000    -5.12e-07   -2.87e-07
                 edex |  -.0006449   .0001209    -5.33   0.000     -.000893   -.0003968
                      |
                ee_cl |
                   2  |   .0626579   .0184631     3.39   0.002     .0247747    .1005411
                   3  |   .0504882   .0189831     2.66   0.013     .0115382    .0894383
                   4  |   .0054183   .0251586     0.22   0.831    -.0462028    .0570395
                   5  |   .0181103   .0249871     0.72   0.475    -.0331591    .0693796
                   6  |   .0433938   .0181055     2.40   0.024     .0062445    .0805431
                   7  |   .0517886   .0231872     2.23   0.034     .0042123    .0993649
                   8  |    .005349   .0232151     0.23   0.820    -.0422844    .0529823
                   9  |   .0280613   .0260507     1.08   0.291    -.0253903    .0815129
                  10  |   .0323703   .0217597     1.49   0.148    -.0122768    .0770175
                  11  |   .0444118   .0228032     1.95   0.062    -.0023766    .0912002
                  12  |    .049517   .0245635     2.02   0.054    -.0008831    .0999172
                  13  |   .0581597   .0242103     2.40   0.023     .0084842    .1078352
                  14  |   .0254999   .0228069     1.12   0.273     -.021296    .0722959
                  15  |   .0427045   .0241167     1.77   0.088    -.0067788    .0921878
                  16  |   .0625845   .0221507     2.83   0.009      .017135     .108034
                      |
                 marr |   .0639713   .0032236    19.84   0.000     .0573571    .0705855
                partt |  -.1226112   .0154936    -7.91   0.000    -.1544014   -.0908209
               public |  -.0483582   .0104144    -4.64   0.000    -.0697268   -.0269895
                 cmsa |   .1153483   .0136115     8.47   0.000     .0874198    .1432769
                      |
                nocc2 |
                   2  |  -.0242851   .0119214    -2.04   0.052    -.0487458    .0001757
                   3  |   -.011777   .0156502    -0.75   0.458    -.0438886    .0203345
                   4  |  -.0484822   .0115501    -4.20   0.000    -.0721812   -.0247833
                   5  |    .034008   .0156936     2.17   0.039     .0018073    .0662086
                   6  |   -.241038   .0129735   -18.58   0.000    -.2676573   -.2144186
                   7  |  -.1896031   .0100746   -18.82   0.000    -.2102744   -.1689318
                   8  |  -.0840628   .0317222    -2.65   0.013    -.1491514   -.0189742
                   9  |  -.2083821    .008783   -23.73   0.000    -.2264034   -.1903609
                  10  |  -.1449342   .0073538   -19.71   0.000    -.1600229   -.1298455
                  11  |  -.0593445     .00886    -6.70   0.000    -.0775237   -.0411652
                  12  |  -.1950305   .0078829   -24.74   0.000    -.2112049   -.1788562
                      |
                unemp |  -.0042015   .0013604    -3.09   0.005    -.0069927   -.0014102
                      |
              quarter |
                   2  |  -.0001021   .0026736    -0.04   0.970    -.0055878    .0053836
                   3  |   .0068531   .0035339     1.94   0.063    -.0003979    .0141041
                   4  |   .0122568   .0019408     6.32   0.000     .0082745    .0162391
                      |
                _cons |   .5451316   .0687699     7.93   0.000     .4040275    .6862358
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,010,750,007)

Linear regression                               Number of obs     =    117,676
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4375
                                                Root MSE          =     .36862

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.049857   .0099921    -4.99   0.000    -.0703591   -.0293549
             treat_st |  -.0708262   .0169545    -4.18   0.000    -.1056139   -.0360385
treat_stblackrelwhite |   .0415903   .0278858     1.49   0.147    -.0156267    .0988073
                      |
                state |
                  NH  |   .0467141   .0051799     9.02   0.000     .0360858    .0573425
                  VT  |  -.0074135   .0019472    -3.81   0.001    -.0114089   -.0034181
                  MA  |   .1306113   .0111902    11.67   0.000     .1076508    .1535717
                  RI  |   .1355913   .0122218    11.09   0.000     .1105143    .1606684
                  CT  |   .1677354    .011333    14.80   0.000      .144482    .1909888
                  NY  |   .1223717   .0099963    12.24   0.000      .101861    .1428823
                  NJ  |   .2099938     .01134    18.52   0.000     .1867261    .2332616
                  PA  |   .0362564   .0092802     3.91   0.001      .017215    .0552978
                  OH  |   .0155131   .0092522     1.68   0.105    -.0034708     .034497
                  IN  |   .0020161   .0087445     0.23   0.819    -.0159261    .0199583
                  IL  |   .0363281   .0094275     3.85   0.001     .0169845    .0556716
                  MI  |   .0864133   .0098202     8.80   0.000     .0662639    .1065627
                  WI  |   .0451411   .0075869     5.95   0.000     .0295741    .0607081
                  MN  |   .0870514   .0089626     9.71   0.000     .0686617    .1054411
                  MO  |  -.0431284   .0094845    -4.55   0.000     -.062589   -.0236677
                  DE  |   .1442071   .0073365    19.66   0.000     .1291538    .1592605
                  MD  |   .1623745   .0109973    14.76   0.000     .1398098    .1849392
                  DC  |   .1845797   .0127068    14.53   0.000     .1585074    .2106519
                  KY  |  -.0380079   .0076931    -4.94   0.000    -.0537928   -.0222231
                  OK  |  -.0971936   .0099282    -9.79   0.000    -.1175646   -.0768226
                  CO  |   .0055658   .0112175     0.50   0.624    -.0174507    .0285822
                  NM  |  -.0695926   .0068051   -10.23   0.000    -.0835554   -.0556298
                  WA  |   .0856409   .0107036     8.00   0.000     .0636789    .1076029
                  OR  |   .0152774   .0093158     1.64   0.113     -.003837    .0343919
                  CA  |   .1897286   .0108837    17.43   0.000      .167397    .2120602
                  AK  |   .2260924   .0054107    41.79   0.000     .2149907    .2371941
                  HI  |   .0763695   .0093546     8.16   0.000     .0571754    .0955636
                      |
                 year |
                1990  |  -.0002485   .0057155    -0.04   0.966    -.0119758    .0114788
                1991  |  -.0039677   .0075477    -0.53   0.603    -.0194542    .0115189
                1992  |   .0065226   .0096586     0.68   0.505    -.0132951    .0263403
                1993  |   .0163351   .0083623     1.95   0.061     -.000823    .0334932
                1996  |   .0253472   .0090154     2.81   0.009      .006849    .0438453
                1997  |   .0298024   .0076485     3.90   0.001     .0141089    .0454959
                1998  |   .0447516   .0069854     6.41   0.000     .0304187    .0590846
                1999  |    .044279   .0072476     6.11   0.000     .0294081    .0591499
                2000  |   .0376627   .0080458     4.68   0.000      .021154    .0541714
                2001  |   .0551208   .0087541     6.30   0.000     .0371589    .0730827
                2002  |   .0645539   .0081768     7.89   0.000     .0477765    .0813313
                2003  |   .0525164   .0069777     7.53   0.000     .0381992    .0668335
                2004  |   .0531989   .0085295     6.24   0.000     .0356978    .0707001
                2005  |   .0421281    .010691     3.94   0.001     .0201919    .0640643
                2006  |   .0401394   .0087696     4.58   0.000     .0221456    .0581331
                2007  |    .033615   .0090541     3.71   0.001     .0150375    .0521926
                2008  |   .0312066   .0139421     2.24   0.034     .0025998    .0598133
                2009  |   .0568531   .0121136     4.69   0.000      .031998    .0817081
                2010  |   .0622993   .0129884     4.80   0.000     .0356493    .0889494
                2011  |   .0357331   .0117193     3.05   0.005      .011687    .0597791
                2012  |   .0117295   .0116536     1.01   0.323    -.0121817    .0356406
                2013  |   .0268249    .009215     2.91   0.007     .0079173    .0457325
                2014  |   .0096428    .020593     0.47   0.643    -.0326105    .0518961
                2015  |   .0242862   .0157128     1.55   0.134    -.0079537    .0565262
                2016  |   .0321719   .0094213     3.41   0.002     .0128409    .0515029
                2017  |   .0217596    .012138     1.79   0.084    -.0031454    .0466646
                2018  |   .0236234    .010788     2.19   0.037     .0014883    .0457585
                2019  |   .0275143   .0097676     2.82   0.009     .0074729    .0475556
                      |
                 nind |
                   2  |   .0891235    .064892     1.37   0.181    -.0440239    .2222708
                   3  |   .0686849   .0474619     1.45   0.159    -.0286988    .1660687
                   4  |  -.2132806   .0632946    -3.37   0.002    -.3431503   -.0834109
                   5  |   .1432341   .0543479     2.64   0.014     .0317213    .2547468
                   6  |  -.0254129   .0595855    -0.43   0.673    -.1476723    .0968464
                   7  |  -.0811272   .0575787    -1.41   0.170     -.199269    .0370146
                   8  |  -.1101387   .0612728    -1.80   0.083    -.2358602    .0155827
                   9  |  -.1439753   .0554359    -2.60   0.015    -.2577204   -.0302302
                  10  |  -.1180475   .0775728    -1.52   0.140    -.2772138    .0411188
                  11  |    .027321   .0584751     0.47   0.644      -.09266     .147302
                      |
                 educ |    .105199   .0064181    16.39   0.000     .0920302    .1183677
                exper |   .0509153   .0038513    13.22   0.000     .0430131    .0588175
               exper2 |  -.0017458    .000283    -6.17   0.000    -.0023264   -.0011652
               exper3 |   .0000303   9.67e-06     3.13   0.004     .0000105    .0000502
               exper4 |  -2.02e-07   1.08e-07    -1.86   0.074    -4.24e-07    2.09e-08
                 edex |  -.0004422    .000148    -2.99   0.006    -.0007457   -.0001386
                      |
                ee_cl |
                   2  |  -.0681466   .0155274    -4.39   0.000    -.1000063   -.0362869
                   3  |  -.1301441   .0197093    -6.60   0.000    -.1705842    -.089704
                   4  |  -.1939316    .035588    -5.45   0.000    -.2669522   -.1209111
                   5  |  -.0774532   .0268044    -2.89   0.008    -.1324513   -.0224551
                   6  |  -.1093454   .0186084    -5.88   0.000    -.1475266   -.0711641
                   7  |  -.1562142   .0237593    -6.57   0.000    -.2049642   -.1074641
                   8  |   -.186086   .0381819    -4.87   0.000    -.2644288   -.1077432
                   9  |  -.0617092   .0172535    -3.58   0.001    -.0971105   -.0263078
                  10  |  -.1346312   .0255886    -5.26   0.000    -.1871346   -.0821278
                  11  |  -.1754896    .026461    -6.63   0.000     -.229783   -.1211962
                  12  |  -.1706394   .0336092    -5.08   0.000    -.2395997   -.1016791
                  13  |  -.0112833   .0236976    -0.48   0.638    -.0599066    .0373401
                  14  |  -.1291943   .0227969    -5.67   0.000    -.1759697   -.0824189
                  15  |  -.1419707   .0279602    -5.08   0.000    -.1993403   -.0846011
                  16  |  -.1464169   .0331271    -4.42   0.000    -.2143881   -.0784458
                      |
                 marr |   .0078494   .0043872     1.79   0.085    -.0011524    .0168511
                partt |  -.0747569   .0063571   -11.76   0.000    -.0878006   -.0617133
               public |   .0207524   .0152249     1.36   0.184    -.0104865    .0519912
                 cmsa |   .1241096   .0118377    10.48   0.000     .0998207    .1483984
                      |
                nocc2 |
                   2  |  -.0353765   .0109082    -3.24   0.003    -.0577584   -.0129947
                   3  |   -.017886   .0162012    -1.10   0.279    -.0511281     .015356
                   4  |  -.0914774    .010666    -8.58   0.000    -.1133623   -.0695926
                   5  |   .1569498   .0172256     9.11   0.000     .1216058    .1922938
                   6  |  -.2262965   .0113276   -19.98   0.000    -.2495388   -.2030542
                   7  |  -.2361752   .0272113    -8.68   0.000    -.2920081   -.1803423
                   8  |  -.0920119   .0584758    -1.57   0.127    -.2119944    .0279706
                   9  |  -.2881034   .0168043   -17.14   0.000    -.3225829   -.2536239
                  10  |  -.2577626   .0220015   -11.72   0.000    -.3029059   -.2126192
                  11  |   .0175843   .0239184     0.74   0.469    -.0314922    .0666608
                  12  |  -.2362079   .0159519   -14.81   0.000    -.2689385   -.2034772
                      |
              quarter |
                   2  |   .0041884   .0030993     1.35   0.188    -.0021708    .0105476
                   3  |   .0149109   .0029918     4.98   0.000     .0087722    .0210497
                   4  |   .0195627   .0034191     5.72   0.000     .0125473     .026578
                      |
                _cons |    .133959   .0655483     2.04   0.051    -.0005351    .2684531
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,010,750,007)

Linear regression                               Number of obs     =    117,676
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4375
                                                Root MSE          =     .36862

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.049868   .0099863    -4.99   0.000    -.0703582   -.0293778
             treat_st |  -.0714407   .0175704    -4.07   0.000    -.1074923   -.0353891
treat_stblackrelwhite |   .0414515   .0278489     1.49   0.148    -.0156897    .0985926
                      |
                state |
                  NH  |   .0442916   .0063448     6.98   0.000      .031273    .0573101
                  VT  |   -.009681   .0032137    -3.01   0.006    -.0162748   -.0030871
                  MA  |   .1306722   .0111749    11.69   0.000     .1077432    .1536012
                  RI  |   .1377198   .0120151    11.46   0.000     .1130668    .1623728
                  CT  |   .1680506    .011229    14.97   0.000     .1450105    .1910907
                  NY  |     .12383   .0098065    12.63   0.000     .1037088    .1439513
                  NJ  |   .2110592   .0110839    19.04   0.000     .1883168    .2338016
                  PA  |   .0370206     .00921     4.02   0.000     .0181231     .055918
                  OH  |   .0167695   .0091794     1.83   0.079    -.0020651    .0356041
                  IN  |    .002093   .0087623     0.24   0.813    -.0158858    .0200718
                  IL  |   .0383601   .0092681     4.14   0.000     .0193435    .0573766
                  MI  |   .0895641   .0105172     8.52   0.000     .0679847    .1111436
                  WI  |   .0442712   .0075896     5.83   0.000     .0286986    .0598437
                  MN  |   .0853587   .0091486     9.33   0.000     .0665872    .1041301
                  MO  |  -.0427092   .0094557    -4.52   0.000    -.0621107   -.0233077
                  DE  |   .1429104   .0070938    20.15   0.000     .1283552    .1574656
                  MD  |    .161766   .0112221    14.41   0.000     .1387402    .1847917
                  DC  |   .1880916   .0121805    15.44   0.000     .1630993    .2130839
                  KY  |  -.0363071   .0079325    -4.58   0.000    -.0525833    -.020031
                  OK  |  -.0978907   .0099723    -9.82   0.000    -.1183522   -.0774293
                  CO  |   .0047386   .0114381     0.41   0.682    -.0187305    .0282077
                  NM  |  -.0682539   .0065131   -10.48   0.000    -.0816177     -.05489
                  WA  |   .0873738   .0106791     8.18   0.000     .0654621    .1092856
                  OR  |   .0176532   .0092612     1.91   0.067    -.0013492    .0366556
                  CA  |    .192924   .0106279    18.15   0.000     .1711173    .2147306
                  AK  |   .2300899   .0063003    36.52   0.000     .2171628    .2430171
                  HI  |    .073995   .0096594     7.66   0.000     .0541755    .0938145
                      |
                 year |
                1990  |   .0006682   .0062989     0.11   0.916     -.012256    .0135924
                1991  |  -.0002288   .0097841    -0.02   0.982    -.0203041    .0198465
                1992  |   .0116948   .0139394     0.84   0.409    -.0169066    .0402962
                1993  |   .0204108   .0118426     1.72   0.096    -.0038883    .0447099
                1996  |   .0261077   .0098386     2.65   0.013     .0059205    .0462949
                1997  |   .0297037    .007927     3.75   0.001      .013439    .0459685
                1998  |   .0437632   .0070193     6.23   0.000     .0293609    .0581656
                1999  |   .0426692   .0072179     5.91   0.000     .0278594     .057479
                2000  |   .0356253   .0078599     4.53   0.000     .0194981    .0517526
                2001  |   .0544142   .0086522     6.29   0.000     .0366613    .0721671
                2002  |   .0660171   .0081167     8.13   0.000     .0493629    .0826712
                2003  |   .0546051   .0073621     7.42   0.000     .0394992    .0697109
                2004  |   .0544228   .0090842     5.99   0.000     .0357836    .0730619
                2005  |   .0423193   .0107736     3.93   0.001     .0202137    .0644248
                2006  |   .0396497   .0088647     4.47   0.000     .0214608    .0578387
                2007  |   .0331544   .0090707     3.66   0.001     .0145428     .051766
                2008  |   .0329173   .0147969     2.22   0.035     .0025567     .063278
                2009  |   .0651611   .0184651     3.53   0.002     .0272739    .1030484
                2010  |   .0712637   .0188734     3.78   0.001     .0325386    .1099887
                2011  |   .0433049   .0170205     2.54   0.017     .0083818     .078228
                2012  |    .017962    .015185     1.18   0.247     -.013195     .049119
                2013  |   .0318418   .0133536     2.38   0.024     .0044426    .0592411
                2014  |   .0120688   .0221267     0.55   0.590    -.0333313     .057469
                2015  |   .0247496   .0161249     1.53   0.136    -.0083361    .0578352
                2016  |   .0318037   .0093226     3.41   0.002     .0126753     .050932
                2017  |   .0205436   .0124179     1.65   0.110    -.0049359    .0460231
                2018  |   .0215922   .0099295     2.17   0.039     .0012186    .0419657
                2019  |   .0250605   .0090034     2.78   0.010     .0065872    .0435339
                      |
                 nind |
                   2  |   .0886481   .0650103     1.36   0.184     -.044742    .2220381
                   3  |   .0682891   .0475758     1.44   0.163    -.0293284    .1659066
                   4  |  -.2136205   .0633928    -3.37   0.002    -.3436918   -.0835492
                   5  |   .1429105   .0545074     2.62   0.014     .0310706    .2547503
                   6  |  -.0257805   .0596949    -0.43   0.669    -.1482644    .0967034
                   7  |  -.0815108   .0577363    -1.41   0.169    -.1999759    .0369542
                   8  |  -.1104591    .061427    -1.80   0.083     -.236497    .0155787
                   9  |  -.1443319   .0555681    -2.60   0.015    -.2583482   -.0303157
                  10  |  -.1182944   .0777112    -1.52   0.140    -.2777447    .0411558
                  11  |   .0269209    .058604     0.46   0.650    -.0933246    .1471664
                      |
                 educ |   .1051931   .0064224    16.38   0.000     .0920154    .1183709
                exper |   .0509422   .0038577    13.21   0.000     .0430269    .0588576
               exper2 |  -.0017472   .0002829    -6.18   0.000    -.0023278   -.0011667
               exper3 |   .0000304   9.67e-06     3.14   0.004     .0000105    .0000502
               exper4 |  -2.02e-07   1.08e-07    -1.87   0.073    -4.25e-07    2.02e-08
                 edex |  -.0004425   .0001483    -2.98   0.006    -.0007468   -.0001382
                      |
                ee_cl |
                   2  |   -.068119   .0155069    -4.39   0.000    -.0999366   -.0363014
                   3  |   -.130098   .0196727    -6.61   0.000     -.170463    -.089733
                   4  |  -.1938694   .0355494    -5.45   0.000    -.2668108   -.1209279
                   5  |  -.0775253   .0267645    -2.90   0.007    -.1324415   -.0226091
                   6  |   -.109332   .0185774    -5.89   0.000    -.1474497   -.0712143
                   7  |   -.156198   .0237039    -6.59   0.000    -.2048343   -.1075616
                   8  |  -.1860311    .038134    -4.88   0.000    -.2642756   -.1077866
                   9  |  -.0618609   .0172342    -3.59   0.001    -.0972226   -.0264992
                  10  |  -.1346758   .0255591    -5.27   0.000    -.1871187   -.0822328
                  11  |  -.1755226   .0264527    -6.64   0.000    -.2297991   -.1212461
                  12  |  -.1706019   .0335654    -5.08   0.000    -.2394723   -.1017315
                  13  |  -.0113752   .0237075    -0.48   0.635    -.0600189    .0372684
                  14  |  -.1292081   .0227755    -5.67   0.000    -.1759396   -.0824766
                  15  |  -.1419966   .0279465    -5.08   0.000     -.199338   -.0846552
                  16  |  -.1463822   .0330948    -4.42   0.000     -.214287   -.0784773
                      |
                 marr |    .007847   .0043864     1.79   0.085    -.0011532    .0168472
                partt |  -.0746998    .006339   -11.78   0.000    -.0877063   -.0616933
               public |   .0208135   .0152351     1.37   0.183    -.0104463    .0520734
                 cmsa |   .1240807   .0118218    10.50   0.000     .0998244     .148337
                      |
                nocc2 |
                   2  |  -.0353342   .0109268    -3.23   0.003    -.0577542   -.0129143
                   3  |   -.017801   .0162096    -1.10   0.282    -.0510605    .0154584
                   4  |  -.0914328   .0106512    -8.58   0.000    -.1132873   -.0695783
                   5  |   .1569776   .0172011     9.13   0.000     .1216839    .1922713
                   6  |  -.2262545   .0113342   -19.96   0.000    -.2495103   -.2029987
                   7  |  -.2361296   .0271906    -8.68   0.000    -.2919202    -.180339
                   8  |  -.0919074   .0584682    -1.57   0.128    -.2118742    .0280594
                   9  |  -.2880613   .0168029   -17.14   0.000     -.322538   -.2535846
                  10  |  -.2577585   .0220021   -11.72   0.000    -.3029031   -.2126138
                  11  |   .0177296   .0238786     0.74   0.464    -.0312653    .0667246
                  12  |  -.2361748   .0159311   -14.82   0.000    -.2688627   -.2034869
                      |
                unemp |  -.0019355   .0019333    -1.00   0.326    -.0059022    .0020312
                      |
              quarter |
                   2  |   .0042208   .0031048     1.36   0.185    -.0021497    .0105914
                   3  |   .0149327   .0030022     4.97   0.000     .0087726    .0210928
                   4  |   .0196233   .0034472     5.69   0.000     .0125501    .0266965
                      |
                _cons |   .1427849   .0598769     2.38   0.024     .0199276    .2656422
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,010,750,007)

Linear regression                               Number of obs     =    117,676
                                                F(26, 27)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4370
                                                Root MSE          =     .36877

                                          (Std. Err. adjusted for 28 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0509681    .009664    -5.27   0.000    -.0707969   -.0311393
             treat_st |   -.059997   .0218061    -2.75   0.010    -.1047393   -.0152547
treat_stblackrelwhite |    .047676   .0289879     1.64   0.112    -.0118023    .1071544
                      |
                state |
                  NH  |  -.0945612   .0167576    -5.64   0.000    -.1289448   -.0601775
                  VT  |  -.2774143   .0191015   -14.52   0.000    -.3166074   -.2382213
                  MA  |  -.2539744   .0193939   -13.10   0.000    -.2937675   -.2141814
                  RI  |  -.3885028   .0243966   -15.92   0.000    -.4385606   -.3384451
                  CT  |   .0607412   .0230136     2.64   0.014     .0135211    .1079612
                  NY  |  -.1614794   .0207114    -7.80   0.000    -.2039757   -.1189831
                  NJ  |  -.2251718   .0227905    -9.88   0.000     -.271934   -.1784096
                  PA  |  -.1770577   .0215168    -8.23   0.000    -.2212065   -.1329089
                  OH  |  -.0270316   .0192738    -1.40   0.172    -.0665781     .012515
                  IN  |  -.1961449   .0837816    -2.34   0.027    -.3680505   -.0242394
                  IL  |   .0193921   .0178718     1.09   0.287    -.0172778     .056062
                  MI  |   .2087132   .0649094     3.22   0.003     .0755301    .3418964
                  WI  |  -.2005746   .0467472    -4.29   0.000    -.2964919   -.1046572
                  MN  |   .0097862   .0201233     0.49   0.631    -.0315034    .0510758
                  MO  |   .1611938    .022159     7.27   0.000     .1157273    .2066602
                  DE  |   .1089709   .0403114     2.70   0.012     .0262587    .1916832
                  MD  |  -.3419953   .0251093   -13.62   0.000    -.3935153   -.2904753
                  DC  |  -.3946552   .0248474   -15.88   0.000    -.4456378   -.3436726
                  KY  |  -.0089199   .0389609    -0.23   0.821     -.088861    .0710212
                  OK  |   .1368838   .1046604     1.31   0.202    -.0778617    .3516292
                  CO  |   .1327868   .0241073     5.51   0.000     .0833228    .1822509
                  NM  |  -.0886076   .0231072    -3.83   0.001    -.1360197   -.0411955
                  WA  |   .0359586   .0184232     1.95   0.061    -.0018426    .0737598
                  OR  |  -.2370311   .0161607   -14.67   0.000    -.2701902    -.203872
                  CA  |   .0390438   .0252535     1.55   0.134    -.0127721    .0908597
                  AK  |   .3203295   .0298972    10.71   0.000     .2589855    .3816734
                  HI  |  -.1243028   .0471846    -2.63   0.014    -.2211176    -.027488
                      |
        state#c.lyear |
                  ME  |  -.0007454   .0002434    -3.06   0.005    -.0012447   -.0002461
                  NH  |   .0006107    .000354     1.73   0.096    -.0001157     .001337
                  VT  |   .0018492   .0001392    13.29   0.000     .0015636    .0021347
                  MA  |    .002948   .0001707    17.27   0.000     .0025978    .0032982
                  RI  |   .0043063    .000179    24.05   0.000     .0039389    .0046736
                  CT  |   .0002888   .0002621     1.10   0.280     -.000249    .0008267
                  NY  |   .0020063   .0001391    14.42   0.000     .0017209    .0022918
                  NJ  |    .003457   .0002599    13.30   0.000     .0029237    .0039903
                  PA  |   .0013261   .0002349     5.64   0.000     .0008441    .0018082
                  OH  |  -.0003319   .0002282    -1.45   0.157    -.0008001    .0001364
                  IN  |    .001182   .0009542     1.24   0.226    -.0007759    .0031398
                  IL  |  -.0005853   .0002532    -2.31   0.029    -.0011047   -.0000659
                  MI  |  -.0019707   .0006981    -2.82   0.009    -.0034031   -.0005384
                  WI  |   .0016478    .000548     3.01   0.006     .0005234    .0027722
                  MN  |   7.74e-07   .0002049     0.00   0.997    -.0004196    .0004211
                  MO  |  -.0027306   .0003091    -8.83   0.000    -.0033649   -.0020963
                  DE  |  -.0004981   .0005596    -0.89   0.381    -.0016464    .0006501
                  MD  |   .0041238   .0001944    21.21   0.000     .0037248    .0045227
                  DC  |    .004894    .000198    24.71   0.000     .0044877    .0053004
                  KY  |  -.0010251   .0004854    -2.11   0.044    -.0020211    -.000029
                  OK  |  -.0031188    .001178    -2.65   0.013    -.0055358   -.0007018
                  CO  |  -.0019307   .0001417   -13.62   0.000    -.0022215     -.00164
                  NM  |   -.000492   .0001456    -3.38   0.002    -.0007908   -.0001932
                  WA  |  -.0002624   .0001533    -1.71   0.098    -.0005769    .0000521
                  OR  |   .0016941   .0001559    10.87   0.000     .0013742     .002014
                  CA  |   .0007109   .0001159     6.13   0.000      .000473    .0009488
                  AK  |  -.0016731   .0001032   -16.21   0.000    -.0018848   -.0014613
                  HI  |   .0011855   .0004409     2.69   0.012     .0002808    .0020901
                      |
                 nind |
                   2  |   .0902279   .0659434     1.37   0.183    -.0450768    .2255325
                   3  |   .0654137   .0476685     1.37   0.181    -.0323941    .1632214
                   4  |  -.2139876   .0642482    -3.33   0.003    -.3458139   -.0821612
                   5  |   .1418854   .0551856     2.57   0.016     .0286539    .2551169
                   6  |  -.0248618   .0599206    -0.41   0.681    -.1478087    .0980852
                   7  |  -.0811873    .058646    -1.38   0.178    -.2015191    .0391444
                   8  |  -.1098275   .0623194    -1.76   0.089    -.2376963    .0180414
                   9  |  -.1431871   .0563679    -2.54   0.017    -.2588445   -.0275297
                  10  |  -.1176993   .0788618    -1.49   0.147    -.2795104    .0441117
                  11  |   .0272953   .0594373     0.46   0.650      -.09466    .1492506
                      |
                 educ |   .1037331    .006358    16.32   0.000     .0906875    .1167786
                exper |   .0500909   .0038063    13.16   0.000     .0422811    .0579008
               exper2 |  -.0016683   .0002861    -5.83   0.000    -.0022552   -.0010813
               exper3 |   .0000282   9.80e-06     2.88   0.008     8.08e-06    .0000483
               exper4 |  -1.85e-07   1.10e-07    -1.68   0.104    -4.11e-07    4.09e-08
                 edex |  -.0004444   .0001451    -3.06   0.005    -.0007421   -.0001467
                      |
                ee_cl |
                   2  |  -.0702983   .0162906    -4.32   0.000    -.1037239   -.0368727
                   3  |  -.1281349   .0196043    -6.54   0.000    -.1683597   -.0879102
                   4  |  -.1870443    .035604    -5.25   0.000    -.2600976   -.1139909
                   5  |  -.0827686   .0259633    -3.19   0.004    -.1360408   -.0294963
                   6  |  -.1134891   .0187948    -6.04   0.000    -.1520528   -.0749254
                   7  |  -.1546613   .0236458    -6.54   0.000    -.2031786   -.1061441
                   8  |  -.1812197   .0381128    -4.75   0.000    -.2594206   -.1030187
                   9  |  -.0676684   .0183955    -3.68   0.001    -.1054129   -.0299239
                  10  |  -.1361647    .025566    -5.33   0.000    -.1886218   -.0837076
                  11  |  -.1725672   .0268362    -6.43   0.000    -.2276305   -.1175039
                  12  |  -.1643633   .0340884    -4.82   0.000     -.234307   -.0944196
                  13  |  -.0157786   .0236575    -0.67   0.510    -.0643198    .0327626
                  14  |  -.1290241   .0230907    -5.59   0.000    -.1764023   -.0816459
                  15  |  -.1393737   .0284694    -4.90   0.000     -.197788   -.0809593
                  16  |  -.1407246   .0336516    -4.18   0.000     -.209772   -.0716772
                      |
                 marr |    .007436   .0043214     1.72   0.097    -.0014307    .0163027
                partt |  -.0736076   .0062907   -11.70   0.000    -.0865151   -.0607001
               public |   .0206962   .0152547     1.36   0.186    -.0106038    .0519962
                 cmsa |   .1245314    .011942    10.43   0.000     .1000284    .1490344
                      |
                nocc2 |
                   2  |   -.033828   .0106936    -3.16   0.004    -.0557694   -.0118865
                   3  |  -.0167712   .0159263    -1.05   0.302    -.0494493    .0159069
                   4  |  -.0904258   .0104525    -8.65   0.000    -.1118726    -.068979
                   5  |   .1574482   .0165713     9.50   0.000     .1234466    .1914498
                   6  |  -.2258198   .0112919   -20.00   0.000    -.2489889   -.2026507
                   7  |  -.2360658   .0267538    -8.82   0.000      -.29096   -.1811715
                   8  |   -.094854   .0591962    -1.60   0.121    -.2163145    .0266064
                   9  |  -.2873235   .0163548   -17.57   0.000    -.3208807   -.2537663
                  10  |  -.2573079   .0217747   -11.82   0.000    -.3019858     -.21263
                  11  |   .0189631   .0233908     0.81   0.425    -.0290308    .0669571
                  12  |  -.2353595   .0153308   -15.35   0.000    -.2668158   -.2039032
                      |
                unemp |  -.0001803   .0009812    -0.18   0.856    -.0021935    .0018329
                      |
              quarter |
                   2  |   .0043081   .0030121     1.43   0.164    -.0018723    .0104885
                   3  |   .0149798   .0028977     5.17   0.000     .0090343    .0209253
                   4  |   .0197915   .0035277     5.61   0.000     .0125534    .0270297
                      |
                _cons |   .2602836   .0621245     4.19   0.000     .1328146    .3877527
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_fem_all_sltt

. 
. ** RUST BELT ONLY BLACK-WHITE + WV, KY - IA
. ** keep if inrange(state, 31, 35) | inlist(state, 23, 41, 43) | inlist(state, 55, 61)
. 
. ** DROP ALWAYS RTW BLACK-WHITE
. ** drop if alwaysr2w == 1
. 
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl ma
> rr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo covstagdid_mal_cf 
.         
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl ma
> rr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo covstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo wagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo wagstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_fem_cf
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_fem_cf 
. 
. label variable blackrelwhite "$ Black $"

. label variable treat_st "$ Treat_{st} $"

. label variable treat_stblackrelwhite "$ Treat_{st} \times Black $"

. 
. ** FIXME ignore rust best stuff, dropping always rtw
. esttab covstagdid_mal_all covstagdid_mal_all_unemp covstagdid_mal_all_sltt covstagdid_fem_all covstagdid_fem_all_unemp covstagdid
> _fem_all_sltt using $tabs/covstagdid-wo-ar2w.tex, se title(Difference in Differences of Union Coverage on Right to Work Laws Trea
> tment in State and Time - W/O Always RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suff
> ix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(*
>  0.1 ** 0.05 *** 0.01) scalars("unemp_level State Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time T
> rends")
(output written to /Users/amedeusdsouza/econ499/tabs/covstagdid-wo-ar2w.tex)

. 
. esttab wagstagdid_mal_all wagstagdid_mal_all_unemp wagstagdid_mal_all_sltt wagstagdid_fem_all wagstagdid_fem_all_unemp wagstagdid
> _fem_all_sltt using $tabs/wagstagdid1-wo-ar2w.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Tre
> atment in State and Time - W/O Always RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suf
> fix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(
> * 0.1 ** 0.05 *** 0.01) 
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid1-wo-ar2w.tex)

. 
. esttab nwagstagdid_mal_all nwagstagdid_mal_all_unemp nwagstagdid_mal_all_sltt nwagstagdid_fem_all nwagstagdid_fem_all_unemp nwags
> tagdid_fem_all_sltt using $tabs/wagstagdid2-wo-ar2w.tex, se title(Difference in Differences of Real Log Wages on Right to Work La
> ws Treatment in State and Time - W/O Always RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}
> {) suffix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starl
> evels(* 0.1 ** 0.05 *** 0.01)
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid2-wo-ar2w.tex)

. 
. esttab uwagstagdid_mal_all uwagstagdid_mal_all_unemp uwagstagdid_mal_all_sltt uwagstagdid_fem_all uwagstagdid_fem_all_unemp uwags
> tagdid_fem_all_sltt using $tabs/wagstagdid3-wo-ar2w.tex, se title(Difference in Differences of Real Log Wages on Right to Work La
> ws Treatment in State and Time - W/O Always RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}
> {) suffix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starl
> evels(* 0.1 ** 0.05 *** 0.01) scalars("unemp_level State Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear
>  Time Trends")
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid3-wo-ar2w.tex)

. 
. panelcombine, use($tabs/wagstagdid1-wo-ar2w.tex $tabs/wagstagdid2-wo-ar2w.tex $tabs/wagstagdid3-wo-ar2w.tex) paneltitles("All (Bl
> ack and White) People" "People Not Covered by Union - Spillover Effect" "People Covered by Union - Direct Effect") columncount(3)
>  save($tabs/wagstagdid-wo-ar2w.tex)

. 
. *** esttab wagstagdid_mal_all wagstagdid_fem_all nwagstagdid_mal_all nwagstagdid_fem_all uwagstagdid_mal_all uwagstagdid_fem_all 
> using $tabs/wagstagdid.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Tim
> e) nonumbers mtitles("men" "women" "men not covered by union" "women not covered by union" "men covered by union" "women covered 
> by union") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
. 
. ** esttab wagstagdid_mal_cf wagstagdid_fem_cf nwagstagdid_mal_cf nwagstagdid_fem_cf uwagstagdid_mal_cf uwagstagdid_fem_cf using $
> tabs/wagstagdid_cf.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Time) n
> onumbers mtitles("men" "women" "men not covered by union" "women not covered by union" "men covered by union" "women covered by u
> nion") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
. 
. ** panelcombine, use($tabs/wagstagdid_all.tex $tabs/wagstagdid_cf.tex) paneltitles("All States" "W/O Always RTW States") columnco
> unt(3) save($tabs/wagstagdid.tex)
. 
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-wo-ar2w.log
  log type:  text
 closed on:  26 Mar 2021, 17:36:30
-----------------------------------------------------------------------------------------------------------------------------------
