---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 opened on:  11 Mar 2021, 11:46:44

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017
> .
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
(2,109 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,113 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,737 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,612 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa par
> tt public marr hisprace hispracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output
> /unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,629  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472442 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786569 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 eff
> ective; signed Dec2012) Mar1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 8
> 3, 72, 82) //incl Idaho which changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,123 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 6
> 4, 57, 87, 47, 83, 72, 82)
(1,149,123 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 6
> 4, 57, 87, 47, 83, 72)
(1,105,938 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,105,938 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,105,938 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to cha
> nge to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. eststo clear

. 
. ** BLACK-WHITE
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3
>  exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce
> (cluster state)
(sum of wgt is 9,209,836,765)

Linear regression                               Number of obs     =  1,068,179
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2229
                                                Root MSE          =     .33515

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0593656   .0076527     7.76   0.000     .0439947    .0747366
             treat_st |  -.0298556   .0103791    -2.88   0.006    -.0507026   -.0090087
treat_stblackrelwhite |  -.0608245   .0080982    -7.51   0.000    -.0770903   -.0445588
                      |
                state |
                  NH  |  -.0454293   .0036275   -12.52   0.000    -.0527155   -.0381432
                  VT  |  -.0472323   .0017424   -27.11   0.000    -.0507321   -.0437325
                  MA  |  -.0017951   .0050629    -0.35   0.724    -.0119642     .008374
                  RI  |   .0073734   .0048701     1.51   0.136    -.0024085    .0171552
                  CT  |   .0002683   .0048387     0.06   0.956    -.0094505    .0099871
                  NY  |   .0893716   .0043155    20.71   0.000     .0807037    .0980395
                  NJ  |   .0362761   .0053036     6.84   0.000     .0256234    .0469287
                  PA  |   .0157906   .0037597     4.20   0.000     .0082391    .0233422
                  OH  |   .0057699   .0037788     1.53   0.133      -.00182    .0133599
                  IN  |  -.0111812   .0039152    -2.86   0.006    -.0190452   -.0033172
                  IL  |   .0349711   .0045823     7.63   0.000     .0257674    .0441749
                  MI  |   .0505693   .0050693     9.98   0.000     .0403873    .0607512
                  WI  |  -.0045709   .0033403    -1.37   0.177    -.0112801    .0021384
                  MN  |   .0139959   .0042554     3.29   0.002     .0054487    .0225431
                  IA  |   .0039715   .0103619     0.38   0.703     -.016841    .0247839
                  MO  |  -.0167626   .0037244    -4.50   0.000    -.0242432    -.009282
                  ND  |  -.0566874   .0102597    -5.53   0.000    -.0772947   -.0360801
                  SD  |  -.0787236   .0102834    -7.66   0.000    -.0993785   -.0580688
                  NE  |  -.0333418   .0106081    -3.14   0.003    -.0546488   -.0120347
                  KS  |  -.0373891   .0107191    -3.49   0.001    -.0589192   -.0158591
                  DE  |  -.0586868   .0022059   -26.60   0.000    -.0631175   -.0542561
                  MD  |  -.0561051   .0055184   -10.17   0.000    -.0671892   -.0450211
                  DC  |   -.057728   .0071154    -8.11   0.000    -.0720197   -.0434362
                  VA  |  -.0875845   .0108682    -8.06   0.000     -.109414    -.065755
                  WV  |  -.0172271   .0034404    -5.01   0.000    -.0241373   -.0103168
                  NC  |  -.1164871   .0110231   -10.57   0.000    -.1386276   -.0943465
                  SC  |  -.1258297   .0111926   -11.24   0.000    -.1483106   -.1033488
                  GA  |  -.0804716   .0114383    -7.04   0.000     -.103446   -.0574971
                  FL  |  -.0630666   .0116709    -5.40   0.000    -.0865084   -.0396248
                  KY  |  -.0488366   .0030736   -15.89   0.000    -.0550101    -.042663
                  TN  |  -.0645246   .0111438    -5.79   0.000    -.0869076   -.0421416
                  AL  |  -.0410182   .0111612    -3.68   0.001    -.0634361   -.0186003
                  MS  |   -.095338   .0112624    -8.47   0.000    -.1179592   -.0727167
                  AR  |  -.0937687   .0109481    -8.56   0.000    -.1157586   -.0717787
                  LA  |  -.0738435   .0115562    -6.39   0.000    -.0970548   -.0506323
                  OK  |  -.0880905   .0065721   -13.40   0.000    -.1012909   -.0748902
                  TX  |  -.0728143   .0116388    -6.26   0.000    -.0961914   -.0494371
                  MT  |  -.0042689   .0022293    -1.91   0.061    -.0087466    .0002088
                  ID  |   -.092837   .0021879   -42.43   0.000    -.0972316   -.0884425
                  WY  |  -.0586465   .0107947    -5.43   0.000    -.0803283   -.0369647
                  CO  |  -.0642612   .0052602   -12.22   0.000    -.0748265   -.0536958
                  NM  |  -.1082764   .0040686   -26.61   0.000    -.1164484   -.1001043
                  AZ  |  -.0694615   .0117363    -5.92   0.000    -.0930345   -.0458885
                  UT  |   -.070341   .0114132    -6.16   0.000    -.0932651   -.0474169
                  NV  |   .0379822   .0117984     3.22   0.002     .0142844    .0616799
                  WA  |   .0450691   .0044548    10.12   0.000     .0361214    .0540168
                  OR  |   .0087708   .0042952     2.04   0.046     .0001436     .017398
                  CA  |   .0245274   .0056172     4.37   0.000      .013245    .0358098
                  AK  |   .0351775   .0055902     6.29   0.000     .0239492    .0464057
                  HI  |   .0174123   .0039958     4.36   0.000     .0093865     .025438
                      |
                 year |
                1990  |  -.0056625   .0025425    -2.23   0.030    -.0107693   -.0005557
                1991  |  -.0064402   .0033662    -1.91   0.061    -.0132015    .0003211
                1992  |  -.0109163   .0039194    -2.79   0.008    -.0187886   -.0030439
                1993  |  -.0132797   .0040526    -3.28   0.002    -.0214195   -.0051398
                1996  |   -.027605   .0036618    -7.54   0.000      -.03496   -.0202501
                1997  |  -.0295515   .0041519    -7.12   0.000    -.0378908   -.0212123
                1998  |   -.034753   .0043268    -8.03   0.000    -.0434438   -.0260623
                1999  |  -.0353646   .0039563    -8.94   0.000    -.0433111    -.027418
                2000  |  -.0402505   .0044335    -9.08   0.000    -.0491555   -.0313456
                2001  |  -.0420654   .0047818    -8.80   0.000    -.0516699   -.0324608
                2002  |  -.0411438   .0055677    -7.39   0.000    -.0523269   -.0299608
                2003  |  -.0477279   .0046081   -10.36   0.000    -.0569836   -.0384723
                2004  |  -.0521738   .0050498   -10.33   0.000    -.0623166   -.0420309
                2005  |  -.0605288   .0053759   -11.26   0.000    -.0713266   -.0497309
                2006  |  -.0635222    .006108   -10.40   0.000    -.0757904   -.0512539
                2007  |  -.0624112   .0059583   -10.47   0.000    -.0743788   -.0504437
                2008  |  -.0525568   .0058098    -9.05   0.000    -.0642262   -.0408874
                2009  |  -.0491616   .0074137    -6.63   0.000    -.0640524   -.0342708
                2010  |  -.0520674   .0081551    -6.38   0.000    -.0684474   -.0356874
                2011  |   -.057607   .0069335    -8.31   0.000    -.0715334   -.0436807
                2012  |  -.0564744   .0072648    -7.77   0.000    -.0710661   -.0418827
                2013  |  -.0578197   .0057137   -10.12   0.000    -.0692961   -.0463434
                2014  |   -.060653   .0055904   -10.85   0.000    -.0718816   -.0494244
                2015  |  -.0630131   .0057061   -11.04   0.000    -.0744741   -.0515521
                2016  |  -.0635954   .0057712   -11.02   0.000    -.0751871   -.0520036
                2017  |  -.0576084   .0051557   -11.17   0.000    -.0679639   -.0472528
                2018  |  -.0600313   .0045164   -13.29   0.000    -.0691028   -.0509598
                2019  |  -.0645344   .0058097   -11.11   0.000    -.0762035   -.0528652
                      |
                 nind |
                   2  |   .0954902   .0162431     5.88   0.000     .0628651    .1281154
                   3  |   .0902968   .0109655     8.23   0.000      .068272    .1123217
                   4  |    .010569   .0082993     1.27   0.209    -.0061006    .0272386
                   5  |   .1769914   .0086545    20.45   0.000     .1596083    .1943745
                   6  |   .0003352    .007937     0.04   0.966    -.0156068    .0162771
                   7  |  -.0022963   .0069298    -0.33   0.742    -.0162152    .0116226
                   8  |   .0124695   .0124078     1.00   0.320    -.0124522    .0373913
                   9  |   .1178551   .0142386     8.28   0.000     .0892561    .1464541
                  10  |   .0034066   .0136266     0.25   0.804    -.0239632    .0307764
                  11  |   .0780355   .0163052     4.79   0.000     .0452855    .1107856
                      |
                 educ |   .0067965   .0013749     4.94   0.000     .0040349    .0095582
                exper |   .0068765   .0011527     5.97   0.000     .0045613    .0091916
               exper2 |  -.0000643   .0000621    -1.03   0.306     -.000189    .0000605
               exper3 |   1.85e-06   2.04e-06     0.90   0.371    -2.26e-06    5.95e-06
               exper4 |  -4.64e-08   2.31e-08    -2.01   0.050    -9.27e-08   -7.77e-11
                 edex |  -.0001793   .0000417    -4.30   0.000     -.000263   -.0000955
                      |
                ee_cl |
                   2  |  -.0159375   .0047582    -3.35   0.002    -.0254947   -.0063803
                   3  |  -.0070348   .0053124    -1.32   0.191    -.0177051    .0036355
                   4  |  -.0182055   .0082198    -2.21   0.031    -.0347154   -.0016956
                   5  |  -.0699179   .0081457    -8.58   0.000    -.0862791   -.0535568
                   6  |   -.002884   .0041653    -0.69   0.492    -.0112502    .0054822
                   7  |   .0160576   .0060335     2.66   0.010      .003939    .0281762
                   8  |  -.0282627   .0101505    -2.78   0.008    -.0486506   -.0078749
                   9  |  -.0612007   .0067817    -9.02   0.000    -.0748223   -.0475792
                  10  |   .0129322   .0059467     2.17   0.034      .000988    .0248765
                  11  |   .0155297   .0075256     2.06   0.044      .000414    .0306453
                  12  |  -.0400259   .0120706    -3.32   0.002    -.0642704   -.0157815
                  13  |   .0010874   .0075232     0.14   0.886    -.0140234    .0161983
                  14  |   .0272077   .0066176     4.11   0.000     .0139158    .0404996
                  15  |   .0079152   .0082959     0.95   0.345    -.0087476    .0245781
                  16  |  -.0478042   .0130641    -3.66   0.001    -.0740442   -.0215641
                      |
                 marr |    .017296   .0015945    10.85   0.000     .0140933    .0204987
                partt |  -.0585413   .0060758    -9.64   0.000    -.0707448   -.0463377
               public |   .2666233   .0254009    10.50   0.000     .2156041    .3176424
                 cmsa |    .043588   .0049352     8.83   0.000     .0336754    .0535006
                      |
                nocc2 |
                   2  |   .0519199    .003031    17.13   0.000     .0458319    .0580079
                   3  |   .0326822    .004835     6.76   0.000     .0229709    .0423935
                   4  |   .1658007   .0108281    15.31   0.000     .1440517    .1875496
                   5  |   .1500237   .0165296     9.08   0.000      .116823    .1832244
                   6  |   .1366872   .0066847    20.45   0.000     .1232607    .1501138
                   7  |   .0710098   .0047409    14.98   0.000     .0614874    .0805323
                   8  |   .0689293   .0070355     9.80   0.000     .0547981    .0830606
                   9  |   .1661588   .0107412    15.47   0.000     .1445844    .1877332
                  10  |   .1945025   .0136777    14.22   0.000       .16703     .221975
                  11  |   .2097615   .0148111    14.16   0.000     .1800124    .2395105
                  12  |   .2078116   .0163324    12.72   0.000      .175007    .2406161
                      |
                unemp |  -.0016309   .0014288    -1.14   0.259    -.0045006    .0012389
                      |
              quarter |
                   2  |  -.0029482   .0014889    -1.98   0.053    -.0059387    .0000423
                   3  |  -.0033827   .0013184    -2.57   0.013    -.0060307   -.0007347
                   4  |  -.0041292   .0009508    -4.34   0.000    -.0060389   -.0022194
                      |
                _cons |   -.156584   .0331067    -4.73   0.000    -.2230809   -.0900872
---------------------------------------------------------------------------------------

. 
. eststo covstagdid_mal_all 

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3
>  exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce
> (cluster state)
(sum of wgt is 9,012,681,441)

Linear regression                               Number of obs     =  1,079,083
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2720
                                                Root MSE          =     .29792

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0795122   .0115423     6.89   0.000     .0563289    .1026955
             treat_st |  -.0220913   .0113613    -1.94   0.057    -.0449112    .0007286
treat_stblackrelwhite |  -.0645795   .0122924    -5.25   0.000    -.0892695   -.0398895
                      |
                state |
                  NH  |  -.0154118   .0015237   -10.11   0.000    -.0184722   -.0123513
                  VT  |  -.0063029   .0010529    -5.99   0.000    -.0084178    -.004188
                  MA  |   .0150707   .0030913     4.88   0.000     .0088617    .0212797
                  RI  |    .034068    .002834    12.02   0.000     .0283757    .0397604
                  CT  |     .02523   .0028839     8.75   0.000     .0194374    .0310225
                  NY  |   .0954886   .0030196    31.62   0.000     .0894236    .1015537
                  NJ  |   .0335318   .0030369    11.04   0.000      .027432    .0396316
                  PA  |   .0087821   .0027571     3.19   0.002     .0032444    .0143199
                  OH  |  -.0047427   .0023878    -1.99   0.053    -.0095388    .0000533
                  IN  |  -.0430734   .0033319   -12.93   0.000    -.0497656   -.0363811
                  IL  |   .0003842   .0030953     0.12   0.902     -.005833    .0066013
                  MI  |    .045198   .0034655    13.04   0.000     .0382374    .0521587
                  WI  |  -.0026344   .0026087    -1.01   0.317     -.007874    .0026053
                  MN  |   .0362139   .0022798    15.88   0.000     .0316349     .040793
                  IA  |  -.0028918   .0111672    -0.26   0.797    -.0253218    .0195383
                  MO  |  -.0521371   .0025526   -20.42   0.000    -.0572642     -.04701
                  ND  |  -.0424587   .0111574    -3.81   0.000     -.064869   -.0200484
                  SD  |  -.0545283    .011192    -4.87   0.000    -.0770082   -.0320485
                  NE  |  -.0220782   .0110757    -1.99   0.052    -.0443243     .000168
                  KS  |  -.0565303   .0111531    -5.07   0.000    -.0789321   -.0341286
                  DE  |  -.0308654    .002968   -10.40   0.000    -.0368269   -.0249039
                  MD  |   -.042785   .0057716    -7.41   0.000    -.0543777   -.0311923
                  DC  |  -.0638042   .0065671    -9.72   0.000    -.0769947   -.0506137
                  VA  |  -.0773097   .0111508    -6.93   0.000    -.0997068   -.0549126
                  WV  |  -.0270494   .0023909   -11.31   0.000    -.0318517   -.0222472
                  NC  |  -.1016981   .0116035    -8.76   0.000    -.1250045   -.0783917
                  SC  |  -.1084974   .0116379    -9.32   0.000    -.1318728   -.0851219
                  GA  |  -.0864779   .0116418    -7.43   0.000    -.1098612   -.0630946
                  FL  |  -.0374325   .0114748    -3.26   0.002    -.0604804   -.0143847
                  KY  |  -.0580798   .0020044   -28.98   0.000    -.0621058   -.0540537
                  TN  |  -.0667663    .011559    -5.78   0.000    -.0899832   -.0435494
                  AL  |  -.0353747   .0116127    -3.05   0.004    -.0586994   -.0120499
                  MS  |  -.0946919   .0118298    -8.00   0.000    -.1184527    -.070931
                  AR  |  -.0809007   .0114543    -7.06   0.000    -.1039074   -.0578941
                  LA  |  -.0663684   .0115241    -5.76   0.000    -.0895152   -.0432216
                  OK  |  -.0688799    .006345   -10.86   0.000    -.0816242   -.0561355
                  TX  |  -.0726545   .0114285    -6.36   0.000    -.0956094   -.0496996
                  MT  |   .0076884   .0018128     4.24   0.000     .0040472    .0113295
                  ID  |   -.074227   .0012037   -61.66   0.000    -.0766448   -.0718092
                  WY  |   -.089988   .0116764    -7.71   0.000    -.1134407   -.0665354
                  CO  |  -.0471889    .002839   -16.62   0.000    -.0528911   -.0414867
                  NM  |  -.0770775   .0029217   -26.38   0.000    -.0829458   -.0712092
                  AZ  |  -.0528336   .0114718    -4.61   0.000    -.0758754   -.0297918
                  UT  |  -.0538617   .0110831    -4.86   0.000    -.0761227   -.0316007
                  NV  |   .0467468   .0115625     4.04   0.000     .0235229    .0699708
                  WA  |   .0612145   .0024527    24.96   0.000     .0562882    .0661408
                  OR  |   .0451643   .0024052    18.78   0.000     .0403333    .0499952
                  CA  |   .0447825   .0028727    15.59   0.000     .0390126    .0505524
                  AK  |    .066332   .0034569    19.19   0.000     .0593887    .0732754
                  HI  |   .0502517   .0021282    23.61   0.000      .045977    .0545264
                      |
                 year |
                1990  |  -.0020746   .0017193    -1.21   0.233     -.005528    .0013788
                1991  |   -.002591   .0026045    -0.99   0.325    -.0078224    .0026403
                1992  |   .0012991   .0023701     0.55   0.586    -.0034615    .0060596
                1993  |   .0006992   .0026127     0.27   0.790    -.0045486     .005947
                1996  |  -.0019515   .0025695    -0.76   0.451    -.0071125    .0032095
                1997  |   -.006216   .0024224    -2.57   0.013    -.0110814   -.0013505
                1998  |  -.0095065   .0029795    -3.19   0.002     -.015491    -.003522
                1999  |  -.0122056   .0027917    -4.37   0.000    -.0178128   -.0065983
                2000  |  -.0100187   .0024697    -4.06   0.000    -.0149793   -.0050582
                2001  |  -.0092817    .002419    -3.84   0.000    -.0141404   -.0044231
                2002  |  -.0092867    .003601    -2.58   0.013    -.0165195    -.002054
                2003  |  -.0155571   .0030408    -5.12   0.000    -.0216646   -.0094495
                2004  |  -.0189802   .0032941    -5.76   0.000    -.0255966   -.0123638
                2005  |  -.0207511   .0033949    -6.11   0.000      -.02757   -.0139323
                2006  |  -.0230598   .0032207    -7.16   0.000    -.0295288   -.0165908
                2007  |  -.0225655   .0044611    -5.06   0.000    -.0315258   -.0136052
                2008  |   -.020044   .0045034    -4.45   0.000    -.0290894   -.0109986
                2009  |  -.0160945   .0057691    -2.79   0.007    -.0276821   -.0045069
                2010  |  -.0188549   .0057367    -3.29   0.002    -.0303774   -.0073324
                2011  |   -.018092   .0055027    -3.29   0.002    -.0291445   -.0070394
                2012  |  -.0233793   .0051222    -4.56   0.000    -.0336675    -.013091
                2013  |  -.0200493   .0050738    -3.95   0.000    -.0302405   -.0098582
                2014  |  -.0245203   .0046246    -5.30   0.000    -.0338091   -.0152314
                2015  |  -.0240396   .0049254    -4.88   0.000    -.0339325   -.0141467
                2016  |  -.0216716   .0044536    -4.87   0.000    -.0306169   -.0127262
                2017  |  -.0277037   .0048924    -5.66   0.000    -.0375303   -.0178771
                2018  |  -.0303998   .0037879    -8.03   0.000    -.0380079   -.0227916
                2019  |  -.0297496   .0053457    -5.57   0.000    -.0404868   -.0190123
                      |
                 nind |
                   2  |   .0348943    .010466     3.33   0.002     .0138727    .0559159
                   3  |   .0511138   .0109553     4.67   0.000     .0291094    .0731182
                   4  |    .041078   .0098108     4.19   0.000     .0213724    .0607836
                   5  |   .1722495    .009913    17.38   0.000     .1523386    .1921605
                   6  |    .014431   .0091197     1.58   0.120    -.0038865    .0327485
                   7  |   .0055249   .0089832     0.62   0.541    -.0125184    .0235682
                   8  |   .0223954    .011569     1.94   0.059    -.0008416    .0456325
                   9  |   .1415177   .0170672     8.29   0.000     .1072373    .1757982
                  10  |   .0083455   .0099672     0.84   0.406    -.0116741    .0283652
                  11  |   .0075365   .0157673     0.48   0.635    -.0241331    .0392061
                      |
                 educ |   .0146592   .0020468     7.16   0.000     .0105481    .0187703
                exper |   .0083819   .0013649     6.14   0.000     .0056405    .0111234
               exper2 |  -.0003096   .0000703    -4.40   0.000    -.0004509   -.0001684
               exper3 |   7.07e-06   2.31e-06     3.06   0.004     2.43e-06    .0000117
               exper4 |  -6.58e-08   2.50e-08    -2.64   0.011    -1.16e-07   -1.57e-08
                 edex |  -.0001227   .0000474    -2.59   0.013    -.0002179   -.0000275
                      |
                ee_cl |
                   2  |   -.035456   .0043252    -8.20   0.000    -.0441433   -.0267687
                   3  |  -.0631053   .0065581    -9.62   0.000    -.0762778   -.0499329
                   4  |  -.0940481   .0130539    -7.20   0.000    -.1202676   -.0678287
                   5  |   -.037932   .0059016    -6.43   0.000    -.0497857   -.0260783
                   6  |  -.0426962   .0053207    -8.02   0.000     -.053383   -.0320093
                   7  |  -.0630936   .0074839    -8.43   0.000    -.0781253   -.0480618
                   8  |   -.086455   .0126982    -6.81   0.000    -.1119602   -.0609498
                   9  |  -.0266081   .0058949    -4.51   0.000    -.0384483   -.0147679
                  10  |  -.0448936   .0065337    -6.87   0.000    -.0580169   -.0317703
                  11  |  -.0631206   .0083592    -7.55   0.000    -.0799104   -.0463307
                  12  |  -.0779557   .0121867    -6.40   0.000    -.1024334    -.053478
                  13  |  -.0032735   .0068985    -0.47   0.637    -.0171294    .0105825
                  14  |   -.037397   .0072518    -5.16   0.000    -.0519626   -.0228314
                  15  |   -.057579   .0093321    -6.17   0.000     -.076323   -.0388349
                  16  |  -.0715232   .0128953    -5.55   0.000    -.0974241   -.0456222
                      |
                 marr |  -.0005993   .0010142    -0.59   0.557    -.0026364    .0014377
                partt |   -.055901   .0049523   -11.29   0.000     -.065848    -.045954
               public |   .2847595   .0282505    10.08   0.000     .2280166    .3415023
                 cmsa |   .0233269   .0028514     8.18   0.000     .0175997    .0290542
                      |
                nocc2 |
                   2  |   .0225633   .0020659    10.92   0.000     .0184138    .0267128
                   3  |   .0314205    .006692     4.70   0.000     .0179792    .0448619
                   4  |   .1521497   .0072875    20.88   0.000     .1375123    .1667871
                   5  |   .1365517   .0157989     8.64   0.000     .1048188    .1682847
                   6  |   .0640479   .0053758    11.91   0.000     .0532503    .0748456
                   7  |   .0837086   .0080016    10.46   0.000      .067637    .0997802
                   8  |   .0566663   .0032563    17.40   0.000     .0501258    .0632067
                   9  |   .0971398   .0091517    10.61   0.000     .0787581    .1155216
                  10  |    .181302   .0151082    12.00   0.000     .1509563    .2116478
                  11  |   .2109401   .0157948    13.36   0.000     .1792153    .2426648
                  12  |   .1705723   .0179783     9.49   0.000     .1344617    .2066828
                      |
                unemp |  -.0008416   .0009048    -0.93   0.357    -.0026589    .0009758
                      |
              quarter |
                   2  |  -.0010102   .0010133    -1.00   0.324    -.0030455    .0010252
                   3  |   .0001313   .0008242     0.16   0.874    -.0015243    .0017868
                   4  |  -.0032214   .0011061    -2.91   0.005    -.0054432   -.0009997
                      |
                _cons |  -.2137034   .0354131    -6.03   0.000    -.2848328   -.1425741
---------------------------------------------------------------------------------------

. 
. eststo covstagdid_fem_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce
> (cluster state) 
(sum of wgt is 9,220,834,418)

Linear regression                               Number of obs     =  1,069,675
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5103
                                                Root MSE          =     .41761

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1438926   .0064668   -22.25   0.000    -.1568815   -.1309036
             treat_st |  -.0392592   .0187556    -2.09   0.041    -.0769309   -.0015875
treat_stblackrelwhite |  -.0222102   .0088474    -2.51   0.015    -.0399807   -.0044397
                      |
                state |
                  NH  |   .0801113   .0048484    16.52   0.000      .070373    .0898496
                  VT  |   .0192579   .0019084    10.09   0.000     .0154248    .0230911
                  MA  |   .1166456   .0086898    13.42   0.000     .0991917    .1340995
                  RI  |   .0350979   .0087549     4.01   0.000     .0175132    .0526826
                  CT  |   .1303744   .0086027    15.15   0.000     .1130953    .1476535
                  NY  |   .1013007   .0080824    12.53   0.000     .0850667    .1175347
                  NJ  |   .1711021   .0091728    18.65   0.000      .152678    .1895261
                  PA  |   .0112983   .0066764     1.69   0.097    -.0021117    .0247083
                  OH  |  -.0157405   .0064604    -2.44   0.018    -.0287166   -.0027644
                  IN  |   .0060336   .0054267     1.11   0.272    -.0048662    .0169334
                  IL  |   .0844438   .0073186    11.54   0.000      .069744    .0991437
                  MI  |   .0536528   .0072323     7.42   0.000     .0391264    .0681793
                  WI  |   .0178903   .0050921     3.51   0.001     .0076626     .028118
                  MN  |   .0607526   .0070052     8.67   0.000     .0466823     .074823
                  IA  |    .015191   .0173403     0.88   0.385     -.019638    .0500201
                  MO  |  -.0209844   .0062701    -3.35   0.002    -.0335782   -.0083907
                  ND  |   .0217993   .0180994     1.20   0.234    -.0145545     .058153
                  SD  |  -.0464351   .0173047    -2.68   0.010    -.0811926   -.0116776
                  NE  |  -.0333905   .0170509    -1.96   0.056    -.0676382    .0008573
                  KS  |   -.005337   .0177933    -0.30   0.765    -.0410759    .0304018
                  DE  |   .0505166   .0023769    21.25   0.000     .0457425    .0552907
                  MD  |   .1213199   .0092461    13.12   0.000     .1027486    .1398911
                  DC  |   .1798687   .0114088    15.77   0.000     .1569535    .2027839
                  VA  |   .1159843   .0180747     6.42   0.000     .0796802    .1522884
                  WV  |   -.035635   .0045511    -7.83   0.000     -.044776   -.0264939
                  NC  |    .008858   .0187068     0.47   0.638    -.0287158    .0464317
                  SC  |  -.0092043   .0191728    -0.48   0.633     -.047714    .0293054
                  GA  |   .0579364   .0192611     3.01   0.004     .0192494    .0966233
                  FL  |  -.0097039   .0198425    -0.49   0.627    -.0495587    .0301509
                  KY  |   -.039051   .0046799    -8.34   0.000    -.0484508   -.0296511
                  TN  |  -.0278992   .0187987    -1.48   0.144    -.0656576    .0098592
                  AL  |  -.0028613   .0192128    -0.15   0.882    -.0414514    .0357288
                  MS  |  -.0252696   .0203868    -1.24   0.221    -.0662177    .0156785
                  AR  |  -.0713372   .0190843    -3.74   0.000    -.1096691   -.0330053
                  LA  |   .0253144   .0199187     1.27   0.210    -.0146935    .0653223
                  OK  |  -.0595481    .010544    -5.65   0.000    -.0807264   -.0383699
                  TX  |   .0614197   .0194288     3.16   0.003     .0223959    .1004436
                  MT  |  -.0352453   .0014443   -24.40   0.000    -.0381463   -.0323443
                  ID  |  -.0400623   .0034896   -11.48   0.000    -.0470713   -.0330533
                  WY  |   .1591772   .0198278     8.03   0.000      .119352    .1990025
                  CO  |   .0293458   .0086117     3.41   0.001     .0120487     .046643
                  NM  |  -.0330282   .0058211    -5.67   0.000    -.0447203   -.0213361
                  AZ  |   .0334205   .0197154     1.70   0.096     -.006179      .07302
                  UT  |  -.0013082   .0183111    -0.07   0.943    -.0380872    .0354707
                  NV  |   .1142962   .0202764     5.64   0.000     .0735699    .1550226
                  WA  |   .1006987   .0076903    13.09   0.000     .0852522    .1161452
                  OR  |   .0297578   .0070689     4.21   0.000     .0155596     .043956
                  CA  |   .1659581   .0092507    17.94   0.000     .1473776    .1845387
                  AK  |   .2492722   .0066024    37.75   0.000     .2360108    .2625336
                  HI  |   .1071214   .0067954    15.76   0.000     .0934725    .1207703
                      |
                 year |
                1990  |  -.0110854   .0027325    -4.06   0.000    -.0165738    -.005597
                1991  |  -.0183995     .00461    -3.99   0.000     -.027659   -.0091399
                1992  |  -.0152402   .0053206    -2.86   0.006    -.0259268   -.0045535
                1993  |  -.0265665   .0042042    -6.32   0.000    -.0350109   -.0181222
                1996  |  -.0373444   .0049187    -7.59   0.000    -.0472238    -.027465
                1997  |  -.0242599   .0046659    -5.20   0.000    -.0336317   -.0148881
                1998  |  -.0040282   .0040099    -1.00   0.320    -.0120823     .004026
                1999  |    .016871   .0052518     3.21   0.002     .0063224    .0274196
                2000  |   .0235322    .005396     4.36   0.000     .0126941    .0343703
                2001  |   .0427391    .005441     7.86   0.000     .0318107    .0536676
                2002  |    .055627   .0055281    10.06   0.000     .0445235    .0667304
                2003  |   .0472875   .0058808     8.04   0.000     .0354755    .0590996
                2004  |   .0367716   .0052672     6.98   0.000     .0261922     .047351
                2005  |    .020623   .0057529     3.58   0.001      .009068    .0321781
                2006  |   .0146528    .005993     2.44   0.018     .0026154    .0266901
                2007  |   .0153022   .0071987     2.13   0.038     .0008433    .0297611
                2008  |   .0168128   .0070606     2.38   0.021     .0026312    .0309945
                2009  |    .049508   .0106578     4.65   0.000     .0281011    .0709149
                2010  |   .0427669   .0091604     4.67   0.000     .0243678    .0611661
                2011  |   .0159784   .0089826     1.78   0.081    -.0020636    .0340204
                2012  |   .0091553   .0100237     0.91   0.365    -.0109779    .0292886
                2013  |   .0034293   .0094238     0.36   0.717    -.0154989    .0223575
                2014  |  -.0053888   .0085659    -0.63   0.532    -.0225939    .0118162
                2015  |   .0103516    .006677     1.55   0.127    -.0030595    .0237628
                2016  |   .0226502   .0071388     3.17   0.003     .0083115     .036989
                2017  |   .0259073   .0079882     3.24   0.002     .0098624    .0419521
                2018  |   .0326601   .0079389     4.11   0.000     .0167143    .0486059
                2019  |   .0513772   .0080772     6.36   0.000     .0351537    .0676007
                      |
                 nind |
                   2  |   .0847024   .0264122     3.21   0.002     .0316518    .1377529
                   3  |    .104912   .0220649     4.75   0.000     .0605934    .1492306
                   4  |  -.0791635   .0237711    -3.33   0.002    -.1269093   -.0314178
                   5  |   .1437841   .0231887     6.20   0.000     .0972082    .1903601
                   6  |   .0988653   .0258366     3.83   0.000     .0469709    .1507597
                   7  |   .0022059   .0250422     0.09   0.930    -.0480928    .0525046
                   8  |  -.0561572   .0249609    -2.25   0.029    -.1062927   -.0060216
                   9  |   -.062374    .027513    -2.27   0.028    -.1176355   -.0071125
                  10  |  -.0951836   .0260205    -3.66   0.001    -.1474473     -.04292
                  11  |   .1180863   .0257691     4.58   0.000     .0663276    .1698451
                      |
                 educ |   .0679156   .0016896    40.20   0.000     .0645219    .0713092
                exper |   .0458213   .0017757    25.80   0.000     .0422547     .049388
               exper2 |  -.0009632   .0000956   -10.08   0.000    -.0011552   -.0007712
               exper3 |   5.19e-06   2.79e-06     1.86   0.069    -4.11e-07    .0000108
               exper4 |   2.93e-08   2.96e-08     0.99   0.327    -3.02e-08    8.88e-08
                 edex |  -.0004562   .0000618    -7.38   0.000    -.0005804   -.0003321
                      |
                ee_cl |
                   2  |  -.0592398   .0045421   -13.04   0.000    -.0683628   -.0501169
                   3  |  -.0680188   .0060594   -11.23   0.000    -.0801896   -.0558481
                   4  |  -.0267009   .0107291    -2.49   0.016     -.048251   -.0051509
                   5  |  -.1341991   .0056831   -23.61   0.000     -.145614   -.1227841
                   6  |  -.0851627   .0054401   -15.65   0.000    -.0960894   -.0742361
                   7  |  -.0611861   .0067698    -9.04   0.000    -.0747837   -.0475886
                   8  |   .0278631   .0115807     2.41   0.020     .0046026    .0511236
                   9  |  -.1529136   .0072829   -21.00   0.000    -.1675417   -.1382856
                  10  |  -.0967133   .0077261   -12.52   0.000    -.1122316    -.081195
                  11  |  -.0580544   .0081855    -7.09   0.000    -.0744954   -.0416134
                  12  |   .0305448   .0116805     2.62   0.012     .0070838    .0540058
                  13  |   -.077751   .0124365    -6.25   0.000    -.1027305   -.0527714
                  14  |  -.0756801   .0094742    -7.99   0.000    -.0947096   -.0566506
                  15  |  -.0480162   .0094135    -5.10   0.000    -.0669237   -.0291087
                  16  |   .0293899   .0127122     2.31   0.025     .0038568    .0549231
                      |
                 marr |    .123494    .002331    52.98   0.000     .1188121    .1281759
                partt |  -.2093266   .0061452   -34.06   0.000    -.2216697   -.1969836
               public |   .0158741   .0074058     2.14   0.037     .0009992     .030749
                 cmsa |   .1453257   .0089311    16.27   0.000      .127387    .1632643
                      |
                nocc2 |
                   2  |  -.1399754   .0035643   -39.27   0.000    -.1471346   -.1328163
                   3  |  -.0389471   .0059553    -6.54   0.000    -.0509087   -.0269855
                   4  |  -.2919249   .0094016   -31.05   0.000    -.3108086   -.2730413
                   5  |  -.0780507   .0068773   -11.35   0.000    -.0918641   -.0642373
                   6  |  -.3672983   .0062224   -59.03   0.000    -.3797963   -.3548003
                   7  |  -.2298249   .0052503   -43.77   0.000    -.2403704   -.2192794
                   8  |  -.1005434   .0107617    -9.34   0.000    -.1221588   -.0789279
                   9  |  -.3880021   .0035641  -108.86   0.000    -.3951607   -.3808434
                  10  |  -.3269046   .0049768   -65.69   0.000    -.3369008   -.3169085
                  11  |  -.2229787   .0055021   -40.53   0.000      -.23403   -.2119274
                  12  |  -.3765087   .0054828   -68.67   0.000    -.3875212   -.3654963
                      |
                unemp |  -.0058841   .0020037    -2.94   0.005    -.0099086   -.0018596
                      |
              quarter |
                   2  |   .0032905   .0018875     1.74   0.087    -.0005006    .0070816
                   3  |    .004875   .0018779     2.60   0.012     .0011032    .0086468
                   4  |   .0140593   .0014955     9.40   0.000     .0110556    .0170631
                      |
                _cons |   .6549647   .0333224    19.66   0.000     .5880347    .7218948
---------------------------------------------------------------------------------------

. 
. eststo wagstagdid_mal_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce
> (cluster state)
(sum of wgt is 9,024,031,886)

Linear regression                               Number of obs     =  1,080,731
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5037
                                                Root MSE          =     .39283

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0660794   .0065643   -10.07   0.000    -.0792642   -.0528946
             treat_st |  -.0319476   .0086592    -3.69   0.001    -.0493402    -.014555
treat_stblackrelwhite |  -.0398742    .008006    -4.98   0.000    -.0559547   -.0237936
                      |
                state |
                  NH  |   .0543759   .0037435    14.53   0.000     .0468567     .061895
                  VT  |   .0336906   .0016255    20.73   0.000     .0304256    .0369555
                  MA  |   .0997461   .0079731    12.51   0.000     .0837317    .1157605
                  RI  |   .0262844   .0079219     3.32   0.002     .0103727     .042196
                  CT  |    .111151   .0079203    14.03   0.000     .0952425    .1270594
                  NY  |   .0660615   .0073986     8.93   0.000      .051201    .0809221
                  NJ  |   .1289259   .0084816    15.20   0.000       .11189    .1459618
                  PA  |  -.0300584   .0063229    -4.75   0.000    -.0427584   -.0173584
                  OH  |  -.0612913    .006081   -10.08   0.000    -.0735052   -.0490773
                  IN  |  -.0649195     .00454   -14.30   0.000    -.0740382   -.0558007
                  IL  |   .0039437   .0069269     0.57   0.572    -.0099693    .0178568
                  MI  |  -.0131841   .0064294    -2.05   0.046     -.026098   -.0002703
                  WI  |  -.0131709    .004494    -2.93   0.005    -.0221973   -.0041444
                  MN  |   .0454392   .0059314     7.66   0.000     .0335257    .0573527
                  IA  |  -.0306401   .0080342    -3.81   0.000    -.0467771    -.014503
                  MO  |  -.0822414   .0058631   -14.03   0.000    -.0940178    -.070465
                  ND  |  -.0582323   .0085965    -6.77   0.000    -.0754989   -.0409656
                  SD  |  -.0790509   .0083061    -9.52   0.000    -.0957342   -.0623677
                  NE  |  -.0694765   .0082141    -8.46   0.000    -.0859751    -.052978
                  KS  |  -.0649992   .0083766    -7.76   0.000     -.081824   -.0481743
                  DE  |   .0482119   .0026029    18.52   0.000     .0429838    .0534401
                  MD  |   .0945236   .0089979    10.51   0.000     .0764509    .1125963
                  DC  |   .1521173   .0115445    13.18   0.000     .1289295    .1753052
                  VA  |   .0533129   .0093685     5.69   0.000     .0344956    .0721302
                  WV  |  -.1437768   .0027435   -52.41   0.000    -.1492872   -.1382663
                  NC  |  -.0323155   .0087996    -3.67   0.001    -.0499901   -.0146409
                  SC  |  -.0727271   .0090531    -8.03   0.000    -.0909108   -.0545434
                  GA  |  -.0037076   .0095302    -0.39   0.699    -.0228495    .0154344
                  FL  |  -.0327873   .0102824    -3.19   0.002      -.05344   -.0121345
                  KY  |  -.0891366   .0040022   -22.27   0.000    -.0971753   -.0810979
                  TN  |  -.0751166   .0090392    -8.31   0.000    -.0932724   -.0569608
                  AL  |  -.0879055   .0090363    -9.73   0.000    -.1060555   -.0697556
                  MS  |   -.110944   .0092507   -11.99   0.000    -.1295246   -.0923635
                  AR  |  -.1139061   .0085557   -13.31   0.000    -.1310907   -.0967216
                  LA  |  -.0937726    .009969    -9.41   0.000    -.1137959   -.0737493
                  OK  |   -.136276   .0063053   -21.61   0.000    -.1489406   -.1236115
                  TX  |  -.0044535   .0098917    -0.45   0.654    -.0243216    .0154146
                  MT  |  -.0784481   .0008911   -88.04   0.000    -.0802378   -.0766583
                  ID  |  -.0756045   .0029852   -25.33   0.000    -.0816005   -.0696085
                  WY  |   .0007191   .0085899     0.08   0.934    -.0165341    .0179724
                  CO  |  -.0072153   .0079046    -0.91   0.366    -.0230921    .0086616
                  NM  |    -.09594   .0049691   -19.31   0.000    -.1059206   -.0859593
                  AZ  |    .005445   .0101686     0.54   0.595    -.0149792    .0258693
                  UT  |  -.0515444   .0094576    -5.45   0.000    -.0705405   -.0325483
                  NV  |   .0689989   .0105425     6.54   0.000     .0478236    .0901741
                  WA  |   .0594428   .0070939     8.38   0.000     .0451943    .0736913
                  OR  |  -.0030952   .0065668    -0.47   0.639    -.0162851    .0100946
                  CA  |   .1280809   .0085802    14.93   0.000      .110847    .1453148
                  AK  |   .1855109   .0050526    36.72   0.000     .1753625    .1956592
                  HI  |   .0692882   .0059873    11.57   0.000     .0572624     .081314
                      |
                 year |
                1990  |  -.0055712   .0027634    -2.02   0.049    -.0111218   -.0000207
                1991  |   .0000378    .003168     0.01   0.991    -.0063254     .006401
                1992  |   .0200092   .0040935     4.89   0.000     .0117872    .0282313
                1993  |    .016208   .0039235     4.13   0.000     .0083274    .0240885
                1996  |   .0028871   .0041185     0.70   0.487    -.0053851    .0111592
                1997  |   .0144545   .0036515     3.96   0.000     .0071202    .0217888
                1998  |   .0421654   .0037973    11.10   0.000     .0345384    .0497925
                1999  |   .0583975   .0037555    15.55   0.000     .0508543    .0659408
                2000  |   .0708639   .0042055    16.85   0.000     .0624168     .079311
                2001  |   .0838404   .0044693    18.76   0.000     .0748635    .0928172
                2002  |   .0987304   .0047326    20.86   0.000     .0892246    .1082362
                2003  |   .1053042   .0046476    22.66   0.000     .0959691    .1146392
                2004  |   .0956196   .0047044    20.33   0.000     .0861705    .1050687
                2005  |   .0851095   .0049984    17.03   0.000     .0750699    .0951491
                2006  |   .0797044   .0044341    17.98   0.000     .0707983    .0886105
                2007  |   .0795436   .0053297    14.92   0.000     .0688386    .0902486
                2008  |    .074393   .0062308    11.94   0.000     .0618781    .0869079
                2009  |   .0994599   .0072199    13.78   0.000     .0849583    .1139614
                2010  |   .0975111   .0066145    14.74   0.000     .0842255    .1107968
                2011  |   .0774688   .0055514    13.95   0.000     .0663185     .088619
                2012  |   .0584838   .0059663     9.80   0.000     .0465002    .0704674
                2013  |   .0598018   .0063576     9.41   0.000     .0470322    .0725715
                2014  |    .052604   .0057616     9.13   0.000     .0410314    .0641767
                2015  |   .0663395   .0052169    12.72   0.000      .055861     .076818
                2016  |   .0776901   .0062636    12.40   0.000     .0651093    .0902708
                2017  |   .0850296   .0072933    11.66   0.000     .0703805    .0996786
                2018  |    .088493   .0072344    12.23   0.000     .0739623    .1030237
                2019  |    .099003   .0067746    14.61   0.000     .0853957    .1126103
                      |
                 nind |
                   2  |   .0610674   .0407977     1.50   0.141    -.0208771     .143012
                   3  |   .1345766   .0382208     3.52   0.001     .0578078    .2113453
                   4  |  -.0823089   .0387158    -2.13   0.038    -.1600719   -.0045458
                   5  |   .1580696   .0373937     4.23   0.000     .0829621    .2331771
                   6  |   .0905244   .0390353     2.32   0.025     .0121197     .168929
                   7  |   .0359449   .0404073     0.89   0.378    -.0452155    .1171054
                   8  |  -.0174201   .0414463    -0.42   0.676    -.1006675    .0658272
                   9  |  -.0690264   .0446325    -1.55   0.128    -.1586734    .0206206
                  10  |  -.0797097    .039548    -2.02   0.049    -.1591443   -.0002751
                  11  |    .072811   .0412508     1.77   0.084    -.0100436    .1556655
                      |
                 educ |   .0913728   .0023405    39.04   0.000     .0866717    .0960739
                exper |   .0478443   .0021321    22.44   0.000     .0435619    .0521266
               exper2 |  -.0015728   .0000971   -16.20   0.000    -.0017678   -.0013778
               exper3 |   .0000245   2.73e-06     8.98   0.000      .000019      .00003
               exper4 |  -1.29e-07   2.77e-08    -4.65   0.000    -1.84e-07   -7.31e-08
                 edex |  -.0005233   .0000899    -5.82   0.000    -.0007038   -.0003428
                      |
                ee_cl |
                   2  |  -.1256705   .0051035   -24.62   0.000    -.1359211   -.1154198
                   3  |  -.1637997    .007786   -21.04   0.000    -.1794384   -.1481609
                   4  |   -.167949    .012513   -13.42   0.000    -.1930821   -.1428159
                   5  |  -.1528432   .0081837   -18.68   0.000    -.1692806   -.1364058
                   6  |  -.1681787   .0087732   -19.17   0.000    -.1858002   -.1505572
                   7  |  -.1761645   .0101718   -17.32   0.000    -.1965951   -.1557339
                   8  |  -.1107034   .0131404    -8.42   0.000    -.1370966   -.0843101
                   9  |  -.1544046   .0100502   -15.36   0.000     -.174591   -.1342182
                  10  |  -.1758039      .0109   -16.13   0.000    -.1976971   -.1539107
                  11  |  -.1698581   .0112447   -15.11   0.000    -.1924438   -.1472724
                  12  |  -.1173217   .0118926    -9.87   0.000    -.1412086   -.0934348
                  13  |  -.1079537   .0146882    -7.35   0.000    -.1374557   -.0784516
                  14  |  -.1557941   .0115593   -13.48   0.000    -.1790116   -.1325765
                  15  |  -.1377778   .0118943   -11.58   0.000    -.1616682   -.1138874
                  16  |  -.1034202   .0123335    -8.39   0.000    -.1281927   -.0786477
                      |
                 marr |   .0337864   .0021984    15.37   0.000     .0293708     .038202
                partt |  -.1404981   .0033163   -42.37   0.000    -.1471591   -.1338371
               public |   .0603162   .0060028    10.05   0.000     .0482592    .0723732
                 cmsa |   .1527678   .0080268    19.03   0.000     .1366454    .1688902
                      |
                nocc2 |
                   2  |  -.1309589   .0030312   -43.20   0.000    -.1370473   -.1248704
                   3  |  -.0389703   .0068494    -5.69   0.000    -.0527278   -.0252128
                   4  |  -.2800748   .0066157   -42.33   0.000    -.2933628   -.2667867
                   5  |   .0508239     .00621     8.18   0.000     .0383509     .063297
                   6  |  -.3243157   .0043373   -74.77   0.000    -.3330274   -.3156039
                   7  |  -.3502215   .0042521   -82.36   0.000    -.3587621   -.3416808
                   8  |  -.1645071   .0077604   -21.20   0.000    -.1800943   -.1489199
                   9  |  -.4036811   .0051317   -78.66   0.000    -.4139884   -.3933737
                  10  |  -.4087493   .0090735   -45.05   0.000    -.4269739   -.3905247
                  11  |  -.1648493   .0087505   -18.84   0.000    -.1824252   -.1472734
                  12  |  -.3812216   .0077212   -49.37   0.000    -.3967301    -.365713
                      |
                unemp |  -.0021866   .0013387    -1.63   0.109    -.0048755    .0005023
                      |
              quarter |
                   2  |   .0086627   .0013356     6.49   0.000       .00598    .0113454
                   3  |   .0176683   .0016519    10.70   0.000     .0143503    .0209863
                   4  |   .0205067   .0011317    18.12   0.000     .0182336    .0227797
                      |
                _cons |   .3417471   .0455675     7.50   0.000     .2502221    .4332721
---------------------------------------------------------------------------------------

. 
. eststo wagstagdid_fem_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & co
> vered == 0, vce(cluster state)
(sum of wgt is 7,596,016,105)

Linear regression                               Number of obs     =    878,855
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5398
                                                Root MSE          =     .42012

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1590531   .0050044   -31.78   0.000    -.1691048   -.1490015
             treat_st |  -.0286257   .0141286    -2.03   0.048    -.0570037   -.0002476
treat_stblackrelwhite |  -.0033004   .0081265    -0.41   0.686    -.0196229     .013022
                      |
                state |
                  NH  |   .0872674   .0044704    19.52   0.000     .0782883    .0962464
                  VT  |   .0321386   .0018615    17.26   0.000     .0283997    .0358776
                  MA  |   .1158355    .008544    13.56   0.000     .0986744    .1329966
                  RI  |   .0306926   .0083294     3.68   0.001     .0139625    .0474226
                  CT  |   .1236824   .0084703    14.60   0.000     .1066693    .1406955
                  NY  |   .0742198   .0080665     9.20   0.000     .0580177    .0904219
                  NJ  |   .1542412   .0091118    16.93   0.000     .1359396    .1725428
                  PA  |   .0032388   .0065233     0.50   0.622    -.0098635    .0163412
                  OH  |  -.0285634   .0063653    -4.49   0.000    -.0413484   -.0157783
                  IN  |  -.0038333   .0050123    -0.76   0.448    -.0139007    .0062342
                  IL  |   .0638721    .007497     8.52   0.000     .0488139    .0789303
                  MI  |   .0257519   .0071886     3.58   0.001     .0113132    .0401906
                  WI  |   .0110597   .0047501     2.33   0.024     .0015188    .0206007
                  MN  |   .0502909   .0066817     7.53   0.000     .0368703    .0637115
                  IA  |   .0035838   .0127691     0.28   0.780    -.0220637    .0292313
                  MO  |  -.0353156   .0059602    -5.93   0.000    -.0472869   -.0233442
                  ND  |   .0232235   .0133625     1.74   0.088    -.0036158    .0500628
                  SD  |    -.04492   .0126255    -3.56   0.001     -.070279   -.0195609
                  NE  |  -.0368925   .0124812    -2.96   0.005    -.0619618   -.0118233
                  KS  |  -.0156682   .0131924    -1.19   0.241    -.0421659    .0108295
                  DE  |   .0567439   .0018624    30.47   0.000     .0530032    .0604845
                  MD  |   .1286675   .0090016    14.29   0.000     .1105872    .1467478
                  DC  |   .1972763   .0120537    16.37   0.000     .1730657    .2214868
                  VA  |    .118394   .0135374     8.75   0.000     .0912034    .1455847
                  WV  |  -.0502084   .0037729   -13.31   0.000    -.0577865   -.0426302
                  NC  |    .018263   .0141114     1.29   0.202    -.0100806    .0466066
                  SC  |   .0053298   .0145219     0.37   0.715    -.0238383    .0344979
                  GA  |   .0595106   .0146566     4.06   0.000     .0300719    .0889494
                  FL  |  -.0092167   .0151035    -0.61   0.544     -.039553    .0211197
                  KY  |  -.0368638   .0043085    -8.56   0.000    -.0455177   -.0282098
                  TN  |  -.0285899   .0142589    -2.01   0.050    -.0572297    .0000499
                  AL  |   -.004487   .0145686    -0.31   0.759    -.0337488    .0247748
                  MS  |  -.0144898   .0156355    -0.93   0.359    -.0458946    .0169151
                  AR  |  -.0659739   .0142678    -4.62   0.000    -.0946317   -.0373161
                  LA  |   .0284266    .015142     1.88   0.066    -.0019869    .0588402
                  OK  |  -.0509657   .0082697    -6.16   0.000    -.0675759   -.0343555
                  TX  |   .0629343   .0147644     4.26   0.000     .0332791    .0925895
                  MT  |  -.0389693   .0013465   -28.94   0.000    -.0416738   -.0362647
                  ID  |  -.0304857   .0033133    -9.20   0.000    -.0371406   -.0238308
                  WY  |   .1576343   .0148032    10.65   0.000     .1279013    .1873673
                  CO  |   .0408757   .0081594     5.01   0.000     .0244871    .0572642
                  NM  |  -.0169657   .0054644    -3.10   0.003    -.0279413     -.00599
                  AZ  |   .0324148   .0150295     2.16   0.036     .0022272    .0626024
                  UT  |  -.0005469   .0136016    -0.04   0.968    -.0278665    .0267727
                  NV  |   .0904062   .0154218     5.86   0.000     .0594306    .1213818
                  WA  |   .0914346   .0076128    12.01   0.000     .0761438    .1067255
                  OR  |   .0239887   .0069018     3.48   0.001     .0101261    .0378513
                  CA  |   .1552935   .0091834    16.91   0.000      .136848     .173739
                  AK  |   .2432423   .0059473    40.90   0.000     .2312968    .2551878
                  HI  |   .1078592   .0065203    16.54   0.000     .0947628    .1209556
                      |
                 year |
                1990  |  -.0079292   .0030714    -2.58   0.013    -.0140983   -.0017601
                1991  |  -.0138927   .0057409    -2.42   0.019    -.0254236   -.0023618
                1992  |  -.0101858   .0052865    -1.93   0.060     -.020804    .0004324
                1993  |   -.022511   .0043201    -5.21   0.000    -.0311882   -.0138338
                1996  |  -.0357193   .0057071    -6.26   0.000    -.0471824   -.0242561
                1997  |  -.0213507    .005005    -4.27   0.000    -.0314036   -.0112979
                1998  |   .0024507   .0045932     0.53   0.596     -.006775    .0116765
                1999  |   .0263816   .0060037     4.39   0.000     .0143227    .0384405
                2000  |   .0356419   .0059914     5.95   0.000     .0236079    .0476759
                2001  |   .0577578    .005939     9.73   0.000      .045829    .0696866
                2002  |   .0717595   .0048253    14.87   0.000     .0620677    .0814513
                2003  |    .061377   .0066671     9.21   0.000     .0479859    .0747682
                2004  |   .0514916   .0057951     8.89   0.000     .0398518    .0631314
                2005  |   .0353785   .0064263     5.51   0.000     .0224708    .0482861
                2006  |   .0294521   .0055835     5.27   0.000     .0182373    .0406668
                2007  |   .0291119   .0067847     4.29   0.000     .0154845    .0427393
                2008  |   .0319604   .0065379     4.89   0.000     .0188286    .0450922
                2009  |   .0675071   .0112334     6.01   0.000     .0449441    .0900701
                2010  |   .0580625   .0097494     5.96   0.000     .0384803    .0776447
                2011  |   .0310074   .0094252     3.29   0.002     .0120763    .0499386
                2012  |   .0258888   .0100715     2.57   0.013     .0056595    .0461181
                2013  |    .018896   .0092252     2.05   0.046     .0003666    .0374254
                2014  |   .0077203    .008608     0.90   0.374    -.0095693      .02501
                2015  |   .0266819   .0065432     4.08   0.000     .0135396    .0398243
                2016  |   .0405554   .0070119     5.78   0.000     .0264715    .0546393
                2017  |   .0404446   .0081664     4.95   0.000     .0240418    .0568474
                2018  |   .0485154   .0083359     5.82   0.000     .0317723    .0652586
                2019  |   .0688314   .0086827     7.93   0.000     .0513917    .0862712
                      |
                 nind |
                   2  |   .0471893   .0232801     2.03   0.048     .0004297    .0939488
                   3  |   .1004931   .0219191     4.58   0.000     .0564673    .1445188
                   4  |  -.0676425   .0239432    -2.83   0.007    -.1157338   -.0195512
                   5  |   .0987392   .0234068     4.22   0.000     .0517253     .145753
                   6  |     .10166   .0263318     3.86   0.000     .0487709     .154549
                   7  |   .0063477   .0252611     0.25   0.803    -.0443907     .057086
                   8  |  -.0451253   .0256236    -1.76   0.084    -.0965918    .0063413
                   9  |  -.0779146   .0256544    -3.04   0.004    -.1294429   -.0263863
                  10  |  -.0894239   .0254611    -3.51   0.001    -.1405639   -.0382838
                  11  |   .0875033   .0261011     3.35   0.002     .0350777     .139929
                      |
                 educ |   .0648339   .0017752    36.52   0.000     .0612683    .0683995
                exper |   .0404974   .0017761    22.80   0.000       .03693    .0440649
               exper2 |  -.0007207   .0000884    -8.15   0.000    -.0008983   -.0005431
               exper3 |  -2.52e-06   2.91e-06    -0.87   0.391    -8.36e-06    3.32e-06
               exper4 |   1.16e-07   3.32e-08     3.49   0.001     4.93e-08    1.83e-07
                 edex |  -.0003394   .0000768    -4.42   0.000    -.0004938   -.0001851
                      |
                ee_cl |
                   2  |  -.0634659   .0044707   -14.20   0.000    -.0724456   -.0544862
                   3  |  -.0758097   .0055258   -13.72   0.000    -.0869085   -.0647108
                   4  |   -.026653   .0093236    -2.86   0.006    -.0453801   -.0079259
                   5  |  -.1251171   .0052719   -23.73   0.000     -.135706   -.1145281
                   6  |   -.098075   .0056241   -17.44   0.000    -.1093713   -.0867787
                   7  |  -.0788958   .0069459   -11.36   0.000     -.092847   -.0649445
                   8  |   .0384571   .0100273     3.84   0.000     .0183167    .0585976
                   9  |  -.1497858    .006972   -21.48   0.000    -.1637895    -.135782
                  10  |  -.1145945   .0078149   -14.66   0.000    -.1302912   -.0988978
                  11  |  -.0693173   .0080608    -8.60   0.000     -.085508   -.0531267
                  12  |   .0409905   .0107556     3.81   0.000     .0193872    .0625937
                  13  |  -.0902986   .0129824    -6.96   0.000    -.1163745   -.0642227
                  14  |  -.0875544   .0100938    -8.67   0.000    -.1078284   -.0672805
                  15  |   -.050916   .0096394    -5.28   0.000    -.0702773   -.0315546
                  16  |   .0394208   .0119688     3.29   0.002     .0153807    .0634609
                      |
                 marr |   .1293583   .0025537    50.66   0.000     .1242291    .1344876
                partt |  -.2075153   .0047076   -44.08   0.000    -.2169709   -.1980598
               public |  -.0105001   .0060472    -1.74   0.089    -.0226463    .0016461
                 cmsa |   .1386546   .0081623    16.99   0.000     .1222601    .1550491
                      |
                nocc2 |
                   2  |  -.1492334   .0038186   -39.08   0.000    -.1569033   -.1415636
                   3  |  -.0391223   .0063138    -6.20   0.000    -.0518038   -.0264408
                   4  |   -.331916   .0073755   -45.00   0.000      -.34673   -.3171019
                   5  |  -.0968507   .0083574   -11.59   0.000     -.113637   -.0800644
                   6  |  -.3919816   .0066201   -59.21   0.000    -.4052784   -.3786848
                   7  |  -.2479434   .0065347   -37.94   0.000    -.2610688   -.2348181
                   8  |  -.1115644   .0102425   -10.89   0.000    -.1321371   -.0909916
                   9  |  -.4345628   .0057652   -75.38   0.000    -.4461426    -.422983
                  10  |  -.3739218   .0060606   -61.70   0.000    -.3860949   -.3617487
                  11  |  -.2747759    .006339   -43.35   0.000    -.2875081   -.2620437
                  12  |   -.436148    .008695   -50.16   0.000    -.4536123   -.4186836
                      |
                unemp |  -.0063733   .0018946    -3.36   0.001    -.0101787   -.0025679
                      |
              quarter |
                   2  |   .0039891   .0018102     2.20   0.032     .0003533     .007625
                   3  |    .004803   .0018378     2.61   0.012     .0011117    .0084943
                   4  |   .0154532   .0017239     8.96   0.000     .0119908    .0189157
                      |
                _cons |   .7312308   .0292573    24.99   0.000     .6724657    .7899959
---------------------------------------------------------------------------------------

. 
. eststo uwagstagdid_mal_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & co
> vered == 0, vce(cluster state)
(sum of wgt is 7,731,986,885)

Linear regression                               Number of obs     =    924,306
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5063
                                                Root MSE          =     .39321

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0837678   .0069803   -12.00   0.000    -.0977881   -.0697475
             treat_st |  -.0256803   .0071919    -3.57   0.001    -.0401256   -.0112349
treat_stblackrelwhite |  -.0285172   .0082649    -3.45   0.001    -.0451176   -.0119167
                      |
                state |
                  NH  |   .0565337   .0037264    15.17   0.000     .0490491    .0640183
                  VT  |   .0419795   .0018947    22.16   0.000     .0381739    .0457852
                  MA  |   .0939956   .0080521    11.67   0.000     .0778225    .1101687
                  RI  |   .0010897   .0080491     0.14   0.893    -.0150773    .0172567
                  CT  |   .0989534   .0079508    12.45   0.000     .0829837    .1149231
                  NY  |   .0425701   .0075519     5.64   0.000     .0274016    .0577385
                  NJ  |    .109113   .0086324    12.64   0.000     .0917743    .1264517
                  PA  |  -.0428007   .0063765    -6.71   0.000    -.0556082   -.0299932
                  OH  |   -.073331   .0060853   -12.05   0.000    -.0855537   -.0611082
                  IN  |  -.0694861   .0045151   -15.39   0.000    -.0785548   -.0604173
                  IL  |  -.0010667   .0070483    -0.15   0.880    -.0152236    .0130902
                  MI  |  -.0403619   .0066398    -6.08   0.000    -.0536984   -.0270254
                  WI  |  -.0217644   .0044673    -4.87   0.000    -.0307372   -.0127916
                  MN  |   .0351205   .0060693     5.79   0.000     .0229299    .0473111
                  IA  |  -.0409548   .0069378    -5.90   0.000    -.0548898   -.0270197
                  MO  |  -.0815783   .0057364   -14.22   0.000    -.0931003   -.0700564
                  ND  |  -.0618302   .0076483    -8.08   0.000    -.0771922   -.0464683
                  SD  |  -.0786641   .0074226   -10.60   0.000    -.0935728   -.0637555
                  NE  |  -.0726437   .0074654    -9.73   0.000    -.0876384   -.0576491
                  KS  |  -.0672162   .0073742    -9.12   0.000    -.0820277   -.0524047
                  DE  |   .0362129   .0025344    14.29   0.000     .0311225    .0413033
                  MD  |   .0924647   .0088885    10.40   0.000     .0746115    .1103178
                  DC  |   .1614909    .011739    13.76   0.000     .1379124    .1850694
                  VA  |   .0528275     .00869     6.08   0.000      .035373    .0702819
                  WV  |  -.1535261   .0028697   -53.50   0.000    -.1592901    -.147762
                  NC  |  -.0271016   .0077899    -3.48   0.001    -.0427481   -.0114552
                  SC  |  -.0641087   .0079611    -8.05   0.000     -.080099   -.0481184
                  GA  |   .0001497   .0085557     0.02   0.986    -.0170349    .0173344
                  FL  |  -.0391977   .0093278    -4.20   0.000    -.0579331   -.0204623
                  KY  |  -.0877967   .0040016   -21.94   0.000    -.0958341   -.0797593
                  TN  |  -.0782209   .0080445    -9.72   0.000    -.0943788   -.0620629
                  AL  |  -.0894698   .0079429   -11.26   0.000    -.1054235    -.073516
                  MS  |  -.1034928   .0080211   -12.90   0.000    -.1196038   -.0873819
                  AR  |  -.1105791   .0073225   -15.10   0.000    -.1252867   -.0958715
                  LA  |  -.0952483   .0088818   -10.72   0.000    -.1130878   -.0774087
                  OK  |  -.1328527   .0060793   -21.85   0.000    -.1450633   -.1206421
                  TX  |  -.0026284   .0089679    -0.29   0.771     -.020641    .0153841
                  MT  |   -.075599   .0011138   -67.88   0.000    -.0778361   -.0733619
                  ID  |  -.0699385    .002977   -23.49   0.000     -.075918    -.063959
                  WY  |    .002877   .0074725     0.39   0.702    -.0121319    .0178859
                  CO  |  -.0018433   .0078572    -0.23   0.815    -.0176249    .0139383
                  NM  |  -.0873728   .0048804   -17.90   0.000    -.0971754   -.0775701
                  AZ  |   .0038506   .0092243     0.42   0.678    -.0146769    .0223781
                  UT  |  -.0531598   .0085051    -6.25   0.000    -.0702429   -.0360768
                  NV  |   .0510262   .0095148     5.36   0.000     .0319153    .0701371
                  WA  |   .0527318   .0073923     7.13   0.000     .0378839    .0675797
                  OR  |  -.0081145   .0068646    -1.18   0.243    -.0219025    .0056734
                  CA  |   .1131533   .0089031    12.71   0.000     .0952709    .1310357
                  AK  |   .1732667   .0053677    32.28   0.000     .1624854     .184048
                  HI  |   .0682863    .006319    10.81   0.000     .0555941    .0809784
                      |
                 year |
                1990  |  -.0061463   .0025243    -2.43   0.019    -.0112165   -.0010762
                1991  |    .001792   .0035114     0.51   0.612    -.0052609    .0088449
                1992  |   .0226065   .0047238     4.79   0.000     .0131184    .0320946
                1993  |   .0166824   .0042695     3.91   0.000     .0081068     .025258
                1996  |  -.0002862   .0040143    -0.07   0.943    -.0083492    .0077767
                1997  |   .0137227   .0039992     3.43   0.001     .0056901    .0217553
                1998  |   .0440723   .0042505    10.37   0.000      .035535    .0526097
                1999  |   .0634319   .0045165    14.04   0.000     .0543602    .0725036
                2000  |   .0779338   .0048074    16.21   0.000     .0682779    .0875896
                2001  |   .0907836   .0055416    16.38   0.000     .0796529    .1019144
                2002  |   .1066914   .0051638    20.66   0.000     .0963197    .1170631
                2003  |   .1168488   .0055578    21.02   0.000     .1056856    .1280121
                2004  |   .1068737   .0056326    18.97   0.000     .0955603    .1181871
                2005  |   .0956496   .0059879    15.97   0.000     .0836225    .1076766
                2006  |   .0900933   .0050728    17.76   0.000     .0799042    .1002824
                2007  |   .0914898   .0055483    16.49   0.000     .0803457     .102634
                2008  |   .0857854   .0066962    12.81   0.000     .0723358     .099235
                2009  |   .1103391   .0083054    13.29   0.000     .0936572     .127021
                2010  |   .1077137    .007377    14.60   0.000     .0928966    .1225309
                2011  |   .0880574   .0064177    13.72   0.000     .0751671    .1009478
                2012  |   .0713568   .0062369    11.44   0.000     .0588296    .0838841
                2013  |   .0706551   .0066382    10.64   0.000     .0573219    .0839884
                2014  |   .0655498   .0065204    10.05   0.000     .0524532    .0786465
                2015  |   .0782368   .0055773    14.03   0.000     .0670344    .0894392
                2016  |    .090349   .0070453    12.82   0.000     .0761981       .1045
                2017  |   .1015221    .007788    13.04   0.000     .0858794    .1171648
                2018  |    .105761   .0083815    12.62   0.000     .0889263    .1225957
                2019  |   .1168168    .008107    14.41   0.000     .1005334    .1331002
                      |
                 nind |
                   2  |   .0516216   .0397207     1.30   0.200    -.0281598     .131403
                   3  |   .1267875   .0377121     3.36   0.001     .0510404    .2025345
                   4  |  -.0831321   .0378717    -2.20   0.033    -.1591997   -.0070646
                   5  |   .1114264   .0373009     2.99   0.004     .0365054    .1863474
                   6  |   .0889682   .0387307     2.30   0.026     .0111752    .1667611
                   7  |   .0376449   .0401721     0.94   0.353    -.0430431    .1183329
                   8  |  -.0137033   .0409009    -0.34   0.739    -.0958551    .0684486
                   9  |  -.0858162   .0425635    -2.02   0.049    -.1713076   -.0003248
                  10  |  -.0771662   .0387478    -1.99   0.052    -.1549934     .000661
                  11  |   .0890593   .0428034     2.08   0.043     .0030863    .1750324
                      |
                 educ |   .0868445   .0019054    45.58   0.000     .0830174    .0906717
                exper |   .0471598   .0022064    21.37   0.000     .0427282    .0515914
               exper2 |  -.0015149   .0000961   -15.77   0.000    -.0017079    -.001322
               exper3 |   .0000232   2.88e-06     8.06   0.000     .0000174     .000029
               exper4 |  -1.16e-07   3.01e-08    -3.86   0.000    -1.76e-07   -5.56e-08
                 edex |  -.0005871   .0000985    -5.96   0.000    -.0007849   -.0003893
                      |
                ee_cl |
                   2  |  -.1200978   .0044957   -26.71   0.000    -.1291276    -.111068
                   3  |  -.1515074   .0062486   -24.25   0.000     -.164058   -.1389567
                   4  |  -.1438687   .0103394   -13.91   0.000     -.164636   -.1231014
                   5  |  -.1499945   .0082585   -18.16   0.000    -.1665823   -.1334068
                   6  |  -.1627168   .0078369   -20.76   0.000    -.1784577   -.1469759
                   7  |  -.1622942    .008436   -19.24   0.000    -.1792385   -.1453499
                   8  |  -.0744638   .0102435    -7.27   0.000    -.0950385   -.0538891
                   9  |  -.1599681   .0106675   -15.00   0.000    -.1813945   -.1385418
                  10  |  -.1703187   .0100972   -16.87   0.000    -.1905995   -.1500379
                  11  |  -.1530472    .009202   -16.63   0.000    -.1715299   -.1345645
                  12  |  -.0899692   .0092643    -9.71   0.000    -.1085771   -.0713613
                  13  |  -.1253546   .0158024    -7.93   0.000    -.1570947   -.0936145
                  14  |  -.1515347   .0111811   -13.55   0.000    -.1739927   -.1290768
                  15  |   -.122071   .0101995   -11.97   0.000    -.1425573   -.1015846
                  16  |   -.082095   .0109803    -7.48   0.000    -.1041497   -.0600403
                      |
                 marr |   .0386769   .0023982    16.13   0.000     .0338599    .0434938
                partt |  -.1383986    .002886   -47.96   0.000    -.1441953   -.1326019
               public |    .015002   .0057003     2.63   0.011     .0035526    .0264514
                 cmsa |   .1527493    .007862    19.43   0.000      .136958    .1685406
                      |
                nocc2 |
                   2  |  -.1382734   .0031975   -43.24   0.000    -.1446958   -.1318511
                   3  |  -.0374956    .007046    -5.32   0.000     -.051648   -.0233432
                   4  |   -.326132   .0044964   -72.53   0.000    -.3351632   -.3171008
                   5  |   .0305607   .0062806     4.87   0.000     .0179457    .0431756
                   6  |  -.3378424    .004697   -71.93   0.000    -.3472766   -.3284082
                   7  |  -.3674274   .0046009   -79.86   0.000    -.3766686   -.3581861
                   8  |  -.1761943   .0076554   -23.02   0.000    -.1915707   -.1608179
                   9  |  -.4259556   .0057345   -74.28   0.000    -.4374737   -.4144376
                  10  |  -.4502539   .0086313   -52.17   0.000    -.4675904   -.4329175
                  11  |  -.2352811   .0073081   -32.19   0.000    -.2499599   -.2206023
                  12  |  -.4249052   .0094049   -45.18   0.000    -.4437954    -.406015
                      |
                unemp |   -.002385   .0015599    -1.53   0.133    -.0055182    .0007481
                      |
              quarter |
                   2  |   .0094494    .001462     6.46   0.000     .0065129     .012386
                   3  |   .0181911   .0018282     9.95   0.000     .0145192    .0218631
                   4  |   .0216804   .0011642    18.62   0.000      .019342    .0240188
                      |
                _cons |   .4115754   .0421972     9.75   0.000     .3268197     .496331
---------------------------------------------------------------------------------------

. 
. eststo uwagstagdid_fem_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & co
> vered == 1, vce(cluster state)
(sum of wgt is 1,613,820,660)

Linear regression                               Number of obs     =    189,324
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3404
                                                Root MSE          =     .36128

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.140079   .0122767   -11.41   0.000    -.1647375   -.1154205
             treat_st |  -.0567935   .0319759    -1.78   0.082     -.121019    .0074321
treat_stblackrelwhite |  -.0147781   .0147232    -1.00   0.320    -.0443506    .0147943
                      |
                state |
                  NH  |   .0364749   .0060276     6.05   0.000     .0243681    .0485818
                  VT  |  -.0216227   .0034279    -6.31   0.000    -.0285077   -.0147376
                  MA  |   .0928756    .009797     9.48   0.000     .0731977    .1125535
                  RI  |   .0345355   .0102297     3.38   0.001     .0139885    .0550824
                  CT  |   .1396052   .0094194    14.82   0.000     .1206857    .1585247
                  NY  |   .1100441   .0079414    13.86   0.000     .0940933    .1259949
                  NJ  |   .1798651   .0092863    19.37   0.000      .161213    .1985173
                  PA  |   .0028232   .0066808     0.42   0.674    -.0105955    .0162419
                  OH  |   .0024001   .0062504     0.38   0.703    -.0101543    .0149544
                  IN  |   .0228799   .0058049     3.94   0.000     .0112203    .0345394
                  IL  |   .0875876   .0066536    13.16   0.000     .0742234    .1009518
                  MI  |   .0884859   .0067538    13.10   0.000     .0749204    .1020514
                  WI  |   .0223757   .0057065     3.92   0.000     .0109139    .0338375
                  MN  |   .0601267   .0080214     7.50   0.000     .0440152    .0762381
                  IA  |   .0279133   .0297922     0.94   0.353     -.031926    .0877526
                  MO  |   .0206401   .0067976     3.04   0.004     .0069867    .0342936
                  ND  |   .0395342    .030616     1.29   0.203    -.0219599    .1010284
                  SD  |  -.0057437      .0296    -0.19   0.847     -.065197    .0537096
                  NE  |  -.0140552   .0283748    -0.50   0.623    -.0710475    .0429372
                  KS  |   .0595519   .0292649     2.03   0.047     .0007717    .1183321
                  DE  |   .0569957   .0045761    12.46   0.000     .0478043    .0661871
                  MD  |   .1203007   .0090317    13.32   0.000       .10216    .1384414
                  DC  |   .1327465   .0087309    15.20   0.000     .1152099     .150283
                  VA  |   .1573559   .0296476     5.31   0.000      .097807    .2169048
                  WV  |  -.0011228   .0072605    -0.15   0.878    -.0157059    .0134604
                  NC  |   .0516299   .0314544     1.64   0.107    -.0115482     .114808
                  SC  |   .0062244   .0325741     0.19   0.849    -.0592027    .0716514
                  GA  |   .0965625   .0317347     3.04   0.004     .0328216    .1603034
                  FL  |   .0361099   .0324506     1.11   0.271    -.0290691    .1012889
                  KY  |  -.0245334   .0056203    -4.37   0.000    -.0358222   -.0132446
                  TN  |    .014233   .0312252     0.46   0.650    -.0484846    .0769507
                  AL  |   .0186111   .0319327     0.58   0.563    -.0455275    .0827498
                  MS  |  -.0061927   .0338129    -0.18   0.855    -.0741079    .0617225
                  AR  |  -.0097384   .0323164    -0.30   0.764    -.0746478    .0551709
                  LA  |   .0619373   .0320805     1.93   0.059    -.0024983     .126373
                  OK  |  -.0420001   .0139614    -3.01   0.004    -.0700424   -.0139579
                  TX  |   .0865916   .0315217     2.75   0.008     .0232784    .1499049
                  MT  |  -.0426498   .0035297   -12.08   0.000    -.0497394   -.0355603
                  ID  |  -.0172707   .0030504    -5.66   0.000    -.0233976   -.0111438
                  WY  |   .1904178   .0329169     5.78   0.000     .1243023    .2565333
                  CO  |   .0064867   .0088622     0.73   0.468    -.0113135     .024287
                  NM  |  -.0397439   .0073657    -5.40   0.000    -.0545383   -.0249494
                  AZ  |    .077616   .0324153     2.39   0.020      .012508     .142724
                  UT  |    .011624   .0298677     0.39   0.699     -.048367    .0716151
                  NV  |   .1476191    .034194     4.32   0.000     .0789384    .2162998
                  WA  |   .1029177   .0075937    13.55   0.000     .0876652    .1181702
                  OR  |   .0293041   .0073944     3.96   0.000      .014452    .0441562
                  CA  |   .1786811   .0096464    18.52   0.000     .1593057    .1980565
                  AK  |   .2404418   .0076028    31.63   0.000     .2251711    .2557124
                  HI  |   .0881195   .0088655     9.94   0.000     .0703127    .1059263
                      |
                 year |
                1990  |  -.0174419   .0048968    -3.56   0.001    -.0272773   -.0076064
                1991  |   -.026751   .0061578    -4.34   0.000    -.0391194   -.0143827
                1992  |  -.0237939   .0074485    -3.19   0.002    -.0387546   -.0088331
                1993  |  -.0268128   .0068808    -3.90   0.000    -.0406333   -.0129924
                1996  |   -.014391    .005932    -2.43   0.019    -.0263057   -.0024762
                1997  |  -.0066705   .0066276    -1.01   0.319    -.0199825    .0066414
                1998  |   .0030774   .0066184     0.46   0.644    -.0102161    .0163709
                1999  |   .0133231   .0066418     2.01   0.050    -.0000173    .0266635
                2000  |   .0100564   .0058938     1.71   0.094    -.0017817    .0218945
                2001  |   .0169083    .006708     2.52   0.015     .0034349    .0303817
                2002  |   .0283679   .0086574     3.28   0.002     .0109791    .0457568
                2003  |   .0370165   .0081937     4.52   0.000     .0205591    .0534739
                2004  |   .0276502   .0063245     4.37   0.000     .0149471    .0403533
                2005  |   .0228734   .0079438     2.88   0.006     .0069179     .038829
                2006  |    .018497   .0105306     1.76   0.085    -.0026544    .0396485
                2007  |   .0229401   .0123693     1.85   0.070    -.0019044    .0477845
                2008  |   .0097746    .007339     1.33   0.189    -.0049662    .0245154
                2009  |   .0307169   .0117277     2.62   0.012     .0071611    .0542726
                2010  |   .0406275   .0116471     3.49   0.001     .0172337    .0640214
                2011  |   .0194338   .0119237     1.63   0.109    -.0045157    .0433833
                2012  |   .0023451    .012141     0.19   0.848    -.0220408    .0267309
                2013  |   .0034068   .0104074     0.33   0.745    -.0174971    .0243107
                2014  |   .0090437   .0112953     0.80   0.427    -.0136437     .031731
                2015  |   .0104486   .0096028     1.09   0.282    -.0088391    .0297364
                2016  |   .0107873   .0104201     1.04   0.306    -.0101421    .0317167
                2017  |   .0268721   .0096357     2.79   0.007     .0075183     .046226
                2018  |   .0267597   .0097756     2.74   0.009     .0071249    .0463945
                2019  |   .0398739   .0106866     3.73   0.000     .0184093    .0613384
                      |
                 nind |
                   2  |   .0688919   .0246849     2.79   0.007     .0193109     .118473
                   3  |  -.0527928   .0228922    -2.31   0.025    -.0987731   -.0068125
                   4  |  -.2259039   .0267521    -8.44   0.000     -.279637   -.1721707
                   5  |   .0696969   .0227672     3.06   0.004     .0239677    .1154261
                   6  |  -.0814202   .0256482    -3.17   0.003     -.132936   -.0299043
                   7  |  -.0950627   .0233948    -4.06   0.000    -.1420525   -.0480729
                   8  |  -.1941308   .0245324    -7.91   0.000    -.2434057   -.1448559
                   9  |  -.1464822   .0252826    -5.79   0.000    -.1972638   -.0957007
                  10  |  -.1635607   .0425371    -3.85   0.000    -.2489989   -.0781225
                  11  |   .0807782   .0246787     3.27   0.002     .0312095    .1303469
                      |
                 educ |   .0723881   .0040705    17.78   0.000     .0642121     .080564
                exper |   .0715937   .0024775    28.90   0.000     .0666175    .0765699
               exper2 |  -.0025658   .0001686   -15.22   0.000    -.0029044   -.0022273
               exper3 |   .0000515   4.79e-06    10.74   0.000     .0000418    .0000611
               exper4 |  -4.18e-07   4.67e-08    -8.95   0.000    -5.12e-07   -3.24e-07
                 edex |  -.0007842    .000105    -7.47   0.000     -.000995   -.0005733
                      |
                ee_cl |
                   2  |   .0706289   .0168771     4.18   0.000     .0367303    .1045274
                   3  |   .0569137   .0183334     3.10   0.003       .02009    .0937374
                   4  |   .0129445   .0257364     0.50   0.617    -.0387485    .0646376
                   5  |   .0124337   .0211063     0.59   0.558    -.0299595    .0548268
                   6  |   .0457152    .016094     2.84   0.006     .0133895    .0780409
                   7  |   .0537276   .0207093     2.59   0.012     .0121318    .0953234
                   8  |   .0139161   .0237829     0.59   0.561    -.0338533    .0616855
                   9  |   .0071247   .0225231     0.32   0.753    -.0381144    .0523637
                  10  |   .0308812   .0189043     1.63   0.109    -.0070891    .0688515
                  11  |   .0435997   .0205383     2.12   0.039     .0023473    .0848521
                  12  |   .0577427   .0236639     2.44   0.018     .0102124     .105273
                  13  |   .0428275   .0207997     2.06   0.045     .0010501    .0846049
                  14  |   .0221202   .0199272     1.11   0.272    -.0179048    .0621453
                  15  |   .0385763   .0215898     1.79   0.080    -.0047881    .0819407
                  16  |   .0748152   .0220048     3.40   0.001     .0306172    .1190132
                      |
                 marr |   .0638375   .0027413    23.29   0.000     .0583314    .0693436
                partt |   -.094559   .0176365    -5.36   0.000    -.1299829   -.0591352
               public |  -.0522619    .008272    -6.32   0.000    -.0688767   -.0356472
                 cmsa |   .1106656   .0109233    10.13   0.000     .0887255    .1326057
                      |
                nocc2 |
                   2  |  -.0359411   .0104649    -3.43   0.001    -.0569605   -.0149217
                   3  |  -.0198954   .0117902    -1.69   0.098    -.0435767    .0037859
                   4  |  -.0700795   .0137678    -5.09   0.000    -.0977329    -.042426
                   5  |   .0089148   .0173266     0.51   0.609    -.0258866    .0437162
                   6  |  -.2391256    .009689   -24.68   0.000    -.2585865   -.2196647
                   7  |  -.1918418   .0105072   -18.26   0.000    -.2129461   -.1707375
                   8  |  -.0855753   .0268707    -3.18   0.002    -.1395467   -.0316039
                   9  |  -.2188977   .0098912   -22.13   0.000    -.2387648   -.1990306
                  10  |  -.1423746   .0064108   -22.21   0.000    -.1552511   -.1294981
                  11  |  -.0668971   .0079457    -8.42   0.000    -.0828565   -.0509378
                  12  |  -.1870231   .0071291   -26.23   0.000    -.2013423   -.1727038
                      |
                unemp |  -.0030176   .0023135    -1.30   0.198    -.0076644    .0016292
                      |
              quarter |
                   2  |   .0010108    .002849     0.35   0.724    -.0047116    .0067331
                   3  |   .0076115   .0028498     2.67   0.010     .0018875    .0133354
                   4  |   .0110209   .0020359     5.41   0.000     .0069317      .01511
                      |
                _cons |    .530839   .0572357     9.27   0.000     .4158777    .6458003
---------------------------------------------------------------------------------------

. 
. eststo nwagstagdid_mal_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & co
> vered == 1, vce(cluster state)
(sum of wgt is 1,280,694,556)

Linear regression                               Number of obs     =    154,777
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4296
                                                Root MSE          =     .36543

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0555029    .009995    -5.55   0.000    -.0755784   -.0354273
             treat_st |  -.0599583   .0191589    -3.13   0.003      -.09844   -.0214765
treat_stblackrelwhite |   .0001843   .0156019     0.01   0.991     -.031153    .0315215
                      |
                state |
                  NH  |   .0461961   .0050539     9.14   0.000     .0360451    .0563472
                  VT  |  -.0082205   .0024754    -3.32   0.002    -.0131925   -.0032485
                  MA  |   .1316757   .0088239    14.92   0.000     .1139524     .149399
                  RI  |   .1390669   .0095376    14.58   0.000     .1199101    .1582237
                  CT  |   .1701257   .0089519    19.00   0.000     .1521453    .1881061
                  NY  |   .1244646   .0077712    16.02   0.000     .1088558    .1400734
                  NJ  |   .2138993   .0087856    24.35   0.000     .1962529    .2315457
                  PA  |   .0374343   .0073184     5.12   0.000     .0227349    .0521338
                  OH  |   .0169941   .0073693     2.31   0.025     .0021925    .0317957
                  IN  |   .0003345   .0070289     0.05   0.962    -.0137834    .0144525
                  IL  |   .0384738   .0074078     5.19   0.000     .0235947    .0533529
                  MI  |   .0886683    .008383    10.58   0.000     .0718306     .105506
                  WI  |   .0426671   .0061494     6.94   0.000     .0303155    .0550186
                  MN  |   .0847637   .0073251    11.57   0.000     .0700508    .0994766
                  IA  |   .0412156   .0180636     2.28   0.027     .0049339    .0774974
                  MO  |  -.0437075   .0076013    -5.75   0.000    -.0589752   -.0284398
                  ND  |   .0049935   .0185328     0.27   0.789    -.0322308    .0422178
                  SD  |  -.0432328   .0176787    -2.45   0.018    -.0787415    -.007724
                  NE  |  -.0402962   .0171353    -2.35   0.023    -.0747135   -.0058789
                  KS  |   .0032238   .0173449     0.19   0.853    -.0316143     .038062
                  DE  |   .1409917   .0062449    22.58   0.000     .1284484     .153535
                  MD  |   .1637475   .0092357    17.73   0.000     .1451971    .1822979
                  DC  |   .1856435   .0108752    17.07   0.000     .1637999     .207487
                  VA  |   .1432969   .0181887     7.88   0.000     .1067638    .1798299
                  WV  |  -.0595067   .0038008   -15.66   0.000    -.0671408   -.0518726
                  NC  |   .0499298   .0185945     2.69   0.010     .0125817    .0872779
                  SC  |  -.0297395   .0191151    -1.56   0.126    -.0681334    .0086544
                  GA  |   .0563934   .0190508     2.96   0.005     .0181288     .094658
                  FL  |   .0483616   .0190333     2.54   0.014     .0101321    .0865911
                  KY  |  -.0379524   .0063434    -5.98   0.000    -.0506935   -.0252113
                  TN  |   .0246576   .0184287     1.34   0.187    -.0123575    .0616727
                  AL  |  -.0510363   .0184597    -2.76   0.008    -.0881136    -.013959
                  MS  |  -.0694953   .0197027    -3.53   0.001    -.1090694   -.0299212
                  AR  |  -.0629414   .0188417    -3.34   0.002     -.100786   -.0250968
                  LA  |  -.0153519   .0193396    -0.79   0.431    -.0541965    .0234928
                  OK  |  -.0987556   .0093368   -10.58   0.000    -.1175091    -.080002
                  TX  |   .0523926   .0186837     2.80   0.007     .0148654    .0899199
                  MT  |  -.0809134   .0029109   -27.80   0.000    -.0867601   -.0750666
                  ID  |  -.0651579   .0030079   -21.66   0.000    -.0711994   -.0591163
                  WY  |   .0935015   .0192845     4.85   0.000     .0547673    .1322356
                  CO  |   .0047222    .009092     0.52   0.606    -.0135396    .0229841
                  NM  |  -.0656382   .0052716   -12.45   0.000    -.0762264   -.0550499
                  AZ  |   .0586742   .0199027     2.95   0.005     .0186984      .09865
                  UT  |    .001742   .0189238     0.09   0.927    -.0362675    .0397515
                  NV  |   .1498014   .0221042     6.78   0.000     .1054039    .1941989
                  WA  |   .0850451   .0085698     9.92   0.000     .0678321     .102258
                  OR  |   .0176124   .0073484     2.40   0.020     .0028528     .032372
                  CA  |   .1927118   .0084228    22.88   0.000     .1757942    .2096294
                  AK  |   .2272175   .0049068    46.31   0.000     .2173619    .2370731
                  HI  |   .0720077   .0075463     9.54   0.000     .0568504    .0871649
                      |
                 year |
                1990  |  -.0009841   .0052673    -0.19   0.853    -.0115638    .0095956
                1991  |  -.0060454   .0081382    -0.74   0.461    -.0223914    .0103006
                1992  |   .0068834   .0108792     0.63   0.530    -.0149682     .028735
                1993  |   .0147638   .0092792     1.59   0.118     -.003874    .0334017
                1996  |   .0232133   .0084357     2.75   0.008     .0062697     .040157
                1997  |   .0239349   .0069684     3.43   0.001     .0099385    .0379313
                1998  |   .0406284   .0068483     5.93   0.000     .0268731    .0543836
                1999  |   .0423008   .0066458     6.37   0.000     .0289522    .0556493
                2000  |    .036711   .0075025     4.89   0.000     .0216419    .0517802
                2001  |    .051981   .0074511     6.98   0.000      .037015     .066947
                2002  |   .0619274   .0072127     8.59   0.000     .0474403    .0764146
                2003  |   .0518541   .0065267     7.94   0.000     .0387448    .0649634
                2004  |   .0466131    .009115     5.11   0.000     .0283051    .0649211
                2005  |   .0406112   .0088342     4.60   0.000     .0228672    .0583552
                2006  |   .0389065   .0076383     5.09   0.000     .0235645    .0542484
                2007  |    .032279   .0084003     3.84   0.000     .0154066    .0491515
                2008  |   .0287807   .0124415     2.31   0.025     .0037912    .0537702
                2009  |   .0597178   .0144814     4.12   0.000      .030631    .0888047
                2010  |   .0663726   .0146093     4.54   0.000     .0370288    .0957163
                2011  |   .0426359   .0133096     3.20   0.002     .0159028     .069369
                2012  |   .0131593    .011979     1.10   0.277    -.0109013    .0372198
                2013  |     .02466   .0113906     2.16   0.035     .0017812    .0475388
                2014  |   .0078932   .0182825     0.43   0.668    -.0288282    .0446146
                2015  |   .0227036   .0133253     1.70   0.095     -.004061    .0494683
                2016  |   .0304142   .0086345     3.52   0.001     .0130712    .0477572
                2017  |   .0138711   .0123062     1.13   0.265    -.0108466    .0385887
                2018  |    .014278   .0105853     1.35   0.183    -.0069833    .0355393
                2019  |   .0207825   .0091167     2.28   0.027     .0024711    .0390939
                      |
                 nind |
                   2  |   .0561274    .051971     1.08   0.285    -.0482594    .1605142
                   3  |   .0448955   .0390526     1.15   0.256    -.0335439    .1233348
                   4  |  -.2343395   .0504374    -4.65   0.000     -.335646    -.133033
                   5  |   .1415213   .0429458     3.30   0.002     .0552622    .2277804
                   6  |  -.0433695   .0477945    -0.91   0.369    -.1393676    .0526287
                   7  |  -.0998985   .0460288    -2.17   0.035      -.19235    -.007447
                   8  |  -.1349485   .0495645    -2.72   0.009    -.2345017   -.0353954
                   9  |  -.1828215   .0453051    -4.04   0.000    -.2738196   -.0918234
                  10  |  -.1466462   .0603773    -2.43   0.019    -.2679176   -.0253749
                  11  |   .0040097   .0463372     0.09   0.931    -.0890613    .0970808
                      |
                 educ |   .1047462   .0056813    18.44   0.000     .0933351    .1161574
                exper |   .0504111   .0033944    14.85   0.000     .0435932     .057229
               exper2 |  -.0017507   .0002624    -6.67   0.000    -.0022777   -.0012237
               exper3 |   .0000311   9.07e-06     3.43   0.001     .0000129    .0000494
               exper4 |  -2.14e-07   1.02e-07    -2.10   0.041    -4.18e-07   -9.55e-09
                 edex |  -.0004617   .0001241    -3.72   0.001     -.000711   -.0002125
                      |
                ee_cl |
                   2  |   -.058621   .0137876    -4.25   0.000    -.0863143   -.0309277
                   3  |  -.1198368   .0178299    -6.72   0.000    -.1556493   -.0840243
                   4  |  -.1684673   .0333524    -5.05   0.000    -.2354576    -.101477
                   5  |  -.0717233   .0206325    -3.48   0.001     -.113165   -.0302816
                   6  |  -.0908219   .0171309    -5.30   0.000    -.1252302   -.0564135
                   7  |  -.1366411   .0219735    -6.22   0.000    -.1807762    -.092506
                   8  |  -.1647172   .0347221    -4.74   0.000    -.2344586   -.0949759
                   9  |  -.0466096   .0164032    -2.84   0.006    -.0795563   -.0136628
                  10  |  -.1111011   .0229834    -4.83   0.000    -.1572647   -.0649375
                  11  |  -.1503972    .024395    -6.17   0.000     -.199396   -.1013983
                  12  |    -.14346   .0312918    -4.58   0.000    -.2063115   -.0806084
                  13  |   .0010907   .0208551     0.05   0.958     -.040798    .0429794
                  14  |  -.1022025    .021778    -4.69   0.000    -.1459449     -.05846
                  15  |  -.1155213   .0258149    -4.47   0.000     -.167372   -.0636707
                  16  |  -.1117858   .0320537    -3.49   0.001    -.1761676    -.047404
                      |
                 marr |   .0058703   .0034699     1.69   0.097    -.0010991    .0128398
                partt |  -.0642403   .0070273    -9.14   0.000    -.0783551   -.0501255
               public |   .0233023   .0120808     1.93   0.059    -.0009627    .0475673
                 cmsa |     .12086   .0095749    12.62   0.000     .1016281    .1400918
                      |
                nocc2 |
                   2  |  -.0392285   .0107504    -3.65   0.001    -.0608214   -.0176356
                   3  |  -.0222639   .0136407    -1.63   0.109    -.0496621    .0051342
                   4  |   -.106938   .0109546    -9.76   0.000    -.1289409    -.084935
                   5  |   .1403592   .0162122     8.66   0.000     .1077961    .1729222
                   6  |  -.2347567   .0095693   -24.53   0.000    -.2539772   -.2155363
                   7  |  -.2427645   .0234073   -10.37   0.000    -.2897794   -.1957496
                   8  |  -.0912428   .0463286    -1.97   0.054    -.1842966    .0018111
                   9  |  -.2887079   .0152761   -18.90   0.000    -.3193909   -.2580249
                  10  |   -.259358   .0175416   -14.79   0.000    -.2945914   -.2241246
                  11  |   .0067167   .0186484     0.36   0.720    -.0307396     .044173
                  12  |  -.2416242   .0131457   -18.38   0.000    -.2680281   -.2152203
                      |
                unemp |  -.0018358   .0014923    -1.23   0.224    -.0048331    .0011615
                      |
              quarter |
                   2  |   .0046853   .0026947     1.74   0.088    -.0007271    .0100977
                   3  |   .0143118   .0025613     5.59   0.000     .0091673    .0194563
                   4  |   .0182638   .0028723     6.36   0.000     .0124947     .024033
                      |
                _cons |   .1802758   .0539931     3.34   0.002     .0718275    .2887241
---------------------------------------------------------------------------------------

. 
. eststo nwagstagdid_fem_all 

. 
. ** HISP-WHITE
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 e
> xper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 0, vce(cluster state) 
(sum of wgt is 7,768,840,614)

Linear regression                               Number of obs     =    834,347
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2115
                                                Root MSE          =     .31669

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0021963   .0054429    -0.40   0.688    -.0131287    .0087361
            treat_st |  -.0251684   .0082314    -3.06   0.004    -.0417016   -.0086352
treat_sthisprelwhite |   .0082789   .0091913     0.90   0.372    -.0101822    .0267401
                     |
               state |
                 NH  |  -.0425981   .0030131   -14.14   0.000    -.0486502   -.0365461
                 VT  |   -.044917   .0015665   -28.67   0.000    -.0480635   -.0417705
                 MA  |   .0060538   .0045887     1.32   0.193    -.0031628    .0152703
                 RI  |   .0110053   .0048868     2.25   0.029     .0011899    .0208207
                 CT  |   .0101805   .0045087     2.26   0.028     .0011245    .0192366
                 NY  |   .0960191    .004279    22.44   0.000     .0874246    .1046137
                 NJ  |   .0430672   .0049529     8.70   0.000     .0331191    .0530153
                 PA  |   .0124479    .003639     3.42   0.001     .0051388    .0197569
                 OH  |   .0054485   .0036718     1.48   0.144    -.0019266    .0128237
                 IN  |  -.0190188   .0043645    -4.36   0.000     -.027785   -.0102525
                 IL  |   .0353034   .0048007     7.35   0.000     .0256609     .044946
                 MI  |   .0407743   .0052409     7.78   0.000     .0302476    .0513011
                 WI  |  -.0081695   .0035978    -2.27   0.028    -.0153959   -.0009432
                 MN  |   .0133296   .0035504     3.75   0.000     .0061984    .0204607
                 IA  |   -.000637   .0086412    -0.07   0.942    -.0179933    .0167192
                 MO  |  -.0104002   .0034831    -2.99   0.004    -.0173963   -.0034041
                 ND  |  -.0644874   .0081244    -7.94   0.000    -.0808057   -.0481691
                 SD  |  -.0876433   .0083272   -10.52   0.000    -.1043689   -.0709177
                 NE  |  -.0405594   .0088001    -4.61   0.000     -.058235   -.0228839
                 KS  |  -.0458163   .0089962    -5.09   0.000    -.0638856   -.0277469
                 DE  |  -.0561812   .0016321   -34.42   0.000    -.0594593    -.052903
                 MD  |  -.0527057   .0043636   -12.08   0.000    -.0614703   -.0439411
                 DC  |    -.05849   .0076468    -7.65   0.000    -.0738489    -.043131
                 VA  |  -.0880591   .0091733    -9.60   0.000    -.1064843    -.069634
                 WV  |   -.025107   .0031946    -7.86   0.000    -.0315236   -.0186904
                 NC  |  -.1088294    .009753   -11.16   0.000    -.1284189   -.0892398
                 SC  |  -.1107147   .0097695   -11.33   0.000    -.1303373    -.091092
                 GA  |  -.0742978   .0100363    -7.40   0.000    -.0944562   -.0541393
                 FL  |  -.0612802   .0104028    -5.89   0.000    -.0821748   -.0403856
                 KY  |  -.0463846     .00342   -13.56   0.000    -.0532539   -.0395154
                 TN  |  -.0716616   .0096601    -7.42   0.000    -.0910646   -.0522586
                 AL  |  -.0510616   .0095554    -5.34   0.000    -.0702542   -.0318691
                 MS  |  -.0889117   .0095254    -9.33   0.000     -.108044   -.0697794
                 AR  |  -.1005566   .0093147   -10.80   0.000    -.1192657   -.0818476
                 LA  |  -.0700858   .0101071    -6.93   0.000    -.0903865    -.049785
                 OK  |  -.0839294   .0072987   -11.50   0.000    -.0985893   -.0692696
                 TX  |  -.0760283   .0103073    -7.38   0.000    -.0967311   -.0553254
                 MT  |  -.0140952   .0020963    -6.72   0.000    -.0183058   -.0098847
                 ID  |  -.0909282   .0020921   -43.46   0.000    -.0951303   -.0867261
                 WY  |  -.0652249   .0085606    -7.62   0.000    -.0824193   -.0480305
                 CO  |  -.0577355   .0042003   -13.75   0.000    -.0661722   -.0492989
                 NM  |   -.085778   .0048547   -17.67   0.000     -.095529   -.0760269
                 AZ  |  -.0705972   .0105578    -6.69   0.000    -.0918031   -.0493912
                 UT  |  -.0754212   .0097004    -7.78   0.000     -.094905   -.0559374
                 NV  |   .0463523   .0109461     4.23   0.000     .0243664    .0683382
                 WA  |   .0416914   .0043459     9.59   0.000     .0329625    .0504203
                 OR  |   .0025282   .0044916     0.56   0.576    -.0064935    .0115499
                 CA  |   .0245054   .0058952     4.16   0.000     .0126646    .0363462
                 AK  |   .0489152   .0069092     7.08   0.000     .0350377    .0627927
                 HI  |   .0397218    .003972    10.00   0.000     .0317437    .0476998
                     |
                year |
               1997  |  -.0014484   .0024424    -0.59   0.556    -.0063541    .0034573
               1998  |  -.0076889   .0028448    -2.70   0.009    -.0134029    -.001975
               1999  |  -.0072708   .0039139    -1.86   0.069    -.0151322    .0005906
               2000  |  -.0109465   .0040693    -2.69   0.010      -.01912    -.002773
               2001  |  -.0125168   .0038099    -3.29   0.002    -.0201692   -.0048645
               2002  |  -.0141892   .0038311    -3.70   0.001    -.0218842   -.0064941
               2003  |  -.0185826   .0039139    -4.75   0.000     -.026444   -.0107212
               2004  |  -.0243437   .0035175    -6.92   0.000    -.0314088   -.0172785
               2005  |  -.0299949   .0048669    -6.16   0.000    -.0397703   -.0202195
               2006  |  -.0358358   .0050964    -7.03   0.000    -.0460722   -.0255993
               2007  |  -.0347353   .0055475    -6.26   0.000    -.0458779   -.0235927
               2008  |  -.0242268   .0048414    -5.00   0.000     -.033951   -.0145025
               2009  |  -.0218361   .0048939    -4.46   0.000    -.0316658   -.0120064
               2010  |  -.0263154   .0056528    -4.66   0.000    -.0376693   -.0149616
               2011  |  -.0295863   .0046971    -6.30   0.000    -.0390206   -.0201519
               2012  |  -.0289224   .0049262    -5.87   0.000    -.0388169   -.0190278
               2013  |  -.0337508   .0041234    -8.19   0.000    -.0420328   -.0254687
               2014  |  -.0336201   .0052233    -6.44   0.000    -.0441115   -.0231287
               2015  |  -.0372291   .0051656    -7.21   0.000    -.0476046   -.0268536
               2016  |  -.0384402   .0053055    -7.25   0.000    -.0490967   -.0277837
               2017  |  -.0355547    .004638    -7.67   0.000    -.0448704   -.0262389
               2018  |  -.0361034    .005183    -6.97   0.000    -.0465138    -.025693
               2019  |   -.036796   .0068225    -5.39   0.000    -.0504993   -.0230926
                     |
                nind |
                  2  |   .0845389   .0156267     5.41   0.000     .0531518    .1159261
                  3  |    .068414   .0084596     8.09   0.000     .0514225    .0854056
                  4  |   .0076144   .0074187     1.03   0.310    -.0072866    .0225154
                  5  |   .1530749   .0068803    22.25   0.000     .1392555    .1668943
                  6  |   .0042991   .0082647     0.52   0.605     -.012301    .0208992
                  7  |  -.0018586   .0059009    -0.31   0.754    -.0137108    .0099936
                  8  |   .0141553   .0117879     1.20   0.235    -.0095213    .0378319
                  9  |    .114783   .0145636     7.88   0.000     .0855311    .1440348
                 10  |   .0055021   .0151443     0.36   0.718    -.0249161    .0359202
                 11  |   .0768249   .0135446     5.67   0.000     .0496197    .1040301
                     |
                educ |   .0094741   .0016767     5.65   0.000     .0061064    .0128419
               exper |   .0066044   .0007895     8.37   0.000     .0050187    .0081902
              exper2 |  -.0000348   .0000436    -0.80   0.429    -.0001225    .0000529
              exper3 |   2.73e-07   1.91e-06     0.14   0.887    -3.57e-06    4.12e-06
              exper4 |  -1.81e-08   2.49e-08    -0.72   0.472    -6.81e-08    3.20e-08
                edex |  -.0002251   .0000342    -6.58   0.000    -.0002938   -.0001564
                     |
               ee_cl |
                  2  |  -.0157381   .0045518    -3.46   0.001    -.0248806   -.0065956
                  3  |  -.0141778   .0057286    -2.47   0.017    -.0256841   -.0026715
                  4  |  -.0281119   .0104122    -2.70   0.009    -.0490254   -.0071983
                  5  |  -.0464464   .0078715    -5.90   0.000    -.0622568    -.030636
                  6  |  -.0091617   .0038571    -2.38   0.021    -.0169088   -.0014145
                  7  |    .016653    .006725     2.48   0.017     .0031455    .0301605
                  8  |  -.0320715   .0120067    -2.67   0.010    -.0561878   -.0079553
                  9  |  -.0560552   .0067028    -8.36   0.000    -.0695181   -.0425923
                 10  |   .0065913   .0062197     1.06   0.294    -.0059012    .0190839
                 11  |   .0197525   .0080844     2.44   0.018     .0035145    .0359904
                 12  |  -.0400908   .0128987    -3.11   0.003    -.0659986    -.014183
                 13  |  -.0264618   .0067828    -3.90   0.000    -.0400854   -.0128382
                 14  |   .0247033   .0067716     3.65   0.001     .0111021    .0383045
                 15  |   .0159334   .0091362     1.74   0.087    -.0024173     .034284
                 16  |  -.0420554   .0136812    -3.07   0.003    -.0695349   -.0145758
                     |
                marr |   .0155291   .0021551     7.21   0.000     .0112004    .0198579
               partt |  -.0523415   .0055325    -9.46   0.000    -.0634539   -.0412291
              public |   .2723517   .0288898     9.43   0.000     .2143249    .3303784
                cmsa |   .0359363   .0053081     6.77   0.000     .0252747    .0465979
                     |
               nocc2 |
                  2  |    .046196    .002931    15.76   0.000     .0403089     .052083
                  3  |   .0301796   .0049709     6.07   0.000     .0201953    .0401639
                  4  |   .1520084   .0094286    16.12   0.000     .1330706    .1709463
                  5  |   .1366761   .0161191     8.48   0.000        .1043    .1690522
                  6  |   .1292278   .0078249    16.52   0.000     .1135111    .1449445
                  7  |   .0702734   .0054356    12.93   0.000     .0593557    .0811911
                  8  |   .0589634    .008983     6.56   0.000     .0409205    .0770063
                  9  |   .1571983   .0108005    14.55   0.000     .1355048    .1788918
                 10  |   .1707403   .0123885    13.78   0.000     .1458572    .1956235
                 11  |   .1897084    .015581    12.18   0.000     .1584131    .2210038
                 12  |   .1884175     .01576    11.96   0.000     .1567626    .2200724
                     |
               unemp |  -.0015444   .0013913    -1.11   0.272    -.0043388      .00125
             citizen |  -.0167545   .0026946    -6.22   0.000    -.0221669   -.0113422
                     |
             quarter |
                  2  |  -.0035648   .0013504    -2.64   0.011    -.0062772   -.0008525
                  3  |  -.0019411   .0014151    -1.37   0.176    -.0047834    .0009012
                  4  |  -.0029003   .0013707    -2.12   0.039    -.0056534   -.0001472
                     |
               _cons |  -.1655674   .0362862    -4.56   0.000    -.2384504   -.0926843
--------------------------------------------------------------------------------------

.         
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 e
> xper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 1, vce(cluster state)
(sum of wgt is 7,117,341,982)

Linear regression                               Number of obs     =    805,738
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2766
                                                Root MSE          =     .28781

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |   .0098055   .0085293     1.15   0.256     -.007326     .026937
            treat_st |  -.0279295     .01151    -2.43   0.019     -.051048    -.004811
treat_sthisprelwhite |   .0066687   .0129305     0.52   0.608    -.0193029    .0326404
                     |
               state |
                 NH  |  -.0116932   .0016391    -7.13   0.000    -.0149854    -.008401
                 VT  |   -.005031   .0011126    -4.52   0.000    -.0072657   -.0027962
                 MA  |   .0210412   .0030219     6.96   0.000     .0149715    .0271108
                 RI  |   .0381768   .0028468    13.41   0.000     .0324588    .0438947
                 CT  |   .0313562    .002659    11.79   0.000     .0260154     .036697
                 NY  |    .102418   .0028861    35.49   0.000      .096621     .108215
                 NJ  |   .0332329   .0032387    10.26   0.000     .0267278    .0397381
                 PA  |   .0064791   .0025282     2.56   0.013      .001401    .0115572
                 OH  |  -.0016485   .0021042    -0.78   0.437     -.005875     .002578
                 IN  |  -.0427688   .0041682   -10.26   0.000    -.0511408   -.0343968
                 IL  |  -.0003779   .0033723    -0.11   0.911    -.0071514    .0063955
                 MI  |   .0434835   .0037654    11.55   0.000     .0359205    .0510465
                 WI  |   -.004815   .0033771    -1.43   0.160     -.011598     .001968
                 MN  |   .0333305   .0020961    15.90   0.000     .0291203    .0375406
                 IA  |   .0051421   .0116612     0.44   0.661    -.0182801    .0285644
                 MO  |  -.0502581    .002091   -24.04   0.000    -.0544579   -.0460583
                 ND  |  -.0435237   .0115471    -3.77   0.000    -.0667166   -.0203308
                 SD  |  -.0530562   .0116635    -4.55   0.000     -.076483   -.0296293
                 NE  |  -.0220762   .0116562    -1.89   0.064    -.0454883     .001336
                 KS  |   -.052119   .0115539    -4.51   0.000    -.0753257   -.0289123
                 DE  |  -.0303871   .0011579   -26.24   0.000    -.0327128   -.0280615
                 MD  |  -.0317549   .0028878   -11.00   0.000    -.0375553   -.0259546
                 DC  |  -.0622211   .0039097   -15.91   0.000    -.0700739   -.0543683
                 VA  |  -.0744139   .0115242    -6.46   0.000    -.0975608   -.0512669
                 WV  |  -.0304742   .0025199   -12.09   0.000    -.0355356   -.0254127
                 NC  |  -.0914918   .0117793    -7.77   0.000    -.1151512   -.0678324
                 SC  |   -.096715   .0116477    -8.30   0.000    -.1201101   -.0733198
                 GA  |  -.0763722   .0117687    -6.49   0.000    -.1000103    -.052734
                 FL  |  -.0336496   .0118944    -2.83   0.007    -.0575402    -.009759
                 KY  |  -.0566891   .0020305   -27.92   0.000    -.0607674   -.0526108
                 TN  |  -.0636223   .0117699    -5.41   0.000    -.0872627   -.0399818
                 AL  |  -.0312224   .0116235    -2.69   0.010    -.0545689    -.007876
                 MS  |  -.0844655   .0116358    -7.26   0.000    -.1078368   -.0610942
                 AR  |  -.0773502   .0116112    -6.66   0.000     -.100672   -.0540284
                 LA  |  -.0608028   .0116348    -5.23   0.000    -.0841719   -.0374337
                 OK  |  -.0611219   .0084717    -7.21   0.000    -.0781378    -.044106
                 TX  |  -.0663952   .0118318    -5.61   0.000    -.0901601   -.0426303
                 MT  |   .0027055   .0016073     1.68   0.099    -.0005228    .0059338
                 ID  |   -.075489   .0013404   -56.32   0.000    -.0781812   -.0727968
                 WY  |  -.0874582   .0119105    -7.34   0.000    -.1113812   -.0635352
                 CO  |  -.0412859   .0029327   -14.08   0.000    -.0471764   -.0353954
                 NM  |  -.0670986   .0048755   -13.76   0.000    -.0768914   -.0573058
                 AZ  |  -.0520765   .0117698    -4.42   0.000    -.0757169   -.0284361
                 UT  |  -.0549603   .0116643    -4.71   0.000    -.0783887    -.031532
                 NV  |   .0639074   .0119469     5.35   0.000     .0399114    .0879034
                 WA  |   .0575813     .00228    25.25   0.000     .0530017    .0621609
                 OR  |   .0446473   .0022295    20.03   0.000     .0401692    .0491255
                 CA  |    .043856   .0047692     9.20   0.000     .0342768    .0534351
                 AK  |   .0789374   .0043916    17.97   0.000     .0701166    .0877583
                 HI  |   .0582555   .0027927    20.86   0.000     .0526462    .0638649
                     |
                year |
               1997  |  -.0047155   .0014979    -3.15   0.003     -.007724   -.0017069
               1998  |  -.0071414    .002779    -2.57   0.013    -.0127232   -.0015596
               1999  |   -.009507    .001873    -5.08   0.000    -.0132689   -.0057451
               2000  |  -.0092977   .0018329    -5.07   0.000    -.0129791   -.0056162
               2001  |  -.0073365   .0023703    -3.10   0.003    -.0120974   -.0025755
               2002  |  -.0090324    .003232    -2.79   0.007     -.015524   -.0025408
               2003  |  -.0137984   .0029427    -4.69   0.000    -.0197089   -.0078879
               2004  |  -.0156963   .0031198    -5.03   0.000    -.0219626   -.0094301
               2005  |  -.0174767   .0027216    -6.42   0.000    -.0229433   -.0120101
               2006  |  -.0192792   .0027374    -7.04   0.000    -.0247774   -.0137811
               2007  |  -.0206992   .0033702    -6.14   0.000    -.0274684     -.01393
               2008  |  -.0163592   .0041041    -3.99   0.000    -.0246026   -.0081159
               2009  |   -.013731    .004263    -3.22   0.002    -.0222934   -.0051686
               2010  |  -.0174575   .0047578    -3.67   0.001    -.0270139   -.0079012
               2011  |  -.0166779   .0043562    -3.83   0.000    -.0254275   -.0079284
               2012  |  -.0222538   .0044959    -4.95   0.000    -.0312841   -.0132235
               2013  |  -.0188885   .0038673    -4.88   0.000    -.0266562   -.0111209
               2014  |  -.0223066   .0036121    -6.18   0.000    -.0295616   -.0150516
               2015  |  -.0226313   .0034237    -6.61   0.000    -.0295081   -.0157545
               2016  |  -.0218904   .0034821    -6.29   0.000    -.0288844   -.0148965
               2017  |  -.0249793   .0035136    -7.11   0.000    -.0320366   -.0179219
               2018  |  -.0265667   .0029657    -8.96   0.000    -.0325235   -.0206098
               2019  |  -.0272254   .0048608    -5.60   0.000    -.0369886   -.0174622
                     |
                nind |
                  2  |   .0326657   .0089162     3.66   0.001      .014757    .0505744
                  3  |   .0350568   .0085965     4.08   0.000     .0177902    .0523234
                  4  |   .0377793   .0099435     3.80   0.000     .0178073    .0577513
                  5  |   .1292193   .0091419    14.13   0.000     .1108573    .1475813
                  6  |   .0165023   .0080312     2.05   0.045     .0003712    .0326334
                  7  |   .0053361    .007704     0.69   0.492     -.010138    .0208101
                  8  |   .0203796   .0121151     1.68   0.099    -.0039542    .0447134
                  9  |    .139522   .0177179     7.87   0.000     .1039346    .1751094
                 10  |    .010236   .0109321     0.94   0.354    -.0117217    .0321937
                 11  |   .0028684   .0190865     0.15   0.881    -.0354679    .0412047
                     |
                educ |   .0160151   .0022197     7.22   0.000     .0115568    .0204735
               exper |   .0096558   .0011535     8.37   0.000     .0073389    .0119727
              exper2 |  -.0003036   .0000668    -4.54   0.000    -.0004378   -.0001694
              exper3 |   6.35e-06   2.08e-06     3.05   0.004     2.17e-06    .0000105
              exper4 |  -5.51e-08   2.22e-08    -2.48   0.016    -9.97e-08   -1.05e-08
                edex |   -.000209   .0000453    -4.61   0.000       -.0003   -.0001181
                     |
               ee_cl |
                  2  |  -.0356102   .0044363    -8.03   0.000    -.0445208   -.0266997
                  3  |  -.0667658   .0069017    -9.67   0.000    -.0806283   -.0529033
                  4  |  -.0945711   .0148662    -6.36   0.000    -.1244308   -.0647114
                  5  |  -.0392109   .0091952    -4.26   0.000      -.05768   -.0207417
                  6  |  -.0521141   .0059404    -8.77   0.000    -.0640456   -.0401825
                  7  |  -.0670246   .0090347    -7.42   0.000    -.0851713   -.0488778
                  8  |   -.087746    .014588    -6.01   0.000    -.1170468   -.0584452
                  9  |  -.0374039   .0078964    -4.74   0.000    -.0532643   -.0215436
                 10  |  -.0523392   .0076357    -6.85   0.000    -.0676759   -.0370024
                 11  |  -.0664236   .0092834    -7.16   0.000    -.0850699   -.0477774
                 12  |  -.0780742    .014344    -5.44   0.000     -.106885   -.0492633
                 13  |  -.0148155   .0099839    -1.48   0.144    -.0348687    .0052378
                 14  |  -.0384621   .0076787    -5.01   0.000    -.0538853    -.023039
                 15  |  -.0539411   .0113063    -4.77   0.000    -.0766505   -.0312317
                 16  |  -.0669149   .0151164    -4.43   0.000    -.0972771   -.0365526
                     |
                marr |   -.001467   .0009562    -1.53   0.131    -.0033876    .0004537
               partt |  -.0502834   .0049091   -10.24   0.000    -.0601437   -.0404231
              public |   .2890947   .0302676     9.55   0.000     .2283004    .3498891
                cmsa |    .020328   .0028315     7.18   0.000     .0146408    .0260152
                     |
               nocc2 |
                  2  |   .0206666   .0018953    10.90   0.000     .0168598    .0244735
                  3  |   .0327053   .0071674     4.56   0.000     .0183091    .0471015
                  4  |   .1449768   .0066466    21.81   0.000     .1316267    .1583269
                  5  |   .1316313   .0161879     8.13   0.000      .099117    .1641457
                  6  |    .060232   .0054221    11.11   0.000     .0493414    .0711227
                  7  |   .0774864   .0076516    10.13   0.000     .0621177     .092855
                  8  |   .0531785   .0030223    17.60   0.000     .0471081    .0592489
                  9  |   .0923488   .0086236    10.71   0.000     .0750279    .1096698
                 10  |   .1465736   .0116155    12.62   0.000     .1232431    .1699041
                 11  |    .177193   .0155538    11.39   0.000     .1459523    .2084337
                 12  |   .1636166   .0150528    10.87   0.000     .1333821    .1938511
                     |
               unemp |   -.000569   .0008151    -0.70   0.488     -.002206    .0010681
             citizen |   -.007011   .0019043    -3.68   0.001    -.0108359   -.0031861
                     |
             quarter |
                  2  |  -.0011943   .0010572    -1.13   0.264    -.0033177    .0009291
                  3  |  -.0002198   .0009812    -0.22   0.824    -.0021906     .001751
                  4  |  -.0021989   .0012484    -1.76   0.084    -.0047063    .0003086
                     |
               _cons |  -.2141859     .03448    -6.21   0.000     -.283441   -.1449307
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 0, vce(cluster state) 
(sum of wgt is 7,768,840,614)

Linear regression                               Number of obs     =    834,347
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5288
                                                Root MSE          =      .4154

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1287022    .012176   -10.57   0.000    -.1531584   -.1042461
            treat_st |  -.0367206   .0159073    -2.31   0.025    -.0686712   -.0047699
treat_sthisprelwhite |   .0190421   .0280314     0.68   0.500    -.0372607    .0753448
                     |
               state |
                 NH  |   .0838477   .0047754    17.56   0.000     .0742561    .0934393
                 VT  |   .0197839   .0021919     9.03   0.000     .0153814    .0241863
                 MA  |   .1386507   .0086647    16.00   0.000     .1212471    .1560542
                 RI  |   .0535455   .0089259     6.00   0.000     .0356172    .0714738
                 CT  |   .1467622   .0087209    16.83   0.000     .1292459    .1642786
                 NY  |   .1181458   .0087959    13.43   0.000     .1004788    .1358129
                 NJ  |   .1848949   .0097912    18.88   0.000     .1652287    .2045611
                 PA  |   .0231003   .0066309     3.48   0.001     .0097817    .0364189
                 OH  |  -.0066509   .0064532    -1.03   0.308    -.0196126    .0063108
                 IN  |   .0170782   .0066866     2.55   0.014     .0036477    .0305087
                 IL  |   .1081959   .0086437    12.52   0.000     .0908346    .1255571
                 MI  |   .0552786   .0085565     6.46   0.000     .0380923    .0724648
                 WI  |     .03842   .0057587     6.67   0.000     .0268534    .0499867
                 MN  |   .0799847   .0063962    12.51   0.000     .0671376    .0928318
                 IA  |   .0281088   .0146956     1.91   0.062    -.0014083    .0576258
                 MO  |  -.0081321   .0061588    -1.32   0.193    -.0205024    .0042382
                 ND  |   .0365115   .0145975     2.50   0.016     .0071915    .0658314
                 SD  |  -.0372327   .0142475    -2.61   0.012    -.0658496   -.0086157
                 NE  |  -.0130251   .0144969    -0.90   0.373    -.0421429    .0160927
                 KS  |   .0044466    .015908     0.28   0.781    -.0275056    .0363988
                 DE  |   .0451045   .0020902    21.58   0.000     .0409063    .0493028
                 MD  |   .1447904   .0092417    15.67   0.000     .1262278    .1633529
                 DC  |   .2441644   .0131113    18.62   0.000     .2178296    .2704992
                 VA  |   .1449498   .0160342     9.04   0.000     .1127442    .1771554
                 WV  |  -.0475969   .0044334   -10.74   0.000    -.0565016   -.0386922
                 NC  |   .0115955   .0179885     0.64   0.522    -.0245356    .0477266
                 SC  |  -.0058349    .018044    -0.32   0.748    -.0420773    .0304075
                 GA  |   .0601736   .0180783     3.33   0.002     .0238622    .0964849
                 FL  |   .0060681   .0192604     0.32   0.754    -.0326176    .0447538
                 KY  |  -.0351025   .0058365    -6.01   0.000    -.0468253   -.0233796
                 TN  |  -.0247845   .0174662    -1.42   0.162    -.0598664    .0102974
                 AL  |    .016073   .0176102     0.91   0.366    -.0192982    .0514442
                 MS  |  -.0119697   .0187057    -0.64   0.525    -.0495412    .0256018
                 AR  |  -.0628774   .0171934    -3.66   0.001    -.0974114   -.0283433
                 LA  |   .0471437   .0184452     2.56   0.014     .0100955    .0841919
                 OK  |  -.0475092   .0124305    -3.82   0.000    -.0724766   -.0225418
                 TX  |   .0541402   .0197229     2.75   0.008     .0145255    .0937548
                 MT  |  -.0326839   .0011696   -27.94   0.000    -.0350331   -.0303347
                 ID  |  -.0262753   .0054067    -4.86   0.000    -.0371349   -.0154157
                 WY  |   .1688695   .0167079    10.11   0.000     .1353107    .2024282
                 CO  |   .0635346    .008708     7.30   0.000     .0460441     .081025
                 NM  |   .0208488   .0087566     2.38   0.021     .0032606    .0384369
                 AZ  |   .0587092   .0201281     2.92   0.005     .0182807    .0991376
                 UT  |   .0185337   .0163761     1.13   0.263    -.0143587    .0514262
                 NV  |   .1453354   .0203314     7.15   0.000     .1044987    .1861722
                 WA  |   .1291067   .0078948    16.35   0.000     .1132496    .1449638
                 OR  |   .0519974   .0080853     6.43   0.000     .0357577    .0682372
                 CA  |   .1658532   .0126508    13.11   0.000     .1404433     .191263
                 AK  |   .2333656    .007184    32.48   0.000      .218936    .2477951
                 HI  |   .1508038   .0065494    23.03   0.000     .1376489    .1639586
                     |
                year |
               1997  |   .0101306   .0036344     2.79   0.007     .0028306    .0174306
               1998  |   .0310124   .0048289     6.42   0.000     .0213133    .0407115
               1999  |    .050652   .0063595     7.96   0.000     .0378786    .0634255
               2000  |   .0592273   .0072205     8.20   0.000     .0447245    .0737301
               2001  |   .0793578   .0067652    11.73   0.000     .0657695     .092946
               2002  |   .0957934   .0056632    16.91   0.000     .0844185    .1071683
               2003  |   .0878619   .0064373    13.65   0.000     .0749321    .1007916
               2004  |   .0748284   .0058352    12.82   0.000     .0631081    .0865487
               2005  |   .0584098   .0070924     8.24   0.000     .0441644    .0726552
               2006  |   .0503308   .0081465     6.18   0.000     .0339681    .0666936
               2007  |    .053504   .0093669     5.71   0.000       .03469    .0723179
               2008  |   .0581512   .0086785     6.70   0.000     .0407198    .0755825
               2009  |    .097967   .0093568    10.47   0.000     .0791734    .1167606
               2010  |   .0889287   .0085951    10.35   0.000      .071665    .1061924
               2011  |   .0609191   .0081016     7.52   0.000     .0446467    .0771916
               2012  |   .0517042   .0092768     5.57   0.000     .0330713    .0703372
               2013  |    .044187   .0083569     5.29   0.000     .0274017    .0609724
               2014  |   .0347974   .0087737     3.97   0.000      .017175    .0524198
               2015  |   .0481714    .008651     5.57   0.000     .0307954    .0655474
               2016  |   .0619674   .0096615     6.41   0.000     .0425617    .0813731
               2017  |   .0651653   .0105261     6.19   0.000     .0440231    .0863076
               2018  |   .0728442   .0104462     6.97   0.000     .0518625     .093826
               2019  |   .0878787    .010035     8.76   0.000     .0677229    .1080345
                     |
                nind |
                  2  |   .0767023   .0362902     2.11   0.040     .0038114    .1495933
                  3  |   .0927847   .0252815     3.67   0.001     .0420054    .1435641
                  4  |  -.0791062   .0312823    -2.53   0.015    -.1419386   -.0162737
                  5  |    .132873   .0288972     4.60   0.000     .0748312    .1909148
                  6  |   .0955879   .0311351     3.07   0.003     .0330512    .1581246
                  7  |   .0071886   .0288227     0.25   0.804    -.0507035    .0650807
                  8  |  -.0459658   .0292548    -1.57   0.122    -.1047257    .0127941
                  9  |  -.0670689   .0313437    -2.14   0.037    -.1300245   -.0041132
                 10  |  -.0844304   .0334946    -2.52   0.015    -.1517062   -.0171546
                 11  |   .1168276   .0325545     3.59   0.001       .05144    .1822152
                     |
                educ |   .0597154   .0024517    24.36   0.000      .054791    .0646398
               exper |    .048999    .002176    22.52   0.000     .0446283    .0533696
              exper2 |  -.0010304   .0001183    -8.71   0.000     -.001268   -.0007929
              exper3 |   7.68e-06   3.38e-06     2.27   0.027     8.99e-07    .0000145
              exper4 |  -1.26e-09   3.36e-08    -0.04   0.970    -6.88e-08    6.63e-08
                edex |   -.000663   .0000659   -10.06   0.000    -.0007954   -.0005306
                     |
               ee_cl |
                  2  |  -.0427104   .0050948    -8.38   0.000    -.0529436   -.0324773
                  3  |  -.0400509   .0104284    -3.84   0.000     -.060997   -.0191048
                  4  |    .036941   .0211189     1.75   0.086    -.0054775    .0793595
                  5  |  -.1023654   .0058881   -17.39   0.000    -.1141919   -.0905389
                  6  |  -.0801849   .0061034   -13.14   0.000     -.092444   -.0679259
                  7  |  -.0263076    .012734    -2.07   0.044    -.0518847   -.0007305
                  8  |   .1071788   .0213249     5.03   0.000     .0643464    .1500111
                  9  |  -.1389101   .0088519   -15.69   0.000    -.1566896   -.1211306
                 10  |  -.0909564   .0087347   -10.41   0.000    -.1085007   -.0734122
                 11  |  -.0218362   .0144282    -1.51   0.136     -.050816    .0071436
                 12  |   .1094743   .0219687     4.98   0.000     .0653488    .1535998
                 13  |  -.1190782   .0129541    -9.19   0.000    -.1450972   -.0930591
                 14  |  -.0685712   .0094127    -7.28   0.000    -.0874771   -.0496652
                 15  |  -.0120432   .0146153    -0.82   0.414    -.0413989    .0173125
                 16  |   .1125141   .0237612     4.74   0.000     .0647883      .16024
                     |
                marr |   .1232253   .0021001    58.68   0.000     .1190071    .1274435
               partt |  -.1898589    .008214   -23.11   0.000    -.2063572   -.1733607
              public |   .0149036   .0083566     1.78   0.081    -.0018812    .0316883
                cmsa |   .1377705   .0088087    15.64   0.000     .1200776    .1554633
                     |
               nocc2 |
                  2  |  -.1523684    .004164   -36.59   0.000     -.160732   -.1440047
                  3  |  -.0362058   .0064926    -5.58   0.000    -.0492466    -.023165
                  4  |  -.3008031   .0087776   -34.27   0.000    -.3184333   -.2831728
                  5  |  -.0888498   .0098364    -9.03   0.000    -.1086067   -.0690929
                  6  |  -.3926566    .006727   -58.37   0.000    -.4061682   -.3791449
                  7  |  -.2418315   .0079132   -30.56   0.000    -.2577257   -.2259373
                  8  |  -.0944525   .0135447    -6.97   0.000    -.1216578   -.0672471
                  9  |  -.3931325   .0043427   -90.53   0.000    -.4018551   -.3844098
                 10  |  -.3556937   .0086843   -40.96   0.000    -.3731367   -.3382507
                 11  |  -.2411143   .0082723   -29.15   0.000    -.2577296   -.2244989
                 12  |   -.398405   .0076541   -52.05   0.000    -.4137786   -.3830313
                     |
               unemp |  -.0080663   .0022393    -3.60   0.001    -.0125641   -.0035685
             citizen |  -.0412685   .0039724   -10.39   0.000    -.0492474   -.0332897
                     |
             quarter |
                  2  |   .0039928   .0018795     2.12   0.039     .0002177    .0077679
                  3  |   .0036343   .0019763     1.84   0.072    -.0003352    .0076038
                  4  |   .0136034   .0016471     8.26   0.000     .0102951    .0169116
                     |
               _cons |   .7635286   .0423774    18.02   0.000     .6784111    .8486462
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 1, vce(cluster state)
(sum of wgt is 7,117,341,982)

Linear regression                               Number of obs     =    805,738
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5094
                                                Root MSE          =     .39707

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0927946   .0144238    -6.43   0.000    -.1217656   -.0638236
            treat_st |  -.0341803   .0080546    -4.24   0.000    -.0503585   -.0180021
treat_sthisprelwhite |   .0128931   .0258956     0.50   0.621    -.0391197    .0649059
                     |
               state |
                 NH  |   .0549543   .0037031    14.84   0.000     .0475164    .0623922
                 VT  |    .036417   .0016422    22.18   0.000     .0331186    .0397155
                 MA  |   .1130942   .0083877    13.48   0.000      .096247    .1299415
                 RI  |   .0353332   .0087232     4.05   0.000     .0178121    .0528543
                 CT  |   .1177114   .0085063    13.84   0.000     .1006259    .1347969
                 NY  |   .0778054    .008583     9.07   0.000      .060566    .0950448
                 NJ  |   .1353958   .0096618    14.01   0.000     .1159896    .1548021
                 PA  |  -.0304176   .0063408    -4.80   0.000    -.0431535   -.0176817
                 OH  |  -.0564032   .0061648    -9.15   0.000    -.0687856   -.0440207
                 IN  |  -.0513888   .0053244    -9.65   0.000    -.0620833   -.0406944
                 IL  |   .0205421   .0081471     2.52   0.015     .0041781    .0369061
                 MI  |  -.0099881   .0072208    -1.38   0.173    -.0244915    .0045154
                 WI  |   .0042485   .0049565     0.86   0.395     -.005707     .014204
                 MN  |    .057899   .0056458    10.26   0.000     .0465591    .0692389
                 IA  |  -.0164301   .0078038    -2.11   0.040    -.0321046   -.0007557
                 MO  |    -.07791   .0059195   -13.16   0.000    -.0897996   -.0660204
                 ND  |  -.0483551   .0075476    -6.41   0.000    -.0635148   -.0331954
                 SD  |   -.068384    .007597    -9.00   0.000    -.0836431   -.0531249
                 NE  |  -.0499448   .0079375    -6.29   0.000    -.0658877   -.0340018
                 KS  |   -.054373   .0085942    -6.33   0.000    -.0716351    -.037111
                 DE  |   .0410273   .0015344    26.74   0.000     .0379453    .0441094
                 MD  |    .112502   .0091633    12.28   0.000     .0940969     .130907
                 DC  |   .2031365   .0140833    14.42   0.000     .1748493    .2314237
                 VA  |   .0845837   .0099894     8.47   0.000     .0645194     .104648
                 WV  |  -.1550319   .0024269   -63.88   0.000    -.1599065   -.1501574
                 NC  |  -.0230412   .0098201    -2.35   0.023    -.0427655   -.0033169
                 SC  |  -.0666793   .0100749    -6.62   0.000    -.0869153   -.0464433
                 GA  |  -.0026998   .0103393    -0.26   0.795    -.0234669    .0180673
                 FL  |  -.0271634   .0113389    -2.40   0.020    -.0499383   -.0043884
                 KY  |  -.0811559   .0046846   -17.32   0.000    -.0905652   -.0717467
                 TN  |   -.071524   .0098254    -7.28   0.000    -.0912588   -.0517892
                 AL  |  -.0705462   .0096556    -7.31   0.000    -.0899401   -.0511523
                 MS  |  -.0954995   .0094013   -10.16   0.000    -.1143825   -.0766164
                 AR  |  -.1059975   .0089388   -11.86   0.000    -.1239517   -.0880433
                 LA  |  -.0752523   .0107111    -7.03   0.000     -.096766   -.0537385
                 OK  |  -.1325971   .0075111   -17.65   0.000    -.1476835   -.1175107
                 TX  |  -.0064551   .0114382    -0.56   0.575    -.0294295    .0165192
                 MT  |  -.0726922   .0008127   -89.44   0.000    -.0743247   -.0710598
                 ID  |  -.0661368   .0041856   -15.80   0.000    -.0745438   -.0577298
                 WY  |   .0155003   .0078315     1.98   0.053    -.0002297    .0312302
                 CO  |   .0220076   .0083614     2.63   0.011     .0052133     .038802
                 NM  |  -.0580455   .0086278    -6.73   0.000    -.0753749   -.0407161
                 AZ  |   .0211706   .0113636     1.86   0.068    -.0016539     .043995
                 UT  |  -.0338764   .0099613    -3.40   0.001    -.0538844   -.0138685
                 NV  |   .0945366   .0115197     8.21   0.000     .0713986    .1176746
                 WA  |   .0774183   .0077725     9.96   0.000     .0618068    .0930297
                 OR  |   .0115662   .0075166     1.54   0.130    -.0035314    .0266638
                 CA  |   .1332144   .0121404    10.97   0.000     .1088297     .157599
                 AK  |   .1821247   .0055106    33.05   0.000     .1710563     .193193
                 HI  |   .0971156   .0065209    14.89   0.000      .084018    .1102131
                     |
                year |
               1997  |   .0093955   .0033056     2.84   0.006     .0027559    .0160351
               1998  |   .0354097   .0028364    12.48   0.000     .0297126    .0411068
               1999  |   .0507821   .0045252    11.22   0.000     .0416928    .0598713
               2000  |   .0642347   .0048941    13.13   0.000     .0544047    .0740647
               2001  |    .081047   .0055834    14.52   0.000     .0698325    .0922615
               2002  |   .0957398   .0061065    15.68   0.000     .0834745    .1080051
               2003  |   .1014972   .0065203    15.57   0.000     .0884008    .1145936
               2004  |   .0930121   .0051631    18.01   0.000     .0826418    .1033824
               2005  |   .0812649   .0050188    16.19   0.000     .0711844    .0913455
               2006  |   .0748127   .0043799    17.08   0.000     .0660154    .0836099
               2007  |   .0746394   .0053678    13.91   0.000     .0638579    .0854208
               2008  |   .0745028   .0064633    11.53   0.000     .0615208    .0874848
               2009  |   .1001114   .0076852    13.03   0.000     .0846752    .1155476
               2010  |   .0963226   .0064458    14.94   0.000     .0833759    .1092694
               2011  |   .0757538    .006057    12.51   0.000      .063588    .0879195
               2012  |   .0581019   .0055126    10.54   0.000     .0470294    .0691744
               2013  |   .0552999   .0055334     9.99   0.000     .0441858     .066414
               2014  |   .0487552   .0049114     9.93   0.000     .0388903    .0586201
               2015  |   .0639053    .004883    13.09   0.000     .0540974    .0737132
               2016  |   .0771233    .006247    12.35   0.000     .0645759    .0896708
               2017  |   .0845511   .0066807    12.66   0.000     .0711325    .0979697
               2018  |   .0865079   .0062005    13.95   0.000     .0740539    .0989619
               2019  |   .0968468   .0062366    15.53   0.000     .0843203    .1093733
                     |
                nind |
                  2  |   .0470858   .0331056     1.42   0.161    -.0194088    .1135804
                  3  |   .1050477   .0303924     3.46   0.001     .0440028    .1660927
                  4  |  -.0916451    .031203    -2.94   0.005    -.1543182    -.028972
                  5  |     .11988   .0314728     3.81   0.000     .0566651     .183095
                  6  |   .0745581   .0328041     2.27   0.027     .0086692     .140447
                  7  |    .017427   .0331099     0.53   0.601    -.0490762    .0839303
                  8  |  -.0305951   .0336319    -0.91   0.367    -.0981467    .0369566
                  9  |  -.0866637   .0383373    -2.26   0.028    -.1636664    -.009661
                 10  |   -.076869   .0319096    -2.41   0.020    -.1409612   -.0127767
                 11  |   .0548783   .0348106     1.58   0.121    -.0150408    .1247974
                     |
                educ |    .090664   .0035791    25.33   0.000     .0834753    .0978528
               exper |   .0541674   .0018586    29.14   0.000     .0504342    .0579006
              exper2 |  -.0015162   .0000927   -16.35   0.000    -.0017024     -.00133
              exper3 |   .0000239   2.59e-06     9.23   0.000     .0000187    .0000291
              exper4 |  -1.38e-07   2.46e-08    -5.61   0.000    -1.88e-07   -8.88e-08
                edex |  -.0010182   .0000728   -13.99   0.000    -.0011644    -.000872
                     |
               ee_cl |
                  2  |  -.1268995   .0086467   -14.68   0.000    -.1442669   -.1095322
                  3  |  -.1581273   .0136923   -11.55   0.000    -.1856291   -.1306256
                  4  |  -.1482066   .0266963    -5.55   0.000    -.2018277   -.0945856
                  5  |  -.1378051    .008068   -17.08   0.000    -.1540101   -.1216001
                  6  |  -.1855805   .0114797   -16.17   0.000    -.2086381   -.1625228
                  7  |  -.1710145   .0176874    -9.67   0.000    -.2065407   -.1354882
                  8  |  -.0734122   .0295966    -2.48   0.017    -.1328587   -.0139657
                  9  |  -.1621531   .0103316   -15.69   0.000    -.1829047   -.1414015
                 10  |  -.2009102   .0120789   -16.63   0.000    -.2251714    -.176649
                 11  |     -.1733   .0168909   -10.26   0.000    -.2072264   -.1393737
                 12  |  -.0736301   .0294649    -2.50   0.016    -.1328121   -.0144482
                 13  |  -.1643309   .0126941   -12.95   0.000    -.1898278   -.1388341
                 14  |   -.185776   .0106073   -17.51   0.000    -.2070813   -.1644707
                 15  |  -.1401849   .0177246    -7.91   0.000    -.1757859    -.104584
                 16  |  -.0470582   .0329704    -1.43   0.160    -.1132813    .0191649
                     |
                marr |   .0368886    .002333    15.81   0.000     .0322026    .0415746
               partt |  -.1325189    .003983   -33.27   0.000    -.1405189   -.1245189
              public |   .0499342    .005983     8.35   0.000      .037917    .0619514
                cmsa |   .1531427    .008055    19.01   0.000     .1369638    .1693216
                     |
               nocc2 |
                  2  |  -.1535446   .0039824   -38.56   0.000    -.1615435   -.1455456
                  3  |  -.0513126   .0060677    -8.46   0.000    -.0634999   -.0391253
                  4  |  -.3077681   .0057485   -53.54   0.000    -.3193143    -.296222
                  5  |   .0298684   .0068731     4.35   0.000     .0160633    .0436734
                  6  |  -.3539014   .0045772   -77.32   0.000    -.3630949   -.3447079
                  7  |  -.3773255    .005709   -66.09   0.000    -.3887923   -.3658586
                  8  |  -.1789707   .0089413   -20.02   0.000    -.1969299   -.1610115
                  9  |  -.4203102   .0061847   -67.96   0.000    -.4327326   -.4078878
                 10  |  -.4509288   .0137217   -32.86   0.000    -.4784897   -.4233679
                 11  |   -.211134   .0102119   -20.68   0.000    -.2316453   -.1906228
                 12  |   -.431331   .0126995   -33.96   0.000    -.4568386   -.4058234
                     |
               unemp |  -.0029143   .0011755    -2.48   0.017    -.0052753   -.0005532
             citizen |  -.0303288   .0035697    -8.50   0.000    -.0374988   -.0231588
                     |
             quarter |
                  2  |   .0061104   .0017354     3.52   0.001     .0026247    .0095962
                  3  |   .0155596   .0019186     8.11   0.000      .011706    .0194133
                  4  |   .0190748   .0012055    15.82   0.000     .0166535    .0214961
                     |
               _cons |   .4127533   .0471618     8.75   0.000     .3180261    .5074805
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 0 & covered == 0, vce(cluster state)
(sum of wgt is 6,607,139,284)

Linear regression                               Number of obs     =    708,473
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5531
                                                Root MSE          =     .41531

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1404435   .0149147    -9.42   0.000    -.1704005   -.1104864
            treat_st |  -.0285549   .0132152    -2.16   0.036    -.0550983   -.0020114
treat_sthisprelwhite |   .0282912   .0284051     1.00   0.324    -.0287622    .0853446
                     |
               state |
                 NH  |   .0908283   .0044657    20.34   0.000     .0818587    .0997978
                 VT  |   .0305159    .002135    14.29   0.000     .0262276    .0348042
                 MA  |   .1362601   .0084129    16.20   0.000     .1193623    .1531579
                 RI  |   .0471367     .00875     5.39   0.000     .0295619    .0647115
                 CT  |   .1386327   .0085493    16.22   0.000     .1214609    .1558046
                 NY  |   .0859617   .0090416     9.51   0.000      .067801    .1041224
                 NJ  |   .1642128   .0099194    16.55   0.000      .144289    .1841366
                 PA  |   .0162577   .0064327     2.53   0.015     .0033373     .029178
                 OH  |  -.0165431   .0062533    -2.65   0.011    -.0291033   -.0039829
                 IN  |   .0106291   .0061786     1.72   0.092     -.001781    .0230391
                 IL  |   .0867975    .008922     9.73   0.000     .0688772    .1047178
                 MI  |   .0338035   .0080387     4.21   0.000     .0176573    .0499497
                 WI  |   .0328836   .0054296     6.06   0.000     .0219778    .0437894
                 MN  |   .0731202   .0060998    11.99   0.000     .0608684    .0853719
                 IA  |   .0224566   .0123316     1.82   0.075    -.0023121    .0472254
                 MO  |  -.0223837    .005778    -3.87   0.000    -.0339891   -.0107783
                 ND  |   .0437762   .0123456     3.55   0.001     .0189793    .0685731
                 SD  |  -.0292581   .0119329    -2.45   0.018    -.0532261   -.0052901
                 NE  |  -.0121892   .0122635    -0.99   0.325    -.0368212    .0124429
                 KS  |  -.0007996   .0133554    -0.06   0.952    -.0276248    .0260256
                 DE  |   .0496173   .0021949    22.61   0.000     .0452087    .0540258
                 MD  |   .1529287   .0089854    17.02   0.000     .1348809    .1709765
                 DC  |   .2537196   .0129852    19.54   0.000      .227638    .2798012
                 VA  |   .1512115   .0136093    11.11   0.000     .1238764    .1785466
                 WV  |  -.0565834    .003768   -15.02   0.000    -.0641516   -.0490151
                 NC  |   .0232393   .0150393     1.55   0.129    -.0069681    .0534467
                 SC  |   .0089472   .0149887     0.60   0.553    -.0211585    .0390528
                 GA  |   .0642621   .0152095     4.23   0.000      .033713    .0948112
                 FL  |   .0087971   .0165896     0.53   0.598    -.0245242    .0421183
                 KY  |  -.0312222   .0052513    -5.95   0.000    -.0417698   -.0206746
                 TN  |   -.021689   .0146118    -1.48   0.144    -.0510377    .0076597
                 AL  |   .0189971   .0146682     1.30   0.201    -.0104649    .0484592
                 MS  |  -.0015706    .015448    -0.10   0.919    -.0325989    .0294577
                 AR  |  -.0527127    .014289    -3.69   0.001    -.0814129   -.0240125
                 LA  |    .053521   .0153988     3.48   0.001     .0225916    .0844503
                 OK  |  -.0381903   .0107162    -3.56   0.001    -.0597144   -.0166663
                 TX  |   .0601874   .0170464     3.53   0.001     .0259487    .0944261
                 MT  |  -.0299207   .0011423   -26.19   0.000    -.0322152   -.0276263
                 ID  |  -.0138113   .0054834    -2.52   0.015     -.024825   -.0027977
                 WY  |   .1709631   .0140271    12.19   0.000     .1427889    .1991373
                 CO  |   .0780358   .0084131     9.28   0.000     .0611376     .094934
                 NM  |   .0408069   .0095943     4.25   0.000     .0215361    .0600776
                 AZ  |   .0617645   .0173293     3.56   0.001     .0269575    .0965714
                 UT  |   .0231799   .0138154     1.68   0.100    -.0045692    .0509291
                 NV  |   .1202626   .0171981     6.99   0.000     .0857192    .1548061
                 WA  |   .1230841   .0078224    15.73   0.000     .1073724    .1387958
                 OR  |   .0519996   .0081437     6.39   0.000     .0356426    .0683566
                 CA  |   .1521181   .0139428    10.91   0.000     .1241132     .180123
                 AK  |   .2260023   .0064362    35.11   0.000     .2130748    .2389299
                 HI  |   .1532648   .0062031    24.71   0.000     .1408055     .165724
                     |
                year |
               1997  |   .0123296   .0034687     3.55   0.001     .0053626    .0192966
               1998  |   .0371066   .0043827     8.47   0.000     .0283038    .0459094
               1999  |   .0591799   .0056014    10.57   0.000     .0479291    .0704306
               2000  |   .0692636    .006571    10.54   0.000     .0560653    .0824618
               2001  |   .0934863   .0058257    16.05   0.000      .081785    .1051875
               2002  |   .1103748   .0054852    20.12   0.000     .0993575    .1213922
               2003  |   .1002048   .0066156    15.15   0.000     .0869171    .1134926
               2004  |   .0881203   .0061583    14.31   0.000     .0757509    .1004897
               2005  |    .071426   .0067284    10.62   0.000     .0579116    .0849404
               2006  |   .0659193   .0074275     8.87   0.000     .0510006    .0808379
               2007  |   .0679919   .0082704     8.22   0.000     .0513804    .0846034
               2008  |   .0721592   .0082661     8.73   0.000     .0555563    .0887621
               2009  |   .1131533   .0108468    10.43   0.000     .0913669    .1349397
               2010  |   .1027081   .0105872     9.70   0.000     .0814431    .1239731
               2011  |    .073815   .0094321     7.83   0.000     .0548701    .0927599
               2012  |   .0660881   .0099187     6.66   0.000     .0461657    .0860104
               2013  |   .0584056   .0084446     6.92   0.000      .041444    .0753672
               2014  |   .0486377   .0081351     5.98   0.000     .0322979    .0649775
               2015  |   .0640718   .0081315     7.88   0.000     .0477392    .0804043
               2016  |   .0791335   .0091236     8.67   0.000     .0608082    .0974588
               2017  |    .080416   .0100651     7.99   0.000     .0601997    .1006322
               2018  |   .0892852   .0097405     9.17   0.000     .0697207    .1088496
               2019  |   .1063158    .009409    11.30   0.000     .0874174    .1252142
                     |
                nind |
                  2  |   .0398068   .0309399     1.29   0.204    -.0223379    .1019515
                  3  |   .0868443   .0242818     3.58   0.001     .0380728    .1356157
                  4  |  -.0715127   .0295059    -2.42   0.019     -.130777   -.0122484
                  5  |   .0869773   .0275638     3.16   0.003     .0316137    .1423409
                  6  |   .0937986   .0295667     3.17   0.003     .0344121    .1531851
                  7  |   .0069793   .0273647     0.26   0.800    -.0479843    .0619429
                  8  |  -.0409512   .0277247    -1.48   0.146    -.0966379    .0147354
                  9  |  -.0830935   .0273272    -3.04   0.004    -.1379818   -.0282052
                 10  |  -.0816676   .0295587    -2.76   0.008    -.1410379   -.0222973
                 11  |   .0814336   .0280575     2.90   0.005     .0250785    .1377887
                     |
                educ |   .0558017   .0020239    27.57   0.000     .0517365    .0598669
               exper |   .0451773   .0022638    19.96   0.000     .0406304    .0497242
              exper2 |  -.0008851   .0001314    -6.74   0.000    -.0011489   -.0006212
              exper3 |   3.71e-06   3.94e-06     0.94   0.351    -4.21e-06    .0000116
              exper4 |   3.99e-08   4.04e-08     0.99   0.327    -4.11e-08    1.21e-07
                edex |  -.0005903    .000068    -8.68   0.000    -.0007269   -.0004538
                     |
               ee_cl |
                  2  |  -.0436685   .0050902    -8.58   0.000    -.0538925   -.0334445
                  3  |  -.0426433   .0096722    -4.41   0.000    -.0620706    -.023216
                  4  |   .0450512   .0191129     2.36   0.022     .0066618    .0834407
                  5  |  -.0953828   .0055454   -17.20   0.000    -.1065211   -.0842445
                  6  |  -.0874431   .0062632   -13.96   0.000    -.1000232    -.074863
                  7  |  -.0407224    .011711    -3.48   0.001    -.0642446   -.0172002
                  8  |   .1272643   .0192099     6.62   0.000     .0886802    .1658484
                  9  |  -.1334521   .0075563   -17.66   0.000    -.1486294   -.1182748
                 10  |  -.1033278   .0083627   -12.36   0.000    -.1201247   -.0865309
                 11  |  -.0291765    .012524    -2.33   0.024    -.0543316   -.0040214
                 12  |    .130559   .0192253     6.79   0.000     .0919439    .1691741
                 13  |  -.1191718   .0131102    -9.09   0.000    -.1455043   -.0928393
                 14  |   -.080223   .0086019    -9.33   0.000    -.0975005   -.0629455
                 15  |  -.0111323      .0124    -0.90   0.374    -.0360385    .0137739
                 16  |   .1331415    .021053     6.32   0.000     .0908553    .1754277
                     |
                marr |   .1261281   .0027376    46.07   0.000     .1206293    .1316268
               partt |  -.1866672   .0082282   -22.69   0.000     -.203194   -.1701405
              public |  -.0173216   .0066202    -2.62   0.012    -.0306187   -.0040244
                cmsa |   .1311285   .0080387    16.31   0.000     .1149823    .1472747
                     |
               nocc2 |
                  2  |  -.1618534    .004469   -36.22   0.000    -.1708296   -.1528772
                  3  |  -.0376003   .0069683    -5.40   0.000    -.0515966   -.0236041
                  4  |  -.3379053   .0070591   -47.87   0.000    -.3520839   -.3237267
                  5  |  -.1042963   .0124577    -8.37   0.000    -.1293184   -.0792742
                  6  |   -.417934   .0077084   -54.22   0.000    -.4334167   -.4024513
                  7  |  -.2600837   .0095703   -27.18   0.000    -.2793061   -.2408612
                  8  |  -.1061611   .0132833    -7.99   0.000    -.1328414   -.0794809
                  9  |  -.4395498   .0062969   -69.80   0.000    -.4521975   -.4269021
                 10  |  -.4013373   .0116067   -34.58   0.000    -.4246502   -.3780245
                 11  |  -.2930584   .0088972   -32.94   0.000     -.310929   -.2751879
                 12  |  -.4521687   .0109616   -41.25   0.000    -.4741857   -.4301517
                     |
               unemp |  -.0082216   .0019651    -4.18   0.000    -.0121687   -.0042746
             citizen |  -.0353451   .0031783   -11.12   0.000    -.0417289   -.0289614
                     |
             quarter |
                  2  |   .0043508   .0018156     2.40   0.020      .000704    .0079976
                  3  |   .0033764   .0020427     1.65   0.105    -.0007264    .0074792
                  4  |   .0144825   .0018605     7.78   0.000     .0107455    .0182195
                     |
               _cons |   .8377941   .0313176    26.75   0.000     .7748909    .9006974
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 1 & covered == 0, vce(cluster state)
(sum of wgt is 6,178,699,274)

Linear regression                               Number of obs     =    698,868
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5107
                                                Root MSE          =     .39748

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.1002741   .0164869    -6.08   0.000    -.1333892   -.0671591
            treat_st |  -.0274133   .0068842    -3.98   0.000    -.0412407   -.0135859
treat_sthisprelwhite |   .0101698   .0270774     0.38   0.709    -.0442167    .0645563
                     |
               state |
                 NH  |   .0559161    .003664    15.26   0.000     .0485567    .0632754
                 VT  |   .0458289   .0016863    27.18   0.000     .0424419    .0492158
                 MA  |   .1058523   .0084571    12.52   0.000     .0888658    .1228389
                 RI  |   .0053589   .0090757     0.59   0.558    -.0128703     .023588
                 CT  |   .1031715   .0086433    11.94   0.000      .085811     .120532
                 NY  |   .0509996   .0090065     5.66   0.000     .0329096    .0690896
                 NJ  |   .1122026   .0101393    11.07   0.000     .0918372    .1325681
                 PA  |  -.0445897   .0064205    -6.94   0.000    -.0574856   -.0316937
                 OH  |  -.0673998    .006183   -10.90   0.000    -.0798187    -.054981
                 IN  |  -.0557517   .0052168   -10.69   0.000      -.06623   -.0452734
                 IL  |   .0162139   .0084448     1.92   0.061     -.000748    .0331757
                 MI  |  -.0337768   .0073951    -4.57   0.000    -.0486303   -.0189233
                 WI  |  -.0022348   .0048776    -0.46   0.649    -.0120318    .0075622
                 MN  |   .0508667   .0057197     8.89   0.000     .0393784    .0623549
                 IA  |  -.0257049    .006836    -3.76   0.000    -.0394355   -.0119744
                 MO  |  -.0752475   .0058248   -12.92   0.000    -.0869469   -.0635481
                 ND  |  -.0506198   .0066678    -7.59   0.000    -.0640124   -.0372272
                 SD  |  -.0667085   .0067181    -9.93   0.000    -.0802021   -.0532148
                 NE  |  -.0525319   .0071541    -7.34   0.000    -.0669014   -.0381625
                 KS  |  -.0553711   .0077256    -7.17   0.000    -.0708884   -.0398539
                 DE  |   .0301087   .0015651    19.24   0.000     .0269651    .0332524
                 MD  |   .1078355   .0091997    11.72   0.000     .0893574    .1263135
                 DC  |   .2096481   .0141235    14.84   0.000     .1812802     .238016
                 VA  |   .0834942   .0093892     8.89   0.000     .0646354    .1023531
                 WV  |  -.1634855   .0024809   -65.90   0.000    -.1684685   -.1585026
                 NC  |  -.0191024   .0090268    -2.12   0.039    -.0372332   -.0009715
                 SC  |  -.0602206   .0093307    -6.45   0.000    -.0789619   -.0414793
                 GA  |  -.0001538   .0096232    -0.02   0.987    -.0194825    .0191749
                 FL  |  -.0316286    .010641    -2.97   0.005    -.0530017   -.0102554
                 KY  |  -.0781544   .0047194   -16.56   0.000    -.0876336   -.0686752
                 TN  |  -.0730701   .0090523    -8.07   0.000    -.0912522    -.054888
                 AL  |   -.071945    .008877    -8.10   0.000    -.0897749   -.0541151
                 MS  |  -.0903785   .0086091   -10.50   0.000    -.1076704   -.0730866
                 AR  |  -.1034419   .0080531   -12.85   0.000     -.119617   -.0872668
                 LA  |  -.0763474   .0099582    -7.67   0.000     -.096349   -.0563459
                 OK  |  -.1277282   .0071133   -17.96   0.000    -.1420156   -.1134408
                 TX  |   -.004847   .0105586    -0.46   0.648    -.0260545    .0163605
                 MT  |  -.0657346     .00095   -69.20   0.000    -.0676426   -.0638266
                 ID  |  -.0590355   .0042383   -13.93   0.000    -.0675484   -.0505226
                 WY  |    .020092   .0068913     2.92   0.005     .0062503    .0339337
                 CO  |   .0280778    .008325     3.37   0.001     .0113565    .0447992
                 NM  |  -.0484707   .0094954    -5.10   0.000    -.0675428   -.0293986
                 AZ  |   .0214219   .0105353     2.03   0.047     .0002611    .0425827
                 UT  |  -.0341135   .0091423    -3.73   0.000    -.0524763   -.0157507
                 NV  |   .0721594   .0105767     6.82   0.000     .0509155    .0934032
                 WA  |   .0740634   .0081056     9.14   0.000     .0577828     .090344
                 OR  |   .0073723   .0078875     0.93   0.354    -.0084702    .0232149
                 CA  |   .1143549   .0133871     8.54   0.000     .0874661    .1412437
                 AK  |    .170062   .0060516    28.10   0.000      .157907     .182217
                 HI  |   .0981174    .006762    14.51   0.000     .0845356    .1116992
                     |
                year |
               1997  |   .0124415   .0036571     3.40   0.001     .0050959    .0197871
               1998  |   .0412954   .0024371    16.94   0.000     .0364004    .0461904
               1999  |   .0585726   .0046455    12.61   0.000     .0492419    .0679033
               2000  |   .0743792   .0042421    17.53   0.000     .0658587    .0828997
               2001  |   .0917299   .0051865    17.69   0.000     .0813125    .1021472
               2002  |   .1062756   .0052929    20.08   0.000     .0956445    .1169067
               2003  |   .1149908    .005897    19.50   0.000     .1031462    .1268353
               2004  |   .1060285   .0048498    21.86   0.000     .0962873    .1157696
               2005  |   .0949794   .0049419    19.22   0.000     .0850533    .1049055
               2006  |   .0875493   .0039123    22.38   0.000     .0796912    .0954074
               2007  |   .0881744   .0047631    18.51   0.000     .0786075    .0977414
               2008  |    .087208   .0065103    13.40   0.000     .0741317    .1002844
               2009  |   .1127234   .0086174    13.08   0.000     .0954148    .1300321
               2010  |   .1087828   .0078661    13.83   0.000     .0929832    .1245824
               2011  |   .0890139   .0067065    13.27   0.000     .0755435    .1024844
               2012  |   .0724806   .0056873    12.74   0.000     .0610574    .0839038
               2013  |   .0690301   .0055787    12.37   0.000      .057825    .0802353
               2014  |   .0650743   .0056789    11.46   0.000      .053668    .0764806
               2015  |   .0785467   .0049598    15.84   0.000     .0685846    .0885088
               2016  |   .0927605   .0058543    15.84   0.000     .0810017    .1045193
               2017  |    .103382   .0062017    16.67   0.000     .0909256    .1158384
               2018  |   .1055495   .0057671    18.30   0.000      .093966     .117133
               2019  |   .1176339   .0067493    17.43   0.000     .1040774    .1311904
                     |
                nind |
                  2  |    .038349   .0320767     1.20   0.238    -.0260789    .1027769
                  3  |   .0998087   .0308323     3.24   0.002     .0378803    .1617371
                  4  |  -.0925861   .0305425    -3.03   0.004    -.1539326   -.0312396
                  5  |   .0830387   .0324014     2.56   0.013     .0179586    .1481189
                  6  |   .0721677    .033017     2.19   0.034     .0058511    .1384842
                  7  |   .0192387   .0331009     0.58   0.564    -.0472464    .0857238
                  8  |  -.0271849   .0333225    -0.82   0.418    -.0941151    .0397454
                  9  |  -.1023303   .0361548    -2.83   0.007    -.1749494   -.0297112
                 10  |  -.0756066   .0312462    -2.42   0.019    -.1383664   -.0128467
                 11  |   .0720515    .038066     1.89   0.064    -.0044063    .1485092
                     |
                educ |   .0836321   .0031218    26.79   0.000     .0773617    .0899025
               exper |   .0525201   .0016481    31.87   0.000     .0492099    .0558304
              exper2 |  -.0014585   .0000919   -15.87   0.000     -.001643   -.0012739
              exper3 |   .0000228   2.67e-06     8.55   0.000     .0000174    .0000281
              exper4 |  -1.29e-07   2.64e-08    -4.89   0.000    -1.82e-07   -7.62e-08
                edex |  -.0010185   .0000631   -16.13   0.000    -.0011453   -.0008917
                     |
               ee_cl |
                  2  |  -.1167878   .0075279   -15.51   0.000    -.1319079   -.1016676
                  3  |  -.1385701   .0126679   -10.94   0.000    -.1640143   -.1131259
                  4  |    -.11205   .0243737    -4.60   0.000    -.1610059   -.0630941
                  5  |  -.1358654    .008126   -16.72   0.000    -.1521868   -.1195439
                  6  |  -.1712654    .010465   -16.37   0.000    -.1922851   -.1502457
                  7  |  -.1476335   .0162667    -9.08   0.000    -.1803062   -.1149609
                  8  |  -.0246669   .0271803    -0.91   0.368    -.0792602    .0299264
                  9  |  -.1643919   .0087078   -18.88   0.000     -.181882   -.1469018
                 10  |  -.1847537   .0109945   -16.80   0.000    -.2068369   -.1626705
                 11  |  -.1462749   .0153548    -9.53   0.000    -.1771159   -.1154338
                 12  |  -.0325994   .0262121    -1.24   0.219     -.085248    .0200493
                 13  |  -.1744577   .0107306   -16.26   0.000    -.1960108   -.1529046
                 14  |  -.1711218   .0102422   -16.71   0.000    -.1916939   -.1505497
                 15  |  -.1138368   .0161433    -7.05   0.000    -.1462616    -.081412
                 16  |  -.0158187   .0299305    -0.53   0.599    -.0759359    .0442984
                     |
                marr |    .041436   .0025519    16.24   0.000     .0363104    .0465615
               partt |   -.129612    .003277   -39.55   0.000     -.136194     -.12303
              public |   .0025301   .0057963     0.44   0.664    -.0091121    .0141722
                cmsa |   .1546408   .0078371    19.73   0.000     .1388994    .1703822
                     |
               nocc2 |
                  2  |  -.1601209   .0037561   -42.63   0.000    -.1676652   -.1525765
                  3  |  -.0504737   .0062827    -8.03   0.000    -.0630929   -.0378545
                  4  |  -.3526838   .0044194   -79.80   0.000    -.3615604   -.3438072
                  5  |   .0091166   .0087256     1.04   0.301    -.0084093    .0266426
                  6  |  -.3676792   .0052119   -70.55   0.000    -.3781477   -.3572107
                  7  |  -.3935525   .0066134   -59.51   0.000     -.406836   -.3802691
                  8  |  -.1903761   .0085087   -22.37   0.000    -.2074664   -.1732858
                  9  |  -.4413233   .0067379   -65.50   0.000    -.4548568   -.4277899
                 10  |  -.4869149   .0139498   -34.90   0.000    -.5149339    -.458896
                 11  |  -.2762371   .0064974   -42.51   0.000    -.2892876   -.2631866
                 12  |  -.4772258   .0159701   -29.88   0.000    -.5093027   -.4451489
                     |
               unemp |  -.0030601   .0013408    -2.28   0.027    -.0057532   -.0003671
             citizen |  -.0284902   .0034659    -8.22   0.000    -.0354517   -.0215287
                     |
             quarter |
                  2  |    .007416   .0017293     4.29   0.000     .0039425    .0108895
                  3  |   .0159738   .0021985     7.27   0.000      .011558    .0203897
                  4  |   .0204901   .0012937    15.84   0.000     .0178915    .0230886
                     |
               _cons |   .4995736   .0451402    11.07   0.000     .4089069    .5902402
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,161,701,330)

Linear regression                               Number of obs     =    125,874
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3569
                                                Root MSE          =     .36466

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0707191   .0064506   -10.96   0.000    -.0836755   -.0577628
            treat_st |  -.0517761   .0275583    -1.88   0.066    -.1071286    .0035764
treat_sthisprelwhite |   .0032104   .0283549     0.11   0.910     -.053742    .0601629
                     |
               state |
                 NH  |   .0434295   .0088929     4.88   0.000     .0255676    .0612915
                 VT  |  -.0108474   .0052251    -2.08   0.043    -.0213424   -.0003525
                 MA  |   .1104947   .0117212     9.43   0.000     .0869521    .1340374
                 RI  |    .055002   .0115916     4.74   0.000     .0317197    .0782844
                 CT  |   .1520346   .0113165    13.43   0.000     .1293046    .1747645
                 NY  |   .1331792   .0098107    13.57   0.000     .1134738    .1528846
                 NJ  |    .203922   .0112711    18.09   0.000     .1812833    .2265606
                 PA  |   .0082048   .0080061     1.02   0.310    -.0078758    .0242854
                 OH  |   .0018249   .0071451     0.26   0.799    -.0125265    .0161763
                 IN  |   .0294314   .0080456     3.66   0.001     .0132713    .0455914
                 IL  |   .1135645   .0090097    12.60   0.000      .095468    .1316609
                 MI  |   .0826707   .0095613     8.65   0.000     .0634662    .1018752
                 WI  |   .0412425    .006948     5.94   0.000     .0272869     .055198
                 MN  |   .0652417   .0094671     6.89   0.000     .0462265    .0842569
                 IA  |    .019252   .0254435     0.76   0.453    -.0318527    .0703568
                 MO  |    .028504   .0083804     3.40   0.001     .0116715    .0453366
                 ND  |   .0356923   .0250686     1.42   0.161    -.0146594     .086044
                 SD  |  -.0032241   .0251594    -0.13   0.899    -.0537583    .0473101
                 NE  |  -.0045109   .0249051    -0.18   0.857    -.0545342    .0455124
                 KS  |   .0663107   .0261244     2.54   0.014     .0138383    .1187831
                 DE  |   .0763994   .0025766    29.65   0.000     .0712241    .0815747
                 MD  |   .1315508   .0125124    10.51   0.000     .1064188    .1566827
                 DC  |   .2374348   .0130338    18.22   0.000     .2112558    .2636139
                 VA  |   .1795773   .0260484     6.89   0.000     .1272575    .2318971
                 WV  |  -.0153693   .0093681    -1.64   0.107    -.0341857     .003447
                 NC  |   .0387012   .0290526     1.33   0.189    -.0196527    .0970551
                 SC  |    .006973   .0298406     0.23   0.816    -.0529635    .0669096
                 GA  |   .0832225   .0290187     2.87   0.006     .0249367    .1415083
                 FL  |   .0411243   .0296658     1.39   0.172    -.0184613    .1007099
                 KY  |  -.0278828   .0082115    -3.40   0.001     -.044376   -.0113896
                 TN  |   .0161475   .0288485     0.56   0.578    -.0417964    .0740914
                 AL  |   .0357203   .0286758     1.25   0.219    -.0218767    .0933173
                 MS  |   .0135739   .0310981     0.44   0.664    -.0488885    .0760363
                 AR  |   -.006181   .0288154    -0.21   0.831    -.0640584    .0516963
                 LA  |   .0698909   .0289249     2.42   0.019     .0117935    .1279883
                 OK  |  -.0248742   .0189502    -1.31   0.195    -.0629367    .0131883
                 TX  |   .0637965   .0293425     2.17   0.034     .0048604    .1227325
                 MT  |  -.0559278   .0041699   -13.41   0.000    -.0643034   -.0475522
                 ID  |  -.0135485   .0047782    -2.84   0.007    -.0231459   -.0039512
                 WY  |   .2039274   .0295363     6.90   0.000     .1446021    .2632527
                 CO  |   .0207333   .0105364     1.97   0.055    -.0004297    .0418964
                 NM  |  -.0290236   .0099595    -2.91   0.005    -.0490278   -.0090195
                 AZ  |   .0888065   .0306693     2.90   0.006     .0272055    .1504076
                 UT  |   .0274775   .0273033     1.01   0.319    -.0273628    .0823178
                 NV  |   .1759408   .0323376     5.44   0.000     .1109888    .2408928
                 WA  |   .1187353   .0086952    13.66   0.000     .1012704    .1362002
                 OR  |   .0366749    .009285     3.95   0.000     .0180255    .0553243
                 CA  |   .1871164   .0120823    15.49   0.000     .1628485    .2113844
                 AK  |    .220785   .0097064    22.75   0.000     .2012892    .2402808
                 HI  |   .1023573   .0100563    10.18   0.000     .0821585    .1225561
                     |
                year |
               1997  |   .0015419   .0057538     0.27   0.790     -.010015    .0130988
               1998  |   .0119701   .0080144     1.49   0.142    -.0041274    .0280675
               1999  |   .0182679   .0082929     2.20   0.032     .0016111    .0349247
               2000  |   .0222577   .0080874     2.75   0.008     .0060136    .0385018
               2001  |   .0233476   .0082124     2.84   0.006     .0068525    .0398428
               2002  |   .0413175   .0062501     6.61   0.000     .0287638    .0538713
               2003  |   .0498496   .0087022     5.73   0.000     .0323707    .0673285
               2004  |   .0396569   .0051305     7.73   0.000      .029352    .0499618
               2005  |   .0351352   .0073573     4.78   0.000     .0203576    .0499128
               2006  |   .0214216   .0115971     1.85   0.071    -.0018718     .044715
               2007  |    .028536   .0127577     2.24   0.030     .0029114    .0541606
               2008  |   .0238919   .0080914     2.95   0.005     .0076399    .0401438
               2009  |   .0557091   .0127524     4.37   0.000     .0300951    .0813232
               2010  |   .0620932   .0145024     4.28   0.000     .0329642    .0912222
               2011  |   .0414238    .013312     3.11   0.003     .0146858    .0681617
               2012  |   .0248838   .0090915     2.74   0.009      .006623    .0431446
               2013  |   .0237924   .0086861     2.74   0.009     .0063459    .0412389
               2014  |   .0168664   .0118001     1.43   0.159    -.0068347    .0405676
               2015  |   .0228075   .0106031     2.15   0.036     .0015106    .0441045
               2016  |    .028777   .0124814     2.31   0.025     .0037073    .0538467
               2017  |   .0414444   .0121311     3.42   0.001     .0170784    .0658103
               2018  |   .0436739   .0118847     3.67   0.001     .0198029     .067545
               2019  |   .0425483   .0129974     3.27   0.002     .0164422    .0686543
                     |
                nind |
                  2  |    .116313   .0594212     1.96   0.056    -.0030379     .235664
                  3  |  -.0138636   .0522711    -0.27   0.792    -.1188531     .091126
                  4  |  -.1909519   .0626458    -3.05   0.004    -.3167796   -.0651242
                  5  |   .1188059   .0515374     2.31   0.025       .01529    .2223217
                  6  |  -.0425602   .0611631    -0.70   0.490    -.1654099    .0802895
                  7  |  -.0311785   .0510466    -0.61   0.544    -.1337086    .0713515
                  8  |  -.1337101   .0541732    -2.47   0.017    -.2425202      -.0249
                  9  |  -.1114267   .0528507    -2.11   0.040    -.2175805   -.0052729
                 10  |   -.125208   .0709221    -1.77   0.084    -.2676592    .0172431
                 11  |   .1315744   .0604677     2.18   0.034     .0101215    .2530273
                     |
                educ |   .0734869   .0049839    14.74   0.000     .0634765    .0834973
               exper |   .0739429   .0035089    21.07   0.000     .0668951    .0809907
              exper2 |  -.0025219   .0002886    -8.74   0.000    -.0031015   -.0019423
              exper3 |   .0000491   9.23e-06     5.32   0.000     .0000306    .0000677
              exper4 |  -3.90e-07   9.56e-08    -4.07   0.000    -5.82e-07   -1.98e-07
                edex |  -.0009382   .0001239    -7.57   0.000    -.0011872   -.0006893
                     |
               ee_cl |
                  2  |   .0540472   .0164414     3.29   0.002     .0210238    .0870707
                  3  |   .0337537   .0182189     1.85   0.070    -.0028401    .0703475
                  4  |  -.0054404   .0297555    -0.18   0.856     -.065206    .0543252
                  5  |   .0062163   .0237291     0.26   0.794    -.0414451    .0538777
                  6  |   .0188018    .016128     1.17   0.249    -.0135922    .0511958
                  7  |   .0373458   .0208823     1.79   0.080    -.0045976    .0792891
                  8  |  -.0046463   .0282589    -0.16   0.870     -.061406    .0521133
                  9  |   -.006772   .0248439    -0.27   0.786    -.0566724    .0431284
                 10  |  -.0011324   .0203089    -0.06   0.956    -.0419239    .0396592
                 11  |   .0194454   .0246221     0.79   0.433    -.0300095    .0689003
                 12  |   .0417239   .0311305     1.34   0.186    -.0208036    .1042515
                 13  |  -.0255489   .0255135    -1.00   0.321    -.0767943    .0256965
                 14  |  -.0084926   .0210748    -0.40   0.689    -.0508226    .0338374
                 15  |   .0073113   .0234238     0.31   0.756    -.0397367    .0543593
                 16  |   .0636054    .030952     2.05   0.045     .0014364    .1257744
                     |
                marr |    .071006    .004375    16.23   0.000     .0622186    .0797933
               partt |  -.0911956   .0139585    -6.53   0.000     -.119232   -.0631592
              public |  -.0535344   .0076874    -6.96   0.000     -.068975   -.0380938
                cmsa |   .1102175   .0118938     9.27   0.000      .086328     .134107
                     |
               nocc2 |
                  2  |  -.0457648   .0110812    -4.13   0.000    -.0680221   -.0235075
                  3  |  -.0194522   .0126297    -1.54   0.130    -.0448197    .0059153
                  4  |  -.0746601   .0139047    -5.37   0.000    -.1025886   -.0467317
                  5  |  -.0120825   .0195339    -0.62   0.539    -.0513176    .0271526
                  6  |  -.2633923   .0082971   -31.75   0.000    -.2800575    -.246727
                  7  |  -.2172056   .0154783   -14.03   0.000    -.2482947   -.1861166
                  8  |  -.0235012   .0502354    -0.47   0.642    -.1244019    .0773996
                  9  |  -.2178655   .0111831   -19.48   0.000    -.2403274   -.1954036
                 10  |  -.1550578   .0079084   -19.61   0.000    -.1709423   -.1391734
                 11  |  -.0676724   .0083947    -8.06   0.000    -.0845336   -.0508112
                 12  |  -.2033528   .0083266   -24.42   0.000    -.2200772   -.1866285
                     |
               unemp |  -.0055049   .0035961    -1.53   0.132    -.0127279    .0017182
             citizen |  -.0441224   .0028902   -15.27   0.000    -.0499275   -.0383174
                     |
             quarter |
                  2  |   .0036869   .0026754     1.38   0.174    -.0016867    .0090605
                  3  |    .006792   .0028393     2.39   0.021      .001089     .012495
                  4  |   .0110103   .0027115     4.06   0.000      .005564    .0164566
                     |
               _cons |   .5315666   .0857671     6.20   0.000     .3592984    .7038349
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 1 & covered == 1, vce(cluster state)
(sum of wgt is 938,642,708)

Linear regression                               Number of obs     =    106,870
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4427
                                                Root MSE          =     .36807

                                         (Std. Err. adjusted for 51 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0550985   .0093161    -5.91   0.000    -.0738104   -.0363866
            treat_st |   -.057097   .0171601    -3.33   0.002     -.091564     -.02263
treat_sthisprelwhite |   .0574201   .0233824     2.46   0.018     .0104551    .1043851
                     |
               state |
                 NH  |   .0515376   .0063389     8.13   0.000     .0388055    .0642697
                 VT  |  -.0104677   .0029885    -3.50   0.001    -.0164702   -.0044651
                 MA  |   .1451247   .0097493    14.89   0.000     .1255427    .1647067
                 RI  |   .1645746   .0098488    16.71   0.000     .1447926    .1843566
                 CT  |   .1791321   .0100174    17.88   0.000     .1590117    .1992526
                 NY  |   .1369566    .008617    15.89   0.000     .1196488    .1542643
                 NJ  |   .2366861   .0098314    24.07   0.000     .2169391    .2564331
                 PA  |   .0482266   .0075409     6.40   0.000     .0330802    .0633729
                 OH  |   .0153457   .0079691     1.93   0.060    -.0006606    .0313521
                 IN  |   .0146656   .0075356     1.95   0.057    -.0004701    .0298014
                 IL  |   .0477936   .0081311     5.88   0.000     .0314619    .0641253
                 MI  |   .0854716   .0096056     8.90   0.000     .0661782    .1047649
                 WI  |   .0484003   .0065126     7.43   0.000     .0353195    .0614812
                 MN  |   .0840135   .0075177    11.18   0.000     .0689138    .0991133
                 IA  |   .0414497   .0163907     2.53   0.015      .008528    .0743714
                 MO  |  -.0603552   .0081103    -7.44   0.000    -.0766453   -.0440651
                 ND  |   .0157115   .0159576     0.98   0.330    -.0163402    .0477632
                 SD  |  -.0358616   .0156675    -2.29   0.026    -.0673306   -.0043925
                 NE  |  -.0275846   .0157009    -1.76   0.085    -.0591208    .0039516
                 KS  |  -.0016846   .0162497    -0.10   0.918    -.0343231     .030954
                 DE  |   .1441361   .0025136    57.34   0.000     .1390874    .1491848
                 MD  |   .1822041   .0107905    16.89   0.000     .1605307    .2038775
                 DC  |   .2384511   .0123504    19.31   0.000     .2136445    .2632577
                 VA  |   .1904998   .0175558    10.85   0.000      .155238    .2257615
                 WV  |   -.069434   .0036217   -19.17   0.000    -.0767083   -.0621597
                 NC  |   .0614662    .017851     3.44   0.001     .0256114    .0973209
                 SC  |  -.0245114   .0184087    -1.33   0.189    -.0614864    .0124637
                 GA  |   .0589389   .0179137     3.29   0.002     .0229582    .0949196
                 FL  |   .0375533   .0181297     2.07   0.044     .0011387    .0739679
                 KY  |  -.0435553   .0070908    -6.14   0.000    -.0577976   -.0293129
                 TN  |   .0102855   .0175231     0.59   0.560    -.0249106    .0454816
                 AL  |  -.0446757    .017237    -2.59   0.012    -.0792973   -.0100541
                 MS  |  -.0361874    .018798    -1.93   0.060    -.0739444    .0015696
                 AR  |   -.043823   .0179638    -2.44   0.018    -.0799043   -.0077417
                 LA  |  -.0017279   .0186376    -0.09   0.927    -.0391627    .0357069
                 OK  |  -.1195561   .0123636    -9.67   0.000    -.1443892   -.0947231
                 TX  |   .0461257   .0181685     2.54   0.014     .0096332    .0826182
                 MT  |  -.0923659   .0029895   -30.90   0.000    -.0983706   -.0863613
                 ID  |  -.0642152   .0040093   -16.02   0.000    -.0722681   -.0561623
                 WY  |   .0964683   .0167836     5.75   0.000     .0627575     .130179
                 CO  |   .0211041   .0103201     2.04   0.046     .0003756    .0418326
                 NM  |  -.0436383   .0073619    -5.93   0.000    -.0584251   -.0288514
                 AZ  |    .054187   .0192923     2.81   0.007     .0154372    .0929367
                 UT  |   .0067111   .0181164     0.37   0.713    -.0296768    .0430989
                 NV  |    .182628   .0216139     8.45   0.000     .1392153    .2260407
                 WA  |   .0890244   .0090928     9.79   0.000      .070761    .1072879
                 OR  |    .026925   .0081275     3.31   0.002     .0106005    .0432495
                 CA  |    .213889   .0104012    20.56   0.000     .1929977    .2347803
                 AK  |   .2152627   .0063444    33.93   0.000     .2025196    .2280057
                 HI  |   .0847179   .0073425    11.54   0.000     .0699701    .0994658
                     |
                year |
               1997  |  -.0057772   .0081314    -0.71   0.481    -.0221095    .0105552
               1998  |   .0055649   .0085574     0.65   0.518    -.0116232     .022753
               1999  |   .0129043   .0110698     1.17   0.249      -.00933    .0351385
               2000  |   .0076168   .0109809     0.69   0.491     -.014439    .0296726
               2001  |   .0199659   .0099914     2.00   0.051    -.0001025    .0400343
               2002  |   .0376773   .0102536     3.67   0.001     .0170824    .0582722
               2003  |   .0291083   .0093494     3.11   0.003     .0103295     .047887
               2004  |   .0246942    .007646     3.23   0.002     .0093367    .0400516
               2005  |   .0101084   .0098698     1.02   0.311    -.0097157    .0299324
               2006  |   .0132352   .0113113     1.17   0.248    -.0094842    .0359546
               2007  |   .0110932   .0117893     0.94   0.351    -.0125864    .0347727
               2008  |   .0115746   .0075206     1.54   0.130    -.0035311    .0266802
               2009  |   .0404215   .0092087     4.39   0.000     .0219252    .0589178
               2010  |   .0421409   .0093022     4.53   0.000      .023457    .0608248
               2011  |   .0144533   .0077814     1.86   0.069    -.0011761    .0300827
               2012  |  -.0029845   .0074424    -0.40   0.690     -.017933     .011964
               2013  |  -.0054485   .0075169    -0.72   0.472    -.0205467    .0096496
               2014  |  -.0265703   .0110016    -2.42   0.019    -.0486678   -.0044729
               2015  |   -.003026   .0075975    -0.40   0.692    -.0182861     .012234
               2016  |   .0063673   .0110441     0.58   0.567    -.0158155    .0285501
               2017  |  -.0077059    .014182    -0.54   0.589    -.0361912    .0207794
               2018  |  -.0069807   .0126659    -0.55   0.584    -.0324209    .0184596
               2019  |  -.0090229   .0119221    -0.76   0.453    -.0329692    .0149234
                     |
                nind |
                  2  |   .1012226   .0611732     1.65   0.104    -.0216473    .2240925
                  3  |   .0664263   .0510925     1.30   0.200     -.036196    .1690486
                  4  |   -.195021   .0600773    -3.25   0.002    -.3156898   -.0743523
                  5  |   .1703626    .052328     3.26   0.002     .0652587    .2754665
                  6  |  -.0066331   .0485477    -0.14   0.892     -.104144    .0908777
                  7  |  -.0554675    .048802    -1.14   0.261    -.1534892    .0425541
                  8  |   -.093886   .0606165    -1.55   0.128    -.2156378    .0278659
                  9  |  -.1543373   .0571348    -2.70   0.009    -.2690959   -.0395786
                 10  |  -.1034299   .0508579    -2.03   0.047     -.205581   -.0012788
                 11  |   .0420008   .0566452     0.74   0.462    -.0717744     .155776
                     |
                educ |   .1141213   .0070434    16.20   0.000     .0999742    .1282684
               exper |   .0567542   .0046613    12.18   0.000     .0473917    .0661168
              exper2 |  -.0017562   .0002106    -8.34   0.000    -.0021791   -.0013333
              exper3 |   .0000326   7.34e-06     4.44   0.000     .0000179    .0000473
              exper4 |  -2.39e-07   8.28e-08    -2.89   0.006    -4.05e-07   -7.26e-08
                edex |  -.0009095   .0001731    -5.25   0.000    -.0012572   -.0005618
                     |
               ee_cl |
                  2  |  -.0730044   .0309998    -2.36   0.022    -.1352693   -.0107396
                  3  |  -.1300928   .0285881    -4.55   0.000    -.1875136   -.0726719
                  4  |  -.1910697   .0517701    -3.69   0.001    -.2950531   -.0870864
                  5  |  -.0240726   .0255339    -0.94   0.350     -.075359    .0272138
                  6  |  -.1232707   .0261317    -4.72   0.000    -.1757578   -.0707836
                  7  |  -.1609589   .0308704    -5.21   0.000     -.222964   -.0989539
                  8  |  -.1788799   .0524979    -3.41   0.001     -.284325   -.0734348
                  9  |  -.0248138   .0265296    -0.94   0.354       -.0781    .0284724
                 10  |  -.1576484     .02981    -5.29   0.000    -.2175235   -.0977733
                 11  |  -.1849733   .0335498    -5.51   0.000    -.2523601   -.1175865
                 12  |  -.1600026   .0509297    -3.14   0.003    -.2622979   -.0577073
                 13  |  -.0329587    .031378    -1.05   0.299    -.0959832    .0300659
                 14  |  -.1526876   .0300644    -5.08   0.000    -.2130737   -.0923016
                 15  |  -.1597547    .037425    -4.27   0.000     -.234925   -.0845843
                 16  |  -.1165599   .0558275    -2.09   0.042    -.2286927    -.004427
                     |
                marr |    .009417   .0024877     3.79   0.000     .0044202    .0144138
               partt |  -.0713839   .0088935    -8.03   0.000     -.089247   -.0535209
              public |   .0105215   .0150154     0.70   0.487    -.0196378    .0406808
                cmsa |   .1159323   .0106473    10.89   0.000     .0945465    .1373181
                     |
               nocc2 |
                  2  |   -.059589     .01544    -3.86   0.000    -.0906012   -.0285767
                  3  |   -.029026   .0143209    -2.03   0.048    -.0577904   -.0002615
                  4  |  -.1303976   .0115055   -11.33   0.000    -.1535071   -.1072881
                  5  |   .1348201   .0153882     8.76   0.000      .103912    .1657283
                  6  |   -.247223   .0100049   -24.71   0.000    -.2673184   -.2271275
                  7  |  -.2677281   .0199376   -13.43   0.000    -.3077739   -.2276824
                  8  |  -.0926265   .0505971    -1.83   0.073    -.1942538    .0090009
                  9  |  -.3035272   .0176756   -17.17   0.000    -.3390297   -.2680246
                 10  |  -.2712222   .0214401   -12.65   0.000    -.3142858   -.2281586
                 11  |   .0119584   .0302473     0.40   0.694    -.0487952     .072712
                 12  |  -.2567151   .0138975   -18.47   0.000     -.284629   -.2288011
                     |
               unemp |  -.0025339   .0020776    -1.22   0.228    -.0067069     .001639
             citizen |  -.0324351    .004262    -7.61   0.000    -.0409955   -.0238747
                     |
             quarter |
                  2  |   .0000291   .0034924     0.01   0.993    -.0069856    .0070438
                  3  |   .0133056   .0042986     3.10   0.003     .0046717    .0219396
                  4  |   .0142351   .0040483     3.52   0.001     .0061039    .0223662
                     |
               _cons |   .1157449   .0643349     1.80   0.078    -.0134755    .2449654
--------------------------------------------------------------------------------------

. 
. ** RUST BELT ONLY BLACK-WHITE + WV, KY - IA
. keep if inrange(state, 31, 35) | inlist(state, 23, 41, 43) | inlist(state, 55, 61)
(2,304,918 observations deleted)

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3
>  exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce
> (cluster state) 
(sum of wgt is 2,898,929,442)

Linear regression                               Number of obs     =    292,703
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2306
                                                Root MSE          =     .36083

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0660872   .0109613     6.03   0.000     .0412909    .0908834
             treat_st |  -.0222183    .006351    -3.50   0.007    -.0365853   -.0078513
treat_stblackrelwhite |  -.0284362   .0128766    -2.21   0.055    -.0575652    .0006927
                      |
                state |
                  OH  |  -.0115148   .0007149   -16.11   0.000    -.0131321   -.0098975
                  IN  |  -.0332478   .0029555   -11.25   0.000    -.0399336   -.0265619
                  IL  |    .021913   .0010577    20.72   0.000     .0195202    .0243057
                  MI  |   .0313829   .0024932    12.59   0.000     .0257429    .0370229
                  WI  |  -.0231628   .0031611    -7.33   0.000    -.0303136   -.0160119
                  MN  |   .0042373   .0016464     2.57   0.030     .0005129    .0079618
                  MO  |  -.0322598   .0008128   -39.69   0.000    -.0340986   -.0304211
                  WV  |  -.0387074   .0090178    -4.29   0.002    -.0591072   -.0183077
                  KY  |  -.0662069   .0034653   -19.11   0.000    -.0740459   -.0583679
                      |
                 year |
                1990  |  -.0044008   .0048052    -0.92   0.384    -.0152709    .0064693
                1991  |   -.004196   .0045915    -0.91   0.385    -.0145827    .0061907
                1992  |  -.0114761    .005975    -1.92   0.087    -.0249926    .0020403
                1993  |  -.0161464   .0061469    -2.63   0.028    -.0300516   -.0022413
                1996  |  -.0318672   .0086188    -3.70   0.005    -.0513644   -.0123701
                1997  |  -.0365079   .0081179    -4.50   0.001    -.0548719   -.0181439
                1998  |  -.0453981   .0085525    -5.31   0.000    -.0647452    -.026051
                1999  |  -.0446191   .0072337    -6.17   0.000    -.0609829   -.0282553
                2000  |  -.0501701   .0086923    -5.77   0.000    -.0698335   -.0305067
                2001  |  -.0536077   .0099665    -5.38   0.000    -.0761534   -.0310619
                2002  |  -.0592379    .012199    -4.86   0.001    -.0868339   -.0316419
                2003  |  -.0638407   .0101937    -6.26   0.000    -.0869004   -.0407809
                2004  |  -.0668401   .0106735    -6.26   0.000    -.0909852    -.042695
                2005  |  -.0821145   .0106431    -7.72   0.000    -.1061909   -.0580381
                2006  |  -.0862628   .0128013    -6.74   0.000    -.1152212   -.0573043
                2007  |  -.0850151   .0098179    -8.66   0.000    -.1072248   -.0628054
                2008  |  -.0769645   .0126563    -6.08   0.000    -.1055949    -.048334
                2009  |  -.0705252   .0083205    -8.48   0.000    -.0893475   -.0517028
                2010  |   -.078613    .008659    -9.08   0.000    -.0982009    -.059025
                2011  |  -.0788516   .0076907   -10.25   0.000    -.0962492    -.061454
                2012  |  -.0850299   .0081432   -10.44   0.000     -.103451   -.0666088
                2013  |  -.0811504   .0080921   -10.03   0.000    -.0994561   -.0628448
                2014  |  -.0847357   .0096756    -8.76   0.000    -.1066234   -.0628479
                2015  |   -.091877   .0086588   -10.61   0.000    -.1114645   -.0722895
                2016  |  -.0922791   .0097978    -9.42   0.000    -.1144432    -.070115
                2017  |   -.077672   .0091297    -8.51   0.000    -.0983248   -.0570193
                2018  |  -.0790821   .0084842    -9.32   0.000    -.0982746   -.0598896
                2019  |  -.0885419     .00983    -9.01   0.000    -.1107788    -.066305
                      |
                 nind |
                   2  |   .1626499    .027139     5.99   0.000     .1012573    .2240426
                   3  |   .1152919   .0208343     5.53   0.000     .0681615    .1624222
                   4  |   .0111192   .0197259     0.56   0.587     -.033504    .0557423
                   5  |   .1816269   .0232899     7.80   0.000     .1289415    .2343124
                   6  |   .0027331   .0188512     0.14   0.888    -.0399112    .0453774
                   7  |   -.014492   .0187441    -0.77   0.459    -.0568941    .0279101
                   8  |   .0074311    .022946     0.32   0.753    -.0444764    .0593386
                   9  |     .14158   .0210499     6.73   0.000     .0939618    .1891982
                  10  |  -.0247807   .0194442    -1.27   0.234    -.0687666    .0192052
                  11  |   .1143731      .0268     4.27   0.002     .0537473     .174999
                      |
                 educ |   .0119952   .0029608     4.05   0.003     .0052973    .0186931
                exper |   .0065097   .0020118     3.24   0.010     .0019588    .0110607
               exper2 |   .0001474   .0001033     1.43   0.187    -.0000862    .0003809
               exper3 |  -3.15e-06   3.47e-06    -0.91   0.388     -.000011    4.70e-06
               exper4 |  -2.05e-08   3.77e-08    -0.54   0.600    -1.06e-07    6.48e-08
                 edex |  -.0002615   .0000944    -2.77   0.022     -.000475   -.0000481
                      |
                ee_cl |
                   2  |  -.0373046   .0075993    -4.91   0.001    -.0544956   -.0201137
                   3  |  -.0257969   .0087342    -2.95   0.016     -.045555   -.0060388
                   4  |  -.0423614   .0154879    -2.74   0.023    -.0773975   -.0073253
                   5  |  -.0944595   .0131127    -7.20   0.000    -.1241224   -.0647966
                   6  |  -.0177798   .0084449    -2.11   0.065    -.0368834    .0013238
                   7  |  -.0006644   .0103473    -0.06   0.950    -.0240717    .0227428
                   8  |  -.0623052   .0175768    -3.54   0.006    -.1020667   -.0225437
                   9  |  -.0652541   .0132339    -4.93   0.001    -.0951912   -.0353169
                  10  |   .0081581   .0121803     0.67   0.520    -.0193956    .0357119
                  11  |  -.0046451   .0134425    -0.35   0.738    -.0350542     .025764
                  12  |  -.0909281   .0184472    -4.93   0.001    -.1326585   -.0491976
                  13  |   .0198243   .0163658     1.21   0.257    -.0171978    .0568464
                  14  |    .015762   .0121779     1.29   0.228    -.0117862    .0433103
                  15  |  -.0084855   .0139491    -0.61   0.558    -.0400405    .0230696
                  16  |  -.1042525   .0207778    -5.02   0.001    -.1512552   -.0572498
                      |
                 marr |   .0199769   .0021724     9.20   0.000     .0150626    .0248913
                partt |  -.0710655   .0059371   -11.97   0.000    -.0844963   -.0576348
               public |   .2885745    .030755     9.38   0.000     .2190017    .3581472
                 cmsa |   .0528556   .0102577     5.15   0.001     .0296511    .0760602
                      |
                nocc2 |
                   2  |   .0605986   .0035918    16.87   0.000     .0524733    .0687238
                   3  |   .0317957   .0031724    10.02   0.000     .0246192    .0389721
                   4  |   .2057734   .0065428    31.45   0.000     .1909727    .2205742
                   5  |    .154739   .0081205    19.06   0.000     .1363692    .1731088
                   6  |   .1639862   .0049439    33.17   0.000     .1528022    .1751701
                   7  |   .0816725   .0034292    23.82   0.000      .073915    .0894299
                   8  |   .0851781    .011923     7.14   0.000     .0582063    .1121498
                   9  |   .1962861   .0078252    25.08   0.000     .1785842    .2139879
                  10  |   .2430423   .0086906    27.97   0.000     .2233828    .2627018
                  11  |   .2706584   .0110357    24.53   0.000     .2456939    .2956229
                  12  |   .2619983   .0119477    21.93   0.000     .2349708    .2890258
                      |
                unemp |  -.0020277   .0012818    -1.58   0.148    -.0049273    .0008719
                      |
              quarter |
                   2  |  -.0060477   .0025508    -2.37   0.042     -.011818   -.0002775
                   3  |  -.0051076   .0028048    -1.82   0.102    -.0114526    .0012375
                   4  |  -.0073813   .0011441    -6.45   0.000    -.0099695   -.0047931
                      |
                _cons |  -.2426398   .0372149    -6.52   0.000    -.3268257   -.1584538
---------------------------------------------------------------------------------------

. 
. eststo covstagdid_mal_rust 

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3
>  exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce
> (cluster state)
(sum of wgt is 2,842,088,791)

Linear regression                               Number of obs     =    292,638
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2837
                                                Root MSE          =     .30353

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0757594   .0112046     6.76   0.000     .0504129    .1011058
             treat_st |  -.0179167   .0121651    -1.47   0.175     -.045436    .0096027
treat_stblackrelwhite |  -.0150822   .0192458    -0.78   0.453    -.0586193    .0284549
                      |
                state |
                  OH  |  -.0153477   .0008593   -17.86   0.000    -.0172916   -.0134039
                  IN  |  -.0584812   .0033864   -17.27   0.000    -.0661417   -.0508206
                  IL  |   -.009463   .0014491    -6.53   0.000    -.0127411    -.006185
                  MI  |   .0322927   .0029586    10.91   0.000     .0255999    .0389856
                  WI  |  -.0159035   .0034046    -4.67   0.001    -.0236052   -.0082019
                  MN  |   .0265111   .0033933     7.81   0.000     .0188349    .0341873
                  MO  |  -.0621334   .0008383   -74.12   0.000    -.0640298    -.060237
                  WV  |   -.040864   .0058703    -6.96   0.000    -.0541435   -.0275845
                  KY  |  -.0723922   .0032225   -22.46   0.000     -.079682   -.0651023
                      |
                 year |
                1990  |  -.0038571   .0023219    -1.66   0.131    -.0091096    .0013954
                1991  |  -.0035654   .0034975    -1.02   0.335    -.0114774    .0043467
                1992  |   .0003147    .002398     0.13   0.898    -.0051099    .0057393
                1993  |   .0002931   .0035774     0.08   0.936    -.0077996    .0083858
                1996  |  -.0058051   .0043898    -1.32   0.219    -.0157356    .0041254
                1997  |  -.0084693   .0063497    -1.33   0.215    -.0228334    .0058947
                1998  |  -.0148441    .007555    -1.96   0.081    -.0319348    .0022465
                1999  |   -.020128     .00593    -3.39   0.008    -.0335426   -.0067134
                2000  |  -.0108707   .0055828    -1.95   0.083    -.0234999    .0017585
                2001  |  -.0114169   .0034333    -3.33   0.009    -.0191835   -.0036503
                2002  |  -.0162787    .005604    -2.90   0.017    -.0289558   -.0036017
                2003  |  -.0215228    .004214    -5.11   0.001    -.0310556     -.01199
                2004  |  -.0257699   .0048894    -5.27   0.001    -.0368305   -.0147093
                2005  |   -.030266   .0060308    -5.02   0.001    -.0439086   -.0166233
                2006  |  -.0327064   .0075078    -4.36   0.002    -.0496901   -.0157226
                2007  |  -.0351268   .0059068    -5.95   0.000    -.0484889   -.0217647
                2008  |   -.029693   .0034674    -8.56   0.000    -.0375368   -.0218492
                2009  |   -.025031   .0072505    -3.45   0.007    -.0414327   -.0086293
                2010  |  -.0289542   .0078221    -3.70   0.005    -.0466489   -.0112594
                2011  |  -.0236187   .0057468    -4.11   0.003    -.0366189   -.0106186
                2012  |  -.0326082   .0018535   -17.59   0.000    -.0368012   -.0284152
                2013  |  -.0325258   .0041387    -7.86   0.000    -.0418882   -.0231634
                2014  |  -.0361082   .0058556    -6.17   0.000    -.0493545   -.0228619
                2015  |  -.0406614   .0062622    -6.49   0.000    -.0548274   -.0264954
                2016  |  -.0385269   .0057599    -6.69   0.000    -.0515567   -.0254972
                2017  |  -.0448525   .0066458    -6.75   0.000    -.0598863   -.0298186
                2018  |  -.0458151   .0066854    -6.85   0.000    -.0609384   -.0306918
                2019  |  -.0464284   .0065806    -7.06   0.000    -.0613147   -.0315421
                      |
                 nind |
                   2  |   .0853368   .0125964     6.77   0.000     .0568418    .1138319
                   3  |   .1016121   .0072263    14.06   0.000     .0852651    .1179591
                   4  |   .0722689   .0074674     9.68   0.000     .0553764    .0891614
                   5  |   .2225248   .0164099    13.56   0.000     .1854031    .2596465
                   6  |   .0505338    .010529     4.80   0.001     .0267154    .0743521
                   7  |   .0378311   .0088097     4.29   0.002     .0179023      .05776
                   8  |   .0491715   .0108092     4.55   0.001     .0247195    .0736235
                   9  |   .2033435   .0160324    12.68   0.000     .1670757    .2396112
                  10  |   .0272151   .0089735     3.03   0.014     .0069157    .0475146
                  11  |   .0514276   .0284129     1.81   0.104    -.0128468     .115702
                      |
                 educ |   .0183713   .0021403     8.58   0.000     .0135297    .0232129
                exper |   .0094641   .0020748     4.56   0.001     .0047704    .0141577
               exper2 |  -.0003851   .0001548    -2.49   0.035    -.0007353    -.000035
               exper3 |   9.73e-06   4.95e-06     1.97   0.081    -1.46e-06    .0000209
               exper4 |  -9.48e-08   5.21e-08    -1.82   0.102    -2.13e-07    2.31e-08
                 edex |  -.0001594   .0000661    -2.41   0.039     -.000309   -9.73e-06
                      |
                ee_cl |
                   2  |  -.0449811   .0055948    -8.04   0.000    -.0576375   -.0323247
                   3  |  -.0766533   .0054805   -13.99   0.000    -.0890511   -.0642555
                   4  |  -.1142102   .0105498   -10.83   0.000    -.1380755   -.0903449
                   5  |  -.0420837   .0120568    -3.49   0.007     -.069358   -.0148093
                   6  |   -.042581   .0065406    -6.51   0.000    -.0573768   -.0277852
                   7  |  -.0705697   .0082001    -8.61   0.000    -.0891196   -.0520197
                   8  |  -.1017477   .0104729    -9.72   0.000     -.125439   -.0780564
                   9  |  -.0230461   .0126505    -1.82   0.102    -.0516636    .0055714
                  10  |  -.0394566   .0077749    -5.07   0.001    -.0570446   -.0218687
                  11  |  -.0645111   .0105742    -6.10   0.000    -.0884317   -.0405906
                  12  |  -.0904527   .0112102    -8.07   0.000    -.1158119   -.0650936
                  13  |   .0145042   .0112174     1.29   0.228    -.0108714    .0398798
                  14  |  -.0349076   .0105324    -3.31   0.009    -.0587334   -.0110817
                  15  |  -.0610957   .0105742    -5.78   0.000    -.0850163   -.0371752
                  16  |  -.0887576   .0157804    -5.62   0.000    -.1244555   -.0530598
                      |
                 marr |  -.0011865   .0017771    -0.67   0.521    -.0052066    .0028336
                partt |  -.0648518   .0058434   -11.10   0.000    -.0780705   -.0516331
               public |   .3138521   .0264588    11.86   0.000     .2539982    .3737059
                 cmsa |   .0221893   .0044447     4.99   0.001     .0121348    .0322438
                      |
                nocc2 |
                   2  |   .0199905   .0024352     8.21   0.000     .0144816    .0254994
                   3  |   .0280576   .0058843     4.77   0.001     .0147462    .0413689
                   4  |   .1799456   .0050538    35.61   0.000     .1685132     .191378
                   5  |   .1456885    .015487     9.41   0.000     .1106546    .1807224
                   6  |   .0700757   .0045287    15.47   0.000     .0598311    .0803203
                   7  |   .1018952   .0067991    14.99   0.000     .0865146    .1172759
                   8  |   .0666456     .00506    13.17   0.000      .055199    .0780922
                   9  |   .1187509   .0083663    14.19   0.000      .099825    .1376768
                  10  |   .2359657   .0103398    22.82   0.000     .2125755     .259356
                  11  |   .2579954   .0157452    16.39   0.000     .2223773    .2936136
                  12  |   .2159963   .0188147    11.48   0.000     .1734346    .2585581
                      |
                unemp |   -.001232   .0017681    -0.70   0.504    -.0052317    .0027678
                      |
              quarter |
                   2  |  -.0036364   .0022993    -1.58   0.148    -.0088379     .001565
                   3  |   -.000938   .0014769    -0.64   0.541     -.004279     .002403
                   4  |  -.0042975   .0023512    -1.83   0.101    -.0096164    .0010213
                      |
                _cons |  -.2907041   .0368195    -7.90   0.000    -.3739956   -.2074126
---------------------------------------------------------------------------------------

. 
. eststo covstagdid_fem_rust 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce
> (cluster state) 
(sum of wgt is 2,902,735,376)

Linear regression                               Number of obs     =    293,189
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5105
                                                Root MSE          =     .39982

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.129796    .012157   -10.68   0.000     -.157297    -.102295
             treat_st |  -.0352678   .0186812    -1.89   0.092    -.0775276    .0069919
treat_stblackrelwhite |  -.0255584   .0124147    -2.06   0.070    -.0536425    .0025257
                      |
                state |
                  OH  |  -.0284645   .0013066   -21.78   0.000    -.0314203   -.0255087
                  IN  |  -.0080116   .0054048    -1.48   0.172    -.0202381    .0042148
                  IL  |   .0724451   .0015427    46.96   0.000     .0689552     .075935
                  MI  |   .0369898   .0057513     6.43   0.000     .0239794    .0500002
                  WI  |    .007477   .0047372     1.58   0.149    -.0032394    .0181933
                  MN  |   .0553095   .0042513    13.01   0.000     .0456925    .0649265
                  MO  |  -.0324603    .000758   -42.83   0.000    -.0341749   -.0307457
                  WV  |   -.052578   .0133235    -3.95   0.003    -.0827179   -.0224381
                  KY  |  -.0525281   .0062268    -8.44   0.000    -.0666141   -.0384421
                      |
                 year |
                1990  |  -.0070448   .0063022    -1.12   0.293    -.0213013    .0072117
                1991  |  -.0166848   .0070982    -2.35   0.043     -.032742   -.0006275
                1992  |  -.0151966   .0076716    -1.98   0.079    -.0325511    .0021578
                1993  |  -.0256546   .0070017    -3.66   0.005    -.0414935   -.0098157
                1996  |  -.0218891   .0091005    -2.41   0.040    -.0424758   -.0013025
                1997  |  -.0103376   .0083103    -1.24   0.245    -.0291368    .0084616
                1998  |    .006031    .009807     0.61   0.554    -.0161541     .028216
                1999  |   .0322981   .0128507     2.51   0.033     .0032278    .0613685
                2000  |   .0420882   .0137616     3.06   0.014     .0109573    .0732191
                2001  |   .0557246   .0134011     4.16   0.002     .0254091    .0860401
                2002  |   .0530687   .0114542     4.63   0.001     .0271574      .07898
                2003  |   .0451874   .0114883     3.93   0.003     .0191991    .0711757
                2004  |   .0382063   .0118238     3.23   0.010     .0114591    .0649535
                2005  |   .0170501   .0121095     1.41   0.193    -.0103435    .0444437
                2006  |   .0046506   .0109266     0.43   0.680    -.0200671    .0293683
                2007  |   .0002492   .0144293     0.02   0.987    -.0323922    .0328906
                2008  |  -.0143199    .015254    -0.94   0.372    -.0488267     .020187
                2009  |   .0217523   .0140064     1.55   0.155    -.0099323    .0534368
                2010  |    .008126   .0184765     0.44   0.670    -.0336707    .0499228
                2011  |  -.0116159   .0131951    -0.88   0.402    -.0414652    .0182334
                2012  |  -.0109846   .0131503    -0.84   0.425    -.0407327    .0187634
                2013  |  -.0155605   .0150881    -1.03   0.329    -.0496922    .0185712
                2014  |   -.015603   .0114677    -1.36   0.207    -.0415449    .0103388
                2015  |  -.0003717   .0120264    -0.03   0.976    -.0275773    .0268338
                2016  |   .0054144    .013747     0.39   0.703    -.0256834    .0365121
                2017  |   .0169447    .014029     1.21   0.258    -.0147911    .0486806
                2018  |   .0265032   .0163103     1.62   0.139    -.0103933    .0633998
                2019  |   .0516279    .016658     3.10   0.013     .0139449     .089311
                      |
                 nind |
                   2  |   .1295769    .047478     2.73   0.023     .0221743    .2369795
                   3  |   .1172265   .0430476     2.72   0.023     .0198461     .214607
                   4  |  -.0809996   .0441699    -1.83   0.100    -.1809189    .0189197
                   5  |   .1456368   .0413813     3.52   0.007     .0520258    .2392479
                   6  |   .0943381   .0430893     2.19   0.056    -.0031366    .1918128
                   7  |  -.0108477   .0443806    -0.24   0.812    -.1112436    .0895482
                   8  |  -.0400967   .0440973    -0.91   0.387    -.1398517    .0596582
                   9  |  -.0386478   .0407499    -0.95   0.368    -.1308305    .0535349
                  10  |  -.1085756   .0439269    -2.47   0.035    -.2079453    -.009206
                  11  |   .1139311   .0417761     2.73   0.023     .0194269    .2084352
                      |
                 educ |   .0659034   .0021894    30.10   0.000     .0609507    .0708561
                exper |   .0419056   .0023601    17.76   0.000     .0365667    .0472445
               exper2 |  -.0008963     .00013    -6.90   0.000    -.0011902   -.0006023
               exper3 |   5.86e-06   2.61e-06     2.25   0.051    -3.74e-08    .0000118
               exper4 |   2.05e-09   2.31e-08     0.09   0.931    -5.02e-08    5.43e-08
                 edex |  -.0003299   .0000976    -3.38   0.008    -.0005507    -.000109
                      |
                ee_cl |
                   2  |  -.0631677   .0066828    -9.45   0.000    -.0782852   -.0480502
                   3  |  -.0745336   .0054546   -13.66   0.000    -.0868729   -.0621943
                   4  |  -.0337729   .0121228    -2.79   0.021    -.0611964   -.0063493
                   5  |  -.1467275   .0117551   -12.48   0.000    -.1733193   -.1201357
                   6  |  -.0832004   .0073257   -11.36   0.000    -.0997723   -.0666284
                   7  |  -.0622394   .0083113    -7.49   0.000    -.0810408   -.0434379
                   8  |   .0233187   .0097023     2.40   0.040     .0013705    .0452669
                   9  |  -.1473423   .0137901   -10.68   0.000    -.1785377    -.116147
                  10  |  -.0903974   .0088797   -10.18   0.000    -.1104846   -.0703101
                  11  |  -.0547765   .0109785    -4.99   0.001    -.0796116   -.0299413
                  12  |   .0300108   .0121012     2.48   0.035     .0026359    .0573856
                  13  |  -.0515683   .0143706    -3.59   0.006     -.084077   -.0190596
                  14  |  -.0715406   .0085162    -8.40   0.000    -.0908056   -.0522756
                  15  |  -.0514628   .0109793    -4.69   0.001    -.0762997   -.0266259
                  16  |   .0062372   .0153792     0.41   0.695     -.028553    .0410274
                      |
                 marr |   .1242282   .0023915    51.94   0.000     .1188182    .1296383
                partt |  -.2292177   .0081292   -28.20   0.000    -.2476072   -.2108283
               public |   .0286726   .0110559     2.59   0.029     .0036625    .0536827
                 cmsa |   .1466716   .0178406     8.22   0.000     .1063133    .1870298
                      |
                nocc2 |
                   2  |  -.1416468   .0070495   -20.09   0.000    -.1575939   -.1256997
                   3  |  -.0454581   .0070931    -6.41   0.000    -.0615037   -.0294125
                   4  |  -.3075989   .0154337   -19.93   0.000    -.3425124   -.2726853
                   5  |  -.0735187   .0133721    -5.50   0.000    -.1037684    -.043269
                   6  |   -.358879   .0108627   -33.04   0.000    -.3834522   -.3343058
                   7  |  -.2214118   .0077139   -28.70   0.000    -.2388619   -.2039617
                   8  |  -.1291497   .0175061    -7.38   0.000    -.1687512   -.0895483
                   9  |  -.3931528    .010245   -38.38   0.000    -.4163285   -.3699771
                  10  |  -.3218654   .0100464   -32.04   0.000    -.3445919   -.2991388
                  11  |   -.203428   .0089893   -22.63   0.000    -.2237631   -.1830929
                  12  |   -.369141   .0120006   -30.76   0.000    -.3962883   -.3419937
                      |
                unemp |  -.0034655   .0032969    -1.05   0.321    -.0109237    .0039928
                      |
              quarter |
                   2  |  -.0023122   .0036242    -0.64   0.539    -.0105108    .0058864
                   3  |  -.0021683     .00276    -0.79   0.452     -.008412    .0040753
                   4  |   .0091329   .0027174     3.36   0.008     .0029857      .01528
                      |
                _cons |   .6894768   .0545584    12.64   0.000     .5660572    .8128964
---------------------------------------------------------------------------------------

. 
. eststo wagstagdid_mal_rust 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce
> (cluster state)
(sum of wgt is 2,846,169,741)

Linear regression                               Number of obs     =    293,170
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5015
                                                Root MSE          =     .37783

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0583602   .0077747    -7.51   0.000    -.0759477   -.0407726
             treat_st |  -.0238211   .0094345    -2.52   0.033    -.0451634   -.0024788
treat_stblackrelwhite |  -.0290169   .0060113    -4.83   0.001    -.0426153   -.0154184
                      |
                state |
                  OH  |  -.0347236   .0009658   -35.95   0.000    -.0369085   -.0325387
                  IN  |  -.0374286   .0046162    -8.11   0.000    -.0478711   -.0269861
                  IL  |   .0295237     .00179    16.49   0.000     .0254746    .0335729
                  MI  |   .0049461   .0044619     1.11   0.296    -.0051474    .0150397
                  WI  |   .0195264   .0051913     3.76   0.004     .0077828    .0312701
                  MN  |   .0844741   .0047765    17.69   0.000     .0736688    .0952794
                  MO  |  -.0516226    .001471   -35.09   0.000    -.0549503    -.048295
                  WV  |  -.1228329   .0102946   -11.93   0.000    -.1461208   -.0995449
                  KY  |  -.0655795   .0052794   -12.42   0.000    -.0775223   -.0536367
                      |
                 year |
                1990  |  -.0125981   .0029819    -4.22   0.002    -.0193436   -.0058525
                1991  |  -.0103487   .0064913    -1.59   0.145    -.0250331    .0043358
                1992  |   .0058013   .0076976     0.75   0.470    -.0116118    .0232144
                1993  |   .0078458   .0069379     1.13   0.287    -.0078489    .0235405
                1996  |   .0092276   .0076295     1.21   0.257    -.0080315    .0264866
                1997  |   .0221456   .0108453     2.04   0.072    -.0023881    .0466793
                1998  |   .0571221   .0103526     5.52   0.000     .0337029    .0805413
                1999  |   .0740221   .0105633     7.01   0.000     .0501262     .097918
                2000  |   .0864453    .012305     7.03   0.000     .0586094    .1142813
                2001  |    .094894   .0107285     8.85   0.000     .0706245    .1191636
                2002  |   .0983717   .0091128    10.79   0.000     .0777571    .1189863
                2003  |   .1051059   .0065148    16.13   0.000     .0903685    .1198433
                2004  |   .0928052   .0099542     9.32   0.000     .0702871    .1153232
                2005  |   .0825232   .0085645     9.64   0.000      .063149    .1018974
                2006  |   .0727767   .0081503     8.93   0.000     .0543395    .0912139
                2007  |   .0638623    .009578     6.67   0.000     .0421954    .0855291
                2008  |   .0523608   .0079608     6.58   0.000     .0343522    .0703693
                2009  |   .0574078   .0135457     4.24   0.002     .0267651    .0880504
                2010  |   .0538541   .0124187     4.34   0.002     .0257611    .0819471
                2011  |   .0448552   .0076881     5.83   0.000     .0274636    .0622468
                2012  |   .0354811   .0070041     5.07   0.001     .0196367    .0513255
                2013  |   .0416636   .0078563     5.30   0.000     .0238915    .0594357
                2014  |   .0415861   .0069535     5.98   0.000     .0258562     .057316
                2015  |   .0539256   .0084769     6.36   0.000     .0347496    .0731017
                2016  |   .0681972   .0132379     5.15   0.001     .0382509    .0981434
                2017  |   .0806369   .0115395     6.99   0.000     .0545328    .1067409
                2018  |   .0914283   .0146269     6.25   0.000       .05834    .1245165
                2019  |   .1022527   .0100816    10.14   0.000     .0794465    .1250589
                      |
                 nind |
                   2  |   .1269716   .0197426     6.43   0.000     .0823107    .1716325
                   3  |   .2027801    .015717    12.90   0.000     .1672257    .2383344
                   4  |  -.0391604    .020917    -1.87   0.094     -.086478    .0081573
                   5  |   .2096005   .0172643    12.14   0.000     .1705458    .2486552
                   6  |   .1358759   .0167901     8.09   0.000      .097894    .1738578
                   7  |   .0767071   .0203073     3.78   0.004     .0307688    .1226455
                   8  |   .0470942   .0202292     2.33   0.045     .0013327    .0928558
                   9  |  -.0006934    .014238    -0.05   0.962    -.0329019    .0315151
                  10  |  -.0358561   .0157254    -2.28   0.049    -.0714295   -.0002828
                  11  |   .1131666   .0191673     5.90   0.000     .0698071    .1565262
                      |
                 educ |   .0919251   .0022992    39.98   0.000      .086724    .0971263
                exper |    .043102   .0030788    14.00   0.000     .0361374    .0500666
               exper2 |  -.0015471    .000211    -7.33   0.000    -.0020244   -.0010697
               exper3 |   .0000251   6.57e-06     3.82   0.004     .0000102    .0000399
               exper4 |  -1.41e-07   6.90e-08    -2.04   0.072    -2.97e-07    1.54e-08
                 edex |  -.0003199   .0001131    -2.83   0.020    -.0005757   -.0000641
                      |
                ee_cl |
                   2  |  -.1292839   .0100053   -12.92   0.000    -.1519175   -.1066503
                   3  |  -.1730832   .0104216   -16.61   0.000    -.1966585   -.1495078
                   4  |  -.1862876   .0161731   -11.52   0.000    -.2228736   -.1497016
                   5  |   -.155068   .0187362    -8.28   0.000    -.1974522   -.1126839
                   6  |  -.1634766   .0137148   -11.92   0.000    -.1945017   -.1324516
                   7  |  -.1766789     .01506   -11.73   0.000    -.2107471   -.1426108
                   8  |  -.1257729   .0143869    -8.74   0.000    -.1583182   -.0932276
                   9  |  -.1427967    .022002    -6.49   0.000    -.1925687   -.0930247
                  10  |  -.1612899   .0171362    -9.41   0.000    -.2000547   -.1225251
                  11  |  -.1688492   .0153928   -10.97   0.000    -.2036702   -.1340282
                  12  |  -.1322369   .0118367   -11.17   0.000    -.1590135   -.1054603
                  13  |  -.0600336   .0286461    -2.10   0.066    -.1248357    .0047685
                  14  |  -.1389076   .0210158    -6.61   0.000    -.1864487   -.0913665
                  15  |   -.138754   .0182523    -7.60   0.000    -.1800437   -.0974643
                  16  |  -.1430088   .0132569   -10.79   0.000     -.172998   -.1130196
                      |
                 marr |    .041593   .0028821    14.43   0.000     .0350733    .0481127
                partt |  -.1477124   .0037334   -39.56   0.000     -.156158   -.1392667
               public |   .0831879   .0068794    12.09   0.000     .0676257    .0987502
                 cmsa |   .1536311   .0163158     9.42   0.000     .1167222      .19054
                      |
                nocc2 |
                   2  |  -.1229027   .0083792   -14.67   0.000    -.1418577   -.1039476
                   3  |  -.0381331   .0133992    -2.85   0.019    -.0684443   -.0078219
                   4  |  -.2832091   .0081271   -34.85   0.000     -.301594   -.2648243
                   5  |   .0671658   .0115938     5.79   0.000     .0409389    .0933928
                   6  |  -.3115437   .0098475   -31.64   0.000    -.3338204    -.289267
                   7  |  -.3380366    .008397   -40.26   0.000     -.357032   -.3190411
                   8  |  -.1586384   .0107985   -14.69   0.000    -.1830662   -.1342106
                   9  |   -.389235   .0090633   -42.95   0.000    -.4097376   -.3687324
                  10  |  -.3850859   .0183937   -20.94   0.000    -.4266954   -.3434764
                  11  |  -.1182262   .0144032    -8.21   0.000    -.1508085   -.0856438
                  12  |  -.3579407   .0151199   -23.67   0.000    -.3921444   -.3237371
                      |
                unemp |   .0045749   .0032221     1.42   0.189    -.0027139    .0118638
                      |
              quarter |
                   2  |    .005597   .0022641     2.47   0.035     .0004754    .0107186
                   3  |   .0119636   .0017738     6.74   0.000     .0079509    .0159763
                   4  |   .0195981   .0015308    12.80   0.000     .0161353    .0230609
                      |
                _cons |   .2267404   .0556348     4.08   0.003     .1008859     .352595
---------------------------------------------------------------------------------------

. 
. eststo wagstagdid_fem_rust 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & co
> vered == 0, vce(cluster state)
(sum of wgt is 2,273,642,012)

Linear regression                               Number of obs     =    227,225
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5491
                                                Root MSE          =     .40355

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1530898   .0079549   -19.24   0.000     -.171085   -.1350947
             treat_st |  -.0256812   .0145786    -1.76   0.112    -.0586603    .0072979
treat_stblackrelwhite |  -.0048691   .0100754    -0.48   0.640    -.0276613    .0179231
                      |
                state |
                  OH  |  -.0336613   .0012445   -27.05   0.000    -.0364765   -.0308461
                  IN  |  -.0089904   .0048498    -1.85   0.097    -.0199614    .0019805
                  IL  |   .0590816   .0018728    31.55   0.000      .054845    .0633183
                  MI  |   .0162976   .0053214     3.06   0.014     .0042598    .0283355
                  WI  |   .0090763   .0045522     1.99   0.077    -.0012215     .019374
                  MN  |   .0518166    .004593    11.28   0.000     .0414266    .0622066
                  MO  |  -.0383395   .0012793   -29.97   0.000    -.0412335   -.0354456
                  WV  |  -.0564475   .0126559    -4.46   0.002    -.0850772   -.0278178
                  KY  |  -.0421814   .0060913    -6.92   0.000     -.055961   -.0284018
                      |
                 year |
                1990  |  -.0019607   .0068635    -0.29   0.782    -.0174871    .0135656
                1991  |  -.0048553    .009064    -0.54   0.605    -.0253596     .015649
                1992  |  -.0037301   .0096478    -0.39   0.708     -.025555    .0180947
                1993  |  -.0176612   .0070644    -2.50   0.034    -.0336421   -.0016804
                1996  |  -.0126632   .0111991    -1.13   0.287    -.0379974    .0126709
                1997  |   .0012462   .0092531     0.13   0.896    -.0196858    .0221781
                1998  |   .0231191   .0109575     2.11   0.064    -.0016686    .0479068
                1999  |   .0515255   .0142176     3.62   0.006     .0193629     .083688
                2000  |   .0624329   .0148976     4.19   0.002     .0287322    .0961336
                2001  |   .0838738   .0141933     5.91   0.000     .0517663    .1159813
                2002  |   .0786527   .0104235     7.55   0.000     .0550732    .1022322
                2003  |   .0677526   .0132746     5.10   0.001     .0377234    .0977818
                2004  |   .0625843   .0115097     5.44   0.000     .0365475    .0886211
                2005  |   .0437572   .0141273     3.10   0.013     .0117991    .0757154
                2006  |   .0283726    .010552     2.69   0.025     .0045024    .0522428
                2007  |   .0259972   .0140681     1.85   0.098    -.0058271    .0578215
                2008  |   .0084392    .013371     0.63   0.544    -.0218082    .0386866
                2009  |   .0455383   .0160604     2.84   0.020      .009207    .0818695
                2010  |   .0318747   .0178148     1.79   0.107    -.0084251    .0721745
                2011  |    .011419   .0135939     0.84   0.423    -.0193324    .0421705
                2012  |   .0135606   .0137996     0.98   0.351    -.0176563    .0447775
                2013  |   .0082115    .014024     0.59   0.573    -.0235131     .039936
                2014  |   .0082778   .0089298     0.93   0.378    -.0119228    .0284783
                2015  |   .0283408   .0104203     2.72   0.024     .0047684    .0519132
                2016  |   .0343576   .0127058     2.70   0.024     .0056152    .0631001
                2017  |   .0403591   .0149725     2.70   0.025     .0064888    .0742293
                2018  |   .0509527   .0176156     2.89   0.018     .0111034    .0908019
                2019  |   .0798754   .0175415     4.55   0.001     .0401938     .119557
                      |
                 nind |
                   2  |   .0694175    .044517     1.56   0.153    -.0312869    .1701219
                   3  |   .1220164   .0397154     3.07   0.013     .0321739     .211859
                   4  |  -.0574165   .0421644    -1.36   0.206    -.1527989    .0379659
                   5  |    .106589   .0382162     2.79   0.021     .0201379    .1930401
                   6  |   .1091021   .0405134     2.69   0.025     .0174544    .2007497
                   7  |   .0097655   .0425741     0.23   0.824    -.0865438    .1060748
                   8  |   -.014595   .0421949    -0.35   0.737    -.1100465    .0808565
                   9  |  -.0534381    .036506    -1.46   0.177    -.1360204    .0291441
                  10  |  -.0871009   .0419385    -2.08   0.068    -.1819723    .0077705
                  11  |   .0761423   .0393262     1.94   0.085    -.0128198    .1651043
                      |
                 educ |   .0606075   .0021654    27.99   0.000      .055709    .0655061
                exper |   .0350341   .0024542    14.28   0.000     .0294823    .0405858
               exper2 |  -.0006338   .0001071    -5.92   0.000    -.0008761   -.0003916
               exper3 |  -3.12e-06   2.99e-06    -1.04   0.324    -9.88e-06    3.65e-06
               exper4 |   1.07e-07   3.92e-08     2.73   0.023     1.83e-08    1.96e-07
                 edex |  -.0001206   .0001206    -1.00   0.343    -.0003935    .0001522
                      |
                ee_cl |
                   2  |  -.0610733   .0042208   -14.47   0.000    -.0706215   -.0515252
                   3  |  -.0774198   .0055372   -13.98   0.000    -.0899459   -.0648937
                   4  |  -.0232858    .012432    -1.87   0.094    -.0514089    .0048374
                   5  |  -.1325656    .009882   -13.41   0.000    -.1549201    -.110211
                   6  |  -.0945778   .0077142   -12.26   0.000    -.1120285   -.0771271
                   7  |  -.0739425   .0091123    -8.11   0.000     -.094556    -.053329
                   8  |   .0449462   .0114462     3.93   0.003     .0190532    .0708392
                   9  |  -.1553523    .012002   -12.94   0.000    -.1825027    -.128202
                  10  |  -.1055588   .0076973   -13.71   0.000    -.1229712   -.0881463
                  11  |  -.0588766   .0110901    -5.31   0.000    -.0839641   -.0337891
                  12  |   .0533476   .0149336     3.57   0.006     .0195655    .0871297
                  13  |  -.0648481   .0122179    -5.31   0.000    -.0924868   -.0372093
                  14  |  -.0737316   .0060188   -12.25   0.000     -.087347   -.0601162
                  15  |  -.0436265   .0101099    -4.32   0.002    -.0664967   -.0207564
                  16  |   .0309461   .0197258     1.57   0.151    -.0136767    .0755689
                      |
                 marr |   .1328986   .0027911    47.62   0.000     .1265848    .1392124
                partt |  -.2223257   .0066895   -33.23   0.000    -.2374585    -.207193
               public |   .0067024   .0089319     0.75   0.472     -.013503    .0269078
                 cmsa |   .1400575   .0164363     8.52   0.000      .102876    .1772389
                      |
                nocc2 |
                   2  |  -.1518615   .0065861   -23.06   0.000    -.1667602   -.1369628
                   3  |  -.0477021   .0084517    -5.64   0.000    -.0668211   -.0285831
                   4  |  -.3546236   .0159861   -22.18   0.000    -.3907867   -.3184606
                   5  |  -.0922414   .0134967    -6.83   0.000    -.1227732   -.0617097
                   6  |   -.387126   .0106849   -36.23   0.000     -.411297    -.362955
                   7  |  -.2385797   .0073735   -32.36   0.000    -.2552597   -.2218997
                   8  |  -.1393449   .0154893    -9.00   0.000    -.1743841   -.1043057
                   9  |  -.4403397   .0109178   -40.33   0.000    -.4650375   -.4156419
                  10  |  -.3728183    .008879   -41.99   0.000     -.392904   -.3527326
                  11  |  -.2651832   .0092362   -28.71   0.000     -.286077   -.2442894
                  12  |  -.4326899   .0126331   -34.25   0.000    -.4612679    -.404112
                      |
                unemp |  -.0031746    .003364    -0.94   0.370    -.0107845    .0044353
                      |
              quarter |
                   2  |  -.0010984   .0034829    -0.32   0.760    -.0089771    .0067804
                   3  |  -.0029351   .0027944    -1.05   0.321    -.0092564    .0033862
                   4  |   .0098139    .003087     3.18   0.011     .0028305    .0167972
                      |
                _cons |   .7702501   .0574121    13.42   0.000     .6403749    .9001253
---------------------------------------------------------------------------------------

. 
. eststo uwagstagdid_mal_rust 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & co
> vered == 0, vce(cluster state)
(sum of wgt is 2,411,359,356)

Linear regression                               Number of obs     =    246,730
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5081
                                                Root MSE          =     .37724

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0828694   .0102703    -8.07   0.000    -.1061024   -.0596363
             treat_st |  -.0199191    .007979    -2.50   0.034    -.0379688   -.0018695
treat_stblackrelwhite |  -.0256867   .0080977    -3.17   0.011    -.0440049   -.0073685
                      |
                state |
                  OH  |   -.033455   .0011217   -29.83   0.000    -.0359924   -.0309176
                  IN  |  -.0274491   .0045022    -6.10   0.000    -.0376338   -.0172645
                  IL  |   .0385429   .0020312    18.98   0.000      .033948    .0431378
                  MI  |  -.0076982   .0046639    -1.65   0.133    -.0182487    .0028524
                  WI  |   .0254577   .0052134     4.88   0.001     .0136641    .0372512
                  MN  |   .0878765   .0048004    18.31   0.000     .0770173    .0987356
                  MO  |  -.0377566   .0018801   -20.08   0.000    -.0420096   -.0335036
                  WV  |  -.1179141   .0104505   -11.28   0.000    -.1415548   -.0942733
                  KY  |  -.0499105    .005529    -9.03   0.000    -.0624179   -.0374031
                      |
                 year |
                1990  |  -.0124388   .0036272    -3.43   0.008    -.0206441   -.0042336
                1991  |  -.0043499    .007136    -0.61   0.557    -.0204926    .0117929
                1992  |   .0143438   .0089617     1.60   0.144     -.005929    .0346165
                1993  |   .0117357   .0074978     1.57   0.152    -.0052255    .0286969
                1996  |    .011812   .0090686     1.30   0.225    -.0087025    .0323266
                1997  |   .0259516   .0126005     2.06   0.070    -.0025527    .0544559
                1998  |    .064662   .0118569     5.45   0.000     .0378398    .0914842
                1999  |   .0849463   .0121887     6.97   0.000     .0573735    .1125192
                2000  |   .0984252   .0136823     7.19   0.000     .0674736    .1293768
                2001  |   .1092407   .0138703     7.88   0.000      .077864    .1406175
                2002  |   .1131283   .0108065    10.47   0.000     .0886822    .1375744
                2003  |   .1223443   .0086019    14.22   0.000     .1028854    .1418032
                2004  |   .1111627   .0132296     8.40   0.000     .0812353    .1410901
                2005  |   .1015683    .008891    11.42   0.000     .0814555     .121681
                2006  |   .0895512    .010801     8.29   0.000     .0651177    .1139847
                2007  |   .0824922   .0100456     8.21   0.000     .0597675    .1052169
                2008  |   .0728374   .0098949     7.36   0.000     .0504537    .0952212
                2009  |   .0764651   .0144984     5.27   0.001     .0436675    .1092628
                2010  |   .0719741   .0146506     4.91   0.001     .0388322     .105116
                2011  |   .0623284   .0085171     7.32   0.000     .0430614    .0815954
                2012  |   .0540121   .0075027     7.20   0.000     .0370398    .0709844
                2013  |   .0583037   .0095088     6.13   0.000     .0367933    .0798141
                2014  |   .0662209   .0097134     6.82   0.000     .0442478    .0881941
                2015  |   .0783587   .0101102     7.75   0.000     .0554879    .1012296
                2016  |   .0907253     .01486     6.11   0.000     .0571095     .124341
                2017  |   .1051834   .0135746     7.75   0.000     .0744755    .1358913
                2018  |   .1179719   .0154613     7.63   0.000     .0829961    .1529477
                2019  |   .1296273   .0113912    11.38   0.000     .1038587    .1553959
                      |
                 nind |
                   2  |   .1103472   .0161775     6.82   0.000     .0737511    .1469433
                   3  |   .1888144    .012532    15.07   0.000      .160465    .2171638
                   4  |  -.0383859   .0193368    -1.99   0.078    -.0821288     .005357
                   5  |   .1523844   .0151728    10.04   0.000      .118061    .1867077
                   6  |   .1332199   .0148934     8.94   0.000     .0995287    .1669111
                   7  |   .0788508   .0184937     4.26   0.002     .0370152    .1206865
                   8  |   .0534903   .0178314     3.00   0.015     .0131528    .0938278
                   9  |  -.0228181   .0129417    -1.76   0.112    -.0520942    .0064579
                  10  |  -.0289098   .0132859    -2.18   0.058    -.0589647    .0011451
                  11  |   .1295149   .0163511     7.92   0.000     .0925262    .1665035
                      |
                 educ |   .0866748   .0031227    27.76   0.000     .0796108    .0937388
                exper |   .0427568   .0032048    13.34   0.000     .0355071    .0500064
               exper2 |   -.001519   .0002094    -7.25   0.000    -.0019927   -.0010454
               exper3 |   .0000245   6.46e-06     3.79   0.004     9.85e-06    .0000391
               exper4 |  -1.31e-07   6.71e-08    -1.95   0.083    -2.82e-07    2.11e-08
                 edex |  -.0004014   .0001111    -3.61   0.006    -.0006528   -.0001501
                      |
                ee_cl |
                   2  |  -.1190477   .0111185   -10.71   0.000    -.1441994   -.0938959
                   3  |  -.1576949   .0126657   -12.45   0.000    -.1863467   -.1290432
                   4  |   -.156799   .0216857    -7.23   0.000    -.2058554   -.1077426
                   5  |  -.1493537   .0190109    -7.86   0.000    -.1923593   -.1063482
                   6  |  -.1545211   .0158155    -9.77   0.000    -.1902984   -.1187439
                   7  |  -.1576477   .0181882    -8.67   0.000    -.1987923   -.1165032
                   8  |  -.0853065   .0200569    -4.25   0.002    -.1306784   -.0399345
                   9  |   -.144437   .0218021    -6.62   0.000    -.1937567   -.0951173
                  10  |  -.1509045    .019873    -7.59   0.000    -.1958603   -.1059487
                  11  |  -.1446823   .0184997    -7.82   0.000    -.1865315   -.1028331
                  12  |  -.0973854   .0166058    -5.86   0.000    -.1349504   -.0598203
                  13  |  -.0773182   .0278657    -2.77   0.022    -.1403549   -.0142815
                  14  |  -.1278359    .023566    -5.42   0.000    -.1811459   -.0745258
                  15  |  -.1145497   .0221948    -5.16   0.001    -.1647578   -.0643416
                  16  |  -.1152244   .0189569    -6.08   0.000     -.158108   -.0723408
                      |
                 marr |   .0481607   .0028371    16.98   0.000     .0417429    .0545786
                partt |   -.143225   .0035763   -40.05   0.000    -.1513152   -.1351348
               public |   .0251537   .0092475     2.72   0.024     .0042344     .046073
                 cmsa |   .1556719   .0159513     9.76   0.000     .1195874    .1917563
                      |
                nocc2 |
                   2  |  -.1300649   .0087016   -14.95   0.000    -.1497492   -.1103806
                   3  |  -.0373803   .0135808    -2.75   0.022    -.0681022   -.0066585
                   4  |  -.3406717   .0098643   -34.54   0.000    -.3629864    -.318357
                   5  |   .0491249   .0122657     4.01   0.003     .0213781    .0768717
                   6  |  -.3267465   .0095824   -34.10   0.000    -.3484235   -.3050696
                   7  |  -.3574528   .0082656   -43.25   0.000    -.3761508   -.3387548
                   8  |  -.1744986   .0116155   -15.02   0.000    -.2007747   -.1482224
                   9  |  -.4163534   .0090324   -46.10   0.000    -.4367861   -.3959208
                  10  |  -.4391163   .0169336   -25.93   0.000    -.4774228   -.4008099
                  11  |  -.2160041   .0158721   -13.61   0.000    -.2519094   -.1800988
                  12  |  -.4081773   .0171333   -23.82   0.000    -.4469356    -.369419
                      |
                unemp |   .0045408   .0034856     1.30   0.225    -.0033442    .0124258
                      |
              quarter |
                   2  |    .006902   .0020894     3.30   0.009     .0021754    .0116287
                   3  |   .0130753   .0020884     6.26   0.000     .0083511    .0177995
                   4  |   .0218851   .0015602    14.03   0.000     .0183556    .0254147
                      |
                _cons |   .2889393   .0660981     4.37   0.002      .139415    .4384636
---------------------------------------------------------------------------------------

. 
. eststo uwagstagdid_fem_rust

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & co
> vered == 1, vce(cluster state)
(sum of wgt is 625,287,430)

Linear regression                               Number of obs     =     65,478
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3341
                                                Root MSE          =     .33785

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1103552   .0192043    -5.75   0.000    -.1537983    -.066912
             treat_st |  -.0590251   .0339016    -1.74   0.116    -.1357159    .0176657
treat_stblackrelwhite |  -.0451163   .0252748    -1.79   0.108    -.1022918    .0120591
                      |
                state |
                  OH  |  -.0005872   .0021683    -0.27   0.793    -.0054923     .004318
                  IN  |    .017628    .007542     2.34   0.044     .0005669    .0346891
                  IL  |   .0826877   .0021875    37.80   0.000     .0777394    .0876361
                  MI  |   .0867274   .0065091    13.32   0.000     .0720028    .1014521
                  WI  |   .0191508   .0042133     4.55   0.001     .0096197    .0286819
                  MN  |   .0580405    .003858    15.04   0.000     .0493132    .0667679
                  MO  |   .0141754   .0021908     6.47   0.000     .0092193    .0191314
                  WV  |  -.0094746    .014337    -0.66   0.525    -.0419072     .022958
                  KY  |  -.0252446   .0066633    -3.79   0.004    -.0403181   -.0101711
                      |
                 year |
                1990  |  -.0140434   .0093809    -1.50   0.169    -.0352644    .0071776
                1991  |  -.0345848   .0056359    -6.14   0.000     -.047334   -.0218356
                1992  |  -.0304763    .006268    -4.86   0.001    -.0446555   -.0162971
                1993  |  -.0271541   .0072422    -3.75   0.005    -.0435371   -.0107712
                1996  |  -.0155177   .0094038    -1.65   0.133    -.0367905    .0057552
                1997  |  -.0105911   .0075743    -1.40   0.196    -.0277254    .0065433
                1998  |   -.005091   .0093476    -0.54   0.599    -.0262367    .0160548
                1999  |   .0114793   .0101371     1.13   0.287    -.0114523     .034411
                2000  |   .0226992   .0085326     2.66   0.026     .0033971    .0420012
                2001  |   .0128001   .0103655     1.23   0.248    -.0106483    .0362485
                2002  |   .0255567   .0129174     1.98   0.079    -.0036646    .0547779
                2003  |   .0295311   .0137814     2.14   0.061    -.0016447    .0607069
                2004  |   .0209455   .0113462     1.85   0.098    -.0047213    .0466124
                2005  |   .0077493   .0098071     0.79   0.450    -.0144359    .0299344
                2006  |   .0086972   .0111754     0.78   0.456    -.0165832    .0339776
                2007  |  -.0072294   .0151797    -0.48   0.645    -.0415683    .0271095
                2008  |  -.0154299   .0141573    -1.09   0.304     -.047456    .0165962
                2009  |   .0173775   .0175687     0.99   0.348    -.0223657    .0571206
                2010  |   .0172582     .01763     0.98   0.353    -.0226236    .0571399
                2011  |  -.0046636   .0109021    -0.43   0.679    -.0293259    .0199987
                2012  |  -.0041465   .0194333    -0.21   0.836    -.0481076    .0398146
                2013  |   -.008615   .0135483    -0.64   0.541    -.0392633    .0220334
                2014  |  -.0089086   .0213751    -0.42   0.687    -.0572625    .0394453
                2015  |  -.0094291   .0173492    -0.54   0.600    -.0486758    .0298176
                2016  |  -.0064772   .0206374    -0.31   0.761    -.0531623    .0402078
                2017  |   .0151921   .0175364     0.87   0.409     -.024478    .0548623
                2018  |   .0218165   .0156492     1.39   0.197    -.0135844    .0572174
                2019  |   .0368127    .019237     1.91   0.088    -.0067043    .0803297
                      |
                 nind |
                   2  |   .0590375   .0405984     1.45   0.180    -.0328025    .1508775
                   3  |  -.0923386   .0374199    -2.47   0.036    -.1769882    -.007689
                   4  |  -.2596547   .0435408    -5.96   0.000    -.3581508   -.1611586
                   5  |   .0286191   .0409061     0.70   0.502    -.0639168    .1211551
                   6  |  -.1423269   .0413788    -3.44   0.007    -.2359323   -.0487216
                   7  |  -.1551323   .0383099    -4.05   0.003    -.2417953   -.0684692
                   8  |  -.2300648   .0430531    -5.34   0.000    -.3274577   -.1326719
                   9  |  -.1492614   .0455269    -3.28   0.010    -.2522503   -.0462724
                  10  |  -.2068647   .0574609    -3.60   0.006    -.3368504   -.0768791
                  11  |   .0476667   .0407534     1.17   0.272    -.0445238    .1398572
                      |
                 educ |   .0681006   .0090007     7.57   0.000     .0477395    .0884617
                exper |   .0694317   .0034775    19.97   0.000     .0615651    .0772983
               exper2 |    -.00262   .0003661    -7.16   0.000    -.0034483   -.0017917
               exper3 |   .0000563   .0000102     5.50   0.000     .0000331    .0000794
               exper4 |  -4.80e-07   9.67e-08    -4.97   0.001    -6.99e-07   -2.62e-07
                 edex |  -.0007803    .000232    -3.36   0.008    -.0013051   -.0002555
                      |
                ee_cl |
                   2  |   .0756807   .0374312     2.02   0.074    -.0089946     .160356
                   3  |   .0654163   .0371926     1.76   0.112    -.0187192    .1495518
                   4  |   .0030132   .0495824     0.06   0.953      -.10915    .1151764
                   5  |   .0115421   .0460877     0.25   0.808    -.0927155    .1157996
                   6  |   .0644575   .0330461     1.95   0.083     -.010298    .1392131
                   7  |   .0659203   .0443991     1.48   0.172    -.0345175    .1663582
                   8  |   .0118525   .0460804     0.26   0.803    -.0923887    .1160937
                   9  |   .0469734   .0487855     0.96   0.361    -.0633871    .1573338
                  10  |   .0486516   .0412879     1.18   0.269    -.0447482    .1420514
                  11  |   .0677748    .042646     1.59   0.146    -.0286972    .1642469
                  12  |   .0676374   .0470758     1.44   0.185    -.0388555    .1741303
                  13  |   .0522059   .0443986     1.18   0.270    -.0482308    .1526426
                  14  |   .0365204   .0420426     0.87   0.408    -.0585865    .1316273
                  15  |   .0565027   .0469875     1.20   0.260    -.0497904    .1627957
                  16  |   .0680386   .0431855     1.58   0.150    -.0296538     .165731
                      |
                 marr |   .0615048   .0048248    12.75   0.000     .0505903    .0724194
                partt |  -.1378473   .0211504    -6.52   0.000    -.1856929   -.0900017
               public |  -.0556378   .0131907    -4.22   0.002    -.0854771   -.0257984
                 cmsa |   .1086711   .0152468     7.13   0.000     .0741804    .1431618
                      |
                nocc2 |
                   2  |  -.0002709   .0200207    -0.01   0.989     -.045561    .0450192
                   3  |   .0073961   .0193332     0.38   0.711    -.0363385    .0511307
                   4  |  -.0470761   .0160126    -2.94   0.016     -.083299   -.0108531
                   5  |   .0160705   .0205689     0.78   0.455    -.0304596    .0626005
                   6  |  -.2056801   .0097205   -21.16   0.000    -.2276695   -.1836907
                   7  |  -.1878086   .0178556   -10.52   0.000    -.2282007   -.1474165
                   8  |  -.1147756    .049505    -2.32   0.046    -.2267636   -.0027876
                   9  |  -.2239044   .0099465   -22.51   0.000     -.246405   -.2014039
                  10  |  -.1351543   .0160275    -8.43   0.000     -.171411   -.0988977
                  11  |  -.0410834   .0169595    -2.42   0.038    -.0794484   -.0027185
                  12  |  -.1849127   .0159421   -11.60   0.000    -.2209763    -.148849
                      |
                unemp |  -.0042593   .0031473    -1.35   0.209    -.0113789    .0028603
                      |
              quarter |
                   2  |  -.0015726   .0044902    -0.35   0.734    -.0117301     .008585
                   3  |   .0073713   .0039508     1.87   0.095     -.001566    .0163086
                   4  |    .013103   .0023397     5.60   0.000     .0078103    .0183958
                      |
                _cons |   .6403398   .0885652     7.23   0.000     .4399915    .8406881
---------------------------------------------------------------------------------------

. 
. eststo nwagstagdid_mal_rust 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 
> exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & co
> vered == 1, vce(cluster state)
(sum of wgt is 430,729,435)

Linear regression                               Number of obs     =     45,908
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4313
                                                Root MSE          =     .35069

                                          (Std. Err. adjusted for 10 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0191372   .0070322    -2.72   0.024    -.0350452   -.0032292
             treat_st |  -.0430639   .0192858    -2.23   0.052    -.0866914    .0005637
treat_stblackrelwhite |   .0066141   .0315245     0.21   0.838    -.0646994    .0779276
                      |
                state |
                  OH  |  -.0241757   .0016368   -14.77   0.000    -.0278785    -.020473
                  IN  |  -.0445467   .0062508    -7.13   0.000    -.0586868   -.0304065
                  IL  |  -.0081191   .0021057    -3.86   0.004    -.0128826   -.0033557
                  MI  |   .0392939    .007338     5.35   0.000     .0226942    .0558936
                  WI  |   .0043148   .0037154     1.16   0.275      -.00409    .0127195
                  MN  |   .0595894   .0057239    10.41   0.000     .0466411    .0725378
                  MO  |  -.0826738   .0018621   -44.40   0.000    -.0868862   -.0784614
                  WV  |  -.1059315   .0105955   -10.00   0.000    -.1299002   -.0819628
                  KY  |    -.07921   .0047712   -16.60   0.000    -.0900031   -.0684169
                      |
                 year |
                1990  |  -.0053316   .0058958    -0.90   0.389     -.018669    .0080057
                1991  |  -.0333907    .009911    -3.37   0.008    -.0558109   -.0109704
                1992  |   -.025307    .010969    -2.31   0.046    -.0501208   -.0004933
                1993  |  -.0056817   .0144497    -0.39   0.703    -.0383693    .0270058
                1996  |   .0089199   .0091455     0.98   0.355    -.0117687    .0296084
                1997  |   .0169545   .0118374     1.43   0.186    -.0098236    .0437326
                1998  |   .0383713   .0092226     4.16   0.002     .0175083    .0592343
                1999  |    .044471   .0084226     5.28   0.001     .0254179    .0635242
                2000  |   .0348773   .0134268     2.60   0.029     .0045038    .0652508
                2001  |   .0352853   .0144054     2.45   0.037     .0026981    .0678725
                2002  |   .0435387   .0087064     5.00   0.001     .0238434     .063234
                2003  |   .0434777   .0126053     3.45   0.007     .0149624    .0719929
                2004  |   .0292325   .0094089     3.11   0.013     .0079481    .0505169
                2005  |   .0163385   .0131244     1.24   0.245     -.013351     .046028
                2006  |   .0182216   .0151417     1.20   0.260    -.0160314    .0524745
                2007  |   .0099303   .0173867     0.57   0.582    -.0294012    .0492618
                2008  |  -.0201767   .0187238    -1.08   0.309     -.062533    .0221796
                2009  |   .0014527   .0231707     0.06   0.951    -.0509631    .0538685
                2010  |   .0066694   .0189659     0.35   0.733    -.0362343    .0495732
                2011  |  -.0074304   .0203256    -0.37   0.723      -.05341    .0385493
                2012  |  -.0200855   .0189246    -1.06   0.316     -.062896     .022725
                2013  |   .0067285   .0194609     0.35   0.737    -.0372951    .0507521
                2014  |  -.0425646   .0190732    -2.23   0.053    -.0857112    .0005819
                2015  |  -.0277655   .0096719    -2.87   0.018    -.0496448   -.0058862
                2016  |  -.0042773   .0128147    -0.33   0.746    -.0332661    .0247114
                2017  |    -.00787   .0167368    -0.47   0.649    -.0457313    .0299912
                2018  |  -.0037727    .010429    -0.36   0.726    -.0273647    .0198192
                2019  |   .0005062   .0080118     0.06   0.951    -.0176178    .0186301
                      |
                 nind |
                   2  |  -.0738061   .0623097    -1.18   0.267    -.2147603    .0671481
                   3  |  -.0879317   .0440793    -1.99   0.077    -.1876461    .0117827
                   4  |  -.4240716   .0541072    -7.84   0.000    -.5464705   -.3016727
                   5  |  -.0144223   .0469967    -0.31   0.766    -.1207361    .0918916
                   6  |  -.2153584   .0467222    -4.61   0.001    -.3210515   -.1096654
                   7  |  -.2634963   .0427022    -6.17   0.000    -.3600953   -.1668973
                   8  |  -.3017182   .0447699    -6.74   0.000    -.4029949   -.2004415
                   9  |  -.3397299   .0443811    -7.65   0.000    -.4401268    -.239333
                  10  |  -.3623839   .0472035    -7.68   0.000    -.4691657    -.255602
                  11  |  -.1631917   .0407149    -4.01   0.003    -.2552952   -.0710883
                      |
                 educ |   .1067892    .004926    21.68   0.000     .0956458    .1179326
                exper |   .0476448    .002787    17.10   0.000     .0413402    .0539494
               exper2 |   -.001648   .0002216    -7.44   0.000    -.0021492   -.0011468
               exper3 |   .0000305   8.72e-06     3.50   0.007     .0000108    .0000502
               exper4 |  -2.32e-07   9.97e-08    -2.33   0.045    -4.57e-07   -6.45e-09
                 edex |  -.0003736   .0001644    -2.27   0.049    -.0007456   -1.70e-06
                      |
                ee_cl |
                   2  |  -.0904322   .0194533    -4.65   0.001    -.1344386   -.0464259
                   3  |  -.1354956   .0214147    -6.33   0.000    -.1839389   -.0870523
                   4  |  -.2048082   .0278942    -7.34   0.000    -.2679093   -.1417071
                   5  |  -.0792993   .0300952    -2.63   0.027    -.1473794   -.0112192
                   6  |  -.1160334   .0193249    -6.00   0.000    -.1597492   -.0723175
                   7  |  -.1658722   .0252197    -6.58   0.000    -.2229231   -.1088213
                   8  |  -.1977657    .032883    -6.01   0.000    -.2721522   -.1233791
                   9  |  -.0841319     .02487    -3.38   0.008    -.1403919    -.027872
                  10  |  -.1395786   .0316206    -4.41   0.002    -.2111095   -.0680477
                  11  |  -.1893207   .0293198    -6.46   0.000    -.2556466   -.1229948
                  12  |  -.1916173   .0350766    -5.46   0.000     -.270966   -.1122685
                  13  |  -.0107019   .0322933    -0.33   0.748    -.0837545    .0623507
                  14  |  -.1394808   .0275641    -5.06   0.001     -.201835   -.0771266
                  15  |     -.1604   .0353889    -4.53   0.001    -.2404552   -.0803447
                  16  |  -.1739073   .0369895    -4.70   0.001    -.2575833   -.0902313
                      |
                 marr |   .0070706   .0047545     1.49   0.171    -.0036849    .0178261
                partt |  -.0686623   .0129119    -5.32   0.000    -.0978711   -.0394536
               public |   .0491009    .010582     4.64   0.001     .0251628     .073039
                 cmsa |   .1175168   .0165529     7.10   0.000     .0800716     .154962
                      |
                nocc2 |
                   2  |  -.0143598   .0190651    -0.75   0.471     -.057488    .0287684
                   3  |   .0025206   .0363472     0.07   0.946    -.0797024    .0847436
                   4  |  -.0729494    .022755    -3.21   0.011    -.1244249   -.0214739
                   5  |   .1555522   .0283055     5.50   0.000     .0915206    .2195837
                   6  |  -.1914992   .0242819    -7.89   0.000    -.2464287   -.1365698
                   7  |  -.2188263   .0227703    -9.61   0.000    -.2703363   -.1673163
                   8  |   .0254822   .0640587     0.40   0.700    -.1194286     .170393
                   9  |  -.2432641   .0252734    -9.63   0.000    -.3004366   -.1860917
                  10  |  -.2299977    .035008    -6.57   0.000    -.3091914    -.150804
                  11  |   .0793115   .0281525     2.82   0.020     .0156262    .1429968
                  12  |  -.2042308   .0274859    -7.43   0.000    -.2664083   -.1420533
                      |
                unemp |   .0035896   .0032652     1.10   0.300    -.0037968     .010976
                      |
              quarter |
                   2  |   .0023402   .0055343     0.42   0.682    -.0101793    .0148597
                   3  |   .0083221    .002787     2.99   0.015     .0020174    .0146268
                   4  |   .0152842   .0030313     5.04   0.001      .008427    .0221414
                      |
                _cons |   .3223191   .0745323     4.32   0.002     .1537154    .4909229
---------------------------------------------------------------------------------------

. 
. eststo nwagstagdid_fem_rust 

. 
. ** RUST BELT ONLY HISP-WHITE + WV, KY - IA
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 e
> xper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 0, vce(cluster state) 
(sum of wgt is 2,172,953,323)

Linear regression                               Number of obs     =    203,949
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2207
                                                Root MSE          =     .34481

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |    .006019   .0062652     0.96   0.362    -.0081539    .0201918
            treat_st |  -.0156603   .0069049    -2.27   0.050    -.0312803   -.0000404
treat_sthisprelwhite |  -.0139454   .0068239    -2.04   0.071    -.0293821    .0014912
                     |
               state |
                 OH  |  -.0085504   .0005122   -16.69   0.000     -.009709   -.0073918
                 IN  |  -.0385115   .0029017   -13.27   0.000    -.0450757   -.0319474
                 IL  |   .0231785   .0015419    15.03   0.000     .0196906    .0266665
                 MI  |    .025521   .0023063    11.07   0.000     .0203038    .0307381
                 WI  |  -.0238736   .0029725    -8.03   0.000    -.0305978   -.0171493
                 MN  |   .0037672   .0021351     1.76   0.111    -.0010627    .0085972
                 MO  |  -.0243193   .0009031   -26.93   0.000    -.0263623   -.0222763
                 WV  |  -.0420509   .0077929    -5.40   0.000    -.0596797    -.024422
                 KY  |  -.0602149   .0030156   -19.97   0.000    -.0670366   -.0533931
                     |
                year |
               1997  |  -.0023821   .0060276    -0.40   0.702    -.0160175    .0112533
               1998  |  -.0131305   .0064546    -2.03   0.072    -.0277318    .0014708
               1999  |  -.0142545   .0086231    -1.65   0.133    -.0337614    .0052524
               2000  |  -.0199483   .0076438    -2.61   0.028    -.0372398   -.0026568
               2001  |   -.022103   .0079828    -2.77   0.022    -.0401613   -.0040447
               2002  |  -.0251247   .0079063    -3.18   0.011      -.04301   -.0072395
               2003  |  -.0325122   .0077916    -4.17   0.002    -.0501381   -.0148864
               2004  |  -.0335906   .0083583    -4.02   0.003    -.0524985   -.0146828
               2005  |  -.0490836    .008483    -5.79   0.000    -.0682735   -.0298938
               2006  |  -.0551246   .0101284    -5.44   0.000    -.0780366   -.0322125
               2007  |  -.0556269   .0089274    -6.23   0.000     -.075822   -.0354318
               2008  |  -.0467838   .0062101    -7.53   0.000     -.060832   -.0327357
               2009  |  -.0362933   .0058852    -6.17   0.000    -.0496067     -.02298
               2010  |  -.0431271   .0082701    -5.21   0.001    -.0618353   -.0244189
               2011  |  -.0458264   .0080888    -5.67   0.000    -.0641246   -.0275283
               2012  |  -.0538632   .0048506   -11.10   0.000    -.0648361   -.0428903
               2013  |  -.0548112    .006057    -9.05   0.000    -.0685131   -.0411092
               2014  |  -.0581587   .0077539    -7.50   0.000    -.0756992   -.0406181
               2015  |  -.0629093    .007042    -8.93   0.000    -.0788394   -.0469793
               2016  |  -.0648295   .0088299    -7.34   0.000    -.0848041   -.0448549
               2017  |  -.0544444   .0086998    -6.26   0.000    -.0741247   -.0347641
               2018  |  -.0536789   .0079737    -6.73   0.000    -.0717168   -.0356411
               2019  |  -.0627788   .0086265    -7.28   0.000    -.0822934   -.0432643
                     |
                nind |
                  2  |   .1673884   .0273671     6.12   0.000     .1054797    .2292971
                  3  |   .0950028    .013399     7.09   0.000     .0646921    .1253135
                  4  |   .0110616    .013703     0.81   0.440    -.0199366    .0420599
                  5  |   .1674158   .0182628     9.17   0.000     .1261025     .208729
                  6  |   .0064268   .0139229     0.46   0.655     -.025069    .0379225
                  7  |  -.0095984   .0143487    -0.67   0.520    -.0420574    .0228607
                  8  |   .0094087   .0177263     0.53   0.608    -.0306909    .0495084
                  9  |   .1448377   .0167337     8.66   0.000     .1069835    .1826919
                 10  |  -.0294022    .015014    -1.96   0.082    -.0633663    .0045618
                 11  |   .1259895   .0214285     5.88   0.000     .0775149     .174464
                     |
                educ |   .0153985    .002291     6.72   0.000      .010216     .020581
               exper |   .0088291   .0014063     6.28   0.000     .0056478    .0120104
              exper2 |  -.0001549   .0000733    -2.11   0.064    -.0003207    .0000109
              exper3 |   7.32e-06   3.15e-06     2.33   0.045     2.00e-07    .0000144
              exper4 |  -1.23e-07   4.14e-08    -2.98   0.015    -2.17e-07   -2.97e-08
                edex |  -.0003389   .0000578    -5.86   0.000    -.0004697   -.0002081
                     |
               ee_cl |
                  2  |  -.0380826     .00772    -4.93   0.001    -.0555463   -.0206188
                  3  |  -.0374411   .0081108    -4.62   0.001     -.055789   -.0190931
                  4  |  -.0584752   .0134525    -4.35   0.002    -.0889069   -.0280436
                  5  |  -.0766094   .0160181    -4.78   0.001    -.1128448    -.040374
                  6  |   -.020419    .007971    -2.56   0.031    -.0384507   -.0023873
                  7  |   .0016471   .0108788     0.15   0.883    -.0229625    .0262567
                  8  |  -.0627006   .0145429    -4.31   0.002    -.0955989   -.0298022
                  9  |  -.0685226   .0150709    -4.55   0.001    -.1026154   -.0344298
                 10  |    .004067   .0080344     0.51   0.625     -.014108    .0222421
                 11  |   .0048182   .0103338     0.47   0.652    -.0185585     .028195
                 12  |  -.0783955   .0126656    -6.19   0.000    -.1070472   -.0497439
                 13  |  -.0186346   .0120241    -1.55   0.156     -.045835    .0085658
                 14  |   .0180937   .0064994     2.78   0.021     .0033911    .0327963
                 15  |   .0046694   .0084552     0.55   0.594    -.0144576    .0237965
                 16  |  -.0912006   .0113437    -8.04   0.000    -.1168619   -.0655392
                     |
                marr |   .0181435      .0032     5.67   0.000     .0109045    .0253824
               partt |  -.0600626   .0051018   -11.77   0.000    -.0716036   -.0485216
              public |   .2922415   .0324658     9.00   0.000     .2187988    .3656842
                cmsa |   .0474481   .0107065     4.43   0.002     .0232284    .0716679
                     |
               nocc2 |
                  2  |   .0547206   .0031573    17.33   0.000     .0475782     .061863
                  3  |   .0293789    .002971     9.89   0.000     .0226579    .0360998
                  4  |   .1929184   .0079466    24.28   0.000     .1749418    .2108949
                  5  |   .1403383   .0089274    15.72   0.000     .1201431    .1605335
                  6  |   .1568043   .0065664    23.88   0.000       .14195    .1716585
                  7  |    .076903   .0036636    20.99   0.000     .0686153    .0851907
                  8  |   .0733323   .0077571     9.45   0.000     .0557845      .09088
                  9  |   .1790451   .0074486    24.04   0.000     .1621953     .195895
                 10  |   .2189943   .0091134    24.03   0.000     .1983783    .2396102
                 11  |   .2541422   .0112623    22.57   0.000     .2286651    .2796192
                 12  |   .2407356   .0115553    20.83   0.000     .2145957    .2668756
                     |
               unemp |  -.0027449   .0015937    -1.72   0.119      -.00635    .0008603
             citizen |  -.0152525   .0021647    -7.05   0.000    -.0201494   -.0103556
                     |
             quarter |
                  2  |  -.0051674   .0027591    -1.87   0.094    -.0114089    .0010742
                  3  |  -.0025463    .003551    -0.72   0.492    -.0105792    .0054867
                  4  |   -.004353   .0018663    -2.33   0.045    -.0085748   -.0001311
                     |
               _cons |   -.260443   .0296241    -8.79   0.000    -.3274574   -.1934286
--------------------------------------------------------------------------------------

.         
. reg covered hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 e
> xper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 1, vce(cluster state)
(sum of wgt is 2,090,926,237)

Linear regression                               Number of obs     =    201,884
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2922
                                                Root MSE          =     .28994

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
             covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |    .020188   .0033971     5.94   0.000     .0125032    .0278729
            treat_st |  -.0193027    .012651    -1.53   0.161    -.0479211    .0093158
treat_sthisprelwhite |  -.0095314   .0102091    -0.93   0.375    -.0326259    .0135631
                     |
               state |
                 OH  |  -.0100391   .0007803   -12.87   0.000    -.0118044   -.0082739
                 IN  |  -.0553554   .0039075   -14.17   0.000    -.0641948   -.0465159
                 IL  |  -.0093949   .0015184    -6.19   0.000    -.0128297   -.0059601
                 MI  |   .0319368    .003067    10.41   0.000     .0249987    .0388748
                 WI  |  -.0143472   .0036478    -3.93   0.003     -.022599   -.0060954
                 MN  |   .0275346   .0032065     8.59   0.000     .0202809    .0347882
                 MO  |  -.0576543   .0008413   -68.53   0.000    -.0595574   -.0557511
                 WV  |  -.0410502   .0055897    -7.34   0.000    -.0536949   -.0284055
                 KY  |  -.0685444   .0029795   -23.01   0.000    -.0752844   -.0618044
                     |
                year |
               1997  |  -.0021523   .0036201    -0.59   0.567    -.0103416     .006037
               1998  |  -.0065218   .0063715    -1.02   0.333    -.0209351    .0078916
               1999  |  -.0116019   .0037943    -3.06   0.014    -.0201852   -.0030187
               2000  |  -.0070165   .0045317    -1.55   0.156     -.017268     .003235
               2001  |  -.0056619   .0045523    -1.24   0.245    -.0159598     .004636
               2002  |  -.0119038   .0041766    -2.85   0.019     -.021352   -.0024557
               2003  |  -.0187677   .0052197    -3.60   0.006    -.0305756   -.0069598
               2004  |  -.0201573   .0025758    -7.83   0.000    -.0259842   -.0143304
               2005  |  -.0234376   .0035932    -6.52   0.000     -.031566   -.0153091
               2006  |  -.0255532   .0030159    -8.47   0.000    -.0323756   -.0187309
               2007  |  -.0280892   .0040411    -6.95   0.000    -.0372307   -.0189477
               2008  |  -.0239623   .0052706    -4.55   0.001    -.0358853   -.0120394
               2009  |  -.0253642   .0115528    -2.20   0.056    -.0514984      .00077
               2010  |  -.0310571   .0130131    -2.39   0.041    -.0604948   -.0016195
               2011  |  -.0220186   .0101157    -2.18   0.057    -.0449019    .0008646
               2012  |   -.031558   .0067593    -4.67   0.001    -.0468486   -.0162675
               2013  |  -.0304861    .004509    -6.76   0.000    -.0406861    -.020286
               2014  |  -.0323817   .0043842    -7.39   0.000    -.0422994   -.0224641
               2015  |  -.0328796   .0060051    -5.48   0.000    -.0464641   -.0192951
               2016  |  -.0351048   .0048586    -7.23   0.000    -.0460959   -.0241138
               2017  |  -.0384508   .0036179   -10.63   0.000    -.0466352   -.0302665
               2018  |  -.0370958   .0063123    -5.88   0.000    -.0513752   -.0228164
               2019  |  -.0395451   .0048004    -8.24   0.000    -.0504044   -.0286858
                     |
                nind |
                  2  |   .0680922   .0135925     5.01   0.001     .0373437    .0988406
                  3  |   .0650748    .005445    11.95   0.000     .0527573    .0773922
                  4  |   .0521011   .0076168     6.84   0.000     .0348707    .0693316
                  5  |   .1625366   .0165975     9.79   0.000     .1249905    .2000826
                  6  |   .0338775   .0099432     3.41   0.008     .0113845    .0563704
                  7  |   .0187369   .0085045     2.20   0.055    -.0005016    .0379753
                  8  |   .0273312      .0094     2.91   0.017     .0060669    .0485956
                  9  |   .1868896   .0169641    11.02   0.000     .1485142    .2252651
                 10  |    .006288   .0090002     0.70   0.502    -.0140718    .0266477
                 11  |   .0177214   .0310749     0.57   0.582    -.0525749    .0880176
                     |
                educ |   .0205204   .0026233     7.82   0.000     .0145861    .0264547
               exper |   .0114115   .0027139     4.20   0.002     .0052722    .0175508
              exper2 |  -.0004125   .0001913    -2.16   0.059    -.0008454    .0000204
              exper3 |   9.30e-06   6.62e-06     1.40   0.194    -5.69e-06    .0000243
              exper4 |  -7.93e-08   7.36e-08    -1.08   0.309    -2.46e-07    8.71e-08
                edex |  -.0002646   .0000959    -2.76   0.022    -.0004815   -.0000478
                     |
               ee_cl |
                  2  |  -.0462449   .0064912    -7.12   0.000    -.0609289   -.0315608
                  3  |  -.0827422   .0069065   -11.98   0.000    -.0983658   -.0671185
                  4  |  -.1211613   .0125953    -9.62   0.000    -.1496539   -.0926688
                  5  |  -.0452237    .006965    -6.49   0.000    -.0609795   -.0294679
                  6  |  -.0587043   .0051887   -11.31   0.000     -.070442   -.0469666
                  7  |  -.0791623   .0085473    -9.26   0.000    -.0984977   -.0598269
                  8  |   -.110774   .0132835    -8.34   0.000    -.1408235   -.0807246
                  9  |  -.0447466   .0160822    -2.78   0.021    -.0811271    -.008366
                 10  |  -.0557366   .0081464    -6.84   0.000    -.0741651   -.0373081
                 11  |  -.0702636   .0103163    -6.81   0.000    -.0936006   -.0469267
                 12  |  -.0936244   .0138569    -6.76   0.000    -.1249708   -.0622779
                 13  |   .0037586   .0104868     0.36   0.728    -.0199641    .0274813
                 14  |  -.0346559   .0109823    -3.16   0.012    -.0594996   -.0098121
                 15  |  -.0594925   .0130518    -4.56   0.001    -.0890177   -.0299672
                 16  |  -.0854601   .0187691    -4.55   0.001    -.1279187   -.0430015
                     |
                marr |  -.0027054   .0018006    -1.50   0.167    -.0067788    .0013679
               partt |   -.060322   .0051296   -11.76   0.000    -.0719259   -.0487181
              public |   .3137915   .0286074    10.97   0.000     .2490771     .378506
                cmsa |   .0200759   .0038462     5.22   0.001     .0113753    .0287766
                     |
               nocc2 |
                  2  |   .0184769   .0026868     6.88   0.000     .0123989     .024555
                  3  |   .0280273   .0059891     4.68   0.001     .0144791    .0415756
                  4  |   .1728011    .005722    30.20   0.000     .1598571     .185745
                  5  |   .1409578   .0160354     8.79   0.000     .1046831    .1772325
                  6  |   .0680964   .0038433    17.72   0.000     .0594023    .0767906
                  7  |   .0946707   .0058278    16.24   0.000     .0814874     .107854
                  8  |   .0647149   .0058102    11.14   0.000     .0515713    .0778585
                  9  |   .1131198   .0077901    14.52   0.000     .0954975    .1307422
                 10  |   .1999096   .0093012    21.49   0.000     .1788689    .2209502
                 11  |   .2305804   .0138088    16.70   0.000     .1993428     .261818
                 12  |   .2036629   .0188605    10.80   0.000     .1609974    .2463283
                     |
               unemp |   .0004524   .0019291     0.23   0.820    -.0039115    .0048164
             citizen |  -.0097625   .0013523    -7.22   0.000    -.0128216   -.0067035
                     |
             quarter |
                  2  |  -.0024652   .0027642    -0.89   0.396    -.0087182    .0037878
                  3  |  -.0020973   .0016761    -1.25   0.242    -.0058888    .0016943
                  4  |  -.0020437   .0032427    -0.63   0.544    -.0093791    .0052916
                     |
               _cons |  -.2863811   .0411225    -6.96   0.000    -.3794067   -.1933554
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 0, vce(cluster state) 
(sum of wgt is 2,172,953,323)

Linear regression                               Number of obs     =    203,949
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5245
                                                Root MSE          =     .39677

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0883229   .0039625   -22.29   0.000    -.0972868   -.0793591
            treat_st |  -.0306094   .0152316    -2.01   0.075    -.0650657    .0038468
treat_sthisprelwhite |   .0075487   .0170971     0.44   0.669    -.0311276     .046225
                     |
               state |
                 OH  |  -.0296612   .0017118   -17.33   0.000    -.0335337   -.0257888
                 IN  |  -.0124353   .0053681    -2.32   0.046    -.0245787   -.0002918
                 IL  |   .0802498    .002798    28.68   0.000     .0739203    .0865793
                 MI  |   .0298934   .0063448     4.71   0.001     .0155404    .0442464
                 WI  |   .0121558   .0045965     2.64   0.027     .0017579    .0225537
                 MN  |   .0565418   .0053261    10.62   0.000     .0444933    .0685904
                 MO  |  -.0323368   .0005142   -62.89   0.000    -.0334999   -.0311737
                 WV  |  -.0703913   .0104265    -6.75   0.000    -.0939776    -.046805
                 KY  |  -.0581428   .0061437    -9.46   0.000    -.0720407   -.0442448
                     |
                year |
               1997  |   .0065748   .0082355     0.80   0.445    -.0120552    .0252049
               1998  |   .0210537   .0096933     2.17   0.058    -.0008742    .0429815
               1999  |   .0447429   .0141998     3.15   0.012     .0126208     .076865
               2000  |   .0549238   .0148168     3.71   0.005     .0214059    .0884416
               2001  |   .0734246     .01328     5.53   0.000     .0433832     .103466
               2002  |   .0820782   .0095207     8.62   0.000     .0605408    .1036155
               2003  |   .0738384   .0120806     6.11   0.000     .0465102    .1011667
               2004  |   .0636667   .0111954     5.69   0.000     .0383409    .0889925
               2005  |   .0437711   .0123655     3.54   0.006     .0157984    .0717437
               2006  |   .0244743   .0114896     2.13   0.062    -.0015169    .0504656
               2007  |   .0196739   .0140867     1.40   0.196    -.0121924    .0515401
               2008  |   .0131594   .0120018     1.10   0.301    -.0139905    .0403093
               2009  |   .0721684   .0179466     4.02   0.003     .0315705    .1127664
               2010  |   .0570334   .0189835     3.00   0.015     .0140898     .099977
               2011  |   .0304139   .0166983     1.82   0.102    -.0073603     .068188
               2012  |   .0260156   .0170311     1.53   0.161    -.0125114    .0645427
               2013  |   .0220412   .0167879     1.31   0.222    -.0159356     .060018
               2014  |   .0135061   .0138219     0.98   0.354    -.0177613    .0447735
               2015  |   .0182534   .0156117     1.17   0.272    -.0170628    .0535696
               2016  |   .0260496   .0159048     1.64   0.136    -.0099295    .0620287
               2017  |   .0289667    .013291     2.18   0.057    -.0010996     .059033
               2018  |   .0354429   .0183727     1.93   0.086    -.0061191     .077005
               2019  |   .0567357   .0169257     3.35   0.008     .0184471    .0950242
                     |
                nind |
                  2  |   .1242239   .0421092     2.95   0.016     .0289663    .2194816
                  3  |   .1034527   .0367138     2.82   0.020     .0204003    .1865051
                  4  |  -.0893138   .0385735    -2.32   0.046     -.176573   -.0020545
                  5  |   .1298641   .0357268     3.63   0.005     .0490445    .2106837
                  6  |   .0974234   .0386852     2.52   0.033     .0099113    .1849354
                  7  |    .000328   .0393827     0.01   0.994    -.0887618    .0894178
                  8  |  -.0371104   .0383144    -0.97   0.358    -.1237835    .0495627
                  9  |  -.0455419   .0360862    -1.26   0.239    -.1271745    .0360907
                 10  |  -.1097796    .038967    -2.82   0.020    -.1979291     -.02163
                 11  |   .1142669   .0385665     2.96   0.016     .0270234    .2015103
                     |
                educ |   .0668083   .0019011    35.14   0.000     .0625077    .0711089
               exper |   .0429876   .0036856    11.66   0.000     .0346502    .0513249
              exper2 |  -.0008322   .0001917    -4.34   0.002    -.0012658   -.0003986
              exper3 |   4.20e-06   4.79e-06     0.88   0.404    -6.63e-06     .000015
              exper4 |   1.50e-08   4.29e-08     0.35   0.735    -8.21e-08    1.12e-07
                edex |  -.0005025   .0001026    -4.90   0.001    -.0007346   -.0002704
                     |
               ee_cl |
                  2  |  -.0611319   .0054675   -11.18   0.000    -.0735002   -.0487635
                  3  |  -.0751661   .0057903   -12.98   0.000    -.0882647   -.0620674
                  4  |  -.0315382   .0114207    -2.76   0.022    -.0573735   -.0057028
                  5  |  -.1201238   .0130132    -9.23   0.000    -.1495618   -.0906858
                  6  |  -.0946492   .0099439    -9.52   0.000    -.1171439   -.0721544
                  7  |  -.0618315   .0078947    -7.83   0.000    -.0796905   -.0439725
                  8  |   .0396203   .0136626     2.90   0.018     .0087132    .0705273
                  9  |  -.1444876   .0204556    -7.06   0.000    -.1907614   -.0982138
                 10  |  -.1050942   .0104692   -10.04   0.000    -.1287772   -.0814111
                 11  |  -.0575169   .0120409    -4.78   0.001    -.0847552   -.0302785
                 12  |   .0449634   .0143735     3.13   0.012     .0124482    .0774786
                 13  |  -.0901929   .0167743    -5.38   0.000     -.128139   -.0522468
                 14  |  -.0811208   .0116768    -6.95   0.000    -.1075356    -.054706
                 15  |  -.0479931   .0126522    -3.79   0.004    -.0766143   -.0193719
                 16  |   .0263149   .0150486     1.75   0.114    -.0077273    .0603571
                     |
                marr |   .1286152   .0025702    50.04   0.000      .122801    .1344293
               partt |  -.2178996   .0071552   -30.45   0.000    -.2340857   -.2017135
              public |   .0183977    .011223     1.64   0.136    -.0069905    .0437858
                cmsa |   .1425172   .0182221     7.82   0.000      .101296    .1837384
                     |
               nocc2 |
                  2  |  -.1530481   .0071856   -21.30   0.000    -.1693031   -.1367931
                  3  |  -.0470189   .0070275    -6.69   0.000    -.0629163   -.0311216
                  4  |  -.3179698   .0165598   -19.20   0.000    -.3554307   -.2805088
                  5  |  -.0744969   .0112566    -6.62   0.000    -.0999611   -.0490327
                  6  |  -.3802828   .0123735   -30.73   0.000    -.4082735    -.352292
                  7  |  -.2227531    .009615   -23.17   0.000    -.2445037   -.2010026
                  8  |  -.1260691    .015901    -7.93   0.000    -.1620398   -.0900984
                  9  |  -.3883505   .0094477   -41.11   0.000    -.4097227   -.3669783
                 10  |  -.3352603   .0095501   -35.11   0.000     -.356864   -.3136565
                 11  |  -.2091579    .009212   -22.70   0.000    -.2299969   -.1883188
                 12  |  -.3802907   .0134452   -28.28   0.000     -.410706   -.3498755
                     |
               unemp |  -.0101043   .0039661    -2.55   0.031    -.0190763   -.0011324
             citizen |  -.0365433   .0071974    -5.08   0.001     -.052825   -.0202616
                     |
             quarter |
                  2  |  -.0017844   .0041597    -0.43   0.678    -.0111943    .0076254
                  3  |  -.0036116   .0034789    -1.04   0.326    -.0114815    .0042583
                  4  |   .0080927    .002944     2.75   0.023     .0014329    .0147525
                     |
               _cons |    .754741   .0554238    13.62   0.000     .6293636    .8801184
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 1, vce(cluster state)
(sum of wgt is 2,090,926,237)

Linear regression                               Number of obs     =    201,884
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5078
                                                Root MSE          =     .38046

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0491656   .0054849    -8.96   0.000    -.0615733    -.036758
            treat_st |  -.0320009   .0063383    -5.05   0.001    -.0463391   -.0176626
treat_sthisprelwhite |   .0190199    .024179     0.79   0.452    -.0356769    .0737166
                     |
               state |
                 OH  |  -.0278318   .0012837   -21.68   0.000    -.0307357   -.0249279
                 IN  |  -.0239386   .0038739    -6.18   0.000    -.0327019   -.0151753
                 IL  |   .0440081   .0019629    22.42   0.000     .0395676    .0484485
                 MI  |   .0143142   .0040111     3.57   0.006     .0052405    .0233878
                 WI  |   .0343506   .0045804     7.50   0.000     .0239891    .0447122
                 MN  |   .0933865   .0049162    19.00   0.000     .0822652    .1045078
                 MO  |  -.0464396    .000949   -48.93   0.000    -.0485865   -.0442928
                 WV  |   -.124905   .0085325   -14.64   0.000    -.1442069   -.1056031
                 KY  |  -.0544025   .0042935   -12.67   0.000     -.064115     -.04469
                     |
                year |
               1997  |   .0119704   .0046678     2.56   0.030     .0014111    .0225296
               1998  |   .0434164   .0059346     7.32   0.000     .0299915    .0568413
               1999  |   .0600489   .0055728    10.78   0.000     .0474423    .0726556
               2000  |    .072464   .0073138     9.91   0.000      .055919    .0890091
               2001  |   .0856918   .0043649    19.63   0.000     .0758177    .0955659
               2002  |    .095708   .0074423    12.86   0.000     .0788724    .1125436
               2003  |   .1002102   .0056061    17.88   0.000     .0875283    .1128922
               2004  |   .0871202   .0062028    14.05   0.000     .0730884     .101152
               2005  |   .0793755   .0051986    15.27   0.000     .0676155    .0911355
               2006  |   .0662174   .0037004    17.89   0.000     .0578466    .0745883
               2007  |   .0577763   .0073887     7.82   0.000     .0410619    .0744907
               2008  |   .0503439   .0065488     7.69   0.000     .0355294    .0651584
               2009  |   .0708911   .0153555     4.62   0.001     .0361544    .1056277
               2010  |   .0650069    .016615     3.91   0.004     .0274211    .1025927
               2011  |   .0508984   .0118144     4.31   0.002     .0241723    .0776245
               2012  |   .0395178   .0090315     4.38   0.002      .019087    .0599485
               2013  |   .0416688   .0085852     4.85   0.001     .0222478    .0610897
               2014  |   .0433954    .005214     8.32   0.000     .0316005    .0551902
               2015  |    .049878   .0048105    10.37   0.000     .0389958    .0607601
               2016  |   .0626829     .00763     8.22   0.000     .0454227    .0799431
               2017  |   .0747933   .0057816    12.94   0.000     .0617145     .087872
               2018  |   .0843697   .0097376     8.66   0.000     .0623416    .1063978
               2019  |   .0918182   .0060183    15.26   0.000     .0782038    .1054325
                     |
                nind |
                  2  |   .1092444   .0182171     6.00   0.000     .0680346    .1504543
                  3  |    .168124   .0146987    11.44   0.000     .1348732    .2013747
                  4  |  -.0630523   .0189621    -3.33   0.009    -.1059476    -.020157
                  5  |   .1606221   .0148227    10.84   0.000     .1270908    .1941534
                  6  |   .1093884   .0168818     6.48   0.000      .071199    .1475778
                  7  |   .0507767   .0204848     2.48   0.035     .0044368    .0971166
                  8  |   .0211148   .0194451     1.09   0.306     -.022873    .0651026
                  9  |  -.0338077   .0158544    -2.13   0.062    -.0696729    .0020574
                 10  |  -.0477889   .0130507    -3.66   0.005    -.0773116   -.0182663
                 11  |   .0853816   .0203928     4.19   0.002     .0392498    .1315134
                     |
                educ |   .0985924   .0024232    40.69   0.000     .0931108     .104074
               exper |    .045473   .0028218    16.11   0.000     .0390896    .0518563
              exper2 |  -.0013561   .0001996    -6.79   0.000    -.0018076   -.0009045
              exper3 |   .0000189   6.28e-06     3.01   0.015     4.70e-06    .0000331
              exper4 |  -8.08e-08   6.37e-08    -1.27   0.236    -2.25e-07    6.32e-08
                edex |  -.0006103   .0001442    -4.23   0.002    -.0009364   -.0002842
                     |
               ee_cl |
                  2  |  -.1420487   .0097277   -14.60   0.000    -.1640543    -.120043
                  3  |  -.1935043   .0068907   -28.08   0.000    -.2090922   -.1779165
                  4  |  -.2177297   .0177742   -12.25   0.000    -.2579377   -.1775216
                  5  |   -.136571   .0214979    -6.35   0.000    -.1852026   -.0879394
                  6  |  -.1871417   .0121523   -15.40   0.000    -.2146321   -.1596512
                  7  |   -.204224   .0126818   -16.10   0.000    -.2329122   -.1755359
                  8  |  -.1470565   .0168207    -8.74   0.000    -.1851077   -.1090053
                  9  |  -.1573022     .02879    -5.46   0.000    -.2224296   -.0921748
                 10  |  -.1935211   .0165353   -11.70   0.000    -.2309265   -.1561157
                 11  |  -.1991723    .014451   -13.78   0.000    -.2318628   -.1664817
                 12  |    -.15184   .0205228    -7.40   0.000    -.1982657   -.1054142
                 13  |  -.0990399   .0236021    -4.20   0.002    -.1524315   -.0456482
                 14  |  -.1662841   .0169199    -9.83   0.000    -.2045596   -.1280087
                 15  |  -.1593356   .0187988    -8.48   0.000    -.2018614   -.1168098
                 16  |  -.1526996   .0221821    -6.88   0.000    -.2028791   -.1025201
                     |
                marr |   .0454901   .0029454    15.44   0.000     .0388271     .052153
               partt |  -.1459134   .0038032   -38.37   0.000    -.1545168     -.13731
              public |   .0699547   .0071013     9.85   0.000     .0538904    .0860189
                cmsa |   .1540578   .0163403     9.43   0.000     .1170935    .1910222
                     |
               nocc2 |
                  2  |  -.1450908   .0088391   -16.41   0.000    -.1650863   -.1250953
                  3  |  -.0506682   .0144753    -3.50   0.007    -.0834136   -.0179227
                  4  |  -.3108319   .0071096   -43.72   0.000     -.326915   -.2947488
                  5  |   .0508476   .0110498     4.60   0.001     .0258512     .075844
                  6  |    -.33673   .0096143   -35.02   0.000     -.358479    -.314981
                  7  |  -.3534177   .0097177   -36.37   0.000    -.3754007   -.3314346
                  8  |  -.1737427   .0125459   -13.85   0.000    -.2021235   -.1453619
                  9  |  -.3978532    .008172   -48.68   0.000    -.4163396   -.3793668
                 10  |  -.4125655   .0204841   -20.14   0.000    -.4589038   -.3662271
                 11  |  -.1504542   .0148934   -10.10   0.000    -.1841454   -.1167629
                 12  |  -.3848786   .0156171   -24.64   0.000     -.420207   -.3495501
                     |
               unemp |   .0005443    .003093     0.18   0.864    -.0064526    .0075411
             citizen |  -.0240019   .0041679    -5.76   0.000    -.0334303   -.0145734
                     |
             quarter |
                  2  |   .0036268   .0039956     0.91   0.388     -.005412    .0126655
                  3  |   .0097046   .0031159     3.11   0.012     .0026559    .0167534
                  4  |   .0187062   .0017494    10.69   0.000     .0147488    .0226636
                     |
               _cons |    .249125   .0508351     4.90   0.001      .134128     .364122
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 0 & covered == 0, vce(cluster state)
(sum of wgt is 1,764,965,443)

Linear regression                               Number of obs     =    165,048
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5590
                                                Root MSE          =     .39788

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0962678   .0045558   -21.13   0.000    -.1065738   -.0859619
            treat_st |  -.0225226   .0119846    -1.88   0.093    -.0496337    .0045886
treat_sthisprelwhite |   .0102466   .0188898     0.54   0.601    -.0324851    .0529782
                     |
               state |
                 OH  |  -.0333589   .0019554   -17.06   0.000    -.0377824   -.0289355
                 IN  |  -.0107217   .0048048    -2.23   0.053     -.021591    .0001476
                 IL  |   .0641145   .0027891    22.99   0.000      .057805     .070424
                 MI  |   .0138624   .0061184     2.27   0.050     .0000216    .0277032
                 WI  |   .0143045   .0045771     3.13   0.012     .0039503    .0246587
                 MN  |   .0575228   .0056971    10.10   0.000     .0446352    .0704105
                 MO  |   -.038316   .0011304   -33.89   0.000    -.0408732   -.0357587
                 WV  |  -.0700041     .01001    -6.99   0.000    -.0926483   -.0473599
                 KY  |  -.0480908   .0059065    -8.14   0.000    -.0614523   -.0347294
                     |
                year |
               1997  |   .0103285   .0088407     1.17   0.273    -.0096705    .0303276
               1998  |   .0310925   .0093853     3.31   0.009     .0098614    .0523235
               1999  |   .0572348   .0132005     4.34   0.002     .0273733    .0870964
               2000  |   .0695436   .0150899     4.61   0.001     .0354078    .1036794
               2001  |   .0936362   .0135544     6.91   0.000      .062974    .1242984
               2002  |   .0968129   .0104892     9.23   0.000     .0730847    .1205411
               2003  |   .0884062   .0120197     7.36   0.000     .0612158    .1155966
               2004  |   .0789086   .0115212     6.85   0.000      .052846    .1049713
               2005  |   .0615745   .0127366     4.83   0.001     .0327622    .0903868
               2006  |   .0402957   .0114786     3.51   0.007     .0143293    .0662621
               2007  |   .0391755   .0127724     3.07   0.013     .0102824    .0680687
               2008  |   .0285259    .012071     2.36   0.042     .0012193    .0558324
               2009  |   .0840351   .0230191     3.65   0.005     .0319622     .136108
               2010  |   .0672215   .0243642     2.76   0.022     .0121059    .1223371
               2011  |   .0402755   .0190181     2.12   0.063    -.0027463    .0832974
               2012  |   .0391092   .0196926     1.99   0.078    -.0054385    .0836569
               2013  |   .0371688   .0165424     2.25   0.051    -.0002528    .0745904
               2014  |    .031466   .0118592     2.65   0.026     .0046387    .0582933
               2015  |   .0387815    .013935     2.78   0.021     .0072583    .0703046
               2016  |   .0469875   .0160404     2.93   0.017     .0107015    .0832736
               2017  |   .0457321   .0127622     3.58   0.006      .016862    .0746022
               2018  |   .0548789   .0179809     3.05   0.014     .0142032    .0955546
               2019  |   .0802939   .0154065     5.21   0.001      .045442    .1151458
                     |
                nind |
                  2  |    .060143    .039146     1.54   0.159    -.0284114    .1486975
                  3  |   .1061237   .0354875     2.99   0.015     .0258454     .186402
                  4  |  -.0715237   .0376383    -1.90   0.090    -.1566675    .0136201
                  5  |   .0862088   .0339988     2.54   0.032     .0092981    .1631195
                  6  |   .1051146   .0362459     2.90   0.018     .0231208    .1871085
                  7  |   .0134017   .0380121     0.35   0.733    -.0725876     .099391
                  8  |   -.021074   .0373732    -0.56   0.587    -.1056179      .06347
                  9  |  -.0602963   .0325999    -1.85   0.097    -.1340425    .0134499
                 10  |  -.0942224   .0371606    -2.54   0.032    -.1782855   -.0101592
                 11  |   .0680465   .0356096     1.91   0.088    -.0125079    .1486009
                     |
                educ |   .0609635   .0022337    27.29   0.000     .0559105    .0660165
               exper |    .036508   .0034833    10.48   0.000     .0286283    .0443877
              exper2 |  -.0004806   .0001664    -2.89   0.018    -.0008572   -.0001041
              exper3 |  -7.98e-06   4.32e-06    -1.85   0.098    -.0000178    1.80e-06
              exper4 |   1.54e-07   4.46e-08     3.45   0.007     5.30e-08    2.55e-07
                edex |  -.0003633   .0001098    -3.31   0.009    -.0006117   -.0001149
                     |
               ee_cl |
                  2  |  -.0577872   .0061729    -9.36   0.000    -.0717512   -.0438232
                  3  |   -.073025   .0069412   -10.52   0.000     -.088727    -.057323
                  4  |  -.0129631   .0111726    -1.16   0.276    -.0382373    .0123111
                  5  |  -.1089925    .012194    -8.94   0.000    -.1365773   -.0814077
                  6  |  -.1023045   .0133439    -7.67   0.000    -.1324904   -.0721185
                  7  |   -.072898   .0106409    -6.85   0.000    -.0969695   -.0488265
                  8  |    .068545   .0132451     5.18   0.001     .0385825    .0985075
                  9  |  -.1468837   .0121511   -12.09   0.000    -.1743714    -.119396
                 10  |  -.1162354    .013252    -8.77   0.000    -.1462134   -.0862574
                 11  |  -.0621925   .0102787    -6.05   0.000    -.0854446   -.0389403
                 12  |   .0751795    .012418     6.05   0.000      .047088    .1032711
                 13  |  -.0924643   .0125995    -7.34   0.000    -.1209664   -.0639621
                 14  |  -.0830904   .0125485    -6.62   0.000     -.111477   -.0547038
                 15  |  -.0362332   .0109264    -3.32   0.009    -.0609503   -.0115161
                 16  |   .0643062   .0130172     4.94   0.001     .0348592    .0937533
                     |
                marr |   .1347638    .003311    40.70   0.000     .1272739    .1422538
               partt |  -.2138539   .0061275   -34.90   0.000    -.2277153   -.1999925
              public |  -.0040586   .0099413    -0.41   0.693    -.0265474    .0184302
                cmsa |    .136045   .0163691     8.31   0.000     .0990156    .1730745
                     |
               nocc2 |
                  2  |   -.162639   .0066162   -24.58   0.000    -.1776058   -.1476722
                  3  |  -.0497222   .0073596    -6.76   0.000    -.0663708   -.0330736
                  4  |  -.3629002   .0164533   -22.06   0.000    -.4001201   -.3256802
                  5  |  -.0867094   .0112564    -7.70   0.000    -.1121731   -.0612457
                  6  |  -.4064885   .0103663   -39.21   0.000    -.4299386   -.3830384
                  7  |   -.237296    .009191   -25.82   0.000    -.2580875   -.2165044
                  8  |  -.1327759   .0132726   -10.00   0.000    -.1628006   -.1027511
                  9  |  -.4316002   .0095888   -45.01   0.000    -.4532915   -.4099089
                 10  |  -.3820266   .0090914   -42.02   0.000    -.4025928   -.3614604
                 11  |  -.2700968   .0096998   -27.85   0.000    -.2920392   -.2481544
                 12  |  -.4342857   .0127825   -33.98   0.000    -.4632017   -.4053697
                     |
               unemp |  -.0085056   .0042893    -1.98   0.079    -.0182088    .0011976
             citizen |  -.0311073   .0055755    -5.58   0.000      -.04372   -.0184946
                     |
             quarter |
                  2  |  -.0011807   .0038272    -0.31   0.765    -.0098384     .007477
                  3  |  -.0046807   .0033377    -1.40   0.194    -.0122312    .0028698
                  4  |   .0078179   .0035444     2.21   0.055    -.0002002     .015836
                     |
               _cons |   .8329248    .057581    14.47   0.000     .7026677     .963182
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 1 & covered == 0, vce(cluster state)
(sum of wgt is 1,803,064,129)

Linear regression                               Number of obs     =    173,406
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5133
                                                Root MSE          =     .38071

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0590945   .0088601    -6.67   0.000    -.0791373   -.0390516
            treat_st |  -.0278963    .005263    -5.30   0.000    -.0398019   -.0159907
treat_sthisprelwhite |   .0233567   .0263561     0.89   0.399    -.0362649    .0829782
                     |
               state |
                 OH  |  -.0244259   .0013262   -18.42   0.000    -.0274259   -.0214259
                 IN  |  -.0129187   .0037755    -3.42   0.008    -.0214595   -.0043779
                 IL  |    .054614   .0018764    29.11   0.000     .0503693    .0588587
                 MI  |   .0060942    .003851     1.58   0.148    -.0026175    .0148058
                 WI  |   .0432398   .0046754     9.25   0.000     .0326632    .0538163
                 MN  |   .1012058   .0046688    21.68   0.000     .0906442    .1117674
                 MO  |  -.0297394   .0012338   -24.10   0.000    -.0325304   -.0269485
                 WV  |  -.1177978   .0086185   -13.67   0.000    -.1372941   -.0983014
                 KY  |  -.0362028   .0044839    -8.07   0.000    -.0463462   -.0260595
                     |
                year |
               1997  |   .0122382   .0056056     2.18   0.057    -.0004425    .0249189
               1998  |   .0476918   .0065497     7.28   0.000     .0328753    .0625083
               1999  |   .0677743   .0064844    10.45   0.000     .0531055    .0824431
               2000  |   .0829728   .0072668    11.42   0.000     .0665342    .0994115
               2001  |   .0963823   .0062933    15.31   0.000     .0821458    .1106188
               2002  |   .1060596   .0075958    13.96   0.000     .0888768    .1232425
               2003  |   .1127167   .0052415    21.50   0.000     .1008597    .1245738
               2004  |   .1012943   .0078656    12.88   0.000      .083501    .1190876
               2005  |   .0939068   .0039995    23.48   0.000     .0848592    .1029544
               2006  |   .0780832    .003886    20.09   0.000     .0692924    .0868741
               2007  |   .0708115   .0062113    11.40   0.000     .0567605    .0848625
               2008  |   .0658472    .006067    10.85   0.000     .0521227    .0795718
               2009  |   .0853159   .0146158     5.84   0.000     .0522528    .1183791
               2010  |   .0791557   .0182591     4.34   0.002     .0378509    .1204605
               2011  |   .0644822   .0116296     5.54   0.000     .0381742    .0907902
               2012  |    .054038   .0081773     6.61   0.000     .0355397    .0725363
               2013  |   .0555512   .0085075     6.53   0.000      .036306    .0747965
               2014  |   .0645911   .0070969     9.10   0.000     .0485369    .0806453
               2015  |   .0700777   .0044865    15.62   0.000     .0599286    .0802269
               2016  |   .0805153   .0074974    10.74   0.000      .063555    .0974757
               2017  |   .0955371   .0051722    18.47   0.000     .0838368    .1072374
               2018  |   .1071898   .0083329    12.86   0.000     .0883394    .1260402
               2019  |   .1141826   .0078643    14.52   0.000     .0963924    .1319728
                     |
                nind |
                  2  |   .0979806   .0151222     6.48   0.000     .0637719    .1321893
                  3  |   .1652802   .0136228    12.13   0.000     .1344634    .1960971
                  4  |  -.0558208   .0183436    -3.04   0.014    -.0973169   -.0143247
                  5  |   .1204614     .01519     7.93   0.000     .0860992    .1548236
                  6  |   .1115159   .0153098     7.28   0.000     .0768828    .1461491
                  7  |   .0585406   .0189567     3.09   0.013     .0156575    .1014236
                  8  |    .031892   .0185242     1.72   0.119    -.0100127    .0737968
                  9  |  -.0476016    .013538    -3.52   0.007    -.0782268   -.0169765
                 10  |  -.0363543   .0118107    -3.08   0.013    -.0630719   -.0096367
                 11  |   .1107943   .0181009     6.12   0.000     .0698474    .1517413
                     |
                educ |   .0917117   .0032421    28.29   0.000     .0843774    .0990459
               exper |    .045004   .0029265    15.38   0.000     .0383839    .0516242
              exper2 |    -.00132   .0002105    -6.27   0.000    -.0017962   -.0008438
              exper3 |   .0000187   6.56e-06     2.85   0.019     3.82e-06    .0000335
              exper4 |  -7.99e-08   6.69e-08    -1.19   0.263    -2.31e-07    7.14e-08
                edex |  -.0006985   .0001412    -4.95   0.001    -.0010178   -.0003791
                     |
               ee_cl |
                  2  |  -.1287851   .0102459   -12.57   0.000    -.1519628   -.1056073
                  3  |  -.1727157   .0094457   -18.29   0.000    -.1940833    -.151348
                  4  |  -.1789884   .0234253    -7.64   0.000    -.2319802   -.1259966
                  5  |  -.1312061   .0203417    -6.45   0.000    -.1772222   -.0851899
                  6  |  -.1699925   .0141148   -12.04   0.000    -.2019223   -.1380627
                  7  |  -.1769241    .016087   -11.00   0.000    -.2133154   -.1405329
                  8  |  -.0941687   .0210552    -4.47   0.002     -.141799   -.0465385
                  9  |  -.1575513   .0250028    -6.30   0.000    -.2141114   -.1009911
                 10  |  -.1747929   .0172581   -10.13   0.000    -.2138333   -.1357524
                 11  |  -.1677391    .015547   -10.79   0.000    -.2029088   -.1325693
                 12  |  -.1026727   .0207435    -4.95   0.001    -.1495978   -.0557477
                 13  |  -.1219028   .0243739    -5.00   0.001    -.1770403   -.0667652
                 14  |  -.1550976   .0184699    -8.40   0.000    -.1968795   -.1133157
                 15  |  -.1304702   .0210635    -6.19   0.000     -.178119   -.0828213
                 16  |  -.1147041   .0249864    -4.59   0.001    -.1712272   -.0581809
                     |
                marr |   .0518614   .0030549    16.98   0.000     .0449508    .0587721
               partt |  -.1412707   .0033438   -42.25   0.000    -.1488348   -.1337066
              public |   .0138062   .0091032     1.52   0.164    -.0067866     .034399
                cmsa |   .1574385   .0161593     9.74   0.000     .1208837    .1939934
                     |
               nocc2 |
                  2  |  -.1520916   .0094474   -16.10   0.000     -.173463   -.1307201
                  3  |   -.050027   .0145512    -3.44   0.007    -.0829442   -.0171099
                  4  |  -.3636143   .0102045   -35.63   0.000    -.3866984   -.3405303
                  5  |    .034994   .0127015     2.76   0.022     .0062613    .0637268
                  6  |  -.3516735   .0098594   -35.67   0.000    -.3739769   -.3293701
                  7  |  -.3712286   .0100595   -36.90   0.000    -.3939847   -.3484725
                  8  |  -.1893014   .0130014   -14.56   0.000    -.2187127   -.1598901
                  9  |  -.4237853   .0093167   -45.49   0.000    -.4448611   -.4027095
                 10  |  -.4565039   .0200063   -22.82   0.000    -.5017613   -.4112464
                 11  |  -.2515412   .0138789   -18.12   0.000    -.2829375   -.2201448
                 12  |  -.4305409   .0177959   -24.19   0.000     -.470798   -.3902838
                     |
               unemp |    .000371   .0031741     0.12   0.910    -.0068092    .0075512
             citizen |  -.0234953   .0043894    -5.35   0.000    -.0334249   -.0135657
                     |
             quarter |
                  2  |   .0052108   .0038688     1.35   0.211    -.0035409    .0139625
                  3  |   .0106761   .0032469     3.29   0.009     .0033312    .0180211
                  4  |   .0207598   .0019421    10.69   0.000     .0163665    .0251531
                     |
               _cons |   .3162878   .0566855     5.58   0.000     .1880563    .4445193
--------------------------------------------------------------------------------------

. 
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 0 & covered == 1, vce(cluster state)
(sum of wgt is 407,987,880)

Linear regression                               Number of obs     =     38,901
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3435
                                                Root MSE          =     .34022

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0519325   .0090919    -5.71   0.000    -.0724998   -.0313652
            treat_st |  -.0557388    .029676    -1.88   0.093    -.1228706    .0113929
treat_sthisprelwhite |   .0457544   .0099539     4.60   0.001     .0232371    .0682717
                     |
               state |
                 OH  |  -.0049827   .0016405    -3.04   0.014    -.0086938   -.0012716
                 IN  |    .013915   .0089714     1.55   0.155    -.0063796    .0342097
                 IL  |   .1022073   .0023105    44.24   0.000     .0969805    .1074341
                 MI  |   .0781907   .0066989    11.67   0.000     .0630367    .0933447
                 WI  |    .027876   .0048304     5.77   0.000     .0169489    .0388032
                 MN  |   .0492939   .0042588    11.57   0.000     .0396598    .0589281
                 MO  |   .0136454   .0032764     4.16   0.002     .0062337    .0210572
                 WV  |  -.0336874   .0115483    -2.92   0.017    -.0598115   -.0075632
                 KY  |  -.0326717   .0069198    -4.72   0.001    -.0483255    -.017018
                     |
                year |
               1997  |  -.0069479   .0100379    -0.69   0.506    -.0296551    .0157593
               1998  |   -.004083   .0139776    -0.29   0.777    -.0357025    .0275365
               1999  |   .0101529     .01538     0.66   0.526    -.0246391    .0449449
               2000  |   .0192258   .0132297     1.45   0.180    -.0107019    .0491535
               2001  |   .0168128   .0139928     1.20   0.260    -.0148411    .0484666
               2002  |   .0446685   .0102304     4.37   0.002     .0215258    .0678112
               2003  |   .0444842   .0183522     2.42   0.038     .0029685    .0859998
               2004  |    .034732   .0093665     3.71   0.005     .0135434    .0559205
               2005  |    .022711   .0098313     2.31   0.046     .0004712    .0449509
               2006  |   .0187048   .0164525     1.14   0.285    -.0185135    .0559231
               2007  |  -.0042986   .0171606    -0.25   0.808    -.0431186    .0345213
               2008  |   -.001985   .0132902    -0.15   0.885    -.0320495    .0280795
               2009  |   .0546844   .0141882     3.85   0.004     .0225884    .0867804
               2010  |   .0573868   .0111989     5.12   0.001     .0320531    .0827206
               2011  |   .0353226   .0154848     2.28   0.048     .0002935    .0703517
               2012  |   .0295858   .0164717     1.80   0.106    -.0076758    .0668473
               2013  |   .0189832    .017171     1.11   0.298    -.0198604    .0578268
               2014  |   .0019722   .0228304     0.09   0.933    -.0496739    .0536182
               2015  |    .002761   .0251623     0.11   0.915    -.0541601    .0596822
               2016  |   .0116136   .0209123     0.56   0.592    -.0356933    .0589205
               2017  |   .0216214   .0197081     1.10   0.301    -.0229614    .0662042
               2018  |   .0176775   .0194836     0.91   0.388    -.0263975    .0617524
               2019  |   .0266179   .0245326     1.08   0.306    -.0288788    .0821145
                     |
                nind |
                  2  |   .0572024   .0519851     1.10   0.300    -.0603962    .1748009
                  3  |   -.101181   .0388109    -2.61   0.028    -.1889773   -.0133848
                  4  |  -.2733275    .056582    -4.83   0.001    -.4013249     -.14533
                  5  |    .037449   .0492829     0.76   0.467    -.0740368    .1489347
                  6  |  -.1301828   .0596966    -2.18   0.057    -.2652259    .0048603
                  7  |  -.1164098   .0502754    -2.32   0.046    -.2301406    -.002679
                  8  |  -.2146764   .0510874    -4.20   0.002     -.330244   -.0991088
                  9  |  -.1623484    .056422    -2.88   0.018    -.2899839   -.0347129
                 10  |  -.1786575   .0640581    -2.79   0.021    -.3235669    -.033748
                 11  |   .0557324   .0523769     1.06   0.315    -.0627524    .1742172
                     |
                educ |   .0711494   .0106311     6.69   0.000     .0471002    .0951987
               exper |   .0739674   .0058792    12.58   0.000     .0606679     .087267
              exper2 |  -.0030289   .0006324    -4.79   0.001    -.0044596   -.0015982
              exper3 |   .0000702   .0000201     3.49   0.007     .0000247    .0001156
              exper4 |  -6.35e-07   2.05e-07    -3.10   0.013    -1.10e-06   -1.72e-07
                edex |  -.0007517   .0001799    -4.18   0.002    -.0011586   -.0003448
                     |
               ee_cl |
                  2  |   .0668448   .0413422     1.62   0.140    -.0266777    .1603674
                  3  |   .0454519   .0452426     1.00   0.341     -.056894    .1477977
                  4  |  -.0348127   .0573066    -0.61   0.559    -.1644493    .0948239
                  5  |   .0218661   .0663371     0.33   0.749    -.1281989    .1719311
                  6  |    .038315   .0451037     0.85   0.418    -.0637166    .1403466
                  7  |   .0450822   .0581307     0.78   0.458    -.0864185     .176583
                  8  |  -.0310082   .0631439    -0.49   0.635    -.1738496    .1118333
                  9  |     .04128   .0700657     0.59   0.570    -.1172197    .1997797
                 10  |   .0148204   .0579859     0.26   0.804    -.1163527    .1459935
                 11  |   .0374383   .0651915     0.57   0.580    -.1100351    .1849116
                 12  |   .0227013    .072345     0.31   0.761    -.1409544     .186357
                 13  |   .0153782    .070485     0.22   0.832      -.14407    .1748264
                 14  |   -.005964   .0597568    -0.10   0.923    -.1411432    .1292153
                 15  |   .0063249   .0642028     0.10   0.924    -.1389119    .1515616
                 16  |  -.0004603   .0670158    -0.01   0.995    -.1520606      .15114
                     |
                marr |   .0673931   .0063735    10.57   0.000     .0529752    .0818109
               partt |  -.1221643   .0212477    -5.75   0.000    -.1702301   -.0740986
              public |  -.0682365   .0115158    -5.93   0.000     -.094287   -.0421859
                cmsa |   .1091349   .0152341     7.16   0.000     .0746729    .1435969
                     |
               nocc2 |
                  2  |  -.0217015   .0194155    -1.12   0.293    -.0656224    .0222193
                  3  |  -.0076242   .0194883    -0.39   0.705    -.0517098    .0364615
                  4  |  -.0577691   .0146223    -3.95   0.003     -.090847   -.0246911
                  5  |  -.0196205   .0186355    -1.05   0.320     -.061777    .0225359
                  6  |  -.2496812   .0202048   -12.36   0.000    -.2953876   -.2039748
                  7  |  -.2546147   .0293507    -8.67   0.000    -.3210107   -.1882187
                  8  |    -.21823   .1268732    -1.72   0.120    -.5052371     .068777
                  9  |  -.2302174   .0112354   -20.49   0.000    -.2556337   -.2048011
                 10  |  -.1551717   .0195923    -7.92   0.000    -.1994925   -.1108508
                 11  |  -.0554069   .0173373    -3.20   0.011    -.0946265   -.0161873
                 12  |  -.2150214   .0187705   -11.46   0.000    -.2574833   -.1725596
                     |
               unemp |  -.0121033   .0031646    -3.82   0.004    -.0192622   -.0049444
             citizen |  -.0404354   .0102155    -3.96   0.003    -.0635445   -.0173264
                     |
             quarter |
                  2  |  -.0020033   .0049531    -0.40   0.695    -.0132081    .0092015
                  3  |   .0047355    .005336     0.89   0.398    -.0073355    .0168065
                  4  |   .0103068   .0040514     2.54   0.032     .0011419    .0194717
                     |
               _cons |   .7055022   .1041996     6.77   0.000     .4697862    .9412182
--------------------------------------------------------------------------------------

.         
. reg lwage3 hisprelwhite treat_st treat_sthisprelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp citizen i.quarter [aw = finalwt1] if female == 
> 1 & covered == 1, vce(cluster state)
(sum of wgt is 287,862,108)

Linear regression                               Number of obs     =     28,478
                                                F(8, 9)           =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4370
                                                Root MSE          =     .34977

                                         (Std. Err. adjusted for 10 clusters in state)
--------------------------------------------------------------------------------------
                     |               Robust
              lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
---------------------+----------------------------------------------------------------
        hisprelwhite |  -.0089418   .0286864    -0.31   0.762    -.0738351    .0559514
            treat_st |  -.0483892   .0177916    -2.72   0.024    -.0886366   -.0081418
treat_sthisprelwhite |  -.0055195   .0418956    -0.13   0.898    -.1002941     .089255
                     |
               state |
                 OH  |   -.032699   .0021492   -15.21   0.000    -.0375609   -.0278371
                 IN  |  -.0387887    .006451    -6.01   0.000    -.0533819   -.0241954
                 IL  |   -.009667   .0030581    -3.16   0.012    -.0165849   -.0027491
                 MI  |   .0348275   .0075457     4.62   0.001      .017758    .0518971
                 WI  |  -.0040202    .003926    -1.02   0.333    -.0129015    .0048611
                 MN  |   .0416738   .0052101     8.00   0.000     .0298877    .0534599
                 MO  |  -.1056779   .0029008   -36.43   0.000    -.1122399   -.0991158
                 WV  |  -.1196414    .009762   -12.26   0.000    -.1417247   -.0975582
                 KY  |  -.0913125   .0054957   -16.62   0.000    -.1037446   -.0788805
                     |
                year |
               1997  |   .0128437   .0138625     0.93   0.378    -.0185155    .0442029
               1998  |   .0221685   .0112772     1.97   0.081    -.0033423    .0476792
               1999  |   .0274882   .0121062     2.27   0.049     .0001021    .0548742
               2000  |   .0142262   .0085652     1.66   0.131    -.0051497    .0336022
               2001  |   .0251925   .0115618     2.18   0.057    -.0009622    .0513471
               2002  |   .0434092   .0103476     4.20   0.002     .0200014     .066817
               2003  |   .0441673   .0155148     2.85   0.019     .0090704    .0792643
               2004  |   .0237219   .0105501     2.25   0.051     -.000144    .0475877
               2005  |   .0166705   .0165599     1.01   0.340    -.0207905    .0541315
               2006  |   .0171095   .0166167     1.03   0.330    -.0204801    .0546992
               2007  |   .0109097   .0208565     0.52   0.614     -.036271    .0580904
               2008  |  -.0178586   .0175437    -1.02   0.335    -.0575451    .0218279
               2009  |   .0194997   .0237458     0.82   0.433    -.0342169    .0732164
               2010  |   .0218552   .0141363     1.55   0.156    -.0101233    .0538337
               2011  |  -.0022372   .0194009    -0.12   0.911    -.0461251    .0416507
               2012  |  -.0136076   .0151195    -0.90   0.392    -.0478103    .0205951
               2013  |   .0004004   .0142368     0.03   0.978    -.0318054    .0326062
               2014  |  -.0440284   .0190711    -2.31   0.046    -.0871702   -.0008866
               2015  |  -.0307815   .0107089    -2.87   0.018    -.0550067   -.0065563
               2016  |  -.0057779   .0153732    -0.38   0.716    -.0405545    .0289987
               2017  |  -.0158668   .0175019    -0.91   0.388    -.0554588    .0237253
               2018  |  -.0175156   .0176721    -0.99   0.348    -.0574927    .0224615
               2019  |  -.0049524   .0164424    -0.30   0.770    -.0421476    .0322428
                     |
                nind |
                  2  |  -.0808749   .0796608    -1.02   0.337    -.2610802    .0993304
                  3  |  -.1390039   .0633456    -2.19   0.056    -.2823017    .0042938
                  4  |  -.4598492   .0655449    -7.02   0.000     -.608122   -.3115764
                  5  |  -.0301509   .0645556    -0.47   0.652    -.1761858    .1158841
                  6  |  -.2330273   .0682813    -3.41   0.008    -.3874905   -.0785642
                  7  |  -.2770694   .0607689    -4.56   0.001    -.4145383   -.1396006
                  8  |  -.3098716   .0563977    -5.49   0.000    -.4374521   -.1822911
                  9  |  -.3708609   .0582319    -6.37   0.000    -.5025905   -.2391312
                 10  |  -.3376914    .053417    -6.32   0.000     -.458529   -.2168537
                 11  |   -.180095   .0549577    -3.28   0.010    -.3044178   -.0557721
                     |
                educ |   .1178329   .0084511    13.94   0.000     .0987153    .1369506
               exper |   .0460207    .003341    13.77   0.000     .0384629    .0535785
              exper2 |  -.0014378   .0003343    -4.30   0.002    -.0021941   -.0006815
              exper3 |   .0000222   .0000123     1.81   0.104    -5.55e-06      .00005
              exper4 |  -1.34e-07   1.36e-07    -0.98   0.351    -4.43e-07    1.74e-07
                edex |  -.0003627   .0002757    -1.32   0.221    -.0009865     .000261
                     |
               ee_cl |
                  2  |  -.1635224   .0250183    -6.54   0.000    -.2201178    -.106927
                  3  |   -.208424   .0295674    -7.05   0.000    -.2753101   -.1415378
                  4  |  -.2998285   .0493721    -6.07   0.000    -.4115159   -.1881412
                  5  |  -.1100779   .0575195    -1.91   0.088     -.240196    .0200402
                  6  |   -.201673   .0413384    -4.88   0.001    -.2951871    -.108159
                  7  |   -.259347   .0458968    -5.65   0.000    -.3631727   -.1555213
                  8  |  -.2997196   .0555253    -5.40   0.000    -.4253264   -.1741127
                  9  |  -.1201779   .0538285    -2.23   0.052    -.2419465    .0015906
                 10  |  -.2285428    .060653    -3.77   0.004    -.3657494   -.0913362
                 11  |  -.2844258   .0565415    -5.03   0.001    -.4123315   -.1565201
                 12  |  -.3062471   .0564875    -5.42   0.000    -.4340306   -.1784635
                 13  |  -.0272838   .0605976    -0.45   0.663    -.1643651    .1097974
                 14  |  -.1951779   .0614487    -3.18   0.011    -.3341845   -.0561714
                 15  |  -.2377544   .0643743    -3.69   0.005    -.3833791   -.0921297
                 16  |  -.2743927   .0537968    -5.10   0.001    -.3960896   -.1526958
                     |
                marr |   .0065214   .0031448     2.07   0.068    -.0005927    .0136356
               partt |  -.0724816    .013555    -5.35   0.000    -.1031452   -.0418181
              public |   .0373368   .0089074     4.19   0.002     .0171869    .0574866
                cmsa |   .1121539   .0164602     6.81   0.000     .0749184    .1493895
                     |
               nocc2 |
                  2  |  -.0181894   .0191993    -0.95   0.368    -.0616213    .0252426
                  3  |  -.0006329   .0324793    -0.02   0.985    -.0741062    .0728404
                  4  |   -.091146   .0242207    -3.76   0.004    -.1459371   -.0363549
                  5  |   .1544817   .0297646     5.19   0.001     .0871494     .221814
                  6  |   -.194694   .0229514    -8.48   0.000    -.2466138   -.1427742
                  7  |  -.2320789    .024496    -9.47   0.000    -.2874927    -.176665
                  8  |   .0474614   .0905647     0.52   0.613    -.1574102    .2523329
                  9  |  -.2257704   .0236566    -9.54   0.000    -.2792853   -.1722556
                 10  |   -.204919   .0366804    -5.59   0.000    -.2878958   -.1219423
                 11  |   .1339731   .0312323     4.29   0.002     .0633207    .2046254
                 12  |  -.1983802   .0257552    -7.70   0.000    -.2566426   -.1401178
                     |
               unemp |    -.00022   .0037116    -0.06   0.954    -.0086161    .0081762
             citizen |  -.0128683   .0071634    -1.80   0.106    -.0290731    .0033365
                     |
             quarter |
                  2  |  -.0017767   .0083826    -0.21   0.837    -.0207395     .017186
                  3  |   .0080981   .0051181     1.58   0.148    -.0034797     .019676
                  4  |   .0132938   .0051254     2.59   0.029     .0016994    .0248881
                     |
               _cons |   .3379128    .106991     3.16   0.012     .0958824    .5799433
--------------------------------------------------------------------------------------

. 
. 
. esttab covstagdid_mal_all covstagdid_fem_all covstagdid_mal_rust covstagdid_fem_rust using $tabs/covsta
> gdid.tex, se title(Difference in Differences of Union Coverage on Right to Work Laws Treatment in State
>  and Time) nonumbers mgroups("All States" "Rust-Belt States +", pattern(1 0 1 0) prefix(\multicolumn{@s
> pan}{c}{) suffix(}) span erepeat(\cmidrule(lr){@span})) mtitles("men" "women" "men" "women") keep(black
> relwhite treat_st treat_stblackrelwhite) replace
(output written to /Users/amedeusdsouza/econ499/tabs/covstagdid.tex)

. 
. esttab wagstagdid_mal_all wagstagdid_fem_all uwagstagdid_mal_all uwagstagdid_fem_all nwagstagdid_mal_al
> l nwagstagdid_fem_all using $tabs/wagstagdid_all.tex, se title(Difference in Differences of Real Log Tr
> immed Imputed Wages on Right to Work Laws Treatment in State and Time) nonumbers mtitles("men" "women" 
> "men covered by union" "women covered by union" "men not covered by union" "women not covered by union"
> ) keep(blackrelwhite treat_st treat_stblackrelwhite) replace
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid_all.tex)

. 
. esttab wagstagdid_mal_rust wagstagdid_fem_rust uwagstagdid_mal_rust uwagstagdid_fem_rust nwagstagdid_ma
> l_rust nwagstagdid_fem_rust using $tabs/wagstagdid_rust.tex, se title(Difference in Differences of Real
>  Log Trimmed Imputed Wages on Right to Work Laws Treatment in State and Time) nonumbers mtitles("men" "
> women" "men covered by union" "women covered by union" "men not covered by union" "women not covered by
>  union") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid_rust.tex)

. 
. panelcombine, use($tabs/wagstagdid_all.tex $tabs/wagstagdid_rust.tex) paneltitles("All States" "Rust-Be
> lt States") columncount(3) save($tabs/wagstagdid.tex)

. 
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 closed on:  11 Mar 2021, 11:50:21
---------------------------------------------------------------------------------------------------------
