--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagpta.log
  log type:  text
 opened on:  15 Mar 2021, 02:40:35

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt pu
> blic marr hisprace hispracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unem
> p.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effectiv
> e; signed Dec2012) Mar1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72
> , 82) //incl Idaho which changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57
> , 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57
> , 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change t
> o treat_jst
. 
. gen treat_stm1 = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_stm1 = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_stm1 = 1 if state == 73 & date >= (500 - 12)
(20,293 real changes made)

.         replace treat_stm1 = 1 if state == 32 & date >= (625 - 12)
(12,242 real changes made)

.         replace treat_stm1 = 1 if state == 34 & date >= (638 - 12)
(14,337 real changes made)

.         replace treat_stm1 = 1 if state == 35 & date >= (662 - 12)
(9,578 real changes made)

.         replace treat_stm1 = 1 if state == 55 & date >= (678 - 12)
(6,340 real changes made)

.         replace treat_stm1 = 1 if state == 61 & date >= (684 - 12)
(4,142 real changes made)

.         
. gen treat_stm2 = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_stm2 = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_stm2 = 1 if state == 73 & date >= (500 - 24)
(21,615 real changes made)

.         replace treat_stm2 = 1 if state == 32 & date >= (625 - 24)
(13,578 real changes made)

.         replace treat_stm2 = 1 if state == 34 & date >= (638 - 24)
(16,160 real changes made)

.         replace treat_stm2 = 1 if state == 35 & date >= (662 - 24)
(11,816 real changes made)

.         replace treat_stm2 = 1 if state == 55 & date >= (678 - 24)
(7,518 real changes made)

.         replace treat_stm2 = 1 if state == 61 & date >= (684 - 24)
(5,241 real changes made)

.         
. gen treat_stm3 = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_stm3 = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_stm3 = 1 if state == 73 & date >= (500 - 36)
(22,956 real changes made)

.         replace treat_stm3 = 1 if state == 32 & date >= (625 - 36)
(15,063 real changes made)

.         replace treat_stm3 = 1 if state == 34 & date >= (638 - 36)
(18,153 real changes made)

.         replace treat_stm3 = 1 if state == 35 & date >= (662 - 36)
(14,018 real changes made)

.         replace treat_stm3 = 1 if state == 55 & date >= (678 - 36)
(8,284 real changes made)

.         replace treat_stm3 = 1 if state == 61 & date >= (684 - 36)
(6,588 real changes made)

.         
. gen treat_stm4 = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_stm4 = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_stm4 = 1 if state == 73 & date >= (500 - 48)
(24,397 real changes made)

.         replace treat_stm4 = 1 if state == 32 & date >= (625 - 48)
(16,601 real changes made)

.         replace treat_stm4 = 1 if state == 34 & date >= (638 - 48)
(20,221 real changes made)

.         replace treat_stm4 = 1 if state == 35 & date >= (662 - 48)
(16,307 real changes made)

.         replace treat_stm4 = 1 if state == 55 & date >= (678 - 48)
(9,077 real changes made)

.         replace treat_stm4 = 1 if state == 61 & date >= (684 - 48)
(7,994 real changes made)

.         
. gen treat_stp1 = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_stp1 = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_stp1 = 1 if state == 73 & date >= (500 + 12)
(17,857 real changes made)

.         replace treat_stp1 = 1 if state == 32 & date >= (625 + 12)
(9,480 real changes made)

.         replace treat_stp1 = 1 if state == 34 & date >= (638 + 12)
(10,415 real changes made)

.         replace treat_stp1 = 1 if state == 35 & date >= (662 + 12)
(5,894 real changes made)

.         replace treat_stp1 = 1 if state == 55 & date >= (678 + 12)
(3,425 real changes made)

.         replace treat_stp1 = 1 if state == 61 & date >= (684 + 12)
(1,998 real changes made)

.         
. gen treat_stp2 = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_stp2 = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_stp2 = 1 if state == 73 & date >= (500 + 24)
(16,615 real changes made)

.         replace treat_stp2 = 1 if state == 32 & date >= (625 + 24)
(8,172 real changes made)

.         replace treat_stp2 = 1 if state == 34 & date >= (638 + 24)
(8,543 real changes made)

.         replace treat_stp2 = 1 if state == 35 & date >= (662 + 24)
(4,296 real changes made)

.         replace treat_stp2 = 1 if state == 55 & date >= (678 + 24)
(2,120 real changes made)

.         replace treat_stp2 = 1 if state == 61 & date >= (684 + 24)
(900 real changes made)

.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. gen treat_stm1blackrelwhite = treat_stm1*blackrelwhite
(324,138 missing values generated)

. gen treat_stm2blackrelwhite = treat_stm2*blackrelwhite
(324,138 missing values generated)

. gen treat_stp1blackrelwhite = treat_stp1*blackrelwhite
(324,138 missing values generated)

. gen treat_stp2blackrelwhite = treat_stp2*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. ** no pretrends for before 2000
. drop if alwaysr2w == 1
(1,149,124 observations deleted)

. 
. reg covered blackrelwhite treat_stm4 treat_stm3 treat_stm2 treat_stm1 treat_st treat_stp1 treat_stp2 treat_s
> tm2blackrelwhite treat_stm1blackrelwhite treat_stblackrelwhite treat_stp1blackrelwhite treat_stp2blackrelwhi
> te i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i
> .quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,857,928,429)

Linear regression                               Number of obs     =    675,883
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2540
                                                Root MSE          =     .35736

                                            (Std. Err. adjusted for 30 clusters in state)
-----------------------------------------------------------------------------------------
                        |               Robust
                covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
          blackrelwhite |   .0510533   .0072849     7.01   0.000      .036154    .0659525
             treat_stm4 |  -.0130495   .0106588    -1.22   0.231    -.0348493    .0087503
             treat_stm3 |  -.0097937   .0055123    -1.78   0.086    -.0210676    .0014801
             treat_stm2 |   .0056497   .0045919     1.23   0.228    -.0037417    .0150411
             treat_stm1 |   .0008757   .0061881     0.14   0.888    -.0117804    .0135318
               treat_st |  -.0139034   .0060244    -2.31   0.028    -.0262248   -.0015821
             treat_stp1 |   .0002087   .0064289     0.03   0.974    -.0129398    .0133573
             treat_stp2 |  -.0003968   .0073702    -0.05   0.957    -.0154704    .0146769
treat_stm2blackrelwhite |   .0657578   .0308458     2.13   0.042     .0026709    .1288446
treat_stm1blackrelwhite |  -.0562649   .0220029    -2.56   0.016     -.101266   -.0112639
  treat_stblackrelwhite |  -.0564296   .0419935    -1.34   0.189     -.142316    .0294568
treat_stp1blackrelwhite |   .0315299    .037021     0.85   0.401    -.0441866    .1072465
treat_stp2blackrelwhite |  -.0081464   .0247184    -0.33   0.744    -.0587011    .0424084
                        |
                  state |
                    NH  |  -.0391388   .0036318   -10.78   0.000    -.0465667   -.0317108
                    VT  |  -.0457702   .0012909   -35.46   0.000    -.0484104   -.0431301
                    MA  |   .0070318   .0072287     0.97   0.339    -.0077524    .0218161
                    RI  |   .0113406   .0078265     1.45   0.158    -.0046663    .0273475
                    CT  |   .0076573   .0071359     1.07   0.292    -.0069373    .0222518
                    NY  |   .0921719   .0068832    13.39   0.000     .0780943    .1062496
                    NJ  |   .0441367   .0080263     5.50   0.000     .0277211    .0605522
                    PA  |   .0201589   .0059192     3.41   0.002     .0080528     .032265
                    OH  |   .0098284   .0059741     1.65   0.111    -.0023899    .0220467
                    IN  |  -.0064772   .0064805    -1.00   0.326    -.0197313     .006777
                    IL  |    .043338   .0066766     6.49   0.000     .0296828    .0569931
                    MI  |   .0590358   .0074678     7.91   0.000     .0437624    .0743092
                    WI  |  -.0002305   .0058091    -0.04   0.969    -.0121114    .0116504
                    MN  |   .0212584   .0054124     3.93   0.000     .0101887    .0323281
                    MO  |  -.0120357   .0057646    -2.09   0.046    -.0238256   -.0002458
                    DE  |  -.0599808   .0029324   -20.45   0.000    -.0659781   -.0539834
                    MD  |  -.0548782   .0079881    -6.87   0.000    -.0712157   -.0385408
                    DC  |  -.0483875   .0099431    -4.87   0.000    -.0687234   -.0280516
                    WV  |   -.016595   .0038695    -4.29   0.000    -.0245091    -.008681
                    KY  |  -.0439491   .0051416    -8.55   0.000    -.0544649   -.0334334
                    OK  |  -.0862677   .0093896    -9.19   0.000    -.1054715   -.0670638
                    MT  |  -.0045506   .0028464    -1.60   0.121    -.0103722    .0012709
                    CO  |  -.0546442   .0071077    -7.69   0.000    -.0691811   -.0401073
                    NM  |  -.1052068   .0060537   -17.38   0.000     -.117588   -.0928255
                    WA  |   .0510177   .0070095     7.28   0.000     .0366818    .0653537
                    OR  |   .0152564   .0065897     2.32   0.028     .0017789    .0287338
                    CA  |   .0339671   .0083939     4.05   0.000     .0167995    .0511346
                    AK  |   .0310341   .0069836     4.44   0.000      .016751    .0453173
                    HI  |   .0146627   .0050422     2.91   0.007     .0043502    .0249752
                        |
                   year |
                  1990  |  -.0048928   .0035607    -1.37   0.180    -.0121752    .0023896
                  1991  |  -.0033568   .0050032    -0.67   0.508    -.0135895     .006876
                  1992  |   -.008001   .0047726    -1.68   0.104    -.0177622    .0017601
                  1993  |  -.0144214   .0056632    -2.55   0.016    -.0260039   -.0028389
                  1996  |  -.0279743   .0051982    -5.38   0.000    -.0386058   -.0173427
                  1997  |  -.0325104   .0050512    -6.44   0.000    -.0428412   -.0221796
                  1998  |  -.0381636   .0051295    -7.44   0.000    -.0486547   -.0276725
                  1999  |  -.0407597   .0042291    -9.64   0.000    -.0494092   -.0321102
                  2000  |  -.0458596   .0043722   -10.49   0.000    -.0548017   -.0369176
                  2001  |  -.0444522   .0060168    -7.39   0.000     -.056758   -.0321464
                  2002  |  -.0449203   .0067577    -6.65   0.000    -.0587413   -.0310992
                  2003  |  -.0507567   .0059015    -8.60   0.000    -.0628267   -.0386867
                  2004  |    -.05474   .0065655    -8.34   0.000    -.0681681    -.041312
                  2005  |  -.0651204    .006929    -9.40   0.000    -.0792918    -.050949
                  2006  |   -.069112   .0076799    -9.00   0.000    -.0848192   -.0534048
                  2007  |  -.0647714   .0079439    -8.15   0.000    -.0810186   -.0485242
                  2008  |  -.0531355    .007858    -6.76   0.000    -.0692069   -.0370642
                  2009  |  -.0454236   .0065652    -6.92   0.000     -.058851   -.0319962
                  2010  |  -.0499096   .0085097    -5.87   0.000    -.0673139   -.0325052
                  2011  |  -.0555141   .0066978    -8.29   0.000    -.0692127   -.0418155
                  2012  |  -.0579316    .006198    -9.35   0.000    -.0706079   -.0452553
                  2013  |   -.057484   .0069053    -8.32   0.000    -.0716069   -.0433611
                  2014  |  -.0643416   .0062054   -10.37   0.000    -.0770331   -.0516501
                  2015  |  -.0701798   .0072022    -9.74   0.000    -.0849099   -.0554498
                  2016  |  -.0686967   .0080026    -8.58   0.000    -.0850638   -.0523296
                  2017  |  -.0603973   .0074148    -8.15   0.000    -.0755623   -.0452323
                  2018  |  -.0621232   .0059386   -10.46   0.000    -.0742691   -.0499774
                  2019  |  -.0704719   .0076127    -9.26   0.000    -.0860416   -.0549021
                        |
                   nind |
                     2  |   .1491736   .0165808     9.00   0.000     .1152621     .183085
                     3  |   .1142842   .0147492     7.75   0.000     .0841186    .1444498
                     4  |   .0285177   .0131199     2.17   0.038     .0016844    .0553509
                     5  |    .197658   .0140409    14.08   0.000      .168941    .2263749
                     6  |   .0203772   .0134936     1.51   0.142    -.0072204    .0479748
                     7  |    .008674   .0126407     0.69   0.498    -.0171792    .0345272
                     8  |   .0392246   .0178141     2.20   0.036     .0027907    .0756585
                     9  |   .1600929   .0146293    10.94   0.000     .1301725    .1900132
                    10  |   .0171996   .0221465     0.78   0.444    -.0280952    .0624943
                    11  |   .1162376   .0214814     5.41   0.000     .0723031     .160172
                        |
                   educ |   .0098665   .0017887     5.52   0.000     .0062081    .0135249
                  exper |   .0092966    .001383     6.72   0.000      .006468    .0121252
                 exper2 |  -.0000842   .0000876    -0.96   0.345    -.0002633     .000095
                 exper3 |   3.07e-06   2.68e-06     1.15   0.261    -2.41e-06    8.55e-06
                 exper4 |  -7.04e-08   2.75e-08    -2.56   0.016    -1.27e-07   -1.42e-08
                   edex |  -.0002948   .0000538    -5.48   0.000    -.0004049   -.0001847
                        |
                  ee_cl |
                     2  |   -.023376   .0072317    -3.23   0.003    -.0381665   -.0085855
                     3  |  -.0171392   .0079806    -2.15   0.040    -.0334614   -.0008169
                     4  |  -.0342957     .00993    -3.45   0.002    -.0546049   -.0139866
                     5  |  -.0886446   .0089327    -9.92   0.000     -.106914   -.0703752
                     6  |   -.006323   .0067467    -0.94   0.356    -.0201216    .0074756
                     7  |   .0066323   .0080777     0.82   0.418    -.0098884    .0231531
                     8  |  -.0479085   .0122121    -3.92   0.000     -.072885    -.022932
                     9  |    -.06737   .0091744    -7.34   0.000    -.0861338   -.0486063
                    10  |   .0119033    .007948     1.50   0.145    -.0043522    .0281588
                    11  |   .0058324    .009724     0.60   0.553    -.0140555    .0257202
                    12  |  -.0647622   .0145883    -4.44   0.000    -.0945986   -.0349258
                    13  |   .0137546    .009087     1.51   0.141    -.0048304    .0323396
                    14  |   .0236926   .0081909     2.89   0.007     .0069404    .0404448
                    15  |  -.0034349   .0101042    -0.34   0.736    -.0241003    .0172305
                    16  |   -.071618   .0157146    -4.56   0.000     -.103758    -.039478
                        |
                   marr |     .01949   .0017024    11.45   0.000     .0160082    .0229719
                  partt |  -.0758865   .0042923   -17.68   0.000    -.0846654   -.0671077
                 public |   .3360833    .021581    15.57   0.000     .2919453    .3802213
                   cmsa |   .0494602   .0072509     6.82   0.000     .0346304    .0642899
                        |
                  nocc2 |
                     2  |   .0575256   .0034278    16.78   0.000     .0505149    .0645363
                     3  |    .041508   .0056636     7.33   0.000     .0299246    .0530914
                     4  |   .1956468   .0051364    38.09   0.000     .1851417    .2061519
                     5  |   .1879838   .0168869    11.13   0.000     .1534462    .2225214
                     6  |   .1541636   .0058857    26.19   0.000     .1421261    .1662012
                     7  |   .0831153   .0029573    28.11   0.000      .077067    .0891636
                     8  |   .0710065    .009155     7.76   0.000     .0522823    .0897306
                     9  |   .1978571   .0065343    30.28   0.000      .184493    .2112212
                    10  |    .233113   .0082482    28.26   0.000     .2162435    .2499825
                    11  |    .253863   .0095318    26.63   0.000     .2343683    .2733577
                    12  |   .2581105   .0086311    29.90   0.000     .2404579     .275763
                        |
                  unemp |  -.0029539   .0012457    -2.37   0.025    -.0055018   -.0004061
                        |
                quarter |
                     2  |  -.0017955    .002023    -0.89   0.382    -.0059331     .002342
                     3  |  -.0036559   .0016615    -2.20   0.036    -.0070539   -.0002578
                     4  |   -.004602   .0013121    -3.51   0.001    -.0072855   -.0019186
                        |
                  _cons |  -.2605388   .0297806    -8.75   0.000     -.321447   -.1996307
-----------------------------------------------------------------------------------------

.         
. reg covered blackrelwhite treat_stm4 treat_stm3 treat_stm2 treat_stm1 treat_st treat_stp1 treat_stp2 treat_s
> tm2blackrelwhite treat_stm1blackrelwhite treat_stblackrelwhite treat_stp1blackrelwhite treat_stp2blackrelwhi
> te i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i
> .quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,726,442,181)

Linear regression                               Number of obs     =    682,696
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3162
                                                Root MSE          =     .31646

                                            (Std. Err. adjusted for 30 clusters in state)
-----------------------------------------------------------------------------------------
                        |               Robust
                covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
          blackrelwhite |   .0724496   .0113007     6.41   0.000     .0493371    .0955621
             treat_stm4 |   -.018055    .007954    -2.27   0.031    -.0343228   -.0017872
             treat_stm3 |   .0004131   .0055106     0.07   0.941    -.0108574    .0116836
             treat_stm2 |   .0026641   .0065197     0.41   0.686    -.0106701    .0159984
             treat_stm1 |   .0008223   .0061033     0.13   0.894    -.0116604     .013305
               treat_st |  -.0083648   .0045734    -1.83   0.078    -.0177184    .0009888
             treat_stp1 |  -.0042613   .0057382    -0.74   0.464    -.0159973    .0074746
             treat_stp2 |  -.0049844   .0081697    -0.61   0.547    -.0216934    .0117245
treat_stm2blackrelwhite |  -.0510144   .0225785    -2.26   0.032    -.0971927   -.0048361
treat_stm1blackrelwhite |   .0292711   .0182257     1.61   0.119    -.0080048    .0665469
  treat_stblackrelwhite |   .0152995     .01526     1.00   0.324    -.0159107    .0465097
treat_stp1blackrelwhite |  -.0178714   .0260433    -0.69   0.498     -.071136    .0353931
treat_stp2blackrelwhite |  -.0047509   .0171284    -0.28   0.783    -.0397823    .0302805
                        |
                  state |
                    NH  |  -.0144596   .0021196    -6.82   0.000    -.0187947   -.0101245
                    VT  |  -.0070559   .0014113    -5.00   0.000    -.0099424   -.0041694
                    MA  |   .0210263   .0042331     4.97   0.000     .0123687    .0296839
                    RI  |   .0374233   .0043545     8.59   0.000     .0285173    .0463293
                    CT  |    .029419   .0041451     7.10   0.000     .0209413    .0378968
                    NY  |   .0953397   .0041058    23.22   0.000     .0869424    .1037371
                    NJ  |   .0366831   .0043853     8.37   0.000     .0277143     .045652
                    PA  |   .0142995   .0037225     3.84   0.001     .0066861    .0219128
                    OH  |  -.0021101    .003496    -0.60   0.551    -.0092603      .00504
                    IN  |  -.0374575   .0052645    -7.12   0.000    -.0482245   -.0266904
                    IL  |   .0062871   .0040599     1.55   0.132    -.0020164    .0145906
                    MI  |   .0514118   .0053201     9.66   0.000      .040531    .0622925
                    WI  |   .0022403   .0044999     0.50   0.622    -.0069631    .0114437
                    MN  |   .0393327   .0031945    12.31   0.000     .0327991    .0458663
                    MO  |   -.048299   .0035022   -13.79   0.000    -.0554619   -.0411362
                    DE  |  -.0318502   .0033018    -9.65   0.000    -.0386032   -.0250972
                    MD  |  -.0464496   .0068632    -6.77   0.000    -.0604864   -.0324127
                    DC  |  -.0616143   .0081591    -7.55   0.000    -.0783015   -.0449271
                    WV  |  -.0289494   .0030393    -9.52   0.000    -.0351655   -.0227333
                    KY  |   -.056905   .0036371   -15.65   0.000    -.0643436   -.0494664
                    OK  |  -.0661107   .0078563    -8.41   0.000    -.0821787   -.0500428
                    MT  |   .0037207   .0020455     1.82   0.079    -.0004629    .0079043
                    CO  |  -.0424367   .0039204   -10.82   0.000    -.0504548   -.0344187
                    NM  |  -.0830353    .003223   -25.76   0.000     -.089627   -.0764436
                    WA  |   .0641506   .0037549    17.08   0.000     .0564709    .0718303
                    OR  |   .0477221   .0036713    13.00   0.000     .0402134    .0552307
                    CA  |   .0477451   .0043596    10.95   0.000     .0388288    .0566614
                    AK  |   .0602586   .0043816    13.75   0.000     .0512973      .06922
                    HI  |   .0501044   .0028104    17.83   0.000     .0443565    .0558523
                        |
                   year |
                  1990  |  -.0003163   .0023456    -0.13   0.894    -.0051136     .004481
                  1991  |  -.0001892   .0034679    -0.05   0.957    -.0072818    .0069034
                  1992  |   .0021805   .0030318     0.72   0.478    -.0040203    .0083813
                  1993  |   .0016439   .0034713     0.47   0.639    -.0054557    .0087435
                  1996  |  -.0000379   .0031491    -0.01   0.990    -.0064785    .0064028
                  1997  |   -.003769   .0031084    -1.21   0.235    -.0101264    .0025884
                  1998  |  -.0101696   .0039787    -2.56   0.016     -.018307   -.0020323
                  1999  |  -.0117843   .0036582    -3.22   0.003    -.0192661   -.0043025
                  2000  |  -.0085275   .0029491    -2.89   0.007     -.014559    -.002496
                  2001  |  -.0074733   .0025333    -2.95   0.006    -.0126546   -.0022921
                  2002  |  -.0063876   .0047229    -1.35   0.187    -.0160471    .0032719
                  2003  |  -.0129528   .0037937    -3.41   0.002    -.0207118   -.0051938
                  2004  |  -.0162295    .004409    -3.68   0.001    -.0252469    -.007212
                  2005  |  -.0198699   .0047327    -4.20   0.000    -.0295494   -.0101904
                  2006  |  -.0217809     .00454    -4.80   0.000    -.0310663   -.0124955
                  2007  |  -.0180209   .0059606    -3.02   0.005    -.0302118   -.0058301
                  2008  |  -.0152252   .0055152    -2.76   0.010     -.026505   -.0039454
                  2009  |  -.0065886   .0068031    -0.97   0.341    -.0205026    .0073253
                  2010  |  -.0097853   .0068073    -1.44   0.161    -.0237077    .0041371
                  2011  |  -.0080878   .0065786    -1.23   0.229    -.0215426    .0053669
                  2012  |  -.0167771   .0066748    -2.51   0.018    -.0304286   -.0031257
                  2013  |  -.0155904   .0071708    -2.17   0.038    -.0302564   -.0009244
                  2014  |  -.0185011   .0063731    -2.90   0.007    -.0315356   -.0054667
                  2015  |  -.0249029   .0071427    -3.49   0.002    -.0395113   -.0102945
                  2016  |  -.0179163   .0060552    -2.96   0.006    -.0303006   -.0055321
                  2017  |  -.0232889    .007055    -3.30   0.003     -.037718   -.0088598
                  2018  |  -.0297164   .0050684    -5.86   0.000    -.0400824   -.0193504
                  2019  |  -.0270546   .0076914    -3.52   0.001    -.0427852   -.0113239
                        |
                   nind |
                     2  |   .0608909    .011473     5.31   0.000     .0374259    .0843559
                     3  |    .074415    .011809     6.30   0.000     .0502628    .0985672
                     4  |   .0660468   .0078219     8.44   0.000     .0500493    .0820444
                     5  |   .1983112   .0098062    20.22   0.000     .1782553     .218367
                     6  |   .0346769   .0087831     3.95   0.000     .0167134    .0526403
                     7  |    .023792   .0086614     2.75   0.010     .0060775    .0415066
                     8  |   .0545324   .0103449     5.27   0.000     .0333746    .0756901
                     9  |   .1941989    .012836    15.13   0.000     .1679463    .2204515
                    10  |   .0196931    .008536     2.31   0.028      .002235    .0371512
                    11  |   .0409545   .0217214     1.89   0.069    -.0034708    .0853798
                        |
                   educ |     .01534   .0023633     6.49   0.000     .0105066    .0201734
                  exper |   .0111072   .0014862     7.47   0.000     .0080675    .0141469
                 exper2 |  -.0004292   .0000911    -4.71   0.000    -.0006156   -.0002428
                 exper3 |   .0000107   3.00e-06     3.56   0.001     4.54e-06    .0000168
                 exper4 |  -1.03e-07   3.21e-08    -3.22   0.003    -1.69e-07   -3.78e-08
                   edex |  -.0001898   .0000534    -3.55   0.001     -.000299   -.0000805
                        |
                  ee_cl |
                     2  |    -.03636   .0056344    -6.45   0.000    -.0478836   -.0248365
                     3  |  -.0694727   .0066483   -10.45   0.000    -.0830699   -.0558755
                     4  |  -.0998983   .0136854    -7.30   0.000     -.127888   -.0719086
                     5  |   -.047644   .0081603    -5.84   0.000    -.0643336   -.0309543
                     6  |  -.0423545    .006199    -6.83   0.000    -.0550328   -.0296761
                     7  |  -.0637958   .0085882    -7.43   0.000    -.0813607    -.046231
                     8  |  -.0917885   .0130296    -7.04   0.000     -.118437   -.0651401
                     9  |  -.0284396    .009176    -3.10   0.004    -.0472067   -.0096724
                    10  |  -.0428575   .0077137    -5.56   0.000    -.0586338   -.0270812
                    11  |   -.063602    .009458    -6.72   0.000    -.0829458   -.0442582
                    12  |  -.0841303   .0121938    -6.90   0.000    -.1090694   -.0591912
                    13  |  -.0011701   .0087594    -0.13   0.895    -.0190851    .0167449
                    14  |  -.0380982   .0087665    -4.35   0.000    -.0560277   -.0201687
                    15  |   -.060654    .010302    -5.89   0.000     -.081724   -.0395839
                    16  |  -.0783736   .0138327    -5.67   0.000    -.1066647   -.0500825
                        |
                   marr |  -.0003273   .0011957    -0.27   0.786    -.0027727    .0021182
                  partt |  -.0670228   .0054277   -12.35   0.000    -.0781236   -.0559219
                 public |   .3661773    .022784    16.07   0.000     .3195788    .4127759
                   cmsa |   .0261129   .0040544     6.44   0.000     .0178208    .0344051
                        |
                  nocc2 |
                     2  |   .0236164   .0023036    10.25   0.000      .018905    .0283278
                     3  |   .0422534   .0068994     6.12   0.000     .0281426    .0563642
                     4  |    .170115   .0041949    40.55   0.000     .1615355    .1786946
                     5  |   .1760415   .0144466    12.19   0.000     .1464948    .2055882
                     6  |   .0759999   .0036464    20.84   0.000     .0685421    .0834577
                     7  |   .1051135     .00572    18.38   0.000     .0934148    .1168122
                     8  |   .0580873   .0046705    12.44   0.000     .0485351    .0676395
                     9  |   .1196057   .0082553    14.49   0.000     .1027218    .1364896
                    10  |    .224797   .0092148    24.40   0.000     .2059506    .2436433
                    11  |   .2575809   .0094135    27.36   0.000     .2383282    .2768336
                    12  |   .2236619   .0118287    18.91   0.000     .1994694    .2478544
                        |
                  unemp |  -.0016781   .0011833    -1.42   0.167    -.0040982     .000742
                        |
                quarter |
                     2  |  -.0021931   .0012343    -1.78   0.086    -.0047176    .0003313
                     3  |  -.0003415   .0011604    -0.29   0.771    -.0027149    .0020318
                     4  |  -.0037314   .0015735    -2.37   0.025    -.0069496   -.0005133
                        |
                  _cons |  -.2926111   .0321564    -9.10   0.000    -.3583783    -.226844
-----------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_stm4 treat_stm3 treat_stm2 treat_stm1 treat_st treat_stp1 treat_stp2 treat_st
> m2blackrelwhite treat_stm1blackrelwhite treat_stblackrelwhite treat_stp1blackrelwhite treat_stp2blackrelwhit
> e i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i
> .quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,866,086,925)

Linear regression                               Number of obs     =    677,009
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5102
                                                Root MSE          =     .41707

                                            (Std. Err. adjusted for 30 clusters in state)
-----------------------------------------------------------------------------------------
                        |               Robust
                 lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
          blackrelwhite |  -.1439851   .0066237   -21.74   0.000     -.157532   -.1304382
             treat_stm4 |  -.0495871   .0119337    -4.16   0.000    -.0739944   -.0251799
             treat_stm3 |   .0002955     .01301     0.02   0.982     -.026313     .026904
             treat_stm2 |   .0015925    .017935     0.09   0.930    -.0350887    .0382736
             treat_stm1 |  -.0063682   .0151635    -0.42   0.678    -.0373811    .0246447
               treat_st |  -.0048259   .0060833    -0.79   0.434    -.0172676    .0076157
             treat_stp1 |   .0242501    .006128     3.96   0.000      .011717    .0367832
             treat_stp2 |  -.0108722   .0139747    -0.78   0.443    -.0394536    .0177092
treat_stm2blackrelwhite |   .0435157   .0240574     1.81   0.081    -.0056872    .0927186
treat_stm1blackrelwhite |  -.0339814   .0221191    -1.54   0.135      -.07922    .0112572
  treat_stblackrelwhite |   .0122292   .0177356     0.69   0.496    -.0240443    .0485026
treat_stp1blackrelwhite |  -.0851536   .0294158    -2.89   0.007    -.1453157   -.0249916
treat_stp2blackrelwhite |   .0545092   .0385623     1.41   0.168    -.0243595    .1333779
                        |
                  state |
                    NH  |   .0862189   .0050092    17.21   0.000      .075974    .0964638
                    VT  |   .0224399   .0018821    11.92   0.000     .0185906    .0262893
                    MA  |   .1198013   .0119579    10.02   0.000     .0953446     .144258
                    RI  |   .0344082   .0129461     2.66   0.013     .0079305    .0608859
                    CT  |   .1327049     .01188    11.17   0.000     .1084075    .1570023
                    NY  |   .1001177   .0118583     8.44   0.000     .0758647    .1243707
                    NJ  |   .1723669   .0130282    13.23   0.000     .1457213    .1990125
                    PA  |   .0122387    .009473     1.29   0.207    -.0071358    .0316131
                    OH  |  -.0150422   .0092947    -1.62   0.116     -.034052    .0039677
                    IN  |   .0149269    .007443     2.01   0.054    -.0002958    .0301496
                    IL  |   .0847204   .0106153     7.98   0.000     .0630098     .106431
                    MI  |    .058282   .0102241     5.70   0.000     .0373715    .0791926
                    WI  |   .0279468   .0063717     4.39   0.000     .0149153    .0409783
                    MN  |   .0670922   .0083976     7.99   0.000     .0499171    .0842673
                    MO  |  -.0194468   .0088053    -2.21   0.035    -.0374556    -.001438
                    DE  |   .0502293   .0027205    18.46   0.000     .0446651    .0557934
                    MD  |   .1229468   .0123912     9.92   0.000     .0976039    .1482898
                    DC  |   .1762451   .0163933    10.75   0.000     .1427171    .2097732
                    WV  |  -.0336938    .006723    -5.01   0.000    -.0474438   -.0199437
                    KY  |  -.0329316   .0068581    -4.80   0.000     -.046958   -.0189052
                    OK  |  -.0456751   .0139729    -3.27   0.003    -.0742528   -.0170974
                    MT  |  -.0342642   .0019531   -17.54   0.000    -.0382587   -.0302698
                    CO  |   .0345439   .0110851     3.12   0.004     .0118723    .0572154
                    NM  |  -.0333167    .007929    -4.20   0.000    -.0495334      -.0171
                    WA  |   .1008387   .0109799     9.18   0.000     .0783823    .1232952
                    OR  |   .0296135   .0101759     2.91   0.007     .0088015    .0504255
                    CA  |   .1641894   .0135405    12.13   0.000     .1364959    .1918829
                    AK  |   .2419594   .0089317    27.09   0.000     .2236921    .2602267
                    HI  |   .1091559   .0089746    12.16   0.000     .0908007    .1275111
                        |
                   year |
                  1990  |  -.0072601   .0034564    -2.10   0.044    -.0143293   -.0001909
                  1991  |  -.0160973   .0048754    -3.30   0.003    -.0260686    -.006126
                  1992  |  -.0149281   .0061553    -2.43   0.022     -.027517   -.0023391
                  1993  |   -.026578   .0045868    -5.79   0.000     -.035959   -.0171969
                  1996  |  -.0285818    .006414    -4.46   0.000    -.0416999   -.0154637
                  1997  |    -.01907   .0063225    -3.02   0.005     -.032001    -.006139
                  1998  |   .0001174   .0046152     0.03   0.980    -.0093218    .0095566
                  1999  |   .0213447   .0067605     3.16   0.004     .0075179    .0351715
                  2000  |   .0309449   .0067867     4.56   0.000     .0170645    .0448254
                  2001  |    .047821   .0073243     6.53   0.000      .032841    .0628009
                  2002  |   .0575907   .0071433     8.06   0.000     .0429811    .0722003
                  2003  |   .0442027   .0076817     5.75   0.000     .0284919    .0599135
                  2004  |   .0378206   .0077516     4.88   0.000     .0219669    .0536744
                  2005  |   .0207363   .0075062     2.76   0.010     .0053845    .0360881
                  2006  |   .0145349   .0084915     1.71   0.098    -.0028321    .0319019
                  2007  |   .0153389   .0098624     1.56   0.131    -.0048319    .0355098
                  2008  |   .0109899   .0101592     1.08   0.288    -.0097879    .0317677
                  2009  |   .0364985   .0119569     3.05   0.005     .0120439    .0609531
                  2010  |   .0313919   .0099401     3.16   0.004      .011062    .0517218
                  2011  |   .0120113   .0098112     1.22   0.231     -.008055    .0320776
                  2012  |   .0019676   .0114288     0.17   0.865    -.0214069    .0253421
                  2013  |   .0016998    .009331     0.18   0.857    -.0173843    .0207839
                  2014  |  -.0036353   .0075034    -0.48   0.632    -.0189815    .0117109
                  2015  |   .0163438   .0078463     2.08   0.046     .0002964    .0323913
                  2016  |   .0217268   .0094918     2.29   0.030     .0023138    .0411398
                  2017  |   .0334567   .0105339     3.18   0.004     .0119125     .055001
                  2018  |   .0386983   .0104242     3.71   0.001     .0173783    .0600183
                  2019  |   .0589728   .0096826     6.09   0.000     .0391698    .0787759
                        |
                   nind |
                     2  |   .1262816   .0316235     3.99   0.000     .0616043    .1909588
                     3  |   .1171222   .0283498     4.13   0.000     .0591403     .175104
                     4  |  -.0703119    .029043    -2.42   0.022    -.1297114   -.0109123
                     5  |   .1470621   .0278616     5.28   0.000     .0900788    .2040454
                     6  |   .1199982   .0326137     3.68   0.001     .0532956    .1867008
                     7  |   .0163409   .0305731     0.53   0.597    -.0461881      .07887
                     8  |  -.0492766   .0288964    -1.71   0.099    -.1083763    .0098232
                     9  |  -.0386885   .0297621    -1.30   0.204    -.0995588    .0221817
                    10  |  -.0823864   .0318296    -2.59   0.015    -.1474853   -.0172875
                    11  |   .1341247   .0303056     4.43   0.000     .0721428    .1961067
                        |
                   educ |   .0671424   .0025301    26.54   0.000     .0619678     .072317
                  exper |   .0452544   .0024631    18.37   0.000     .0402168     .050292
                 exper2 |  -.0010096   .0001141    -8.85   0.000     -.001243   -.0007762
                 exper3 |   6.47e-06   2.72e-06     2.38   0.024     9.07e-07     .000012
                 exper4 |   1.43e-08   2.58e-08     0.55   0.585    -3.86e-08    6.71e-08
                   edex |  -.0003414   .0000717    -4.76   0.000    -.0004881   -.0001948
                        |
                  ee_cl |
                     2  |  -.0635644   .0056423   -11.27   0.000    -.0751042   -.0520246
                     3  |  -.0745576   .0069784   -10.68   0.000    -.0888301   -.0602851
                     4  |  -.0364412   .0114214    -3.19   0.003    -.0598006   -.0130817
                     5  |  -.1379161   .0090867   -15.18   0.000    -.1565006   -.1193317
                     6  |  -.0837477   .0069632   -12.03   0.000     -.097989   -.0695064
                     7  |  -.0663443   .0079475    -8.35   0.000    -.0825989   -.0500898
                     8  |   .0136135   .0110805     1.23   0.229    -.0090486    .0362756
                     9  |  -.1421915   .0106517   -13.35   0.000    -.1639768   -.1204063
                    10  |  -.0905873   .0096438    -9.39   0.000    -.1103111   -.0708636
                    11  |  -.0605333   .0095554    -6.33   0.000    -.0800764   -.0409902
                    12  |   .0127177   .0120191     1.06   0.299     -.011864    .0372995
                    13  |  -.0518456   .0118036    -4.39   0.000    -.0759866   -.0277046
                    14  |  -.0702496   .0113853    -6.17   0.000    -.0935351    -.046964
                    15  |  -.0524186   .0102889    -5.09   0.000    -.0734619   -.0313754
                    16  |   .0055203   .0127217     0.43   0.668    -.0204986    .0315391
                        |
                   marr |   .1206705   .0032353    37.30   0.000     .1140536    .1272875
                  partt |  -.2243848   .0058445   -38.39   0.000    -.2363382   -.2124314
                 public |    .032301   .0072692     4.44   0.000     .0174337    .0471682
                   cmsa |   .1455713   .0126261    11.53   0.000      .119748    .1713947
                        |
                  nocc2 |
                     2  |  -.1432659   .0044218   -32.40   0.000    -.1523096   -.1342223
                     3  |  -.0443149   .0079224    -5.59   0.000    -.0605182   -.0281117
                     4  |  -.2820906   .0124205   -22.71   0.000    -.3074933   -.2566879
                     5  |  -.0721222   .0093794    -7.69   0.000    -.0913053   -.0529391
                     6  |  -.3733067   .0078163   -47.76   0.000    -.3892929   -.3573206
                     7  |  -.2314576   .0066629   -34.74   0.000    -.2450849   -.2178304
                     8  |  -.0943944   .0146967    -6.42   0.000    -.1244525   -.0643364
                     9  |   -.386017   .0051059   -75.60   0.000    -.3964598   -.3755743
                    10  |  -.3284014   .0066603   -49.31   0.000    -.3420232   -.3147797
                    11  |  -.2146144   .0060095   -35.71   0.000    -.2269053   -.2023235
                    12  |  -.3789873   .0076153   -49.77   0.000    -.3945624   -.3634122
                        |
                  unemp |  -.0030162   .0018501    -1.63   0.114       -.0068    .0007676
                        |
                quarter |
                     2  |    .001178   .0021819     0.54   0.593    -.0032845    .0056405
                     3  |   .0026909   .0026878     1.00   0.325    -.0028062     .008188
                     4  |   .0130341   .0019982     6.52   0.000     .0089473     .017121
                        |
                  _cons |   .6313601   .0486633    12.97   0.000     .5318325    .7308877
-----------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_stm4 treat_stm3 treat_stm2 treat_stm1 treat_st treat_stp1 treat_stp2 treat_st
> m2blackrelwhite treat_stm1blackrelwhite treat_stblackrelwhite treat_stp1blackrelwhite treat_stp2blackrelwhit
> e i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i
> .quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,734,824,966)

Linear regression                               Number of obs     =    683,919
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5061
                                                Root MSE          =     .39554

                                            (Std. Err. adjusted for 30 clusters in state)
-----------------------------------------------------------------------------------------
                        |               Robust
                 lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
          blackrelwhite |   -.066836   .0066278   -10.08   0.000    -.0803913   -.0532807
             treat_stm4 |  -.0296256   .0064149    -4.62   0.000    -.0427456   -.0165057
             treat_stm3 |   .0096734   .0102103     0.95   0.351    -.0112091    .0305558
             treat_stm2 |  -.0116665   .0092623    -1.26   0.218      -.03061    .0072771
             treat_stm1 |  -.0004838   .0046094    -0.10   0.917     -.009911    .0089435
               treat_st |   -.002455   .0124347    -0.20   0.845    -.0278868    .0229769
             treat_stp1 |  -.0046356    .006912    -0.67   0.508    -.0187721     .009501
             treat_stp2 |  -.0063522   .0071177    -0.89   0.380    -.0209096    .0082053
treat_stm2blackrelwhite |  -.0189297   .0273987    -0.69   0.495    -.0749663    .0371068
treat_stm1blackrelwhite |    .031493   .0328444     0.96   0.346    -.0356813    .0986673
  treat_stblackrelwhite |  -.0322957    .024277    -1.33   0.194    -.0819477    .0173563
treat_stp1blackrelwhite |  -.0186795   .0295935    -0.63   0.533    -.0792049    .0418459
treat_stp2blackrelwhite |   .0259276   .0196389     1.32   0.197    -.0142384    .0660936
                        |
                  state |
                    NH  |   .0572859   .0045061    12.71   0.000     .0480698    .0665019
                    VT  |   .0362919   .0019639    18.48   0.000     .0322752    .0403086
                    MA  |   .1008628    .011431     8.82   0.000     .0774837    .1242419
                    RI  |    .024096   .0119868     2.01   0.054    -.0004197    .0486117
                    CT  |   .1110924   .0113988     9.75   0.000     .0877793    .1344055
                    NY  |   .0639741   .0109755     5.83   0.000     .0415266    .0864217
                    NJ  |   .1277643    .012372    10.33   0.000     .1024608    .1530678
                    PA  |  -.0302177   .0092132    -3.28   0.003    -.0490609   -.0113745
                    OH  |  -.0624155   .0090247    -6.92   0.000     -.080873    -.043958
                    IN  |  -.0588158   .0066284    -8.87   0.000    -.0723725   -.0452591
                    IL  |   .0026172   .0102896     0.25   0.801    -.0184275    .0236619
                    MI  |  -.0116707   .0099422    -1.17   0.250    -.0320048    .0086635
                    WI  |  -.0063631   .0060361    -1.05   0.301    -.0187083    .0059821
                    MN  |   .0489676   .0078401     6.25   0.000     .0329328    .0650024
                    MO  |  -.0820052   .0084431    -9.71   0.000    -.0992733   -.0647371
                    DE  |   .0505648   .0031183    16.22   0.000     .0441872    .0569424
                    MD  |   .0953142   .0120783     7.89   0.000     .0706112    .1200171
                    DC  |   .1494011   .0159208     9.38   0.000     .1168394    .1819629
                    WV  |  -.1446653   .0040147   -36.03   0.000    -.1528762   -.1364544
                    KY  |  -.0878267   .0061522   -14.28   0.000    -.1004093   -.0752441
                    OK  |  -.1248108   .0088744   -14.06   0.000     -.142961   -.1066607
                    MT  |  -.0771141   .0010108   -76.29   0.000    -.0791814   -.0750468
                    CO  |  -.0044738   .0107228    -0.42   0.680    -.0264044    .0174569
                    NM  |  -.0986268   .0071422   -13.81   0.000    -.1132342   -.0840194
                    WA  |   .0583013   .0104538     5.58   0.000     .0369208    .0796818
                    OR  |  -.0053556   .0097948    -0.55   0.589    -.0253881     .014677
                    CA  |   .1243845   .0128704     9.66   0.000     .0980616    .1507073
                    AK  |   .1798652   .0074162    24.25   0.000     .1646974     .195033
                    HI  |   .0732126   .0078475     9.33   0.000     .0571627    .0892626
                        |
                   year |
                  1990  |  -.0047364   .0039594    -1.20   0.241    -.0128342    .0033615
                  1991  |   -.001981   .0042271    -0.47   0.643    -.0106264    .0066644
                  1992  |   .0168749   .0057373     2.94   0.006     .0051408     .028609
                  1993  |   .0136207   .0060732     2.24   0.033     .0011996    .0260418
                  1996  |   .0086001   .0048698     1.77   0.088    -.0013598      .01856
                  1997  |   .0150466   .0048896     3.08   0.005     .0050463     .025047
                  1998  |   .0482967   .0041148    11.74   0.000     .0398809    .0567124
                  1999  |   .0615457   .0055776    11.03   0.000     .0501382    .0729531
                  2000  |   .0731579   .0059636    12.27   0.000      .060961    .0853547
                  2001  |   .0885453   .0055872    15.85   0.000     .0771182    .0999724
                  2002  |    .097742   .0061948    15.78   0.000     .0850722    .1104119
                  2003  |   .1048531   .0061309    17.10   0.000     .0923141    .1173921
                  2004  |   .0970733   .0068768    14.12   0.000     .0830087    .1111379
                  2005  |   .0908351   .0062162    14.61   0.000     .0781214    .1035487
                  2006  |   .0808858   .0059539    13.59   0.000     .0687088    .0930629
                  2007  |   .0791934   .0074891    10.57   0.000     .0638765    .0945103
                  2008  |   .0730291   .0087047     8.39   0.000      .055226    .0908323
                  2009  |    .093325   .0103215     9.04   0.000     .0722152    .1144349
                  2010  |   .0919824   .0092304     9.97   0.000     .0731041    .1108606
                  2011  |   .0730638    .007993     9.14   0.000     .0567163    .0894114
                  2012  |   .0570825   .0071702     7.96   0.000     .0424178    .0717471
                  2013  |   .0608364   .0075149     8.10   0.000     .0454667    .0762061
                  2014  |   .0581071   .0073043     7.96   0.000     .0431682     .073046
                  2015  |   .0713576   .0069704    10.24   0.000     .0571015    .0856136
                  2016  |   .0833522   .0089353     9.33   0.000     .0650775    .1016269
                  2017  |   .0955898   .0090709    10.54   0.000     .0770377    .1141418
                  2018  |   .1015185   .0092667    10.96   0.000     .0825659    .1204711
                  2019  |   .1105317   .0072076    15.34   0.000     .0957904     .125273
                        |
                   nind |
                     2  |   .1109288     .02301     4.82   0.000      .063868    .1579896
                     3  |   .1796221   .0217386     8.26   0.000     .1351616    .2240825
                     4  |  -.0425656   .0229609    -1.85   0.074     -.089526    .0043948
                     5  |   .1958154   .0213961     9.15   0.000     .1520554    .2395753
                     6  |   .1360901   .0236777     5.75   0.000     .0876637    .1845165
                     7  |   .0808052   .0237919     3.40   0.002     .0321452    .1294652
                     8  |   .0282138   .0217752     1.30   0.205    -.0163214     .072749
                     9  |  -.0095445   .0230602    -0.41   0.682    -.0567078    .0376189
                    10  |  -.0414391   .0218824    -1.89   0.068    -.0861936    .0033154
                    11  |   .1150058   .0234144     4.91   0.000     .0671179    .1628937
                        |
                   educ |   .0899442   .0029075    30.94   0.000     .0839977    .0958907
                  exper |   .0485348   .0030829    15.74   0.000     .0422295    .0548401
                 exper2 |  -.0016882   .0001254   -13.46   0.000    -.0019448   -.0014316
                 exper3 |   .0000267   3.63e-06     7.36   0.000     .0000193    .0000341
                 exper4 |  -1.41e-07   3.78e-08    -3.73   0.001    -2.18e-07   -6.37e-08
                   edex |  -.0004078    .000109    -3.74   0.001    -.0006308   -.0001849
                        |
                  ee_cl |
                     2  |  -.1249551    .006978   -17.91   0.000    -.1392266   -.1106836
                     3  |  -.1660944   .0104178   -15.94   0.000    -.1874012   -.1447875
                     4  |  -.1752397   .0168694   -10.39   0.000    -.2097416   -.1407379
                     5  |  -.1637343    .012502   -13.10   0.000    -.1893037   -.1381649
                     6  |   -.166541   .0128932   -12.92   0.000    -.1929106   -.1401714
                     7  |  -.1780961   .0143933   -12.37   0.000    -.2075336   -.1486586
                     8  |  -.1151006   .0183356    -6.28   0.000    -.1526011   -.0776002
                     9  |  -.1531717    .013458   -11.38   0.000    -.1806965   -.1256469
                    10  |  -.1729978    .016076   -10.76   0.000    -.2058768   -.1401187
                    11  |  -.1728918   .0158566   -10.90   0.000    -.2053221   -.1404615
                    12  |  -.1310996   .0147152    -8.91   0.000    -.1611956   -.1010036
                    13  |  -.0939135   .0202259    -4.64   0.000    -.1352802   -.0525469
                    14  |  -.1543336   .0169728    -9.09   0.000    -.1890468   -.1196204
                    15  |  -.1417042   .0168359    -8.42   0.000    -.1761376   -.1072708
                    16  |  -.1228855   .0145325    -8.46   0.000    -.1526078   -.0931632
                        |
                   marr |   .0352193   .0032868    10.72   0.000      .028497    .0419416
                  partt |  -.1455646   .0037181   -39.15   0.000     -.153169   -.1379602
                 public |   .0703185   .0079832     8.81   0.000      .053991     .086646
                   cmsa |   .1528779   .0117348    13.03   0.000     .1288775    .1768783
                        |
                  nocc2 |
                     2  |  -.1272147   .0044524   -28.57   0.000    -.1363209   -.1181086
                     3  |  -.0467586   .0087812    -5.32   0.000    -.0647182   -.0287991
                     4  |  -.2711723   .0079267   -34.21   0.000    -.2873841   -.2549605
                     5  |   .0604168   .0074494     8.11   0.000      .045181    .0756526
                     6  |   -.325169   .0056389   -57.67   0.000    -.3367018   -.3136362
                     7  |  -.3482026   .0053931   -64.56   0.000    -.3592328   -.3371723
                     8  |  -.1602406   .0093048   -17.22   0.000     -.179271   -.1412102
                     9  |  -.4050104   .0069674   -58.13   0.000    -.4192604   -.3907604
                    10  |  -.4073374   .0137242   -29.68   0.000    -.4354065   -.3792683
                    11  |  -.1463982    .010465   -13.99   0.000    -.1678016   -.1249949
                    12  |   -.381549   .0113603   -33.59   0.000    -.4047834   -.3583147
                        |
                  unemp |   .0005203   .0013114     0.40   0.694    -.0021617    .0032024
                        |
                quarter |
                     2  |   .0088167   .0019245     4.58   0.000     .0048806    .0127527
                     3  |   .0159513   .0020496     7.78   0.000     .0117594    .0201431
                     4  |   .0208652   .0014178    14.72   0.000     .0179654     .023765
                        |
                  _cons |   .2872054   .0417984     6.87   0.000      .201718    .3726928
-----------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_stm4 treat_stm3 treat_stm2 treat_stm1 treat_st treat_stp1 treat_stp2 treat_st
> m2blackrelwhite treat_stm1blackrelwhite treat_stblackrelwhite treat_stp1blackrelwhite treat_stp2blackrelwhit
> e i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i
> .quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 4,573,856,658)

Linear regression                               Number of obs     =    528,582
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5476
                                                Root MSE          =     .42207

                                            (Std. Err. adjusted for 30 clusters in state)
-----------------------------------------------------------------------------------------
                        |               Robust
                 lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
          blackrelwhite |  -.1569009   .0050243   -31.23   0.000    -.1671766   -.1466251
             treat_stm4 |  -.0474554   .0120329    -3.94   0.000    -.0720655   -.0228453
             treat_stm3 |   .0057903   .0129655     0.45   0.658    -.0207272    .0323078
             treat_stm2 |   -.001284    .021952    -0.06   0.954    -.0461809    .0436129
             treat_stm1 |   -.006423    .018003    -0.36   0.724    -.0432432    .0303972
               treat_st |   -.000752   .0049208    -0.15   0.880    -.0108161     .009312
             treat_stp1 |   .0230051   .0051407     4.48   0.000     .0124911    .0335191
             treat_stp2 |  -.0084158   .0138659    -0.61   0.549    -.0367747    .0199431
treat_stm2blackrelwhite |   .0320013   .0269178     1.19   0.244    -.0230519    .0870545
treat_stm1blackrelwhite |   .0050757   .0460181     0.11   0.913    -.0890418    .0991932
  treat_stblackrelwhite |   .0073455   .0203308     0.36   0.720    -.0342357    .0489268
treat_stp1blackrelwhite |  -.1049972   .0401589    -2.61   0.014    -.1871314    -.022863
treat_stp2blackrelwhite |   .0661971   .0372966     1.77   0.086     -.010083    .1424773
                        |
                  state |
                    NH  |   .0911016   .0050702    17.97   0.000     .0807318    .1014713
                    VT  |   .0352007   .0022525    15.63   0.000     .0305938    .0398076
                    MA  |   .1160364   .0119813     9.68   0.000     .0915319    .1405408
                    RI  |   .0284836   .0125699     2.27   0.031     .0027753    .0541918
                    CT  |   .1229949   .0119207    10.32   0.000     .0986143    .1473755
                    NY  |   .0718321   .0119451     6.01   0.000     .0474016    .0962626
                    NJ  |   .1525095   .0130426    11.69   0.000     .1258344    .1791847
                    PA  |   .0026133   .0093479     0.28   0.782    -.0165052    .0217318
                    OH  |  -.0298334   .0092914    -3.21   0.003    -.0488365   -.0108304
                    IN  |   .0035908   .0070558     0.51   0.615    -.0108399    .0180215
                    IL  |   .0613813   .0110376     5.56   0.000     .0388068    .0839557
                    MI  |   .0279897   .0105884     2.64   0.013     .0063339    .0496455
                    WI  |   .0196572   .0061599     3.19   0.003     .0070588    .0322555
                    MN  |   .0541212   .0083613     6.47   0.000     .0370205    .0712219
                    MO  |  -.0355312   .0084243    -4.22   0.000    -.0527607   -.0183016
                    DE  |   .0574428   .0023135    24.83   0.000     .0527112    .0621743
                    MD  |   .1287801    .011908    10.81   0.000     .1044255    .1531347
                    DC  |   .1903702   .0172215    11.05   0.000     .1551482    .2255922
                    WV  |  -.0478106   .0056609    -8.45   0.000    -.0593884   -.0362328
                    KY  |  -.0328284   .0062933    -5.22   0.000    -.0456997   -.0199571
                    OK  |  -.0382591   .0111903    -3.42   0.002    -.0611458   -.0153723
                    MT  |  -.0379046   .0017128   -22.13   0.000    -.0414076   -.0344016
                    CO  |   .0423151   .0106881     3.96   0.000     .0204554    .0641748
                    NM  |  -.0201432   .0072756    -2.77   0.010    -.0350235   -.0052628
                    WA  |   .0889697   .0109171     8.15   0.000     .0666417    .1112976
                    OR  |   .0211381   .0100258     2.11   0.044     .0006331    .0416431
                    CA  |   .1500577   .0136256    11.01   0.000     .1221902    .1779251
                    AK  |   .2364235   .0084732    27.90   0.000     .2190938    .2537532
                    HI  |   .1107017   .0083595    13.24   0.000     .0936047    .1277988
                        |
                   year |
                  1990  |  -.0025745   .0037692    -0.68   0.500    -.0102833    .0051344
                  1991  |  -.0105032   .0076894    -1.37   0.182    -.0262297    .0052233
                  1992  |  -.0091727   .0075222    -1.22   0.233    -.0245573    .0062119
                  1993  |  -.0228563   .0055699    -4.10   0.000     -.034248   -.0114646
                  1996  |  -.0262909   .0083728    -3.14   0.004    -.0434153   -.0091666
                  1997  |   -.016629   .0075901    -2.19   0.037    -.0321525   -.0011054
                  1998  |   .0082446   .0064993     1.27   0.215    -.0050479    .0215371
                  1999  |   .0330011   .0086674     3.81   0.001     .0152742    .0507279
                  2000  |   .0466791   .0079147     5.90   0.000     .0304917    .0628665
                  2001  |   .0667992   .0088028     7.59   0.000     .0487955     .084803
                  2002  |   .0766697   .0069581    11.02   0.000     .0624387    .0909007
                  2003  |   .0580965   .0100522     5.78   0.000     .0375374    .0786555
                  2004  |   .0546054   .0087717     6.23   0.000     .0366654    .0725455
                  2005  |   .0371388   .0094136     3.95   0.000     .0178857    .0563918
                  2006  |   .0308009   .0086198     3.57   0.001     .0131713    .0484304
                  2007  |   .0307312   .0097721     3.14   0.004     .0107451    .0507173
                  2008  |   .0272967   .0100497     2.72   0.011     .0067426    .0478507
                  2009  |    .054544   .0159318     3.42   0.002     .0219599    .0871282
                  2010  |   .0448304   .0136519     3.28   0.003     .0169092    .0727516
                  2011  |   .0260195   .0135955     1.91   0.066    -.0017865    .0538255
                  2012  |   .0182748   .0146215     1.25   0.221    -.0116294    .0481791
                  2013  |   .0181081   .0112547     1.61   0.118    -.0049103    .0411265
                  2014  |   .0115362   .0093167     1.24   0.226    -.0075186    .0305911
                  2015  |   .0355608   .0083885     4.24   0.000     .0184043    .0527173
                  2016  |   .0427206   .0100137     4.27   0.000     .0222403    .0632009
                  2017  |   .0503854   .0110319     4.57   0.000     .0278226    .0729483
                  2018  |   .0571771   .0114562     4.99   0.000     .0337466    .0806076
                  2019  |   .0801788   .0104789     7.65   0.000     .0587471    .1016105
                        |
                   nind |
                     2  |   .0719147    .029662     2.42   0.022     .0112492    .1325802
                     3  |   .1142103   .0271615     4.20   0.000     .0586588    .1697619
                     4  |  -.0553812   .0283928    -1.95   0.061     -.113451    .0026885
                     5  |   .1025891   .0270987     3.79   0.001     .0471661    .1580121
                     6  |   .1234352    .032376     3.81   0.001     .0572188    .1896517
                     7  |   .0230631   .0297873     0.77   0.445    -.0378587    .0839849
                     8  |  -.0349457   .0294053    -1.19   0.244    -.0950862    .0251948
                     9  |  -.0642368   .0273791    -2.35   0.026    -.1202334   -.0082401
                    10  |  -.0760552   .0294145    -2.59   0.015    -.1362146   -.0158957
                    11  |   .0837627   .0286304     2.93   0.007     .0252069    .1423184
                        |
                   educ |   .0624594   .0026221    23.82   0.000     .0570965    .0678222
                  exper |    .038076   .0022996    16.56   0.000     .0333729    .0427792
                 exper2 |  -.0007001   .0000943    -7.43   0.000    -.0008929   -.0005073
                 exper3 |  -3.46e-06   2.68e-06    -1.29   0.207    -8.93e-06    2.02e-06
                 exper4 |   1.25e-07   3.15e-08     3.96   0.000     6.05e-08    1.90e-07
                   edex |  -.0001497   .0000822    -1.82   0.079    -.0003178    .0000184
                        |
                  ee_cl |
                     2  |    -.06696   .0058305   -11.48   0.000    -.0788847   -.0550354
                     3  |  -.0808541    .006809   -11.87   0.000      -.09478   -.0669281
                     4  |  -.0304904   .0111368    -2.74   0.010    -.0532677   -.0077131
                     5  |  -.1289392   .0087851   -14.68   0.000    -.1469068   -.1109717
                     6  |  -.0987768   .0070262   -14.06   0.000     -.113147   -.0844065
                     7  |  -.0857289   .0085691   -10.00   0.000    -.1032547   -.0682031
                     8  |   .0311339   .0116366     2.68   0.012     .0073343    .0549335
                     9  |  -.1479187    .009969   -14.84   0.000    -.1683076   -.1275298
                    10  |  -.1099567   .0094328   -11.66   0.000     -.129249   -.0906644
                    11  |  -.0710541   .0091375    -7.78   0.000    -.0897424   -.0523657
                    12  |   .0287338   .0131233     2.19   0.037     .0018936    .0555741
                    13  |  -.0718399   .0129315    -5.56   0.000    -.0982879   -.0453919
                    14  |  -.0792214   .0117001    -6.77   0.000    -.1031509   -.0552919
                    15  |  -.0525007   .0104017    -5.05   0.000    -.0737745   -.0312269
                    16  |   .0196455   .0141056     1.39   0.174    -.0092037    .0484947
                        |
                   marr |    .128104   .0038815    33.00   0.000     .1201655    .1360426
                  partt |  -.2189605   .0043172   -50.72   0.000    -.2277901   -.2101308
                 public |   .0058908   .0057959     1.02   0.318     -.005963    .0177447
                   cmsa |   .1376978   .0115289    11.94   0.000     .1141186    .1612771
                        |
                  nocc2 |
                     2  |  -.1530941   .0045117   -33.93   0.000    -.1623216   -.1438666
                     3  |  -.0446884   .0083485    -5.35   0.000    -.0617631   -.0276138
                     4  |  -.3316038   .0115222   -28.78   0.000    -.3551694   -.3080383
                     5  |  -.0955785   .0118769    -8.05   0.000    -.1198695   -.0712875
                     6  |  -.3989692   .0073937   -53.96   0.000     -.414091   -.3838475
                     7  |  -.2521467   .0083443   -30.22   0.000    -.2692127   -.2350806
                     8  |   -.105196   .0137241    -7.67   0.000    -.1332649   -.0771271
                     9  |   -.444691   .0074784   -59.46   0.000     -.459986   -.4293961
                    10  |  -.3822678   .0077651   -49.23   0.000    -.3981492   -.3663863
                    11  |  -.2761737   .0084407   -32.72   0.000    -.2934369   -.2589105
                    12  |  -.4516458   .0112809   -40.04   0.000    -.4747178   -.4285739
                        |
                  unemp |  -.0031171   .0020432    -1.53   0.138     -.007296    .0010617
                        |
                quarter |
                     2  |   .0014666   .0021912     0.67   0.509    -.0030149     .005948
                     3  |   .0021177   .0025957     0.82   0.421    -.0031911    .0074264
                     4  |   .0140743   .0025506     5.52   0.000     .0088578    .0192908
                        |
                  _cons |    .738371   .0436535    16.91   0.000     .6490896    .8276525
-----------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_stm4 treat_stm3 treat_stm2 treat_stm1 treat_st treat_stp1 treat_stp2 treat_st
> m2blackrelwhite treat_stm1blackrelwhite treat_stblackrelwhite treat_stp1blackrelwhite treat_stp2blackrelwhit
> e i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i
> .quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 4,706,063,449)

Linear regression                               Number of obs     =    561,535
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5113
                                                Root MSE          =     .39643

                                            (Std. Err. adjusted for 30 clusters in state)
-----------------------------------------------------------------------------------------
                        |               Robust
                 lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
          blackrelwhite |  -.0849743   .0070629   -12.03   0.000    -.0994196   -.0705289
             treat_stm4 |  -.0309028   .0070579    -4.38   0.000    -.0453378   -.0164679
             treat_stm3 |   .0190932   .0080487     2.37   0.025     .0026318    .0355545
             treat_stm2 |  -.0206502   .0132323    -1.56   0.129    -.0477133    .0064128
             treat_stm1 |   .0047188   .0059025     0.80   0.431    -.0073531    .0167907
               treat_st |  -.0034521   .0133808    -0.26   0.798     -.030819    .0239148
             treat_stp1 |  -.0005803    .009504    -0.06   0.952    -.0200181    .0188576
             treat_stp2 |  -.0084445   .0058202    -1.45   0.158    -.0203482    .0034592
treat_stm2blackrelwhite |   .0122657   .0282835     0.43   0.668    -.0455806    .0701121
treat_stm1blackrelwhite |   .0259071   .0265527     0.98   0.337    -.0283992    .0802134
  treat_stblackrelwhite |  -.0675361   .0210585    -3.21   0.003    -.1106055   -.0244668
treat_stp1blackrelwhite |  -.0091242   .0243737    -0.37   0.711    -.0589741    .0407257
treat_stp2blackrelwhite |   .0282122   .0146653     1.92   0.064    -.0017817    .0582062
                        |
                  state |
                    NH  |   .0588161   .0045571    12.91   0.000     .0494959    .0681363
                    VT  |   .0456747   .0020662    22.11   0.000      .041449    .0499005
                    MA  |   .0934355   .0116698     8.01   0.000      .069568    .1173031
                    RI  |  -.0026969   .0123139    -0.22   0.828    -.0278817    .0224879
                    CT  |   .0976573   .0115508     8.45   0.000     .0740334    .1212813
                    NY  |   .0403504   .0112975     3.57   0.001     .0172443    .0634564
                    NJ  |   .1065844    .012618     8.45   0.000     .0807777    .1323911
                    PA  |  -.0450599   .0094042    -4.79   0.000    -.0642936   -.0258262
                    OH  |  -.0761419   .0091404    -8.33   0.000    -.0948361   -.0574476
                    IN  |  -.0645801   .0067359    -9.59   0.000    -.0783565   -.0508036
                    IL  |  -.0042398   .0105814    -0.40   0.692    -.0258812    .0174015
                    MI  |   -.040308   .0104142    -3.87   0.001    -.0616073   -.0190086
                    WI  |  -.0158624   .0060123    -2.64   0.013    -.0281588   -.0035659
                    MN  |   .0375072   .0081212     4.62   0.000     .0208974     .054117
                    MO  |  -.0832303   .0084037    -9.90   0.000    -.1004177   -.0660428
                    DE  |   .0397556    .003074    12.93   0.000     .0334685    .0460427
                    MD  |   .0924805   .0118826     7.78   0.000     .0681779    .1167831
                    DC  |   .1568049    .016159     9.70   0.000      .123756    .1898538
                    WV  |  -.1545784   .0040971   -37.73   0.000     -.162958   -.1461988
                    KY  |  -.0873971   .0062116   -14.07   0.000    -.1001012    -.074693
                    OK  |  -.1210107    .008555   -14.15   0.000    -.1385076   -.1035138
                    MT  |  -.0733238   .0010942   -67.01   0.000    -.0755616    -.071086
                    CO  |  -.0008732   .0107619    -0.08   0.936    -.0228837    .0211373
                    NM  |  -.0890337   .0069023   -12.90   0.000    -.1031506   -.0749168
                    WA  |   .0499873   .0109485     4.57   0.000     .0275951    .0723795
                    OR  |   -.011778   .0102597    -1.15   0.260    -.0327614    .0092054
                    CA  |   .1081279   .0134359     8.05   0.000     .0806485    .1356073
                    AK  |   .1676474   .0078802    21.27   0.000     .1515306    .1837642
                    HI  |    .072308    .008153     8.87   0.000     .0556332    .0889828
                        |
                   year |
                  1990  |  -.0054728   .0035954    -1.52   0.139    -.0128261    .0018806
                  1991  |  -.0010692   .0044936    -0.24   0.814    -.0102596    .0081212
                  1992  |   .0198172   .0064718     3.06   0.005     .0065809    .0330535
                  1993  |   .0133023   .0067487     1.97   0.058    -.0005004    .0271049
                  1996  |   .0049619   .0047152     1.05   0.301    -.0046817    .0146055
                  1997  |   .0123564    .005809     2.13   0.042     .0004756    .0242372
                  1998  |   .0508114   .0051987     9.77   0.000     .0401789    .0614439
                  1999  |   .0677254   .0070473     9.61   0.000      .053312    .0821387
                  2000  |   .0819496   .0070539    11.62   0.000     .0675228    .0963763
                  2001  |   .0972361   .0074552    13.04   0.000     .0819884    .1124837
                  2002  |   .1062399   .0072311    14.69   0.000     .0914507    .1210292
                  2003  |   .1184346   .0078922    15.01   0.000     .1022932     .134576
                  2004  |   .1094428   .0088766    12.33   0.000      .091288    .1275976
                  2005  |   .1044643   .0074191    14.08   0.000     .0892906    .1196381
                  2006  |   .0933077   .0069707    13.39   0.000      .079051    .1075645
                  2007  |    .092991   .0080914    11.49   0.000     .0764423    .1095396
                  2008  |   .0858377   .0098352     8.73   0.000     .0657225    .1059529
                  2009  |   .1039759   .0128255     8.11   0.000     .0777448     .130207
                  2010  |    .101376   .0112046     9.05   0.000     .0784601    .1242919
                  2011  |   .0843058   .0105138     8.02   0.000     .0628027    .1058089
                  2012  |   .0708667   .0087263     8.12   0.000     .0530194     .088714
                  2013  |   .0728632   .0092507     7.88   0.000     .0539433    .0917831
                  2014  |   .0736242    .009108     8.08   0.000     .0549962    .0922522
                  2015  |   .0869874   .0076493    11.37   0.000     .0713428     .102632
                  2016  |   .0992301   .0101513     9.78   0.000     .0784684    .1199917
                  2017  |   .1163615   .0099497    11.69   0.000      .096012     .136711
                  2018  |   .1239391   .0102436    12.10   0.000     .1029885    .1448897
                  2019  |   .1336754   .0086004    15.54   0.000     .1160856    .1512652
                        |
                   nind |
                     2  |   .0950773   .0222893     4.27   0.000     .0494905    .1406641
                     3  |    .168369   .0212856     7.91   0.000      .124835     .211903
                     4  |  -.0454835   .0225767    -2.01   0.053    -.0916581    .0006911
                     5  |   .1465963   .0217864     6.73   0.000     .1020381    .1911546
                     6  |   .1322007   .0239085     5.53   0.000     .0833023     .181099
                     7  |   .0813524    .023911     3.40   0.002     .0324489    .1302558
                     8  |   .0304159   .0213938     1.42   0.166    -.0133393    .0741711
                     9  |  -.0365938   .0222492    -1.64   0.111    -.0820985     .008911
                    10  |  -.0400207   .0214812    -1.86   0.073    -.0839547    .0039132
                    11  |   .1387915   .0271332     5.12   0.000     .0832977    .1942852
                        |
                   educ |   .0842221   .0021311    39.52   0.000     .0798635    .0885807
                  exper |   .0474717   .0032296    14.70   0.000     .0408664     .054077
                 exper2 |   -.001613   .0001252   -12.88   0.000    -.0018691   -.0013569
                 exper3 |   .0000248   3.68e-06     6.73   0.000     .0000172    .0000323
                 exper4 |  -1.20e-07   3.80e-08    -3.15   0.004    -1.98e-07   -4.20e-08
                   edex |  -.0004693   .0001213    -3.87   0.001    -.0007174   -.0002213
                        |
                  ee_cl |
                     2  |  -.1177278   .0064802   -18.17   0.000    -.1309813   -.1044743
                     3  |  -.1501141    .008786   -17.09   0.000    -.1680836   -.1321447
                     4  |  -.1452439   .0148723    -9.77   0.000     -.175661   -.1148267
                     5  |  -.1613294   .0126124   -12.79   0.000    -.1871248   -.1355341
                     6  |  -.1587768   .0122074   -13.01   0.000    -.1837437   -.1338098
                     7  |  -.1601522   .0126119   -12.70   0.000    -.1859463    -.134358
                     8  |  -.0699058   .0150373    -4.65   0.000    -.1006606   -.0391509
                     9  |  -.1609911   .0154455   -10.42   0.000    -.1925806   -.1294015
                    10  |   -.164132   .0156945   -10.46   0.000    -.1962309   -.1320332
                    11  |  -.1501698   .0137457   -10.92   0.000    -.1782828   -.1220568
                    12  |  -.0974984   .0121013    -8.06   0.000    -.1222483   -.0727486
                    13  |  -.1152022   .0236702    -4.87   0.000    -.1636132   -.0667912
                    14  |  -.1459392   .0176393    -8.27   0.000    -.1820156   -.1098629
                    15  |  -.1195916   .0156461    -7.64   0.000    -.1515914   -.0875918
                    16  |  -.0951151   .0150558    -6.32   0.000    -.1259077   -.0643224
                        |
                   marr |   .0412638   .0036028    11.45   0.000     .0338952    .0486325
                  partt |  -.1424293   .0030199   -47.16   0.000    -.1486058   -.1362529
                 public |   .0089865   .0077537     1.16   0.256    -.0068715    .0248445
                   cmsa |   .1537594   .0116268    13.22   0.000       .12998    .1775389
                        |
                  nocc2 |
                     2  |   -.134606    .004715   -28.55   0.000    -.1442493   -.1249628
                     3  |   -.045377   .0091311    -4.97   0.000    -.0640522   -.0267018
                     4  |  -.3303312   .0066369   -49.77   0.000    -.3439052   -.3167572
                     5  |   .0348629   .0084601     4.12   0.000       .01756    .0521658
                     6  |  -.3411563   .0059226   -57.60   0.000    -.3532693   -.3290433
                     7  |  -.3694447    .005867   -62.97   0.000     -.381444   -.3574454
                     8  |  -.1725624   .0095097   -18.15   0.000     -.192012   -.1531128
                     9  |   -.432121   .0075999   -56.86   0.000    -.4476645   -.4165774
                    10  |  -.4598457   .0121152   -37.96   0.000    -.4846242   -.4350673
                    11  |  -.2338458   .0110031   -21.25   0.000    -.2563496    -.211342
                    12  |  -.4400715   .0139536   -31.54   0.000    -.4686098   -.4115332
                        |
                  unemp |   .0006259   .0015894     0.39   0.697    -.0026248    .0038765
                        |
                quarter |
                     2  |   .0102131   .0021569     4.74   0.000     .0058017    .0146246
                     3  |    .016163   .0023667     6.83   0.000     .0113225    .0210036
                     4  |   .0220686   .0014015    15.75   0.000     .0192023     .024935
                        |
                  _cons |   .3799534   .0373575    10.17   0.000     .3035487     .456358
-----------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_stm4 treat_stm3 treat_stm2 treat_stm1 treat_st treat_stp1 treat_stp2 treat_st
> m2blackrelwhite treat_stm1blackrelwhite treat_stblackrelwhite treat_stp1blackrelwhite treat_stp2blackrelwhit
> e i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i
> .quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,284,071,771)

Linear regression                               Number of obs     =    147,301
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3498
                                                Root MSE          =     .35716

                                            (Std. Err. adjusted for 30 clusters in state)
-----------------------------------------------------------------------------------------
                        |               Robust
                 lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
          blackrelwhite |  -.1367094   .0126574   -10.80   0.000    -.1625968   -.1108221
             treat_stm4 |  -.0414621   .0158529    -2.62   0.014     -.073885   -.0090393
             treat_stm3 |  -.0199074   .0079545    -2.50   0.018    -.0361762   -.0036385
             treat_stm2 |   .0049296   .0087673     0.56   0.578    -.0130016    .0228608
             treat_stm1 |  -.0056521   .0086751    -0.65   0.520    -.0233946    .0120904
               treat_st |  -.0027786   .0210852    -0.13   0.896    -.0459028    .0403455
             treat_stp1 |   .0113157   .0189611     0.60   0.555     -.027464    .0500955
             treat_stp2 |  -.0115196   .0292288    -0.39   0.696    -.0712992      .04826
treat_stm2blackrelwhite |   .0469364   .0573104     0.82   0.419    -.0702766    .1641494
treat_stm1blackrelwhite |  -.1203142    .045274    -2.66   0.013    -.2129099   -.0277186
  treat_stblackrelwhite |   .0397629   .1145572     0.35   0.731    -.1945329    .2740587
treat_stp1blackrelwhite |   .0222503   .0331513     0.67   0.507    -.0455518    .0900524
treat_stp2blackrelwhite |  -.0159771    .045239    -0.35   0.727    -.1085013    .0765471
                        |
                  state |
                    NH  |   .0350281   .0075528     4.64   0.000     .0195808    .0504754
                    VT  |  -.0222637   .0041607    -5.35   0.000    -.0307733   -.0137541
                    MA  |   .0867671   .0122134     7.10   0.000     .0617879    .1117462
                    RI  |   .0264212   .0126018     2.10   0.045     .0006477    .0521947
                    CT  |   .1338202   .0117549    11.38   0.000     .1097788    .1578616
                    NY  |   .1041137    .009998    10.41   0.000     .0836655    .1245618
                    NJ  |   .1735174   .0116936    14.84   0.000     .1496013    .1974334
                    PA  |  -.0007937   .0082728    -0.10   0.924    -.0177135     .016126
                    OH  |  -.0003179   .0076495    -0.04   0.967    -.0159629    .0153271
                    IN  |   .0290756   .0070211     4.14   0.000     .0147158    .0434354
                    IL  |   .0827431   .0081993    10.09   0.000     .0659735    .0995126
                    MI  |   .0895949   .0080126    11.18   0.000     .0732073    .1059826
                    WI  |   .0259794   .0066603     3.90   0.001     .0123575    .0396013
                    MN  |   .0577421   .0097601     5.92   0.000     .0377804    .0777038
                    MO  |    .018838   .0081747     2.30   0.029     .0021189    .0355571
                    DE  |   .0571689   .0048399    11.81   0.000     .0472702    .0670676
                    MD  |   .1138145   .0110583    10.29   0.000     .0911977    .1364313
                    DC  |   .1242499   .0100677    12.34   0.000     .1036591    .1448406
                    WV  |   .0027328   .0093178     0.29   0.771    -.0163242    .0217898
                    KY  |  -.0156368   .0070624    -2.21   0.035    -.0300811   -.0011925
                    OK  |  -.0317714   .0178736    -1.78   0.086     -.068327    .0047843
                    MT  |  -.0437707   .0043079   -10.16   0.000    -.0525814     -.03496
                    CO  |   .0055485    .011272     0.49   0.626    -.0175053    .0286023
                    NM  |   -.044578   .0093127    -4.79   0.000    -.0636246   -.0255314
                    WA  |   .0992708    .009542    10.40   0.000     .0797552    .1187864
                    OR  |   .0257756   .0091834     2.81   0.009     .0069934    .0445578
                    CA  |    .171074   .0118527    14.43   0.000     .1468325    .1953156
                    AK  |   .2342396   .0083929    27.91   0.000     .2170742     .251405
                    HI  |   .0821719   .0105484     7.79   0.000     .0605979    .1037459
                        |
                   year |
                  1990  |  -.0155653   .0057558    -2.70   0.011    -.0273373   -.0037933
                  1991  |  -.0243993   .0061487    -3.97   0.000    -.0369748   -.0118239
                  1992  |  -.0217784    .007271    -3.00   0.006    -.0366493   -.0069076
                  1993  |  -.0219648   .0055886    -3.93   0.000    -.0333947   -.0105349
                  1996  |  -.0113525   .0060722    -1.87   0.072    -.0237716    .0010665
                  1997  |  -.0002464   .0062045    -0.04   0.969     -.012936    .0124432
                  1998  |   .0035673   .0063855     0.56   0.581    -.0094926    .0166272
                  1999  |   .0139078   .0067045     2.07   0.047     .0001956    .0276201
                  2000  |   .0125745   .0076187     1.65   0.110    -.0030074    .0281564
                  2001  |   .0174339   .0073583     2.37   0.025     .0023845    .0324833
                  2002  |   .0335988   .0080034     4.20   0.000     .0172301    .0499675
                  2003  |   .0421083   .0084573     4.98   0.000     .0248112    .0594055
                  2004  |   .0281743   .0072531     3.88   0.001       .01334    .0430086
                  2005  |   .0246252   .0075968     3.24   0.003      .009088    .0401625
                  2006  |   .0194451   .0109237     1.78   0.086    -.0028964    .0417867
                  2007  |   .0204352   .0133153     1.53   0.136    -.0067976    .0476679
                  2008  |   .0068904   .0083903     0.82   0.418    -.0102698    .0240506
                  2009  |   .0260752   .0134677     1.94   0.063    -.0014692    .0536197
                  2010  |   .0438429   .0143646     3.05   0.005     .0144639    .0732219
                  2011  |   .0241305   .0115858     2.08   0.046     .0004348    .0478262
                  2012  |   .0075241   .0117563     0.64   0.527    -.0165203    .0315685
                  2013  |   .0041897   .0069985     0.60   0.554    -.0101239    .0185033
                  2014  |   .0090587   .0103214     0.88   0.387    -.0120509    .0301684
                  2015  |   .0154374   .0087905     1.76   0.090    -.0025412     .033416
                  2016  |   .0104421   .0103074     1.01   0.319     -.010639    .0315232
                  2017  |   .0314182   .0101198     3.10   0.004     .0107209    .0521155
                  2018  |    .030101    .011147     2.70   0.011     .0073028    .0528992
                  2019  |   .0439614   .0131453     3.34   0.002     .0170762    .0708465
                        |
                   nind |
                     2  |   .0832626   .0312286     2.67   0.012     .0193931    .1471322
                     3  |  -.0585031   .0304098    -1.92   0.064    -.1206981    .0036919
                     4  |  -.2201076   .0347473    -6.33   0.000    -.2911738   -.1490415
                     5  |   .0518453    .030336     1.71   0.098    -.0101989    .1138895
                     6  |  -.0877073   .0343276    -2.56   0.016    -.1579151   -.0174996
                     7  |   -.103727   .0318199    -3.26   0.003    -.1688059    -.038648
                     8  |  -.2036457   .0320071    -6.36   0.000    -.2691075   -.1381838
                     9  |  -.1322382   .0306924    -4.31   0.000    -.1950111   -.0694652
                    10  |  -.1492828   .0524223    -2.85   0.008    -.2564984   -.0420673
                    11  |   .0850882   .0323908     2.63   0.014     .0188415    .1513349
                        |
                   educ |   .0694495    .004787    14.51   0.000     .0596589      .07924
                  exper |   .0690115   .0029183    23.65   0.000      .063043    .0749801
                 exper2 |  -.0025373   .0002019   -12.57   0.000    -.0029501   -.0021244
                 exper3 |   .0000508   5.72e-06     8.88   0.000     .0000391    .0000626
                 exper4 |  -4.12e-07   5.56e-08    -7.40   0.000    -5.25e-07   -2.98e-07
                   edex |  -.0006564   .0001192    -5.50   0.000    -.0009003   -.0004125
                        |
                  ee_cl |
                     2  |   .0635263   .0181172     3.51   0.001     .0264726      .10058
                     3  |   .0498185   .0186298     2.67   0.012     .0117162    .0879208
                     4  |   .0031992   .0243516     0.13   0.896    -.0466054    .0530037
                     5  |   .0185772   .0243619     0.76   0.452    -.0312484    .0684028
                     6  |   .0453182   .0175734     2.58   0.015     .0093765    .0812599
                     7  |   .0516466   .0227348     2.27   0.031     .0051487    .0981445
                     8  |   .0032224   .0225789     0.14   0.888    -.0429566    .0494013
                     9  |   .0313591   .0252677     1.24   0.225    -.0203192    .0830373
                    10  |    .032519   .0210418     1.55   0.133    -.0105163    .0755543
                    11  |    .043752   .0222475     1.97   0.059    -.0017492    .0892531
                    12  |   .0472462   .0238579     1.98   0.057    -.0015488    .0960411
                    13  |   .0584457   .0230157     2.54   0.017     .0113732    .1055182
                    14  |   .0241022   .0220447     1.09   0.283    -.0209843    .0691886
                    15  |   .0390497   .0233794     1.67   0.106    -.0087665     .086866
                    16  |   .0586384   .0214412     2.73   0.011     .0147862    .1024907
                        |
                   marr |   .0638607   .0032168    19.85   0.000     .0572817    .0704398
                  partt |  -.1232075   .0154852    -7.96   0.000    -.1548783   -.0915367
                 public |  -.0496559   .0104385    -4.76   0.000    -.0710049   -.0283069
                   cmsa |   .1158368   .0134441     8.62   0.000     .0883406     .143333
                        |
                  nocc2 |
                     2  |  -.0249238   .0118045    -2.11   0.043    -.0490667   -.0007808
                     3  |  -.0124521   .0154307    -0.81   0.426    -.0440114    .0191072
                     4  |  -.0480727   .0112901    -4.26   0.000    -.0711634   -.0249819
                     5  |   .0345772   .0156165     2.21   0.035     .0026379    .0665164
                     6  |  -.2402132   .0129261   -18.58   0.000      -.26665   -.2137764
                     7  |  -.1877229   .0099809   -18.81   0.000    -.2081362   -.1673096
                     8  |  -.0846793   .0313933    -2.70   0.012    -.1488857   -.0204728
                     9  |  -.2084818   .0087203   -23.91   0.000    -.2263169   -.1906467
                    10  |  -.1445704   .0072284   -20.00   0.000    -.1593541   -.1297867
                    11  |  -.0587514   .0088024    -6.67   0.000    -.0767543   -.0407485
                    12  |  -.1944335   .0078682   -24.71   0.000    -.2105258   -.1783412
                        |
                  unemp |  -.0018434   .0022064    -0.84   0.410    -.0063559    .0026691
                        |
                quarter |
                     2  |   .0000409   .0026807     0.02   0.988    -.0054418    .0055236
                     3  |   .0071462   .0033774     2.12   0.043     .0002387    .0140536
                     4  |    .012578   .0019242     6.54   0.000     .0086426    .0165135
                        |
                  _cons |   .5678246   .0706111     8.04   0.000     .4234088    .7122405
-----------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_stm4 treat_stm3 treat_stm2 treat_stm1 treat_st treat_stp1 treat_stp2 treat_st
> m2blackrelwhite treat_stm1blackrelwhite treat_stblackrelwhite treat_stp1blackrelwhite treat_stp2blackrelwhit
> e i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i
> .quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,020,378,732)

Linear regression                               Number of obs     =    121,161
                                                F(28, 29)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4386
                                                Root MSE          =     .36832

                                            (Std. Err. adjusted for 30 clusters in state)
-----------------------------------------------------------------------------------------
                        |               Robust
                 lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------------+----------------------------------------------------------------
          blackrelwhite |  -.0490319   .0101452    -4.83   0.000    -.0697812   -.0282826
             treat_stm4 |   .0001291   .0167905     0.01   0.994    -.0342113    .0344695
             treat_stm3 |  -.0578426   .0306218    -1.89   0.069    -.1204711     .004786
             treat_stm2 |   .0437812   .0285302     1.53   0.136    -.0145695     .102132
             treat_stm1 |  -.0463275   .0184513    -2.51   0.018    -.0840647   -.0085903
               treat_st |   .0151813   .0394939     0.38   0.703    -.0655928    .0959555
             treat_stp1 |   -.038354   .0419765    -0.91   0.368    -.1242056    .0474976
             treat_stp2 |   .0009279   .0342273     0.03   0.979    -.0690748    .0709307
treat_stm2blackrelwhite |  -.1361447   .0410433    -3.32   0.002    -.2200876   -.0522018
treat_stm1blackrelwhite |   .0849617   .0833974     1.02   0.317    -.0856052    .2555286
  treat_stblackrelwhite |   .0951185   .0514364     1.85   0.075    -.0100807    .2003178
treat_stp1blackrelwhite |  -.0078149   .0747628    -0.10   0.917     -.160722    .1450922
treat_stp2blackrelwhite |   .0033051   .0628418     0.05   0.958    -.1252208     .131831
                        |
                  state |
                    NH  |   .0450562   .0061929     7.28   0.000     .0323903     .057722
                    VT  |   -.008801   .0030923    -2.85   0.008    -.0151255   -.0024765
                    MA  |   .1305771   .0110469    11.82   0.000     .1079837    .1531705
                    RI  |   .1369313   .0118102    11.59   0.000     .1127768    .1610859
                    CT  |   .1679677   .0111105    15.12   0.000     .1452441    .1906912
                    NY  |    .123228   .0096784    12.73   0.000     .1034334    .1430226
                    NJ  |   .2106623   .0109498    19.24   0.000     .1882676    .2330571
                    PA  |   .0368072   .0090917     4.05   0.000     .0182126    .0554018
                    OH  |   .0163713   .0090524     1.81   0.081    -.0021429    .0348854
                    IN  |   .0076556    .009314     0.82   0.418    -.0113937    .0267049
                    IL  |    .037438   .0091217     4.10   0.000      .018782     .056094
                    MI  |   .0931293   .0108571     8.58   0.000      .070924    .1153345
                    WI  |   .0481003    .007921     6.07   0.000     .0319001    .0643005
                    MN  |   .0861373   .0091343     9.43   0.000     .0674554    .1048191
                    MO  |  -.0428639   .0093537    -4.58   0.000    -.0619943   -.0237335
                    DE  |   .1436411   .0070629    20.34   0.000     .1291958    .1580864
                    MD  |   .1619815   .0110654    14.64   0.000     .1393503    .1846127
                    DC  |   .1862268   .0121822    15.29   0.000     .1613115    .2111421
                    WV  |  -.0573585   .0056013   -10.24   0.000    -.0688145   -.0459026
                    KY  |  -.0313204   .0087121    -3.60   0.001    -.0491386   -.0135023
                    OK  |  -.0870367   .0118337    -7.35   0.000    -.1112394   -.0628339
                    MT  |  -.0794188    .003337   -23.80   0.000    -.0862438   -.0725939
                    CO  |   .0048712   .0113093     0.43   0.670    -.0182589    .0280013
                    NM  |  -.0687181   .0064493   -10.66   0.000    -.0819084   -.0555278
                    WA  |   .0865199   .0104795     8.26   0.000      .065087    .1079529
                    OR  |   .0165828   .0090286     1.84   0.077    -.0018829    .0350484
                    CA  |   .1915664   .0104176    18.39   0.000     .1702601    .2128727
                    AK  |   .2283666   .0060208    37.93   0.000     .2160527    .2406805
                    HI  |   .0752264   .0097915     7.68   0.000     .0552005    .0952523
                        |
                   year |
                  1990  |  -.0000732   .0061808    -0.01   0.991    -.0127143    .0125679
                  1991  |  -.0018138   .0095961    -0.19   0.851      -.02144    .0178124
                  1992  |   .0091392   .0135139     0.68   0.504    -.0184999    .0367782
                  1993  |   .0181851   .0114451     1.59   0.123    -.0052228    .0415929
                  1996  |   .0257375   .0095512     2.69   0.012     .0062031    .0452719
                  1997  |   .0291383   .0077053     3.78   0.001     .0133791    .0448974
                  1998  |   .0440784   .0066483     6.63   0.000     .0304811    .0576757
                  1999  |   .0433392   .0069639     6.22   0.000     .0290964    .0575819
                  2000  |   .0357178   .0077173     4.63   0.000     .0199342    .0515014
                  2001  |   .0540588   .0084477     6.40   0.000     .0367813    .0713362
                  2002  |   .0644435   .0080864     7.97   0.000      .047905    .0809821
                  2003  |   .0533451   .0072477     7.36   0.000     .0385219    .0681683
                  2004  |   .0535742   .0089902     5.96   0.000     .0351871    .0719613
                  2005  |   .0412365   .0107315     3.84   0.001     .0192881     .063185
                  2006  |   .0391884   .0087652     4.47   0.000     .0212615    .0571152
                  2007  |   .0325965   .0089759     3.63   0.001     .0142386    .0509544
                  2008  |   .0303532    .014905     2.04   0.051     -.000131    .0608375
                  2009  |   .0622435   .0176787     3.52   0.001     .0260865    .0984005
                  2010  |   .0709164   .0176029     4.03   0.000     .0349144    .1069184
                  2011  |   .0415708   .0162284     2.56   0.016       .00838    .0747616
                  2012  |   .0195419   .0138136     1.41   0.168      -.00871    .0477938
                  2013  |   .0299721   .0127077     2.36   0.025     .0039819    .0559622
                  2014  |   .0139849    .021548     0.65   0.521    -.0300857    .0580555
                  2015  |   .0263909    .015702     1.68   0.104    -.0057233    .0585051
                  2016  |   .0351604   .0091521     3.84   0.001     .0164423    .0538785
                  2017  |    .022107   .0119682     1.85   0.075    -.0023707    .0465848
                  2018  |   .0241239   .0096242     2.51   0.018     .0044401    .0438077
                  2019  |   .0281306   .0088071     3.19   0.003      .010118    .0461432
                        |
                   nind |
                     2  |   .0773522   .0640899     1.21   0.237    -.0537263    .2084308
                     3  |   .0564924     .04702     1.20   0.239    -.0396743    .1526592
                     4  |  -.2253867   .0625143    -3.61   0.001    -.3532427   -.0975306
                     5  |   .1319448   .0536634     2.46   0.020     .0221908    .2416989
                     6  |  -.0379317   .0591209    -0.64   0.526    -.1588475    .0829841
                     7  |  -.0932704   .0570017    -1.64   0.113    -.2098519    .0233111
                     8  |  -.1224971   .0606748    -2.02   0.053    -.2465909    .0015967
                     9  |  -.1558842   .0549031    -2.84   0.008    -.2681736   -.0435947
                    10  |  -.1295148   .0769739    -1.68   0.103    -.2869441    .0279144
                    11  |   .0148977   .0579582     0.26   0.799      -.10364    .1334355
                        |
                   educ |   .1051928   .0063651    16.53   0.000     .0921746    .1182109
                  exper |   .0509881    .003823    13.34   0.000     .0431692     .058807
                 exper2 |  -.0017405   .0002818    -6.18   0.000    -.0023169   -.0011641
                 exper3 |   .0000301   9.62e-06     3.13   0.004     .0000104    .0000498
                 exper4 |  -2.00e-07   1.08e-07    -1.85   0.074    -4.20e-07    2.07e-08
                   edex |  -.0004468   .0001465    -3.05   0.005    -.0007464   -.0001472
                        |
                  ee_cl |
                     2  |  -.0692525   .0153857    -4.50   0.000    -.1007199   -.0377852
                     3  |  -.1311503   .0194481    -6.74   0.000    -.1709261   -.0913746
                     4  |   -.194454   .0352465    -5.52   0.000    -.2665413   -.1223668
                     5  |  -.0807364   .0265256    -3.04   0.005    -.1349873   -.0264856
                     6  |  -.1107064   .0183726    -6.03   0.000    -.1482825   -.0731303
                     7  |   -.157505   .0234642    -6.71   0.000    -.2054948   -.1095153
                     8  |  -.1873884   .0377187    -4.97   0.000    -.2645319    -.110245
                     9  |  -.0650661   .0169791    -3.83   0.001    -.0997923   -.0303399
                    10  |  -.1369776   .0252832    -5.42   0.000    -.1886876   -.0852677
                    11  |  -.1773214   .0261568    -6.78   0.000    -.2308181   -.1238248
                    12  |  -.1723827   .0332147    -5.19   0.000    -.2403143   -.1044511
                    13  |    -.01433   .0235404    -0.61   0.547    -.0624755    .0338156
                    14  |  -.1314094    .022478    -5.85   0.000    -.1773822   -.0854366
                    15  |  -.1442849   .0275841    -5.23   0.000    -.2007008    -.087869
                    16  |  -.1479142   .0327817    -4.51   0.000    -.2149604    -.080868
                        |
                   marr |   .0076244   .0043291     1.76   0.089    -.0012295    .0164784
                  partt |  -.0738454   .0062915   -11.74   0.000    -.0867129   -.0609778
                 public |   .0204301   .0150374     1.36   0.185    -.0103248    .0511849
                   cmsa |   .1236776   .0117236    10.55   0.000     .0997001     .147655
                        |
                  nocc2 |
                     2  |    -.03563   .0108698    -3.28   0.003    -.0578613   -.0133988
                     3  |  -.0174678    .016118    -1.08   0.287    -.0504328    .0154971
                     4  |  -.0918408   .0106615    -8.61   0.000    -.1136461   -.0700355
                     5  |    .157392   .0169652     9.28   0.000     .1226942    .1920897
                     6  |  -.2262718   .0113254   -19.98   0.000    -.2494348   -.2031089
                     7  |  -.2364385   .0269845    -8.76   0.000    -.2916281   -.1812489
                     8  |  -.0931038   .0579473    -1.61   0.119    -.2116194    .0254118
                     9  |  -.2881041   .0166861   -17.27   0.000     -.322231   -.2539773
                    10  |  -.2587088   .0219212   -11.80   0.000    -.3035428   -.2138749
                    11  |   .0175125    .023623     0.74   0.464     -.030802     .065827
                    12  |  -.2356212    .015793   -14.92   0.000    -.2679215   -.2033208
                        |
                  unemp |  -.0010924   .0017831    -0.61   0.545    -.0047392    .0025544
                        |
                quarter |
                     2  |   .0043583   .0030344     1.44   0.162    -.0018478    .0105644
                     3  |    .014935   .0029518     5.06   0.000     .0088979    .0209721
                     4  |   .0195293   .0034357     5.68   0.000     .0125024    .0265562
                        |
                  _cons |    .151788   .0595969     2.55   0.016     .0298986    .2736775
-----------------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagpta.log
  log type:  text
 closed on:  15 Mar 2021, 02:42:38
--------------------------------------------------------------------------------------------------------------
