-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-ptaplot.log
  log type:  text
 opened on:   2 Apr 2021, 13:46:11

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt public marr hisprace hi
> spracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effective; signed Dec2012) Ma
> r1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82) //incl Idaho wh
> ich changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. gen lyear = year - 1900

. 
. gen r2wstates = 0 if neverr2w == 1
(1,463,937 missing values generated)

.         replace r2wstates = 1 if alwaysr2w == 1
(1,149,124 real changes made)

.         replace r2wstates = 73 if state == 73
(35,302 real changes made)

.         replace r2wstates = 32 if state == 32
(46,817 real changes made)

.         replace r2wstates = 34 if state == 34
(94,533 real changes made)

.         replace r2wstates = 35 if state == 35
(62,707 real changes made)

.         replace r2wstates = 55 if state == 55
(35,853 real changes made)

.         replace r2wstates = 61 if state == 61
(39,601 real changes made)

. 
. ** pta - wv dropped in did, common support MT, ME, NH, VT
. drop if inlist(state, 81, 11, 12, 13)
(179,357 observations deleted)

. 
. preserve

. 
. keep if female == 0 & blackrelwhite == 0
(1,705,327 observations deleted)

. 
. reg lwage3 i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 i.quarter [aw = fina
> lwt1] if female == 0 & blackrelwhite == 0, vce(cluster state)
(sum of wgt is 8,004,519,352)

Linear regression                               Number of obs     =    917,606
                                                F(45, 46)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5054
                                                Root MSE          =      .4194

                                 (Std. Err. adjusted for 47 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |
         RI  |  -.0883679   .0009763   -90.51   0.000    -.0903332   -.0864026
         CT  |   .0113622   .0004511    25.19   0.000     .0104543    .0122702
         NY  |   -.021171   .0012625   -16.77   0.000    -.0237123   -.0186298
         NJ  |    .055081   .0009168    60.08   0.000     .0532356    .0569264
         PA  |  -.1117169   .0022526   -49.60   0.000     -.116251   -.1071827
         OH  |  -.1376823   .0026962   -51.07   0.000    -.1431095   -.1322551
         IN  |  -.1226715   .0043314   -28.32   0.000    -.1313901   -.1139529
         IL  |  -.0378179   .0015006   -25.20   0.000    -.0408385   -.0347974
         MI  |  -.0854551    .002672   -31.98   0.000    -.0908335   -.0800767
         WI  |   -.102415   .0040689   -25.17   0.000    -.1106053   -.0942248
         MN  |  -.0511586   .0025603   -19.98   0.000    -.0563123   -.0460049
         IA  |  -.1347453   .0067412   -19.99   0.000    -.1483147   -.1211759
         MO  |  -.1413892   .0028317   -49.93   0.000    -.1470891   -.1356892
         ND  |  -.1256909    .009143   -13.75   0.000    -.1440947   -.1072871
         SD  |  -.1924472   .0082847   -23.23   0.000    -.2091235    -.175771
         NE  |  -.1818829   .0043274   -42.03   0.000    -.1905935   -.1731723
         KS  |  -.1611426   .0036847   -43.73   0.000    -.1685595   -.1537258
         DE  |  -.0672268   .0097445    -6.90   0.000    -.0868416   -.0476121
         MD  |   .0010656   .0016375     0.65   0.518    -.0022305    .0043617
         DC  |   .0885007   .0059314    14.92   0.000     .0765613    .1004401
         VA  |  -.0295055   .0016324   -18.08   0.000    -.0327913   -.0262198
         WV  |  -.1684967   .0078546   -21.45   0.000    -.1843072   -.1526861
         NC  |  -.1556399   .0031266   -49.78   0.000    -.1619334   -.1493465
         SC  |  -.1739876   .0031177   -55.81   0.000    -.1802632   -.1677121
         GA  |  -.1063645   .0019378   -54.89   0.000    -.1102651   -.1024638
         FL  |  -.1711243   .0011049  -154.88   0.000    -.1733484   -.1689003
         KY  |  -.1681877   .0047782   -35.20   0.000    -.1778058   -.1585696
         TN  |  -.1935167   .0031146   -62.13   0.000    -.1997862   -.1872473
         AL  |  -.1583417    .003996   -39.62   0.000    -.1663853   -.1502982
         MS  |  -.1859875   .0060593   -30.69   0.000    -.1981843   -.1737907
         AR  |  -.2324452   .0051547   -45.09   0.000     -.242821   -.2220694
         LA  |  -.1264904   .0021523   -58.77   0.000    -.1308227   -.1221581
         OK  |  -.1961767   .0027908   -70.29   0.000    -.2017943   -.1905591
         TX  |   -.097117   .0013198   -73.59   0.000    -.0997735   -.0944604
         ID  |  -.1567872   .0057175   -27.42   0.000     -.168296   -.1452784
         WY  |   .0062606   .0096134     0.65   0.518    -.0130902    .0256114
         CO  |  -.0840091   .0009318   -90.16   0.000    -.0858846   -.0821335
         NM  |  -.1586059   .0035455   -44.73   0.000    -.1657425   -.1514692
         AZ  |  -.1281589   .0007923  -161.75   0.000    -.1297538   -.1265641
         UT  |  -.1524806   .0013457  -113.31   0.000    -.1551893    -.149772
         NV  |  -.0495608   .0019442   -25.49   0.000    -.0534743   -.0456473
         WA  |  -.0234934   .0013368   -17.57   0.000    -.0261843   -.0208026
         OR  |  -.0955354   .0020282   -47.10   0.000     -.099618   -.0914528
         CA  |   .0379761   .0006493    58.49   0.000     .0366692     .039283
         AK  |   .1209402   .0045113    26.81   0.000     .1118594     .130021
         HI  |  -.0026996   .0035527    -0.76   0.451    -.0098508    .0044516
             |
        year |
       1990  |  -.0126601   .0027055    -4.68   0.000     -.018106   -.0072142
       1991  |  -.0266245   .0036218    -7.35   0.000    -.0339147   -.0193342
       1992  |   -.025682    .003384    -7.59   0.000    -.0324936   -.0188704
       1993  |  -.0344753   .0035819    -9.62   0.000    -.0416854   -.0272653
       1996  |  -.0360429   .0053371    -6.75   0.000     -.046786   -.0252999
       1997  |   -.020212   .0052073    -3.88   0.000    -.0306938   -.0097303
       1998  |   .0012977   .0050126     0.26   0.797    -.0087922    .0113877
       1999  |   .0245216   .0059298     4.14   0.000     .0125856    .0364577
       2000  |   .0329201   .0055923     5.89   0.000     .0216635    .0441767
       2001  |   .0478778   .0061391     7.80   0.000     .0355204    .0602353
       2002  |   .0532908   .0056422     9.44   0.000     .0419336     .064648
       2003  |   .0419379   .0059855     7.01   0.000     .0298896    .0539861
       2004  |   .0338608   .0055846     6.06   0.000     .0226196    .0451021
       2005  |    .022845   .0060932     3.75   0.000     .0105799      .03511
       2006  |   .0185271   .0063748     2.91   0.006     .0056954    .0313588
       2007  |   .0199072   .0071333     2.79   0.008     .0055486    .0342658
       2008  |   .0156156   .0079429     1.97   0.055    -.0003726    .0316038
       2009  |   .0280686   .0082298     3.41   0.001      .011503    .0446342
       2010  |   .0167415   .0082242     2.04   0.048     .0001871    .0332958
       2011  |  -.0051196   .0072395    -0.71   0.483     -.019692    .0094527
       2012  |  -.0093197    .009161    -1.02   0.314    -.0277598    .0091203
       2013  |  -.0100807   .0095678    -1.05   0.298    -.0293398    .0091783
       2014  |  -.0117678   .0090944    -1.29   0.202    -.0300738    .0065382
       2015  |   .0083234    .007958     1.05   0.301    -.0076951     .024342
       2016  |   .0209333    .008375     2.50   0.016     .0040753    .0377914
       2017  |   .0274156   .0087085     3.15   0.003     .0098862    .0449449
       2018  |   .0396584    .008582     4.62   0.000     .0223837    .0569331
       2019  |   .0552068   .0080422     6.86   0.000     .0390186     .071395
             |
        nind |
          2  |   .0828628   .0271503     3.05   0.004     .0282121    .1375135
          3  |   .0973077   .0225837     4.31   0.000      .051849    .1427663
          4  |   -.088216   .0241512    -3.65   0.001    -.1368298   -.0396023
          5  |    .135772   .0233376     5.82   0.000     .0887959    .1827481
          6  |   .0981224   .0265836     3.69   0.001     .0446124    .1516323
          7  |   .0026541   .0253062     0.10   0.917    -.0482846    .0535927
          8  |   -.056774   .0240814    -2.36   0.023    -.1052474   -.0083007
          9  |  -.0676504   .0276143    -2.45   0.018    -.1232351   -.0120656
         10  |  -.1026804   .0267104    -3.84   0.000    -.1564456   -.0489151
         11  |   .1097931   .0263891     4.16   0.000     .0566747    .1629116
             |
        educ |   .0674804   .0019359    34.86   0.000     .0635837    .0713771
       exper |   .0453273   .0019136    23.69   0.000     .0414754    .0491791
      exper2 |  -.0009999   .0001142    -8.76   0.000    -.0012297   -.0007701
      exper3 |   5.60e-06   3.41e-06     1.64   0.107    -1.25e-06    .0000125
      exper4 |   2.61e-08   3.64e-08     0.72   0.478    -4.72e-08    9.94e-08
        edex |  -.0003327   .0000594    -5.60   0.000    -.0004523   -.0002131
             |
       ee_cl |
          2  |  -.0605788   .0052566   -11.52   0.000    -.0711598   -.0499978
          3  |  -.0693689     .00727    -9.54   0.000    -.0840027   -.0547351
          4  |  -.0245523   .0121928    -2.01   0.050    -.0490951   -9.47e-06
          5  |  -.1286339   .0069599   -18.48   0.000    -.1426434   -.1146244
          6  |  -.0784801   .0062591   -12.54   0.000    -.0910791   -.0658811
          7  |  -.0602692   .0077841    -7.74   0.000    -.0759377   -.0446007
          8  |    .028787   .0130159     2.21   0.032     .0025872    .0549867
          9  |   -.141516   .0085342   -16.58   0.000    -.1586945   -.1243374
         10  |  -.0875569   .0080553   -10.87   0.000    -.1037714   -.0713425
         11  |  -.0554898    .009298    -5.97   0.000    -.0742057    -.036774
         12  |   .0264978   .0130343     2.03   0.048     .0002612    .0527344
         13  |  -.0531192   .0117435    -4.52   0.000    -.0767576   -.0294809
         14  |  -.0641336   .0099825    -6.42   0.000    -.0842273   -.0440398
         15  |  -.0446123   .0104887    -4.25   0.000    -.0657249   -.0234997
         16  |   .0232513   .0137484     1.69   0.098    -.0044227    .0509253
             |
        marr |   .1269483   .0023042    55.09   0.000     .1223102    .1315864
       partt |  -.2113737   .0062081   -34.05   0.000    -.2238699   -.1988774
      public |   .0057352   .0069249     0.83   0.412    -.0082039    .0196743
        cmsa |   .1461882   .0092529    15.80   0.000     .1275632    .1648133
             |
       nocc2 |
          2  |  -.1400583    .003598   -38.93   0.000    -.1473008   -.1328159
          3  |    -.04106   .0062095    -6.61   0.000    -.0535591   -.0285609
          4  |  -.2937837   .0105259   -27.91   0.000    -.3149714   -.2725961
          5  |  -.0764523   .0076318   -10.02   0.000    -.0918143   -.0610903
          6  |  -.3705518   .0063964   -57.93   0.000    -.3834271   -.3576766
          7  |  -.2199363   .0054878   -40.08   0.000    -.2309827   -.2088898
          8  |  -.0974968   .0110491    -8.82   0.000    -.1197376   -.0752561
          9  |  -.3806295   .0036053  -105.58   0.000    -.3878865   -.3733725
         10  |  -.3247203   .0048523   -66.92   0.000    -.3344874   -.3149532
         11  |  -.2203868   .0054532   -40.41   0.000    -.2313635   -.2094102
         12  |  -.3764307   .0059736   -63.02   0.000    -.3884548   -.3644065
             |
     quarter |
          2  |   .0035433    .001987     1.78   0.081    -.0004563    .0075429
          3  |    .004762   .0018563     2.57   0.014     .0010254    .0084986
          4  |   .0150628   .0015962     9.44   0.000     .0118498    .0182758
             |
       _cons |   .7416043   .0320939    23.11   0.000     .6770026     .806206
------------------------------------------------------------------------------

. predict plwage3
(option xb assumed; fitted values)
(225,841 missing values generated)

. 
. keep plwage3 year r2wstates finalwt1

. 
. collapse (sum) stweight = finalwt1 (mean) plwage3 [aw = finalwt1], by(year r2wstates)

.         
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 73), ///
>                 legend(label(1 "Never RTW States") label(2 "Oklahoma")) ///
>                 title("Oklahoma (2001) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2001, lcolor(red)) xlabel(1989(2)2019)

.                 
. graph export "$figs/pta/wm_ok.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_ok.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 32), ///
>                 legend(label(1 "Never RTW States") label(2 "Indiana")) ///
>                 title("Indiana (2012) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2012, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/wm_in.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_in.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 34), ///
>                 legend(label(1 "Never RTW States") label(2 "Michigan")) ///
>                 title("Michigan (2013) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2013, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/wm_mi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_mi.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 35), ///
>                 legend(label(1 "Never RTW States") label(2 "Wisconsin")) ///
>                 title("Wisconsin (2015) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2015, lcolor(red)) xlabel(1989(2)2019)                            

. 
. graph export "$figs/pta/wm_wi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_wi.png written in PNG format)

.                 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 55), ///
>                 legend(label(1 "Never RTW States") label(2 "West Virginia")) ///
>                 title("West Virginia (2016) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2016, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/wm_wv.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_wv.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 61), ///
>                 legend(label(1 "Never RTW States") label(2 "Kentucky")) ///
>                 title("Kentucky (2017) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2017, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/wm_ky.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_ky.png written in PNG format)

. 
. restore

. 
. preserve

. 
. keep if female == 0 & blackrelwhite == 1
(2,734,766 observations deleted)

. 
. reg lwage3 i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 i.quarter [aw = fina
> lwt1] if female == 0 & blackrelwhite == 1, vce(cluster state)
(sum of wgt is 1,093,094,867)

Linear regression                               Number of obs     =     98,253
                                                F(45, 46)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4481
                                                Root MSE          =     .40239

                                 (Std. Err. adjusted for 47 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |
         RI  |  -.0724413   .0015249   -47.51   0.000    -.0755108   -.0693718
         CT  |    .044083   .0022682    19.43   0.000     .0395173    .0486487
         NY  |   .0194227   .0020935     9.28   0.000     .0152087    .0236368
         NJ  |   .0438356   .0015399    28.47   0.000      .040736    .0469352
         PA  |   -.043687   .0019869   -21.99   0.000    -.0476864   -.0396877
         OH  |  -.1018327   .0022843   -44.58   0.000    -.1064307   -.0972347
         IN  |  -.0642273   .0027244   -23.57   0.000    -.0697112   -.0587433
         IL  |  -.0210437   .0021205    -9.92   0.000    -.0253119   -.0167754
         MI  |   .0009623   .0033533     0.29   0.775    -.0057876    .0077122
         WI  |  -.0998471   .0023271   -42.91   0.000    -.1045313   -.0951629
         MN  |  -.0379055   .0018035   -21.02   0.000    -.0415358   -.0342752
         IA  |  -.0758398   .0061777   -12.28   0.000    -.0882748   -.0634047
         MO  |  -.0939935   .0017211   -54.61   0.000     -.097458   -.0905291
         ND  |   .0603265   .0154584     3.90   0.000     .0292104    .0914426
         SD  |  -.1557262   .0083419   -18.67   0.000    -.1725175   -.1389349
         NE  |  -.0752576   .0023699   -31.76   0.000     -.080028   -.0704872
         KS  |  -.0945708   .0041133   -22.99   0.000    -.1028504   -.0862912
         DE  |  -.0260391   .0167152    -1.56   0.126    -.0596849    .0076068
         MD  |   .0550012   .0017949    30.64   0.000     .0513883     .058614
         DC  |   .0416039   .0034807    11.95   0.000     .0345975    .0486103
         VA  |  -.0518888    .003376   -15.37   0.000    -.0586842   -.0450934
         WV  |  -.0681668   .0118328    -5.76   0.000     -.091985   -.0443487
         NC  |  -.1215697   .0055064   -22.08   0.000    -.1326536   -.1104859
         SC  |  -.1580563   .0073619   -21.47   0.000    -.1728749   -.1432376
         GA  |  -.0780497   .0034724   -22.48   0.000    -.0850392   -.0710602
         FL  |  -.1511913   .0016221   -93.21   0.000    -.1544565   -.1479262
         KY  |  -.0989649   .0044271   -22.35   0.000    -.1078763   -.0900536
         TN  |  -.1445353   .0030134   -47.96   0.000     -.150601   -.1384696
         AL  |  -.1809172   .0064619   -28.00   0.000    -.1939243   -.1679101
         MS  |  -.2035944   .0102163   -19.93   0.000    -.2241588     -.18303
         AR  |  -.2225833   .0077888   -28.58   0.000    -.2382613   -.2069053
         LA  |  -.1619304    .003849   -42.07   0.000    -.1696781   -.1541827
         OK  |  -.1759177   .0031193   -56.40   0.000    -.1821966   -.1696388
         TX  |  -.0920719   .0019398   -47.46   0.000    -.0959765   -.0881672
         ID  |  -.2128726   .0043584   -48.84   0.000    -.2216457   -.2040995
         WY  |    .146498    .015628     9.37   0.000     .1150404    .1779556
         CO  |  -.0909606   .0016299   -55.81   0.000    -.0942414   -.0876799
         NM  |  -.0546127   .0071006    -7.69   0.000    -.0689055   -.0403198
         AZ  |  -.0982225   .0015506   -63.34   0.000    -.1013437   -.0951013
         UT  |   -.116936   .0032428   -36.06   0.000    -.1234635   -.1104086
         NV  |   -.014223   .0024012    -5.92   0.000    -.0190563   -.0093896
         WA  |   .0447161   .0014051    31.82   0.000     .0418879    .0475444
         OR  |  -.0602514   .0024831   -24.26   0.000    -.0652497   -.0552531
         CA  |   .0771421   .0014603    52.83   0.000     .0742027    .0800815
         AK  |   .1246674   .0058985    21.14   0.000     .1127943    .1365405
         HI  |    .019012   .0034393     5.53   0.000     .0120891    .0259349
             |
        year |
       1990  |  -.0154399   .0073795    -2.09   0.042     -.030294   -.0005858
       1991  |   -.029633   .0087195    -3.40   0.001    -.0471844   -.0120816
       1992  |  -.0399021   .0072318    -5.52   0.000    -.0544591   -.0253452
       1993  |  -.0367804   .0074253    -4.95   0.000    -.0517269    -.021834
       1996  |    -.04305   .0106932    -4.03   0.000    -.0645742   -.0215258
       1997  |  -.0232977   .0127074    -1.83   0.073    -.0488764     .002281
       1998  |   .0084586   .0111829     0.76   0.453    -.0140514    .0309686
       1999  |   .0284989   .0115943     2.46   0.018     .0051607     .051837
       2000  |   .0283453   .0104484     2.71   0.009     .0073138    .0493768
       2001  |   .0419861   .0089195     4.71   0.000     .0240321      .05994
       2002  |   .0511818   .0133135     3.84   0.000      .024383    .0779806
       2003  |   .0548638   .0123149     4.46   0.000     .0300751    .0796524
       2004  |    .049417   .0149843     3.30   0.002     .0192551     .079579
       2005  |   .0120821   .0134649     0.90   0.374    -.0150212    .0391855
       2006  |    .007287   .0087375     0.83   0.409    -.0103008    .0248747
       2007  |   .0087164   .0137032     0.64   0.528    -.0188667    .0362995
       2008  |  -.0009241   .0100692    -0.09   0.927    -.0211925    .0193442
       2009  |   .0116322   .0132155     0.88   0.383    -.0149693    .0382336
       2010  |   .0198496   .0136291     1.46   0.152    -.0075844    .0472836
       2011  |  -.0074344   .0151316    -0.49   0.626    -.0378927    .0230239
       2012  |   .0010632   .0129017     0.08   0.935    -.0249066    .0270331
       2013  |  -.0213581   .0143939    -1.48   0.145    -.0503315    .0076154
       2014  |  -.0249437   .0167572    -1.49   0.143    -.0586743    .0087868
       2015  |  -.0015636   .0123455    -0.13   0.900    -.0264139    .0232867
       2016  |   .0206719   .0147839     1.40   0.169    -.0090865    .0504303
       2017  |   .0164923   .0152672     1.08   0.286     -.014239    .0472236
       2018  |   .0094222   .0134761     0.70   0.488    -.0177039    .0365482
       2019  |    .057744   .0162549     3.55   0.001     .0250247    .0904633
             |
        nind |
          2  |   .0827594   .0318272     2.60   0.012     .0186945    .1468243
          3  |   .1574918   .0307979     5.11   0.000     .0954987    .2194848
          4  |  -.0197329   .0353987    -0.56   0.580    -.0909868    .0515209
          5  |   .1930325   .0371779     5.19   0.000     .1181973    .2678678
          6  |   .0940367   .0324791     2.90   0.006     .0286596    .1594138
          7  |  -.0037449   .0376434    -0.10   0.921    -.0795172    .0720274
          8  |  -.0381776   .0403696    -0.95   0.349    -.1194374    .0430821
          9  |  -.0109738   .0384206    -0.29   0.776    -.0883104    .0663629
         10  |  -.0367065   .0375177    -0.98   0.333    -.1122257    .0388128
         11  |   .1861112    .038338     4.85   0.000     .1089407    .2632816
             |
        educ |   .0645017   .0041897    15.40   0.000     .0560684    .0729351
       exper |   .0376256   .0030111    12.50   0.000     .0315646    .0436865
      exper2 |  -.0005688   .0001941    -2.93   0.005    -.0009596    -.000178
      exper3 |   3.24e-06   6.08e-06     0.53   0.596    -9.00e-06    .0000155
      exper4 |   5.95e-09   6.27e-08     0.09   0.925    -1.20e-07    1.32e-07
        edex |  -.0008354   .0001189    -7.02   0.000    -.0010748    -.000596
             |
       ee_cl |
          2  |  -.0457086   .0087578    -5.22   0.000    -.0633372     -.02808
          3  |  -.0334094   .0144876    -2.31   0.026    -.0625715   -.0042474
          4  |   .0221601   .0248241     0.89   0.377    -.0278082    .0721285
          5  |  -.1210372   .0128604    -9.41   0.000    -.1469239   -.0951506
          6  |  -.0770311    .013129    -5.87   0.000    -.1034583   -.0506038
          7  |  -.0202074   .0164605    -1.23   0.226    -.0533407    .0129258
          8  |   .0554012   .0249355     2.22   0.031     .0052087    .1055938
          9  |  -.1545393   .0140236   -11.02   0.000    -.1827672   -.1263113
         10  |  -.0930801   .0165148    -5.64   0.000    -.1263226   -.0598376
         11  |  -.0227846   .0183476    -1.24   0.221    -.0597164    .0141471
         12  |   .0767088   .0191371     4.01   0.000     .0381879    .1152297
         13  |  -.1395444   .0145895    -9.56   0.000    -.1689117   -.1101772
         14  |  -.0902572   .0159401    -5.66   0.000     -.122343   -.0581713
         15  |  -.0200518   .0133599    -1.50   0.140    -.0469438    .0068402
         16  |   .0708494   .0202553     3.50   0.001     .0300775    .1116212
             |
        marr |   .0991076   .0045435    21.81   0.000      .089962    .1082532
       partt |  -.1947004   .0108088   -18.01   0.000    -.2164574   -.1729434
      public |    .072983   .0131314     5.56   0.000     .0465508    .0994151
        cmsa |   .1262412   .0148375     8.51   0.000     .0963748    .1561076
             |
       nocc2 |
          2  |   -.117465    .011375   -10.33   0.000    -.1403616   -.0945684
          3  |   .0175614   .0089654     1.96   0.056     -.000485    .0356078
          4  |  -.2353049   .0121102   -19.43   0.000    -.2596816   -.2109283
          5  |  -.0680626   .0141588    -4.81   0.000    -.0965627   -.0395625
          6  |  -.3328414   .0103521   -32.15   0.000    -.3536792   -.3120037
          7  |  -.3027525   .0142844   -21.19   0.000    -.3315056   -.2739994
          8  |  -.1417478   .0273127    -5.19   0.000    -.1967254   -.0867701
          9  |  -.3948688   .0134862   -29.28   0.000    -.4220151   -.3677224
         10  |  -.3096592   .0122788   -25.22   0.000    -.3343751   -.2849433
         11  |  -.2135418   .0106037   -20.14   0.000     -.234886   -.1921976
         12  |  -.3543344   .0108044   -32.80   0.000    -.3760825   -.3325863
             |
     quarter |
          2  |   .0036444   .0040821     0.89   0.377    -.0045725    .0118613
          3  |   .0048019   .0042253     1.14   0.262    -.0037032    .0133069
          4  |   .0064823   .0029022     2.23   0.030     .0006406    .0123241
             |
       _cons |   .6554861   .0634323    10.33   0.000     .5278036    .7831686
------------------------------------------------------------------------------

. predict plwage3
(option xb assumed; fitted values)
(15,755 missing values generated)

. 
. keep plwage3 year r2wstates finalwt1

. 
. collapse (sum) stweight = finalwt1 (mean) plwage3 [aw = finalwt1], by(year r2wstates)

.         
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 73), ///
>                 legend(label(1 "Never RTW States") label(2 "Oklahoma")) ///
>                 title("Oklahoma (2001) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2001, lcolor(red)) xlabel(1989(2)2019)

.                 
. graph export "$figs/pta/bm_ok.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_ok.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 32), ///
>                 legend(label(1 "Never RTW States") label(2 "Indiana")) ///
>                 title("Indiana (2012) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2012, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/bm_in.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_in.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 34), ///
>                 legend(label(1 "Never RTW States") label(2 "Michigan")) ///
>                 title("Michigan (2013) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2013, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/bm_mi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_mi.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 35), ///
>                 legend(label(1 "Never RTW States") label(2 "Wisconsin")) ///
>                 title("Wisconsin (2015) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2015, lcolor(red)) xlabel(1989(2)2019)                            

. 
. graph export "$figs/pta/bm_wi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_wi.png written in PNG format)

.                 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 55), ///
>                 legend(label(1 "Never RTW States") label(2 "West Virginia")) ///
>                 title("West Virginia (2016) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2016, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/bm_wv.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_wv.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 61), ///
>                 legend(label(1 "Never RTW States") label(2 "Kentucky")) ///
>                 title("Kentucky (2017) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2017, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/bm_ky.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_ky.png written in PNG format)

. 
. restore

. 
. preserve

. 
. keep if female == 1 & blackrelwhite == 0
(1,730,947 observations deleted)

. 
. reg lwage3 i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 i.quarter [aw = fina
> lwt1] if female == 1 & blackrelwhite == 0, vce(cluster state)
(sum of wgt is 7,578,091,814)

Linear regression                               Number of obs     =    892,575
                                                F(45, 46)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5001
                                                Root MSE          =     .39612

                                 (Std. Err. adjusted for 47 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |
         RI  |   -.076712   .0008754   -87.63   0.000     -.078474     -.07495
         CT  |    .009025   .0003608    25.02   0.000     .0082988    .0097511
         NY  |  -.0381565    .001109   -34.41   0.000    -.0403889   -.0359241
         NJ  |   .0323011    .000776    41.63   0.000     .0307391    .0338631
         PA  |  -.1349124   .0020201   -66.78   0.000    -.1389787   -.1308461
         OH  |  -.1646895   .0024397   -67.50   0.000    -.1696004   -.1597786
         IN  |  -.1720953   .0038714   -44.45   0.000     -.179888   -.1643026
         IL  |  -.0981114   .0014056   -69.80   0.000    -.1009408    -.095282
         MI  |  -.1265952   .0021871   -57.88   0.000    -.1309976   -.1221929
         WI  |  -.1176036   .0037618   -31.26   0.000    -.1251757   -.1100315
         MN  |  -.0533653   .0025264   -21.12   0.000    -.0584508   -.0482799
         IA  |   -.160059   .0064409   -24.85   0.000    -.1730239   -.1470942
         MO  |  -.1838901   .0025361   -72.51   0.000     -.188995   -.1787853
         ND  |  -.1865378   .0090723   -20.56   0.000    -.2047994   -.1682761
         SD  |  -.2065558   .0080807   -25.56   0.000    -.2228214   -.1902902
         NE  |  -.1984148   .0044437   -44.65   0.000    -.2073596     -.18947
         KS  |  -.1981269   .0037461   -52.89   0.000    -.2056673   -.1905865
         DE  |  -.0529214   .0086128    -6.14   0.000    -.0702581   -.0355847
         MD  |  -.0124026   .0014528    -8.54   0.000    -.0153268   -.0094783
         DC  |   .0672633   .0062024    10.84   0.000     .0547785    .0797481
         VA  |  -.0707643    .001498   -47.24   0.000    -.0737797   -.0677489
         WV  |  -.2518285   .0071678   -35.13   0.000    -.2662566   -.2374004
         NC  |  -.1644713    .002976   -55.27   0.000    -.1704616   -.1584809
         SC  |  -.2070738   .0027886   -74.26   0.000     -.212687   -.2014606
         GA  |  -.1411781   .0016947   -83.31   0.000    -.1445894   -.1377669
         FL  |  -.1672398   .0008002  -209.01   0.000    -.1688504   -.1656292
         KY  |  -.1954789   .0044648   -43.78   0.000    -.2044662   -.1864917
         TN  |  -.2166564   .0029417   -73.65   0.000    -.2225778    -.210735
         AL  |  -.2150971    .003489   -61.65   0.000      -.22212   -.2080741
         MS  |  -.2372414   .0056497   -41.99   0.000    -.2486136   -.2258691
         AR  |   -.248879   .0048614   -51.19   0.000    -.2586646   -.2390934
         LA  |  -.2196847   .0015201  -144.52   0.000    -.2227444    -.216625
         OK  |  -.2546409   .0025945   -98.15   0.000    -.2598632   -.2494185
         TX  |  -.1363034   .0009741  -139.93   0.000    -.1382641   -.1343427
         ID  |   -.174725   .0053655   -32.56   0.000    -.1855252   -.1639249
         WY  |  -.1280931   .0085877   -14.92   0.000    -.1453794   -.1108069
         CO  |  -.1074522   .0006781  -158.47   0.000     -.108817   -.1060873
         NM  |  -.1994184   .0035831   -55.66   0.000    -.2066308    -.192206
         AZ  |  -.1296356   .0007033  -184.33   0.000    -.1310512   -.1282199
         UT  |  -.1812806   .0016284  -111.33   0.000    -.1845583   -.1780029
         NV  |  -.0694145    .001238   -56.07   0.000    -.0719065   -.0669225
         WA  |  -.0428662   .0011429   -37.51   0.000    -.0451668   -.0405656
         OR  |  -.1067874   .0018015   -59.28   0.000    -.1104137   -.1031612
         CA  |   .0281967   .0007414    38.03   0.000     .0267044     .029689
         AK  |   .0824541   .0041677    19.78   0.000     .0740649    .0908432
         HI  |  -.0218293   .0028252    -7.73   0.000    -.0275162   -.0161425
             |
        year |
       1990  |  -.0046888   .0025525    -1.84   0.073    -.0098267     .000449
       1991  |  -.0041878   .0026188    -1.60   0.117    -.0094591    .0010835
       1992  |   .0155022    .003574     4.34   0.000     .0083081    .0226964
       1993  |   .0139972   .0039797     3.52   0.001     .0059864    .0220079
       1996  |   .0057839    .003648     1.59   0.120    -.0015592     .013127
       1997  |   .0183481   .0036455     5.03   0.000     .0110101     .025686
       1998  |   .0453384   .0036719    12.35   0.000     .0379473    .0527295
       1999  |    .062503    .004021    15.54   0.000     .0544092    .0705969
       2000  |   .0760381   .0043607    17.44   0.000     .0672604    .0848158
       2001  |   .0904226   .0052302    17.29   0.000     .0798947    .1009505
       2002  |   .1011844   .0050178    20.17   0.000     .0910841    .1112846
       2003  |   .1068963   .0051494    20.76   0.000     .0965311    .1172616
       2004  |   .0990951    .005823    17.02   0.000     .0873739    .1108162
       2005  |   .0912458   .0053414    17.08   0.000     .0804942    .1019974
       2006  |   .0849791   .0049411    17.20   0.000     .0750332    .0949249
       2007  |   .0855213   .0058301    14.67   0.000      .073786    .0972566
       2008  |   .0795367    .006877    11.57   0.000     .0656941    .0933794
       2009  |   .0947897   .0051753    18.32   0.000     .0843724     .105207
       2010  |   .0931144   .0056997    16.34   0.000     .0816416    .1045872
       2011  |   .0737612   .0060298    12.23   0.000     .0616238    .0858987
       2012  |   .0591194   .0059796     9.89   0.000     .0470832    .0711557
       2013  |   .0580883   .0057436    10.11   0.000      .046527    .0696496
       2014  |    .054377   .0059359     9.16   0.000     .0424287    .0663254
       2015  |   .0706254    .005752    12.28   0.000     .0590472    .0822035
       2016  |    .082314   .0059225    13.90   0.000     .0703926    .0942354
       2017  |    .089863   .0075959    11.83   0.000     .0745733    .1051527
       2018  |   .0965509   .0070287    13.74   0.000     .0824028    .1106989
       2019  |   .1022988   .0063431    16.13   0.000     .0895308    .1150667
             |
        nind |
          2  |     .06295   .0391892     1.61   0.115    -.0159338    .1418338
          3  |   .1366709   .0370437     3.69   0.001     .0621059     .211236
          4  |  -.0821204   .0377887    -2.17   0.035    -.1581852   -.0060556
          5  |   .1582648   .0368246     4.30   0.000     .0841407    .2323889
          6  |   .0937667   .0381759     2.46   0.018     .0169226    .1706108
          7  |   .0429037   .0391943     1.09   0.279    -.0359905    .1217978
          8  |  -.0097928   .0399774    -0.24   0.808    -.0902631    .0706775
          9  |  -.0737836   .0438772    -1.68   0.099    -.1621037    .0145366
         10  |  -.0801821   .0384107    -2.09   0.042    -.1574989   -.0028653
         11  |   .0673942   .0402582     1.67   0.101    -.0136412    .1484297
             |
        educ |   .0917222   .0026972    34.01   0.000     .0862931    .0971512
       exper |   .0485348   .0020266    23.95   0.000     .0444555    .0526141
      exper2 |  -.0017691   .0001114   -15.88   0.000    -.0019933   -.0015448
      exper3 |   .0000292   3.21e-06     9.12   0.000     .0000228    .0000357
      exper4 |  -1.67e-07   3.26e-08    -5.13   0.000    -2.33e-07   -1.02e-07
        edex |  -.0003657   .0000751    -4.87   0.000    -.0005169   -.0002145
             |
       ee_cl |
          2  |  -.1293577   .0062662   -20.64   0.000    -.1419709   -.1167446
          3  |   -.169536   .0091937   -18.44   0.000    -.1880419     -.15103
          4  |  -.1770543    .015597   -11.35   0.000    -.2084495   -.1456591
          5  |  -.1517592   .0088273   -17.19   0.000    -.1695277   -.1339907
          6  |  -.1653758   .0105352   -15.70   0.000    -.1865821   -.1441696
          7  |  -.1808245   .0120554   -15.00   0.000    -.2050908   -.1565582
          8  |  -.1233482   .0166862    -7.39   0.000    -.1569359   -.0897606
          9  |  -.1470793   .0110315   -13.33   0.000    -.1692846    -.124874
         10  |  -.1688012   .0125619   -13.44   0.000    -.1940871   -.1435154
         11  |  -.1740826   .0136788   -12.73   0.000    -.2016167   -.1465485
         12  |  -.1358416   .0151935    -8.94   0.000    -.1664245   -.1052586
         13  |  -.0904547   .0150965    -5.99   0.000    -.1208425    -.060067
         14  |  -.1447505   .0131685   -10.99   0.000    -.1712574   -.1182436
         15  |  -.1376202   .0146202    -9.41   0.000    -.1670492   -.1081912
         16  |  -.1247979     .01534    -8.14   0.000    -.1556756   -.0939201
             |
        marr |   .0326598   .0024335    13.42   0.000     .0277613    .0375583
       partt |  -.1425122   .0034572   -41.22   0.000    -.1494712   -.1355532
      public |   .0597908    .006273     9.53   0.000     .0471638    .0724177
        cmsa |   .1546783   .0083904    18.44   0.000     .1377893    .1715673
             |
       nocc2 |
          2  |  -.1310647   .0030498   -42.98   0.000    -.1372036   -.1249258
          3  |   -.039579    .006665    -5.94   0.000     -.052995    -.026163
          4  |  -.2811548   .0070807   -39.71   0.000    -.2954076   -.2669021
          5  |   .0581974   .0061047     9.53   0.000     .0459093    .0704855
          6  |  -.3283774   .0043092   -76.20   0.000    -.3370513   -.3197034
          7  |  -.3433396   .0041802   -82.13   0.000    -.3517539   -.3349253
          8  |  -.1573917     .00866   -18.17   0.000    -.1748235     -.13996
          9  |  -.4003606   .0050244   -79.68   0.000    -.4104742    -.390247
         10  |  -.4103355     .00933   -43.98   0.000    -.4291159   -.3915552
         11  |  -.1654833   .0088061   -18.79   0.000    -.1832091   -.1477575
         12  |  -.3802372   .0086943   -43.73   0.000    -.3977379   -.3627366
             |
     quarter |
          2  |   .0080148   .0015421     5.20   0.000     .0049107     .011119
          3  |   .0175796   .0017712     9.93   0.000     .0140144    .0211448
          4  |   .0205591   .0011578    17.76   0.000     .0182285    .0228896
             |
       _cons |   .4169894   .0432245     9.65   0.000     .3299829    .5039959
------------------------------------------------------------------------------

. predict plwage3
(option xb assumed; fitted values)
(225,252 missing values generated)

. 
. keep plwage3 year r2wstates finalwt1

. 
. collapse (sum) stweight = finalwt1 (mean) plwage3 [aw = finalwt1], by(year r2wstates)

.         
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 73), ///
>                 legend(label(1 "Never RTW States") label(2 "Oklahoma")) ///
>                 title("Oklahoma (2001) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2001, lcolor(red)) xlabel(1989(2)2019)

.                 
. graph export "$figs/pta/wf_ok.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_ok.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 32), ///
>                 legend(label(1 "Never RTW States") label(2 "Indiana")) ///
>                 title("Indiana (2012) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2012, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/wf_in.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_in.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 34), ///
>                 legend(label(1 "Never RTW States") label(2 "Michigan")) ///
>                 title("Michigan (2013) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2013, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/wf_mi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_mi.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 35), ///
>                 legend(label(1 "Never RTW States") label(2 "Wisconsin")) ///
>                 title("Wisconsin (2015) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2015, lcolor(red)) xlabel(1989(2)2019)                            

. 
. graph export "$figs/pta/wf_wi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_wi.png written in PNG format)

.                 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 55), ///
>                 legend(label(1 "Never RTW States") label(2 "West Virginia")) ///
>                 title("West Virginia (2016) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2016, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/wf_wv.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_wv.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 61), ///
>                 legend(label(1 "Never RTW States") label(2 "Kentucky")) ///
>                 title("Kentucky (2017) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2017, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/wf_ky.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_ky.png written in PNG format)

. 
. restore

. 
. preserve

. 
. keep if female == 1 & blackrelwhite == 1
(2,697,026 observations deleted)

. 
. reg lwage3 i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 i.quarter [aw = fina
> lwt1] if female == 1 & blackrelwhite == 1, vce(cluster state)
(sum of wgt is 1,320,672,747)

Linear regression                               Number of obs     =    131,535
                                                F(45, 46)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5013
                                                Root MSE          =     .37252

                                 (Std. Err. adjusted for 47 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |
         RI  |  -.0656966   .0014432   -45.52   0.000    -.0686017   -.0627916
         CT  |   .0324292   .0013011    24.93   0.000     .0298102    .0350481
         NY  |  -.0137216   .0017429    -7.87   0.000    -.0172298   -.0102133
         NJ  |   .0078031   .0016756     4.66   0.000     .0044304    .0111759
         PA  |  -.0898267   .0011621   -77.30   0.000    -.0921658   -.0874876
         OH  |  -.1437506   .0016053   -89.55   0.000     -.146982   -.1405193
         IN  |  -.1750725   .0022551   -77.63   0.000    -.1796117   -.1705332
         IL  |  -.0941504   .0017093   -55.08   0.000    -.0975911   -.0907097
         MI  |  -.0969581   .0021525   -45.04   0.000    -.1012909   -.0926254
         WI  |   -.118474   .0015624   -75.83   0.000     -.121619    -.115329
         MN  |  -.0354018   .0019716   -17.96   0.000    -.0393703   -.0314332
         IA  |  -.1472385   .0050722   -29.03   0.000    -.1574483   -.1370287
         MO  |  -.1656869   .0013628  -121.58   0.000    -.1684301   -.1629438
         ND  |  -.0442618   .0183069    -2.42   0.020    -.0811117    -.007412
         SD  |  -.1266192   .0095392   -13.27   0.000    -.1458206   -.1074177
         NE  |  -.1977218   .0014921  -132.51   0.000    -.2007252   -.1947183
         KS  |  -.1830515   .0038911   -47.04   0.000    -.1908838   -.1752192
         DE  |  -.0593145   .0171317    -3.46   0.001    -.0937988   -.0248301
         MD  |    .017376    .003739     4.65   0.000     .0098497    .0249022
         DC  |   .0325526   .0040467     8.04   0.000      .024407    .0406982
         VA  |  -.1347266   .0032312   -41.70   0.000    -.1412306   -.1282226
         WV  |  -.1730321   .0110558   -15.65   0.000    -.1952863   -.1507779
         NC  |  -.2043738   .0058566   -34.90   0.000    -.2161624   -.1925851
         SC  |  -.2466735   .0081538   -30.25   0.000    -.2630863   -.2302607
         GA  |  -.1624442   .0037804   -42.97   0.000    -.1700537   -.1548348
         FL  |  -.1951253   .0013897  -140.41   0.000    -.1979227    -.192328
         KY  |  -.1803122   .0048513   -37.17   0.000    -.1900773   -.1705472
         TN  |  -.2070198    .002753   -75.20   0.000    -.2125614   -.2014783
         AL  |  -.2758404   .0062202   -44.35   0.000    -.2883611   -.2633197
         MS  |  -.3033719   .0109824   -27.62   0.000    -.3254783   -.2812656
         AR  |  -.2788115   .0085842   -32.48   0.000    -.2960905   -.2615324
         LA  |  -.2764531   .0029057   -95.14   0.000    -.2823021   -.2706042
         OK  |  -.2504983   .0029082   -86.14   0.000    -.2563522   -.2446444
         TX  |   -.171086   .0018452   -92.72   0.000    -.1748003   -.1673717
         ID  |   -.229153   .0063672   -35.99   0.000    -.2419696   -.2163364
         WY  |  -.1801346    .015464   -11.65   0.000    -.2112621   -.1490071
         CO  |  -.0904114   .0020327   -44.48   0.000    -.0945029   -.0863199
         NM  |  -.1571518    .008648   -18.17   0.000    -.1745593   -.1397443
         AZ  |  -.1394112   .0015843   -87.99   0.000    -.1426003   -.1362221
         UT  |  -.1984626   .0036019   -55.10   0.000    -.2057129   -.1912123
         NV  |  -.0629516   .0021264   -29.61   0.000    -.0672317   -.0586715
         WA  |  -.0376844    .001448   -26.03   0.000     -.040599   -.0347697
         OR  |  -.0738814     .00223   -33.13   0.000    -.0783703   -.0693926
         CA  |  -.0007713   .0021172    -0.36   0.717     -.005033    .0034905
         AK  |   .0687189   .0038723    17.75   0.000     .0609245    .0765134
         HI  |  -.1175522   .0028856   -40.74   0.000    -.1233606   -.1117437
             |
        year |
       1990  |  -.0143946   .0074504    -1.93   0.060    -.0293914    .0006023
       1991  |   .0028418   .0103488     0.27   0.785    -.0179893    .0236728
       1992  |   .0172045   .0096938     1.77   0.083    -.0023081     .036717
       1993  |   .0090779   .0101697     0.89   0.377    -.0113927    .0295486
       1996  |  -.0112161   .0112279    -1.00   0.323    -.0338167    .0113845
       1997  |   .0012523   .0140747     0.09   0.929    -.0270787    .0295832
       1998  |    .041116   .0110724     3.71   0.001     .0188284    .0634035
       1999  |   .0562917   .0137088     4.11   0.000     .0286974     .083886
       2000  |   .0669921   .0121687     5.51   0.000     .0424978    .0914863
       2001  |   .0601351   .0128735     4.67   0.000      .034222    .0860481
       2002  |   .0799734   .0139713     5.72   0.000     .0518505    .1080962
       2003  |    .086844   .0139036     6.25   0.000     .0588575    .1148305
       2004  |   .0740364   .0121873     6.07   0.000     .0495047    .0985681
       2005  |    .052148   .0134139     3.89   0.000     .0251471    .0791488
       2006  |   .0596015   .0133163     4.48   0.000     .0327972    .0864058
       2007  |   .0591754   .0146998     4.03   0.000     .0295863    .0887645
       2008  |   .0381374   .0113442     3.36   0.002     .0153028     .060972
       2009  |   .0702072   .0139493     5.03   0.000     .0421288    .0982857
       2010  |   .0617596   .0155842     3.96   0.000     .0303901    .0931291
       2011  |   .0483636   .0125146     3.86   0.000     .0231731    .0735541
       2012  |   .0121731   .0173865     0.70   0.487    -.0228242    .0471704
       2013  |   .0255573   .0194333     1.32   0.195    -.0135599    .0646744
       2014  |   .0157931   .0165641     0.95   0.345    -.0175488    .0491349
       2015  |   .0280242   .0137995     2.03   0.048     .0002473     .055801
       2016  |   .0417353   .0144909     2.88   0.006     .0125666     .070904
       2017  |   .0471228   .0142389     3.31   0.002     .0184613    .0757842
       2018  |   .0404395   .0166997     2.42   0.019     .0068248    .0740542
       2019  |    .079705   .0143186     5.57   0.000     .0508831    .1085269
             |
        nind |
          2  |   .0084315   .0854247     0.10   0.922    -.1635194    .1803825
          3  |   .0726357   .0729503     1.00   0.325    -.0742056     .219477
          4  |  -.1404359   .0738872    -1.90   0.064     -.289163    .0082912
          5  |   .0919773   .0720472     1.28   0.208    -.0530463    .2370008
          6  |   .0136806   .0723324     0.19   0.851    -.1319171    .1592782
          7  |  -.0660436   .0755921    -0.87   0.387    -.2182027    .0861154
          8  |   -.110748   .0769479    -1.44   0.157     -.265636    .0441401
          9  |  -.0940668   .0788422    -1.19   0.239    -.2527679    .0646343
         10  |  -.1403266   .0755991    -1.86   0.070    -.2924996    .0118465
         11  |   .0230971   .0750435     0.31   0.760    -.1279575    .1741517
             |
        educ |   .0828302   .0043152    19.20   0.000     .0741442    .0915162
       exper |   .0368399   .0039367     9.36   0.000     .0289157    .0447641
      exper2 |  -.0004945   .0002162    -2.29   0.027    -.0009297   -.0000593
      exper3 |   5.30e-07   7.07e-06     0.08   0.941    -.0000137    .0000148
      exper4 |   4.54e-08   7.54e-08     0.60   0.550    -1.06e-07    1.97e-07
        edex |  -.0009775    .000186    -5.25   0.000    -.0013519    -.000603
             |
       ee_cl |
          2  |  -.0958173   .0137068    -6.99   0.000    -.1234076    -.068227
          3  |  -.1147361   .0152205    -7.54   0.000    -.1453733    -.084099
          4  |  -.0833313   .0236697    -3.52   0.001     -.130976   -.0356866
          5  |   -.132266   .0164596    -8.04   0.000    -.1653974   -.0991345
          6  |   -.143514   .0153571    -9.35   0.000    -.1744262   -.1126017
          7  |  -.1188292    .016875    -7.04   0.000    -.1527968   -.0848616
          8  |  -.0174435    .024905    -0.70   0.487    -.0675747    .0326877
          9  |  -.1667806   .0210118    -7.94   0.000    -.2090751    -.124486
         10  |  -.1714705   .0222447    -7.71   0.000    -.2162468   -.1266942
         11  |  -.1161895   .0242506    -4.79   0.000    -.1650035   -.0673755
         12  |   .0142082   .0287069     0.49   0.623    -.0435759    .0719923
         13  |   -.162549   .0279677    -5.81   0.000     -.218845    -.106253
         14  |  -.1697661   .0241178    -7.04   0.000    -.2183127   -.1212196
         15  |  -.1075843   .0244301    -4.40   0.000    -.1567595    -.058409
         16  |   .0320468   .0325212     0.99   0.330    -.0334149    .0975086
             |
        marr |   .0375626    .003412    11.01   0.000     .0306946    .0444305
       partt |  -.1349324   .0051223   -26.34   0.000    -.1452431   -.1246217
      public |   .0677726   .0073626     9.21   0.000     .0529526    .0825927
        cmsa |   .1343032   .0154645     8.68   0.000     .1031748    .1654317
             |
       nocc2 |
          2  |   -.125306   .0096839   -12.94   0.000    -.1447988   -.1058132
          3  |  -.0289212   .0143406    -2.02   0.050    -.0577873   -.0000552
          4  |  -.2514184   .0099244   -25.33   0.000    -.2713952   -.2314416
          5  |  -.0112106   .0115461    -0.97   0.337    -.0344516    .0120304
          6  |  -.2916083   .0085357   -34.16   0.000    -.3087898   -.2744268
          7  |  -.3812697   .0110221   -34.59   0.000     -.403456   -.3590835
          8  |  -.2261816   .0183159   -12.35   0.000    -.2630496   -.1893135
          9  |  -.4014404   .0108265   -37.08   0.000    -.4232331   -.3796477
         10  |  -.3954954   .0106416   -37.16   0.000    -.4169159   -.3740749
         11  |  -.1564825   .0211505    -7.40   0.000    -.1990563   -.1139087
         12  |  -.3731188   .0116093   -32.14   0.000    -.3964871   -.3497505
             |
     quarter |
          2  |   .0129866   .0031578     4.11   0.000     .0066302     .019343
          3  |   .0183166   .0032061     5.71   0.000      .011863    .0247702
          4  |   .0206993   .0028616     7.23   0.000     .0149392    .0264594
             |
       _cons |   .5817011   .0960136     6.06   0.000     .3884357    .7749665
------------------------------------------------------------------------------

. predict plwage3
(option xb assumed; fitted values)
(20,213 missing values generated)

. 
. keep plwage3 year r2wstates finalwt1

. 
. collapse (sum) stweight = finalwt1 (mean) plwage3 [aw = finalwt1], by(year r2wstates)

.         
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 73), ///
>                 legend(label(1 "Never RTW States") label(2 "Oklahoma")) ///
>                 title("Oklahoma (2001) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2001, lcolor(red)) xlabel(1989(2)2019)

.                 
. graph export "$figs/pta/bf_ok.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_ok.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 32), ///
>                 legend(label(1 "Never RTW States") label(2 "Indiana")) ///
>                 title("Indiana (2012) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2012, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/bf_in.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_in.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 34), ///
>                 legend(label(1 "Never RTW States") label(2 "Michigan")) ///
>                 title("Michigan (2013) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2013, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/bf_mi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_mi.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 35), ///
>                 legend(label(1 "Never RTW States") label(2 "Wisconsin")) ///
>                 title("Wisconsin (2015) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2015, lcolor(red)) xlabel(1989(2)2019)                            

. 
. graph export "$figs/pta/bf_wi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_wi.png written in PNG format)

.                 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 55), ///
>                 legend(label(1 "Never RTW States") label(2 "West Virginia")) ///
>                 title("West Virginia (2016) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2016, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/bf_wv.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_wv.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 61), ///
>                 legend(label(1 "Never RTW States") label(2 "Kentucky")) ///
>                 title("Kentucky (2017) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2017, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/bf_ky.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_ky.png written in PNG format)

. 
. restore

.                         
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-ptaplot.log
  log type:  text
 closed on:   2 Apr 2021, 13:47:26
-----------------------------------------------------------------------------------------------------------------------------------
