---------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-ptaplot.log
  log type:  text
 opened on:  24 Mar 2021, 18:34:16

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt public marr hisprace hispracesex citize
> n eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effective; signed Dec2012) Mar1,2015(Mar11,20
> 15) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82) //incl Idaho which changed in 1
> 985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. gen lyear = year - 1900

. 
. gen r2wstates = 0 if neverr2w == 1
(1,463,937 missing values generated)

.         replace r2wstates = 1 if alwaysr2w == 1
(1,149,124 real changes made)

.         replace r2wstates = 73 if state == 73
(35,302 real changes made)

.         replace r2wstates = 32 if state == 32
(46,817 real changes made)

.         replace r2wstates = 34 if state == 34
(94,533 real changes made)

.         replace r2wstates = 35 if state == 35
(62,707 real changes made)

.         replace r2wstates = 55 if state == 55
(35,853 real changes made)

.         replace r2wstates = 61 if state == 61
(39,601 real changes made)

. 
. preserve

. 
. keep if female == 0 & blackrelwhite == 0
(1,798,911 observations deleted)

. 
. reg lwage3 i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female 
> == 0 & blackrelwhite == 0, vce(cluster state)
(sum of wgt is 8,126,935,821)

Linear regression                               Number of obs     =    971,142
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5054
                                                Root MSE          =     .41892

                                 (Std. Err. adjusted for 51 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |
         NH  |   .0865182   .0040522    21.35   0.000     .0783792    .0946573
         VT  |   .0260548   .0006984    37.31   0.000     .0246521    .0274575
         MA  |    .118192   .0089422    13.22   0.000     .1002311    .1361529
         RI  |    .029668   .0089931     3.30   0.002     .0116049    .0477311
         CT  |   .1295785    .008951    14.48   0.000     .1115999    .1475571
         NY  |   .0970255   .0083124    11.67   0.000     .0803296    .1137213
         NJ  |   .1732812    .009712    17.84   0.000     .1537741    .1927883
         PA  |   .0063614   .0069068     0.92   0.361    -.0075112     .020234
         OH  |  -.0196642   .0066956    -2.94   0.005    -.0331127   -.0062156
         IN  |   -.004623   .0050574    -0.91   0.365    -.0147811     .005535
         IL  |    .080339   .0075521    10.64   0.000     .0651701    .0955079
         MI  |   .0326219    .006974     4.68   0.000     .0186141    .0466296
         WI  |   .0156721   .0050897     3.08   0.003     .0054492     .025895
         MN  |   .0669924   .0065615    10.21   0.000     .0538131    .0801716
         IA  |  -.0165907   .0024731    -6.71   0.000    -.0215581   -.0116233
         MO  |  -.0233472   .0064013    -3.65   0.001    -.0362046   -.0104898
         ND  |  -.0072916   .0022227    -3.28   0.002    -.0117559   -.0028272
         SD  |  -.0741511   .0012297   -60.30   0.000     -.076621   -.0716812
         NE  |  -.0637064   .0048463   -13.15   0.000    -.0734405   -.0539723
         KS  |  -.0429889   .0053852    -7.98   0.000    -.0538054   -.0321723
         DE  |   .0509242   .0015741    32.35   0.000     .0477625    .0540859
         MD  |   .1193853   .0097846    12.20   0.000     .0997324    .1390382
         DC  |   .2072852   .0131401    15.78   0.000     .1808926    .2336777
         VA  |   .0888373   .0080093    11.09   0.000     .0727501    .1049245
         WV  |  -.0502345   .0026484   -18.97   0.000    -.0555541    -.044915
         NC  |  -.0375078   .0059224    -6.33   0.000    -.0494032   -.0256123
         SC  |  -.0559041   .0060762    -9.20   0.000    -.0681084   -.0436998
         GA  |   .0118109   .0071787     1.65   0.106    -.0026079    .0262297
         FL  |  -.0530059   .0089217    -5.94   0.000    -.0709256   -.0350861
         KY  |  -.0501143   .0044318   -11.31   0.000    -.0590159   -.0412127
         TN  |  -.0754547   .0060931   -12.38   0.000     -.087693   -.0632164
         AL  |  -.0402363   .0052751    -7.63   0.000    -.0508317   -.0296409
         MS  |  -.0677869   .0030838   -21.98   0.000    -.0739809   -.0615929
         AR  |  -.1143972    .004129   -27.71   0.000    -.1226905   -.1061039
         LA  |  -.0082601   .0074567    -1.11   0.273    -.0232373     .006717
         OK  |  -.0779676   .0064629   -12.06   0.000    -.0909486   -.0649866
         TX  |   .0211588    .008411     2.52   0.015     .0042649    .0380528
         MT  |  -.0334326   .0014139   -23.65   0.000    -.0362725   -.0305928
         ID  |  -.0385672   .0035234   -10.95   0.000    -.0456441   -.0314904
         WY  |   .1249292   .0048075    25.99   0.000     .1152731    .1345852
         CO  |   .0342717   .0087009     3.94   0.000     .0167954    .0517479
         NM  |  -.0401276   .0059928    -6.70   0.000    -.0521644   -.0280908
         AZ  |  -.0100231   .0086711    -1.16   0.253    -.0274395    .0073932
         UT  |  -.0344109   .0086649    -3.97   0.000    -.0518149    -.017007
         NV  |   .0685625    .008817     7.78   0.000     .0508531    .0862719
         WA  |    .094671   .0079279    11.94   0.000     .0787473    .1105947
         OR  |   .0226456   .0071926     3.15   0.003     .0081989    .0370923
         CA  |   .1562449   .0093636    16.69   0.000     .1374375    .1750522
         AK  |    .239391   .0050275    47.62   0.000     .2292929     .249489
         HI  |    .115735   .0066807    17.32   0.000     .1023163    .1291537
             |
        year |
       1990  |   -.012442   .0026803    -4.64   0.000    -.0178255   -.0070585
       1991  |  -.0267131   .0035816    -7.46   0.000    -.0339069   -.0195193
       1992  |  -.0256859   .0033472    -7.67   0.000     -.032409   -.0189628
       1993  |  -.0348234   .0035471    -9.82   0.000    -.0419478   -.0276989
       1996  |  -.0361935   .0052575    -6.88   0.000    -.0467536   -.0256335
       1997  |  -.0207805   .0051396    -4.04   0.000    -.0311036   -.0104574
       1998  |   .0008228   .0049384     0.17   0.868    -.0090962    .0107418
       1999  |   .0238222   .0058529     4.07   0.000     .0120663    .0355781
       2000  |   .0322893   .0055171     5.85   0.000      .021208    .0433707
       2001  |   .0471002   .0060515     7.78   0.000     .0349455     .059255
       2002  |   .0528529   .0055628     9.50   0.000     .0416797    .0640261
       2003  |   .0416734   .0058846     7.08   0.000     .0298538    .0534931
       2004  |   .0337022   .0054962     6.13   0.000     .0226628    .0447417
       2005  |   .0225852   .0059972     3.77   0.000     .0105396    .0346309
       2006  |   .0189291   .0062877     3.01   0.004     .0062999    .0315584
       2007  |   .0200796    .007033     2.86   0.006     .0059534    .0342058
       2008  |   .0157272   .0078196     2.01   0.050     .0000211    .0314333
       2009  |   .0281936   .0081035     3.48   0.001     .0119172      .04447
       2010  |   .0170122   .0081002     2.10   0.041     .0007425    .0332818
       2011  |  -.0049118   .0071323    -0.69   0.494    -.0192374    .0094138
       2012  |  -.0093478    .009017    -1.04   0.305    -.0274589    .0087634
       2013  |  -.0099674   .0094251    -1.06   0.295    -.0288984    .0089635
       2014  |  -.0116223   .0089693    -1.30   0.201    -.0296378    .0063931
       2015  |   .0083282   .0078416     1.06   0.293    -.0074221    .0240784
       2016  |   .0212957   .0082615     2.58   0.013      .004702    .0378894
       2017  |   .0276641   .0085916     3.22   0.002     .0104072    .0449209
       2018  |   .0400626   .0084555     4.74   0.000     .0230792    .0570459
       2019  |   .0558517   .0079234     7.05   0.000      .039937    .0717663
             |
        nind |
          2  |   .0853464   .0267429     3.19   0.002     .0316317    .1390612
          3  |   .1003113   .0222804     4.50   0.000     .0555598    .1450629
          4  |  -.0853065   .0238305    -3.58   0.001    -.1331714   -.0374415
          5  |   .1389129   .0230531     6.03   0.000     .0926094    .1852163
          6  |   .1010152   .0262458     3.85   0.000      .048299    .1537314
          7  |   .0050922   .0249792     0.20   0.839      -.04508    .0552644
          8  |  -.0541734    .023778    -2.28   0.027     -.101933   -.0064139
          9  |  -.0646843   .0272442    -2.37   0.021     -.119406   -.0099627
         10  |  -.1003293   .0263551    -3.81   0.000    -.1532651   -.0473934
         11  |   .1118074   .0260394     4.29   0.000     .0595059     .164109
             |
        educ |   .0674934   .0019132    35.28   0.000     .0636507    .0713362
       exper |   .0451784   .0018924    23.87   0.000     .0413775    .0489793
      exper2 |  -.0009883   .0001132    -8.73   0.000    -.0012157   -.0007609
      exper3 |   5.27e-06   3.37e-06     1.56   0.124    -1.50e-06    .0000121
      exper4 |   2.93e-08   3.60e-08     0.81   0.420    -4.30e-08    1.02e-07
        edex |  -.0003359   .0000587    -5.72   0.000    -.0004539   -.0002179
             |
       ee_cl |
          2  |   -.061502   .0051832   -11.87   0.000    -.0719127   -.0510914
          3  |  -.0705805   .0071981    -9.81   0.000    -.0850384   -.0561226
          4  |  -.0268655   .0121313    -2.21   0.031    -.0512319   -.0024992
          5  |  -.1289536   .0068394   -18.85   0.000     -.142691   -.1152162
          6  |   -.079443   .0061813   -12.85   0.000    -.0918584   -.0670276
          7  |  -.0617337   .0077212    -8.00   0.000    -.0772421   -.0462252
          8  |   .0267363    .012932     2.07   0.044     .0007616    .0527109
          9  |  -.1424221   .0083711   -17.01   0.000    -.1592359   -.1256083
         10  |  -.0886627   .0079377   -11.17   0.000    -.1046061   -.0727192
         11  |  -.0569194   .0091874    -6.20   0.000    -.0753728    -.038466
         12  |   .0246072   .0129411     1.90   0.063    -.0013857    .0506002
         13  |  -.0542588    .011563    -4.69   0.000    -.0774837   -.0310338
         14  |  -.0649361    .009815    -6.62   0.000    -.0846502    -.045222
         15  |  -.0457877   .0103488    -4.42   0.000    -.0665738   -.0250016
         16  |   .0215481    .013609     1.58   0.120    -.0057865    .0488826
             |
        marr |   .1266698   .0022725    55.74   0.000     .1221054    .1312343
       partt |  -.2115006   .0061037   -34.65   0.000    -.2237602    -.199241
      public |   .0058281   .0067962     0.86   0.395    -.0078225    .0194786
        cmsa |   .1463653   .0091499    16.00   0.000     .1279872    .1647435
             |
       nocc2 |
          2  |  -.1403487   .0035497   -39.54   0.000    -.1474786   -.1332189
          3  |  -.0409824   .0061441    -6.67   0.000    -.0533232   -.0286416
          4  |  -.2946175   .0104449   -28.21   0.000    -.3155966   -.2736384
          5  |  -.0755382   .0075868    -9.96   0.000    -.0907768   -.0602996
          6  |  -.3704997   .0063163   -58.66   0.000    -.3831864   -.3578131
          7  |  -.2206275   .0054099   -40.78   0.000    -.2314935   -.2097614
          8  |  -.0980158   .0109917    -8.92   0.000    -.1200932   -.0759383
          9  |  -.3804134   .0035569  -106.95   0.000    -.3875577    -.373269
         10  |  -.3253398    .004787   -67.96   0.000    -.3349547   -.3157249
         11  |   -.220286   .0053818   -40.93   0.000    -.2310957   -.2094763
         12  |  -.3762744   .0058854   -63.93   0.000    -.3880956   -.3644533
             |
     quarter |
          2  |   .0034525   .0019572     1.76   0.084    -.0004787    .0073837
          3  |   .0049364   .0018285     2.70   0.009     .0012638     .008609
          4  |   .0150577   .0015712     9.58   0.000     .0119018    .0182136
             |
       _cons |    .623354   .0291683    21.37   0.000     .5647677    .6819402
------------------------------------------------------------------------------

. predict plwage3
(option xb assumed; fitted values)
(258,078 missing values generated)

. 
. keep plwage3 year r2wstates finalwt1

. 
. collapse (mean) plwage3 [aw = finalwt1], by(year r2wstates)

.         
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 73), ///
>                 legend(label(1 "Never RTW States") label(2 "Oklahoma")) ///
>                 title("Oklahoma (2001) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2001, lcolor(red)) xlabel(1989(2)2019)

.                 
. graph export "$figs/pta/wm_ok.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_ok.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 32), ///
>                 legend(label(1 "Never RTW States") label(2 "Indiana")) ///
>                 title("Indiana (2012) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2012, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/wm_in.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_in.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 34), ///
>                 legend(label(1 "Never RTW States") label(2 "Michigan")) ///
>                 title("Michigan (2013) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2013, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/wm_mi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_mi.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 35), ///
>                 legend(label(1 "Never RTW States") label(2 "Wisconsin")) ///
>                 title("Wisconsin (2015) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2015, lcolor(red)) xlabel(1989(2)2019)                            

. 
. graph export "$figs/pta/wm_wi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_wi.png written in PNG format)

.                 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 55), ///
>                 legend(label(1 "Never RTW States") label(2 "West Virginia")) ///
>                 title("West Virginia (2016) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2016, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/wm_wv.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_wv.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 61), ///
>                 legend(label(1 "Never RTW States") label(2 "Kentucky")) ///
>                 title("Kentucky (2017) - All White Men") ytitle("Mean Predicted Real Log Wages of White Men") ///
>                 xline(2017, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/wm_ky.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wm_ky.png written in PNG format)

. 
. restore

. 
. preserve

. 
. keep if female == 0 & blackrelwhite == 1
(2,913,530 observations deleted)

. 
. reg lwage3 i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female 
> == 0 & blackrelwhite == 1, vce(cluster state)
(sum of wgt is 1,093,910,716)

Linear regression                               Number of obs     =     98,534
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4482
                                                Root MSE          =     .40236

                                 (Std. Err. adjusted for 51 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |
         NH  |   .0773049     .00432    17.89   0.000     .0686278    .0859819
         VT  |  -.0659979   .0062487   -10.56   0.000    -.0785489    -.053447
         MA  |  -.0079254   .0112659    -0.70   0.485    -.0305537    .0147029
         RI  |  -.0803481   .0114545    -7.01   0.000     -.103355   -.0573411
         CT  |   .0361561   .0114986     3.14   0.003     .0130605    .0592518
         NY  |   .0115064   .0113639     1.01   0.316    -.0113187    .0343315
         NJ  |   .0359223   .0116519     3.08   0.003     .0125188    .0593259
         PA  |  -.0516103    .010715    -4.82   0.000     -.073132   -.0300885
         OH  |  -.1097394   .0106968   -10.26   0.000    -.1312245   -.0882543
         IN  |  -.0721193    .010634    -6.78   0.000    -.0934784   -.0507603
         IL  |  -.0289482   .0112402    -2.58   0.013    -.0515248   -.0063717
         MI  |  -.0069435   .0116829    -0.59   0.555    -.0304093    .0165224
         WI  |  -.1077543   .0102164   -10.55   0.000    -.1282745   -.0872341
         MN  |  -.0458155   .0107525    -4.26   0.000    -.0674126   -.0242184
         IA  |  -.0837204   .0061995   -13.50   0.000    -.0961724   -.0712684
         MO  |  -.1019017   .0104605    -9.74   0.000    -.1229123   -.0808911
         ND  |   .0524637   .0056536     9.28   0.000     .0411082    .0638191
         SD  |  -.1635675   .0079128   -20.67   0.000    -.1794608   -.1476742
         NE  |  -.0831524   .0106382    -7.82   0.000    -.1045199   -.0617848
         KS  |  -.1024446    .008729   -11.74   0.000    -.1199773   -.0849119
         DE  |  -.0338554   .0084925    -3.99   0.000    -.0509131   -.0167976
         MD  |   .0470948   .0115576     4.07   0.000     .0238806     .070309
         DC  |   .0336826   .0120238     2.80   0.007      .009532    .0578331
         VA  |  -.0597849   .0094172    -6.35   0.000    -.0786999   -.0408699
         WV  |  -.0759818   .0032382   -23.46   0.000    -.0824859   -.0694776
         NC  |  -.1294373   .0071189   -18.18   0.000     -.143736   -.1151385
         SC  |  -.1659147    .005965   -27.81   0.000    -.1778958   -.1539336
         GA  |  -.0859354   .0085564   -10.04   0.000    -.1031214   -.0687494
         FL  |  -.1591045    .010666   -14.92   0.000    -.1805278   -.1376812
         KY  |  -.1068426   .0077029   -13.87   0.000    -.1223142   -.0913709
         TN  |  -.1524294   .0097186   -15.68   0.000    -.1719498   -.1329091
         AL  |  -.1887876   .0068383   -27.61   0.000    -.2025227   -.1750525
         MS  |  -.2114415   .0043321   -48.81   0.000    -.2201428   -.2027402
         AR  |  -.2304285   .0050903   -45.27   0.000    -.2406526   -.2202044
         LA  |  -.1698428   .0089948   -18.88   0.000    -.1879095   -.1517762
         OK  |  -.1838097   .0091956   -19.99   0.000    -.2022797   -.1653397
         TX  |  -.0999772   .0105244    -9.50   0.000    -.1211161   -.0788382
         MT  |  -.0593721   .0079251    -7.49   0.000    -.0752902   -.0434539
         ID  |  -.2207298   .0084973   -25.98   0.000     -.237797   -.2036625
         WY  |   .1386518   .0067957    20.40   0.000     .1250021    .1523014
         CO  |  -.0988576   .0114527    -8.63   0.000    -.1218611   -.0758542
         NM  |  -.0624657   .0053507   -11.67   0.000    -.0732129   -.0517185
         AZ  |  -.1061383   .0109698    -9.68   0.000    -.1281718   -.0841048
         UT  |  -.1248737   .0109215   -11.43   0.000    -.1468102   -.1029373
         NV  |  -.0221233   .0112309    -1.97   0.054    -.0446812    .0004346
         WA  |   .0368017   .0110737     3.32   0.002     .0145596    .0590437
         OR  |  -.0681632   .0108886    -6.26   0.000    -.0900335   -.0462929
         CA  |   .0692366   .0116616     5.94   0.000     .0458135    .0926597
         AK  |   .1167536   .0088971    13.12   0.000     .0988832     .134624
         HI  |   .0111339   .0102813     1.08   0.284    -.0095168    .0317846
             |
        year |
       1990  |  -.0153805     .00737    -2.09   0.042    -.0301836   -.0005774
       1991  |  -.0295802   .0087094    -3.40   0.001    -.0470736   -.0120868
       1992  |  -.0398839   .0072246    -5.52   0.000     -.054395   -.0253728
       1993  |  -.0367456   .0074179    -4.95   0.000    -.0516449   -.0218463
       1996  |   -.043042   .0106836    -4.03   0.000    -.0645007   -.0215832
       1997  |   -.023238   .0126935    -1.83   0.073    -.0487336    .0022576
       1998  |   .0085506   .0111701     0.77   0.448    -.0138852    .0309864
       1999  |   .0284725   .0115793     2.46   0.017     .0052147    .0517302
       2000  |   .0283134   .0104357     2.71   0.009     .0073527     .049274
       2001  |   .0420935   .0089103     4.72   0.000     .0241967    .0599903
       2002  |   .0511702   .0132984     3.85   0.000     .0244595    .0778809
       2003  |   .0548309   .0123016     4.46   0.000     .0301225    .0795394
       2004  |   .0493584   .0149705     3.30   0.002     .0192893    .0794275
       2005  |   .0118877   .0134494     0.88   0.381    -.0151262    .0389016
       2006  |   .0071178   .0087308     0.82   0.419    -.0104185    .0246541
       2007  |   .0086944   .0136875     0.64   0.528    -.0187978    .0361865
       2008  |   -.000846   .0100561    -0.08   0.933    -.0210444    .0193523
       2009  |   .0115454    .013201     0.87   0.386    -.0149696    .0380604
       2010  |   .0197108   .0136154     1.45   0.154    -.0076365    .0470581
       2011  |  -.0075005   .0151142    -0.50   0.622    -.0378583    .0228574
       2012  |   .0010897   .0128859     0.08   0.933    -.0247924    .0269718
       2013  |  -.0214705    .014381    -1.49   0.142    -.0503557    .0074146
       2014  |  -.0248649   .0167289    -1.49   0.143    -.0584658     .008736
       2015  |  -.0014636   .0123208    -0.12   0.906    -.0262106    .0232833
       2016  |   .0207994   .0147559     1.41   0.165    -.0088387    .0504375
       2017  |   .0165211    .015249     1.08   0.284    -.0141074    .0471496
       2018  |   .0096122   .0134584     0.71   0.478    -.0174198    .0366442
       2019  |   .0578998    .016234     3.57   0.001     .0252929    .0905066
             |
        nind |
          2  |   .0827656   .0317762     2.60   0.012     .0189412      .14659
          3  |   .1573094   .0307581     5.11   0.000       .09553    .2190889
          4  |  -.0199167   .0353503    -0.56   0.576      -.09092    .0510865
          5  |   .1928689   .0371313     5.19   0.000     .1182885    .2674494
          6  |   .0938442   .0324327     2.89   0.006     .0287012    .1589871
          7  |  -.0039016   .0375929    -0.10   0.918    -.0794091     .071606
          8  |  -.0382592   .0403056    -0.95   0.347    -.1192154    .0426969
          9  |  -.0112317   .0383575    -0.29   0.771     -.088275    .0658117
         10  |  -.0369399   .0374651    -0.99   0.329    -.1121908     .038311
         11  |   .1859119   .0382889     4.86   0.000     .1090063    .2628175
             |
        educ |   .0645228   .0041817    15.43   0.000     .0561236    .0729219
       exper |   .0376302   .0030068    12.52   0.000     .0315908    .0436695
      exper2 |   -.000569   .0001939    -2.93   0.005    -.0009584   -.0001795
      exper3 |   3.25e-06   6.07e-06     0.54   0.595    -8.95e-06    .0000155
      exper4 |   5.87e-09   6.27e-08     0.09   0.926    -1.20e-07    1.32e-07
        edex |  -.0008353   .0001188    -7.03   0.000    -.0010738   -.0005967
             |
       ee_cl |
          2  |   -.045913   .0087445    -5.25   0.000    -.0634769   -.0283491
          3  |  -.0336517    .014466    -2.33   0.024    -.0627075    -.004596
          4  |   .0218359   .0247805     0.88   0.382    -.0279372    .0716091
          5  |  -.1211377   .0128401    -9.43   0.000    -.1469279   -.0953476
          6  |  -.0773069   .0131119    -5.90   0.000    -.1036429   -.0509709
          7  |  -.0204888   .0164408    -1.25   0.218     -.053511    .0125335
          8  |    .054936   .0249045     2.21   0.032     .0049138    .1049582
          9  |  -.1545744   .0139968   -11.04   0.000    -.1826879   -.1264609
         10  |  -.0934106   .0164848    -5.67   0.000    -.1265214   -.0602999
         11  |  -.0230358   .0183187    -1.26   0.214    -.0598299    .0137584
         12  |   .0762467   .0191117     3.99   0.000     .0378597    .1146338
         13  |  -.1398938   .0145585    -9.61   0.000    -.1691353   -.1106523
         14  |  -.0905951   .0159077    -5.70   0.000    -.1225466   -.0586436
         15  |  -.0205074   .0133306    -1.54   0.130    -.0472827     .006268
         16  |   .0700806   .0202427     3.46   0.001     .0294219    .1107392
             |
        marr |   .0991015   .0045366    21.84   0.000     .0899894    .1082136
       partt |  -.1946518   .0107878   -18.04   0.000    -.2163196   -.1729839
      public |   .0729455   .0131141     5.56   0.000     .0466051    .0992859
        cmsa |   .1263502      .0148     8.54   0.000     .0966235    .1560769
             |
       nocc2 |
          2  |  -.1175052   .0113527   -10.35   0.000    -.1403077   -.0947027
          3  |   .0174644   .0089505     1.95   0.057    -.0005131    .0354419
          4  |  -.2353366    .012085   -19.47   0.000      -.25961   -.2110631
          5  |  -.0685392   .0141383    -4.85   0.000    -.0969368   -.0401416
          6  |  -.3329845   .0103291   -32.24   0.000     -.353731    -.312238
          7  |  -.3028771   .0142589   -21.24   0.000    -.3315169   -.2742372
          8  |  -.1418243   .0272858    -5.20   0.000    -.1966295   -.0870192
          9  |  -.3950146   .0134585   -29.35   0.000    -.4220468   -.3679823
         10  |  -.3098713    .012256   -25.28   0.000    -.3344882   -.2852544
         11  |  -.2136437   .0105795   -20.19   0.000    -.2348932   -.1923941
         12  |  -.3545038   .0107825   -32.88   0.000    -.3761611   -.3328465
             |
     quarter |
          2  |   .0036235   .0040749     0.89   0.378    -.0045612    .0118082
          3  |   .0048892   .0042188     1.16   0.252    -.0035845     .013363
          4  |   .0065329   .0029005     2.25   0.029      .000707    .0123588
             |
       _cons |   .6634863   .0618992    10.72   0.000     .5391582    .7878144
------------------------------------------------------------------------------

. predict plwage3
(option xb assumed; fitted values)
(16,067 missing values generated)

. 
. keep plwage3 year r2wstates finalwt1

. 
. collapse (mean) plwage3 [aw = finalwt1], by(year r2wstates)

.         
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 73), ///
>                 legend(label(1 "Never RTW States") label(2 "Oklahoma")) ///
>                 title("Oklahoma (2001) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2001, lcolor(red)) xlabel(1989(2)2019)

.                 
. graph export "$figs/pta/bm_ok.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_ok.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 32), ///
>                 legend(label(1 "Never RTW States") label(2 "Indiana")) ///
>                 title("Indiana (2012) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2012, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/bm_in.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_in.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 34), ///
>                 legend(label(1 "Never RTW States") label(2 "Michigan")) ///
>                 title("Michigan (2013) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2013, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/bm_mi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_mi.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 35), ///
>                 legend(label(1 "Never RTW States") label(2 "Wisconsin")) ///
>                 title("Wisconsin (2015) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2015, lcolor(red)) xlabel(1989(2)2019)                            

. 
. graph export "$figs/pta/bm_wi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_wi.png written in PNG format)

.                 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 55), ///
>                 legend(label(1 "Never RTW States") label(2 "West Virginia")) ///
>                 title("West Virginia (2016) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2016, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/bm_wv.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_wv.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 61), ///
>                 legend(label(1 "Never RTW States") label(2 "Kentucky")) ///
>                 title("Kentucky (2017) - All Black Men") ytitle("Mean Predicted Real Log Wages of Black Men") ///
>                 xline(2017, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/bm_ky.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bm_ky.png written in PNG format)

. 
. restore

. 
. preserve

. 
. keep if female == 1 & blackrelwhite == 0
(1,820,094 observations deleted)

. 
. reg lwage3 i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female 
> == 1 & blackrelwhite == 0, vce(cluster state)
(sum of wgt is 7,702,889,487)

Linear regression                               Number of obs     =    949,025
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5001
                                                Root MSE          =     .39557

                                 (Std. Err. adjusted for 51 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |
         NH  |   .0570659   .0034993    16.31   0.000     .0500372    .0640945
         VT  |   .0371332    .000768    48.35   0.000     .0355907    .0386757
         MA  |   .1005375   .0083084    12.10   0.000     .0838496    .1172254
         RI  |   .0237605   .0081641     2.91   0.005     .0073624    .0401586
         CT  |   .1096253   .0082749    13.25   0.000     .0930047    .1262458
         NY  |    .062399    .007527     8.29   0.000     .0472804    .0775175
         NJ  |   .1329435   .0088971    14.94   0.000     .1150732    .1508138
         PA  |  -.0345661   .0064701    -5.34   0.000    -.0475617   -.0215705
         OH  |  -.0643397   .0061712   -10.43   0.000     -.076735   -.0519444
         IN  |  -.0717795   .0046872   -15.31   0.000     -.081194    -.062365
         IL  |   .0023842   .0069679     0.34   0.734    -.0116113    .0163797
         MI  |  -.0261744   .0064431    -4.06   0.000    -.0391158    -.013233
         WI  |  -.0172748   .0047057    -3.67   0.001    -.0267266   -.0078231
         MN  |    .047091   .0058734     8.02   0.000      .035294     .058888
         IA  |  -.0598788   .0020488   -29.23   0.000     -.063994   -.0557637
         MO  |  -.0835211   .0059128   -14.13   0.000    -.0953974   -.0716448
         ND  |  -.0865424   .0008707   -99.40   0.000    -.0882912   -.0847935
         SD  |  -.1064419   .0008327  -127.83   0.000    -.1081143   -.1047694
         NE  |  -.0981231   .0039508   -24.84   0.000    -.1060585   -.0901878
         KS  |  -.0977567   .0046707   -20.93   0.000    -.1071382   -.0883753
         DE  |   .0471356    .001223    38.54   0.000     .0446791    .0495921
         MD  |   .0883047   .0091817     9.62   0.000     .0698627    .1067466
         DC  |   .1684586   .0135015    12.48   0.000     .1413401    .1955772
         VA  |   .0298571   .0074889     3.99   0.000     .0148151     .044899
         WV  |     -.1518   .0013748  -110.42   0.000    -.1545613   -.1490387
         NC  |  -.0639881   .0054572   -11.73   0.000    -.0749492    -.053027
         SC  |  -.1066216   .0057019   -18.70   0.000    -.1180742   -.0951689
         GA  |  -.0406428   .0067628    -6.01   0.000    -.0542263   -.0270594
         FL  |  -.0666882   .0083242    -8.01   0.000    -.0834078   -.0499685
         KY  |  -.0952128   .0039882   -23.87   0.000    -.1032234   -.0872023
         TN  |  -.1162262   .0055578   -20.91   0.000    -.1273894   -.1050631
         AL  |  -.1147152   .0049555   -23.15   0.000    -.1246685   -.1047618
         MS  |  -.1369044   .0029361   -46.63   0.000    -.1428017   -.1310072
         AR  |  -.1486088   .0036581   -40.62   0.000    -.1559564   -.1412612
         LA  |  -.1192567   .0069969   -17.04   0.000    -.1333104    -.105203
         OK  |  -.1542219   .0058797   -26.23   0.000    -.1660316   -.1424121
         TX  |  -.0357251    .007732    -4.62   0.000    -.0512552   -.0201949
         MT  |  -.0764862   .0007883   -97.03   0.000    -.0780696   -.0749029
         ID  |  -.0745035    .003065   -24.31   0.000    -.0806597   -.0683472
         WY  |  -.0279822   .0012826   -21.82   0.000    -.0305583   -.0254061
         CO  |  -.0068101   .0081056    -0.84   0.405    -.0230907    .0094706
         NM  |  -.0989025   .0050583   -19.55   0.000    -.1090624   -.0887425
         AZ  |  -.0290614   .0080669    -3.60   0.001    -.0452642   -.0128586
         UT  |  -.0808806   .0075472   -10.72   0.000    -.0960396   -.0657216
         NV  |   .0311202   .0081587     3.81   0.000     .0147329    .0475075
         WA  |   .0576637   .0073149     7.88   0.000     .0429712    .0723561
         OR  |  -.0063015   .0066374    -0.95   0.347    -.0196331    .0070301
         CA  |   .1288823    .008746    14.74   0.000     .1113154    .1464491
         AK  |   .1829247   .0045299    40.38   0.000     .1738261    .1920234
         HI  |   .0786911    .005768    13.64   0.000     .0671058    .0902764
             |
        year |
       1990  |  -.0047932   .0025254    -1.90   0.063    -.0098657    .0002793
       1991  |  -.0043025    .002599    -1.66   0.104    -.0095229    .0009178
       1992  |   .0151592    .003566     4.25   0.000     .0079967    .0223217
       1993  |   .0135038   .0039634     3.41   0.001     .0055431    .0214646
       1996  |   .0053934   .0036252     1.49   0.143     -.001888    .0126749
       1997  |   .0178273   .0036104     4.94   0.000     .0105755     .025079
       1998  |   .0445788   .0036717    12.14   0.000     .0372039    .0519536
       1999  |    .061975   .0039785    15.58   0.000     .0539838    .0699661
       2000  |   .0751546   .0043085    17.44   0.000     .0665007    .0838086
       2001  |   .0894541    .005203    17.19   0.000     .0790037    .0999046
       2002  |   .1004807   .0049659    20.23   0.000     .0905064    .1104551
       2003  |   .1063452   .0050884    20.90   0.000     .0961248    .1165656
       2004  |   .0986299    .005747    17.16   0.000     .0870868     .110173
       2005  |   .0909434   .0052679    17.26   0.000     .0803625    .1015243
       2006  |    .084593   .0048675    17.38   0.000     .0748164    .0943696
       2007  |   .0849821    .005758    14.76   0.000     .0734168    .0965474
       2008  |   .0791987   .0067777    11.69   0.000     .0655853    .0928121
       2009  |   .0945472   .0051107    18.50   0.000     .0842822    .1048123
       2010  |   .0928567   .0056386    16.47   0.000     .0815313    .1041821
       2011  |   .0733572   .0059505    12.33   0.000     .0614052    .0853092
       2012  |   .0590243   .0059008    10.00   0.000     .0471723    .0708764
       2013  |   .0581838   .0056654    10.27   0.000     .0468045    .0695631
       2014  |   .0544314   .0058515     9.30   0.000     .0426784    .0661844
       2015  |   .0705588     .00568    12.42   0.000     .0591501    .0819674
       2016  |   .0821388   .0058527    14.03   0.000     .0703832    .0938943
       2017  |   .0898805   .0074901    12.00   0.000     .0748362    .1049247
       2018  |   .0969553   .0069175    14.02   0.000     .0830611    .1108495
       2019  |   .1022311   .0062582    16.34   0.000     .0896612     .114801
             |
        nind |
          2  |   .0636342   .0382909     1.66   0.103    -.0132752    .1405437
          3  |   .1366454    .036163     3.78   0.000     .0640099    .2092809
          4  |  -.0816394   .0369081    -2.21   0.032    -.1557715   -.0075073
          5  |   .1585336   .0359418     4.41   0.000     .0863423    .2307249
          6  |   .0942551   .0372895     2.53   0.015      .019357    .1691532
          7  |   .0432977   .0382878     1.13   0.264    -.0336056     .120201
          8  |  -.0088349   .0390685    -0.23   0.822    -.0873062    .0696365
          9  |  -.0724572   .0428741    -1.69   0.097    -.1585724    .0136579
         10  |  -.0799463   .0375274    -2.13   0.038    -.1553222   -.0045703
         11  |    .068048   .0393343     1.73   0.090    -.0109572    .1470532
             |
        educ |    .091673   .0026679    34.36   0.000     .0863144    .0970316
       exper |   .0483086   .0020073    24.07   0.000     .0442767    .0523404
      exper2 |   -.001756   .0001106   -15.88   0.000     -.001978   -.0015339
      exper3 |   .0000289   3.18e-06     9.08   0.000     .0000225    .0000352
      exper4 |  -1.63e-07   3.23e-08    -5.06   0.000    -2.28e-07   -9.85e-08
        edex |  -.0003634    .000074    -4.91   0.000     -.000512   -.0002147
             |
       ee_cl |
          2  |  -.1293365   .0061736   -20.95   0.000    -.1417366   -.1169365
          3  |  -.1700709   .0090729   -18.74   0.000    -.1882945   -.1518474
          4  |  -.1782622   .0154445   -11.54   0.000    -.2092835   -.1472409
          5  |  -.1511743   .0087146   -17.35   0.000    -.1686781   -.1336705
          6  |   -.165382    .010363   -15.96   0.000    -.1861966   -.1445673
          7  |  -.1814829   .0118881   -15.27   0.000    -.2053608    -.157605
          8  |  -.1245406   .0164895    -7.55   0.000    -.1576607   -.0914205
          9  |  -.1469519   .0108479   -13.55   0.000    -.1687405   -.1251633
         10  |  -.1687136   .0123665   -13.64   0.000    -.1935525   -.1438746
         11  |   -.174595   .0134821   -12.95   0.000    -.2016746   -.1475154
         12  |   -.137168   .0150204    -9.13   0.000    -.1673374   -.1069986
         13  |  -.0901792   .0148609    -6.07   0.000    -.1200282   -.0603301
         14  |  -.1448324   .0129784   -11.16   0.000    -.1709002   -.1187646
         15  |  -.1384647   .0144158    -9.61   0.000    -.1674198   -.1095097
         16  |  -.1263476   .0151692    -8.33   0.000    -.1568158   -.0958793
             |
        marr |   .0326625   .0024047    13.58   0.000     .0278325    .0374926
       partt |   -.142039   .0034314   -41.39   0.000    -.1489311   -.1351468
      public |   .0591128   .0061914     9.55   0.000      .046677    .0715486
        cmsa |   .1542632   .0083184    18.54   0.000     .1375553    .1709711
             |
       nocc2 |
          2  |  -.1311202   .0030247   -43.35   0.000    -.1371955   -.1250449
          3  |  -.0394882   .0065909    -5.99   0.000    -.0527265   -.0262499
          4  |  -.2815863   .0069922   -40.27   0.000    -.2956305   -.2675422
          5  |   .0582568   .0060185     9.68   0.000     .0461683    .0703452
          6  |  -.3284462   .0042617   -77.07   0.000    -.3370061   -.3198862
          7  |  -.3438127   .0041368   -83.11   0.000    -.3521217   -.3355037
          8  |  -.1579462    .008565   -18.44   0.000    -.1751495    -.140743
          9  |  -.4001332   .0049309   -81.15   0.000    -.4100373   -.3902291
         10  |  -.4109434   .0091792   -44.77   0.000    -.4293804   -.3925063
         11  |  -.1657438   .0086731   -19.11   0.000    -.1831643   -.1483233
         12  |  -.3807487   .0085718   -44.42   0.000    -.3979656   -.3635318
             |
     quarter |
          2  |   .0079826   .0015166     5.26   0.000     .0049364    .0110287
          3  |   .0175754   .0017403    10.10   0.000     .0140799    .0210708
          4  |   .0205258   .0011391    18.02   0.000     .0182378    .0228137
             |
       _cons |   .3188525   .0416829     7.65   0.000     .2351299     .402575
------------------------------------------------------------------------------

. predict plwage3
(option xb assumed; fitted values)
(259,012 missing values generated)

. 
. keep plwage3 year r2wstates finalwt1

. 
. collapse (mean) plwage3 [aw = finalwt1], by(year r2wstates)

.         
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 73), ///
>                 legend(label(1 "Never RTW States") label(2 "Oklahoma")) ///
>                 title("Oklahoma (2001) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2001, lcolor(red)) xlabel(1989(2)2019)

.                 
. graph export "$figs/pta/wf_ok.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_ok.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 32), ///
>                 legend(label(1 "Never RTW States") label(2 "Indiana")) ///
>                 title("Indiana (2012) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2012, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/wf_in.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_in.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 34), ///
>                 legend(label(1 "Never RTW States") label(2 "Michigan")) ///
>                 title("Michigan (2013) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2013, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/wf_mi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_mi.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 35), ///
>                 legend(label(1 "Never RTW States") label(2 "Wisconsin")) ///
>                 title("Wisconsin (2015) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2015, lcolor(red)) xlabel(1989(2)2019)                            

. 
. graph export "$figs/pta/wf_wi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_wi.png written in PNG format)

.                 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 55), ///
>                 legend(label(1 "Never RTW States") label(2 "West Virginia")) ///
>                 title("West Virginia (2016) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2016, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/wf_wv.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_wv.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 61), ///
>                 legend(label(1 "Never RTW States") label(2 "Kentucky")) ///
>                 title("Kentucky (2017) - All White Women") ytitle("Mean Predicted Real Log Wages of White Women") ///
>                 xline(2017, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/wf_ky.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/wf_ky.png written in PNG format)

. 
. restore

. 
. preserve

. 
. keep if female == 1 & blackrelwhite == 1
(2,875,996 observations deleted)

. 
. reg lwage3 i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female 
> == 1 & blackrelwhite == 1, vce(cluster state)
(sum of wgt is 1,321,143,906)

Linear regression                               Number of obs     =    131,707
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5013
                                                Root MSE          =     .37253

                                 (Std. Err. adjusted for 51 clusters in state)
------------------------------------------------------------------------------
             |               Robust
      lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       state |
         NH  |  -.0813226   .0085104    -9.56   0.000    -.0984163   -.0642289
         VT  |  -.0455893    .006926    -6.58   0.000    -.0595006   -.0316781
         MA  |  -.0301203    .013092    -2.30   0.026    -.0564163   -.0038243
         RI  |  -.0958067   .0132792    -7.21   0.000    -.1224787   -.0691347
         CT  |   .0023187   .0132078     0.18   0.861    -.0242099    .0288473
         NY  |   -.043828   .0137069    -3.20   0.002    -.0713591   -.0162969
         NJ  |  -.0223038   .0133826    -1.67   0.102    -.0491834    .0045759
         PA  |  -.1199455   .0127175    -9.43   0.000    -.1454894   -.0944015
         OH  |  -.1738587    .012493   -13.92   0.000    -.1989516   -.1487658
         IN  |  -.2051752   .0120799   -16.98   0.000    -.2294384    -.180912
         IL  |  -.1242615   .0130005    -9.56   0.000    -.1503737   -.0981493
         MI  |  -.1270586   .0130343    -9.75   0.000    -.1532388   -.1008783
         WI  |  -.1485797   .0125154   -11.87   0.000    -.1737177   -.1234418
         MN  |  -.0655106   .0125244    -5.23   0.000    -.0906667   -.0403546
         IA  |  -.1773843   .0084498   -20.99   0.000    -.1943563   -.1604122
         MO  |  -.1958004   .0122546   -15.98   0.000    -.2204145   -.1711863
         ND  |  -.0745188   .0077141    -9.66   0.000     -.090013   -.0590247
         SD  |  -.1567446   .0086536   -18.11   0.000    -.1741259   -.1393633
         NE  |  -.2278232   .0125795   -18.11   0.000      -.25309   -.2025564
         KS  |  -.2131715   .0100292   -21.26   0.000    -.2333157   -.1930273
         DE  |  -.0895156   .0098116    -9.12   0.000    -.1092228   -.0698084
         MD  |  -.0127401   .0131968    -0.97   0.339    -.0392466    .0137664
         DC  |    .002427   .0140322     0.17   0.863    -.0257574    .0306115
         VA  |  -.1648446   .0110892   -14.87   0.000    -.1871179   -.1425714
         WV  |   -.203245   .0060434   -33.63   0.000    -.2153836   -.1911065
         NC  |  -.2344999    .008676   -27.03   0.000    -.2519261   -.2170737
         SC  |   -.276812    .007208   -38.40   0.000    -.2912898   -.2623342
         GA  |  -.1925716   .0099767   -19.30   0.000    -.2126105   -.1725328
         FL  |  -.2252359   .0125958   -17.88   0.000    -.2505353   -.1999365
         KY  |  -.2104458   .0092702   -22.70   0.000    -.2290656   -.1918259
         TN  |  -.2371304   .0116568   -20.34   0.000    -.2605438   -.2137169
         AL  |   -.305974   .0084545   -36.19   0.000    -.3229554   -.2889926
         MS  |  -.3335311   .0061057   -54.63   0.000    -.3457947   -.3212676
         AR  |  -.3089564   .0074319   -41.57   0.000    -.3238837    -.294029
         LA  |  -.3065772   .0111928   -27.39   0.000    -.3290587   -.2840957
         OK  |  -.2806154   .0110626   -25.37   0.000    -.3028352   -.2583956
         TX  |  -.2012029   .0119487   -16.84   0.000    -.2252025   -.1772033
         MT  |  -.3151491   .0092647   -34.02   0.000    -.3337577   -.2965404
         ID  |  -.2592845   .0076431   -33.92   0.000    -.2746362   -.2439327
         WY  |  -.2103572   .0089106   -23.61   0.000    -.2282547   -.1924597
         CO  |  -.1205244   .0130424    -9.24   0.000    -.1467209   -.0943279
         NM  |  -.1873157    .006169   -30.36   0.000    -.1997064    -.174925
         AZ  |  -.1695307   .0121082   -14.00   0.000    -.1938508   -.1452107
         UT  |  -.2285703   .0117093   -19.52   0.000    -.2520892   -.2050515
         NV  |   -.093063   .0132251    -7.04   0.000    -.1196264   -.0664996
         WA  |  -.0677898   .0126196    -5.37   0.000     -.093137   -.0424426
         OR  |  -.1040069    .012818    -8.11   0.000    -.1297527   -.0782611
         CA  |  -.0308818   .0132563    -2.33   0.024    -.0575078   -.0042558
         AK  |   .0385801   .0111122     3.47   0.001     .0162605    .0608997
         HI  |  -.1476742   .0126077   -11.71   0.000    -.1729976   -.1223509
             |
        year |
       1990  |  -.0144151   .0074439    -1.94   0.058    -.0293666    .0005363
       1991  |   .0027844   .0103402     0.27   0.789    -.0179844    .0235532
       1992  |   .0172141   .0096851     1.78   0.082    -.0022389    .0366672
       1993  |   .0090481   .0101608     0.89   0.377    -.0113605    .0294568
       1996  |  -.0111971    .011217    -1.00   0.323    -.0337271    .0113328
       1997  |   .0012448   .0140614     0.09   0.930    -.0269984    .0294879
       1998  |   .0410958   .0110622     3.71   0.001     .0188767    .0633148
       1999  |     .05623   .0136951     4.11   0.000     .0287226    .0837373
       2000  |    .066971   .0121556     5.51   0.000     .0425558    .0913863
       2001  |   .0601143   .0128603     4.67   0.000     .0342836     .085945
       2002  |   .0799539   .0139567     5.73   0.000      .051921    .1079868
       2003  |   .0867248   .0138868     6.25   0.000     .0588324    .1146172
       2004  |   .0739817   .0121725     6.08   0.000     .0495326    .0984309
       2005  |   .0520969   .0133989     3.89   0.000     .0251845    .0790094
       2006  |   .0595267   .0133034     4.47   0.000     .0328059    .0862474
       2007  |     .05915   .0146836     4.03   0.000     .0296571     .088643
       2008  |   .0381888   .0113316     3.37   0.001     .0154286     .060949
       2009  |   .0701017   .0139348     5.03   0.000     .0421128    .0980906
       2010  |   .0617199   .0155697     3.96   0.000     .0304473    .0929925
       2011  |   .0483502   .0125015     3.87   0.000     .0232403    .0734601
       2012  |   .0121436   .0173667     0.70   0.488    -.0227385    .0470257
       2013  |   .0255061   .0194123     1.31   0.195    -.0134847    .0644969
       2014  |    .015802   .0165457     0.96   0.344     -.017431     .049035
       2015  |   .0280283   .0137863     2.03   0.047     .0003377    .0557189
       2016  |   .0415616   .0144737     2.87   0.006     .0124903    .0706328
       2017  |   .0470747   .0142228     3.31   0.002     .0185074     .075642
       2018  |    .040379   .0166804     2.42   0.019     .0068754    .0738826
       2019  |    .079935   .0143006     5.59   0.000     .0512114    .1086585
             |
        nind |
          2  |    .009013   .0852866     0.11   0.916    -.1622902    .1803162
          3  |   .0724103   .0728272     0.99   0.325    -.0738673     .218688
          4  |  -.1404543   .0737621    -1.90   0.063    -.2886099    .0077013
          5  |   .0919808   .0719243     1.28   0.207    -.0524834     .236445
          6  |   .0136496   .0722119     0.19   0.851    -.1313922    .1586914
          7  |  -.0661006   .0754645    -0.88   0.385    -.2176755    .0854743
          8  |  -.1107448   .0768201    -1.44   0.156    -.2650424    .0435529
          9  |  -.0940259    .078709    -1.19   0.238    -.2521176    .0640657
         10  |  -.1403878   .0754726    -1.86   0.069     -.291979    .0112035
         11  |    .023115   .0749146     0.31   0.759    -.1273554    .1735854
             |
        educ |   .0828486   .0043089    19.23   0.000      .074194    .0915032
       exper |   .0368258   .0039327     9.36   0.000     .0289267    .0447249
      exper2 |  -.0004926   .0002161    -2.28   0.027    -.0009266   -.0000586
      exper3 |   4.65e-07   7.07e-06     0.07   0.948    -.0000137    .0000147
      exper4 |   4.61e-08   7.54e-08     0.61   0.544    -1.05e-07    1.97e-07
        edex |  -.0009774   .0001858    -5.26   0.000    -.0013506   -.0006041
             |
       ee_cl |
          2  |  -.0956822   .0136876    -6.99   0.000    -.1231746   -.0681898
          3  |  -.1146492   .0151948    -7.55   0.000    -.1451689   -.0841296
          4  |  -.0832668   .0236362    -3.52   0.001    -.1307414   -.0357921
          5  |  -.1321867   .0164278    -8.05   0.000    -.1651828   -.0991905
          6  |  -.1434558   .0153314    -9.36   0.000    -.1742499   -.1126618
          7  |  -.1188145   .0168469    -7.05   0.000    -.1526524   -.0849766
          8  |  -.0175588   .0248685    -0.71   0.483    -.0675085     .032391
          9  |  -.1667422   .0209816    -7.95   0.000     -.208885   -.1245993
         10  |  -.1714737   .0222101    -7.72   0.000    -.2160839   -.1268634
         11  |  -.1161757   .0242157    -4.80   0.000    -.1648144   -.0675371
         12  |   .0140384   .0286713     0.49   0.627    -.0435496    .0716263
         13  |  -.1624653   .0279295    -5.82   0.000    -.2185633   -.1063674
         14  |  -.1697306   .0240812    -7.05   0.000    -.2180991   -.1213622
         15  |   -.107581   .0243931    -4.41   0.000     -.156576   -.0585861
         16  |   .0319107   .0324848     0.98   0.331    -.0333369    .0971583
             |
        marr |   .0375333   .0034083    11.01   0.000     .0306876     .044379
       partt |  -.1349351   .0051154   -26.38   0.000    -.1452097   -.1246606
      public |   .0676946   .0073548     9.20   0.000     .0529221    .0824672
        cmsa |   .1341732   .0154457     8.69   0.000     .1031496    .1651968
             |
       nocc2 |
          2  |  -.1254709   .0096701   -12.98   0.000    -.1448939   -.1060478
          3  |  -.0291132   .0143209    -2.03   0.047    -.0578776   -.0003488
          4  |  -.2515798   .0099023   -25.41   0.000    -.2714693   -.2316904
          5  |  -.0114837   .0115273    -1.00   0.324    -.0346369    .0116695
          6  |  -.2918186   .0085154   -34.27   0.000    -.3089222    -.274715
          7  |  -.3814567   .0109933   -34.70   0.000    -.4035374    -.359376
          8  |   -.226376   .0182837   -12.38   0.000    -.2630999   -.1896521
          9  |  -.4016561   .0107948   -37.21   0.000     -.423338   -.3799741
         10  |  -.3956483   .0106156   -37.27   0.000    -.4169704   -.3743262
         11  |  -.1568311   .0211066    -7.43   0.000    -.1992251   -.1144372
         12  |  -.3733418   .0115853   -32.23   0.000    -.3966115   -.3500722
             |
     quarter |
          2  |   .0130115   .0031525     4.13   0.000     .0066796    .0193435
          3  |   .0183434      .0032     5.73   0.000     .0119159    .0247708
          4  |   .0207373   .0028572     7.26   0.000     .0149984    .0264762
             |
       _cons |   .6118718   .0895855     6.83   0.000      .431934    .7918096
------------------------------------------------------------------------------

. predict plwage3
(option xb assumed; fitted values)
(20,428 missing values generated)

. 
. keep plwage3 year r2wstates finalwt1

. 
. collapse (mean) plwage3 [aw = finalwt1], by(year r2wstates)

.         
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 73), ///
>                 legend(label(1 "Never RTW States") label(2 "Oklahoma")) ///
>                 title("Oklahoma (2001) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2001, lcolor(red)) xlabel(1989(2)2019)

.                 
. graph export "$figs/pta/bf_ok.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_ok.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 32), ///
>                 legend(label(1 "Never RTW States") label(2 "Indiana")) ///
>                 title("Indiana (2012) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2012, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/bf_in.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_in.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 34), ///
>                 legend(label(1 "Never RTW States") label(2 "Michigan")) ///
>                 title("Michigan (2013) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2013, lcolor(red)) xlabel(1989(2)2019)

. 
. graph export "$figs/pta/bf_mi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_mi.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 35), ///
>                 legend(label(1 "Never RTW States") label(2 "Wisconsin")) ///
>                 title("Wisconsin (2015) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2015, lcolor(red)) xlabel(1989(2)2019)                            

. 
. graph export "$figs/pta/bf_wi.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_wi.png written in PNG format)

.                 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 55), ///
>                 legend(label(1 "Never RTW States") label(2 "West Virginia")) ///
>                 title("West Virginia (2016) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2016, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/bf_wv.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_wv.png written in PNG format)

. 
. twoway  (connected plwage3 year if r2wstates == 0) ///
>                 (connected plwage3 year if r2wstates == 61), ///
>                 legend(label(1 "Never RTW States") label(2 "Kentucky")) ///
>                 title("Kentucky (2017) - All Black Women") ytitle("Mean Predicted Real Log Wages of Black Women") ///
>                 xline(2017, lcolor(red)) xlabel(1989(2)2019)    

. 
. graph export "$figs/pta/bf_ky.png", replace
(file /Users/amedeusdsouza/econ499/figures/pta/bf_ky.png written in PNG format)

. 
. restore

.                         
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-ptaplot.log
  log type:  text
 closed on:  24 Mar 2021, 18:35:22
---------------------------------------------------------------------------------------------------------------------------------------------------
