-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-wo-ar2w.log
  log type:  text
 opened on:   2 Apr 2021, 13:36:04

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt public marr hisprace hi
> spracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effective; signed Dec2012) Ma
> r1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82) //incl Idaho wh
> ich changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. gen lyear = year - 1900

. 
. drop if alwaysr2w == 1
(1,149,124 observations deleted)

. 
. eststo clear

. 
. ** pta WV drop, common support MT, ME, NH, VT
. drop if inlist(state, 55, 81, 11, 12, 13)
(215,210 observations deleted)

. 
. ** BLACK-WHITE
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 5,692,881,058)

Linear regression                               Number of obs     =    612,127
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2555
                                                Root MSE          =     .35779

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0511209   .0074524     6.86   0.000     .0357398     .066502
             treat_st |   -.026557   .0111973    -2.37   0.026    -.0496671    -.003447
treat_stblackrelwhite |  -.0254538   .0114625    -2.22   0.036    -.0491112   -.0017964
                      |
                state |
                  RI  |   .0009688   .0009599     1.01   0.323    -.0010123    .0029499
                  CT  |   .0003732   .0010601     0.35   0.728    -.0018147    .0025612
                  NY  |   .0827415   .0020343    40.67   0.000     .0785429    .0869401
                  NJ  |   .0355217    .001033    34.39   0.000     .0333898    .0376536
                  PA  |    .011906   .0018223     6.53   0.000     .0081449    .0156671
                  OH  |    .000774   .0022876     0.34   0.738    -.0039473    .0054954
                  IN  |   -.016465   .0045857    -3.59   0.001    -.0259295   -.0070004
                  IL  |   .0332859   .0016066    20.72   0.000     .0299701    .0366017
                  MI  |   .0452089   .0037956    11.91   0.000     .0373752    .0530426
                  WI  |  -.0082738   .0039291    -2.11   0.046    -.0163831   -.0001646
                  MN  |   .0169998   .0018115     9.38   0.000      .013261    .0207387
                  MO  |  -.0197493   .0019661   -10.04   0.000    -.0238072   -.0156914
                  DE  |  -.0652751   .0089771    -7.27   0.000    -.0838029   -.0467473
                  MD  |  -.0609858   .0039625   -15.39   0.000     -.069164   -.0528077
                  DC  |  -.0605181   .0053207   -11.37   0.000    -.0714996   -.0495367
                  KY  |   -.055718    .003778   -14.75   0.000    -.0635154   -.0479207
                  OK  |  -.0958533   .0065714   -14.59   0.000    -.1094161   -.0822906
                  CO  |  -.0601488    .001367   -44.00   0.000    -.0629702   -.0573274
                  NM  |  -.1138582   .0047666   -23.89   0.000    -.1236961   -.1040204
                  WA  |   .0415197   .0009753    42.57   0.000     .0395069    .0435326
                  OR  |   .0047832   .0015167     3.15   0.004     .0016529    .0079134
                  CA  |   .0223011   .0007932    28.11   0.000      .020664    .0239383
                  AK  |    .017983    .006447     2.79   0.010     .0046771     .031289
                  HI  |   .0109995   .0047681     2.31   0.030     .0011587    .0208403
                      |
                 year |
                1990  |  -.0067584   .0034284    -1.97   0.060    -.0138342    .0003174
                1991  |  -.0093052   .0042182    -2.21   0.037     -.018011   -.0005993
                1992  |  -.0152213   .0034031    -4.47   0.000    -.0222449   -.0081978
                1993  |  -.0198133   .0048009    -4.13   0.000    -.0297218   -.0099047
                1996  |  -.0282352   .0052153    -5.41   0.000     -.038999   -.0174713
                1997  |   -.031672   .0052017    -6.09   0.000    -.0424079   -.0209362
                1998  |  -.0363841   .0053404    -6.81   0.000    -.0474062   -.0253619
                1999  |   -.038396   .0042037    -9.13   0.000     -.047072     -.02972
                2000  |  -.0428315   .0043776    -9.78   0.000    -.0518665   -.0337965
                2001  |  -.0430889   .0060102    -7.17   0.000    -.0554932   -.0306845
                2002  |  -.0466633   .0068104    -6.85   0.000    -.0607193   -.0326074
                2003  |  -.0535764   .0060934    -8.79   0.000    -.0661526   -.0410002
                2004  |  -.0557803   .0068182    -8.18   0.000    -.0698522   -.0417083
                2005  |    -.06513   .0071429    -9.12   0.000    -.0798723   -.0503877
                2006  |  -.0689707   .0079549    -8.67   0.000    -.0853889   -.0525525
                2007  |     -.0644   .0080567    -7.99   0.000    -.0810281   -.0477718
                2008  |  -.0553856   .0083707    -6.62   0.000    -.0726618   -.0381093
                2009  |  -.0596239   .0069717    -8.55   0.000    -.0740128    -.045235
                2010  |  -.0654979   .0095598    -6.85   0.000    -.0852283   -.0457676
                2011  |   -.068426   .0069655    -9.82   0.000    -.0828021   -.0540499
                2012  |  -.0687406   .0073774    -9.32   0.000    -.0839668   -.0535144
                2013  |  -.0663883   .0075849    -8.75   0.000    -.0820427   -.0507339
                2014  |  -.0692436   .0065344   -10.60   0.000    -.0827298   -.0557573
                2015  |   -.072331   .0072763    -9.94   0.000    -.0873485   -.0573134
                2016  |  -.0695595   .0080988    -8.59   0.000    -.0862747   -.0528443
                2017  |  -.0586407   .0073927    -7.93   0.000    -.0738984    -.043383
                2018  |  -.0590751   .0055533   -10.64   0.000    -.0705365   -.0476137
                2019  |  -.0675424   .0066882   -10.10   0.000    -.0813462   -.0537386
                      |
                 nind |
                   2  |   .1612309   .0136726    11.79   0.000      .133012    .1894498
                   3  |   .1218721   .0124602     9.78   0.000     .0961554    .1475887
                   4  |   .0371212   .0100005     3.71   0.001     .0164812    .0577611
                   5  |   .2050064   .0112648    18.20   0.000     .1817571    .2282558
                   6  |   .0291117   .0105425     2.76   0.011      .007353    .0508704
                   7  |   .0170354   .0095638     1.78   0.088    -.0027033    .0367742
                   8  |   .0477437    .016215     2.94   0.007     .0142776    .0812098
                   9  |   .1685923   .0125573    13.43   0.000     .1426754    .1945092
                  10  |     .02636   .0206253     1.28   0.213    -.0162084    .0689285
                  11  |   .1240067   .0202032     6.14   0.000     .0823093    .1657042
                      |
                 educ |     .01006   .0018179     5.53   0.000      .006308     .013812
                exper |   .0095179   .0014014     6.79   0.000     .0066255    .0124102
               exper2 |  -.0001025   .0000886    -1.16   0.259    -.0002854    .0000804
               exper3 |   3.76e-06   2.70e-06     1.39   0.177    -1.81e-06    9.32e-06
               exper4 |  -7.84e-08   2.76e-08    -2.84   0.009    -1.35e-07   -2.15e-08
                 edex |  -.0002989   .0000549    -5.45   0.000    -.0004122   -.0001856
                      |
                ee_cl |
                   2  |  -.0229922   .0075414    -3.05   0.006    -.0385569   -.0074275
                   3  |  -.0168827    .008222    -2.05   0.051    -.0338522    .0000867
                   4  |  -.0344498   .0101297    -3.40   0.002    -.0553565   -.0135431
                   5  |  -.0885554   .0093362    -9.49   0.000    -.1078244   -.0692864
                   6  |   -.005608    .006971    -0.80   0.429    -.0199955    .0087795
                   7  |   .0068975   .0082947     0.83   0.414    -.0102219    .0240169
                   8  |  -.0480537   .0125099    -3.84   0.001    -.0738729   -.0222344
                   9  |  -.0651809   .0094434    -6.90   0.000    -.0846712   -.0456906
                  10  |   .0132386   .0081418     1.63   0.117    -.0035653    .0300424
                  11  |   .0067908   .0099381     0.68   0.501    -.0137204     .027302
                  12  |  -.0647385   .0150157    -4.31   0.000    -.0957295   -.0337476
                  13  |   .0162392   .0093032     1.75   0.094    -.0029616      .03544
                  14  |    .024649   .0083457     2.95   0.007     .0074243    .0418737
                  15  |  -.0035175   .0103127    -0.34   0.736    -.0248019     .017767
                  16  |   -.072539   .0161923    -4.48   0.000    -.1059582   -.0391198
                      |
                 marr |   .0194145   .0017445    11.13   0.000     .0158139    .0230151
                partt |  -.0763355   .0044135   -17.30   0.000    -.0854445   -.0672265
               public |    .337901   .0219525    15.39   0.000     .2925934    .3832087
                 cmsa |   .0500594   .0074542     6.72   0.000     .0346746    .0654442
                      |
                nocc2 |
                   2  |   .0575648   .0035342    16.29   0.000     .0502705    .0648591
                   3  |    .041577   .0057875     7.18   0.000     .0296321    .0535219
                   4  |   .1948538   .0051981    37.49   0.000     .1841254    .2055823
                   5  |   .1892293   .0172926    10.94   0.000     .1535392    .2249194
                   6  |   .1543324   .0060381    25.56   0.000     .1418704    .1667943
                   7  |   .0829463   .0030039    27.61   0.000     .0767465     .089146
                   8  |   .0708428   .0092359     7.67   0.000     .0517809    .0899047
                   9  |   .1991222   .0065969    30.18   0.000     .1855069    .2127374
                  10  |   .2361083   .0080668    29.27   0.000     .2194592    .2527574
                  11  |   .2553095    .009667    26.41   0.000     .2353577    .2752613
                  12  |   .2612091   .0084696    30.84   0.000     .2437288    .2786894
                      |
              quarter |
                   2  |  -.0016013   .0020738    -0.77   0.448    -.0058813    .0026788
                   3  |  -.0036993   .0017131    -2.16   0.041     -.007235   -.0001635
                   4  |  -.0047978    .001353    -3.55   0.002    -.0075902   -.0020054
                      |
                _cons |   -.279889   .0298618    -9.37   0.000    -.3415206   -.2182573
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 5,692,881,058)

Linear regression                               Number of obs     =    612,127
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2555
                                                Root MSE          =     .35778

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |    .051105    .007461     6.85   0.000     .0357062    .0665037
             treat_st |  -.0275496   .0107891    -2.55   0.017    -.0498172    -.005282
treat_stblackrelwhite |  -.0256259   .0113807    -2.25   0.034    -.0491146   -.0021372
                      |
                state |
                  RI  |   .0048107    .001592     3.02   0.006     .0015249    .0080965
                  CT  |   .0005642   .0010133     0.56   0.583    -.0015273    .0026556
                  NY  |   .0854136   .0021119    40.44   0.000     .0810549    .0897723
                  NJ  |   .0374122   .0014045    26.64   0.000     .0345136    .0403109
                  PA  |   .0131913   .0016762     7.87   0.000     .0097319    .0166508
                  OH  |   .0029607   .0019876     1.49   0.149    -.0011415    .0070628
                  IN  |  -.0163453   .0044692    -3.66   0.001    -.0255692   -.0071214
                  IL  |   .0369309   .0014566    25.35   0.000     .0339246    .0399373
                  MI  |   .0509074    .003297    15.44   0.000     .0441027    .0577122
                  WI  |  -.0100654   .0041461    -2.43   0.023    -.0186224   -.0015083
                  MN  |   .0135468   .0023924     5.66   0.000     .0086092    .0184844
                  MO  |  -.0192085   .0019192   -10.01   0.000    -.0231696   -.0152474
                  DE  |  -.0680048     .00938    -7.25   0.000    -.0873641   -.0486455
                  MD  |  -.0624957   .0039298   -15.90   0.000    -.0706063    -.054385
                  DC  |  -.0539837   .0057342    -9.41   0.000    -.0658185   -.0421489
                  KY  |  -.0526923   .0036122   -14.59   0.000    -.0601475   -.0452372
                  OK  |   -.097552   .0063451   -15.37   0.000    -.1106475   -.0844564
                  CO  |  -.0619087   .0010108   -61.25   0.000    -.0639948   -.0598225
                  NM  |  -.1111661   .0049951   -22.25   0.000    -.1214756   -.1008566
                  WA  |   .0445721   .0015145    29.43   0.000     .0414463    .0476979
                  OR  |   .0090889   .0020431     4.45   0.000     .0048721    .0133056
                  CA  |   .0281617   .0025182    11.18   0.000     .0229645     .033359
                  AK  |   .0256943   .0071161     3.61   0.001     .0110073    .0403812
                  HI  |   .0064927   .0047785     1.36   0.187    -.0033696    .0163549
                      |
                 year |
                1990  |  -.0050627   .0035473    -1.43   0.166    -.0123839    .0022586
                1991  |    -.00248   .0048109    -0.52   0.611    -.0124091    .0074492
                1992  |   -.005848   .0046179    -1.27   0.218    -.0153789    .0036829
                1993  |  -.0125945   .0054613    -2.31   0.030     -.023866   -.0013229
                1996  |  -.0273214   .0052963    -5.16   0.000    -.0382525   -.0163902
                1997  |  -.0325305   .0052364    -6.21   0.000    -.0433379    -.021723
                1998  |  -.0388987   .0054741    -7.11   0.000    -.0501967   -.0276007
                1999  |  -.0420765   .0047117    -8.93   0.000    -.0518011    -.032352
                2000  |  -.0472102   .0047688    -9.90   0.000    -.0570524   -.0373679
                2001  |  -.0446937   .0062992    -7.10   0.000    -.0576946   -.0316928
                2002  |  -.0440636   .0068778    -6.41   0.000    -.0582587   -.0298685
                2003  |  -.0497784   .0059143    -8.42   0.000    -.0619849   -.0375719
                2004  |  -.0535566   .0066414    -8.06   0.000    -.0672637   -.0398495
                2005  |  -.0646682   .0070848    -9.13   0.000    -.0792905   -.0500459
                2006  |  -.0699301   .0079142    -8.84   0.000    -.0862641    -.053596
                2007  |  -.0653541   .0082056    -7.96   0.000    -.0822896   -.0484185
                2008  |  -.0523246   .0081156    -6.45   0.000    -.0690744   -.0355749
                2009  |  -.0435211   .0066205    -6.57   0.000    -.0571853    -.029857
                2010  |  -.0482132   .0089694    -5.38   0.000    -.0667251   -.0297014
                2011  |  -.0541222   .0067584    -8.01   0.000    -.0680708   -.0401736
                2012  |  -.0572516   .0066996    -8.55   0.000     -.071079   -.0434242
                2013  |  -.0570092   .0072507    -7.86   0.000    -.0719739   -.0420445
                2014  |  -.0649022   .0066145    -9.81   0.000    -.0785538   -.0512507
                2015  |   -.071727   .0076581    -9.37   0.000    -.0875325   -.0559215
                2016  |  -.0703457   .0084006    -8.37   0.000    -.0876836   -.0530078
                2017  |  -.0611812   .0075815    -8.07   0.000    -.0768286   -.0455339
                2018  |  -.0632143   .0063234   -10.00   0.000    -.0762651   -.0501635
                2019  |  -.0723213   .0080234    -9.01   0.000    -.0888809   -.0557618
                      |
                 nind |
                   2  |   .1612013   .0136432    11.82   0.000     .1330431    .1893594
                   3  |   .1218863   .0124385     9.80   0.000     .0962145    .1475581
                   4  |   .0371707   .0099754     3.73   0.001     .0165825    .0577589
                   5  |   .2050493   .0112411    18.24   0.000     .1818487    .2282499
                   6  |   .0291467   .0105169     2.77   0.011     .0074409    .0508525
                   7  |   .0170343   .0095441     1.78   0.087    -.0026638    .0367324
                   8  |   .0478059   .0161945     2.95   0.007     .0143821    .0812297
                   9  |   .1686279   .0125249    13.46   0.000     .1427778    .1944781
                  10  |   .0263967    .020608     1.28   0.212     -.016136    .0689295
                  11  |    .124033   .0201662     6.15   0.000      .082412    .1656541
                      |
                 educ |   .0100754   .0018319     5.50   0.000     .0062945    .0138563
                exper |   .0095668   .0014011     6.83   0.000     .0066751    .0124585
               exper2 |  -.0001048   .0000886    -1.18   0.248    -.0002876     .000078
               exper3 |   3.83e-06   2.70e-06     1.42   0.169    -1.74e-06    9.40e-06
               exper4 |  -7.93e-08   2.76e-08    -2.87   0.008    -1.36e-07   -2.23e-08
                 edex |  -.0003004   .0000552    -5.44   0.000    -.0004143   -.0001865
                      |
                ee_cl |
                   2  |  -.0229061   .0075441    -3.04   0.006    -.0384764   -.0073359
                   3  |  -.0168531   .0082172    -2.05   0.051    -.0338125    .0001063
                   4  |  -.0344372   .0101583    -3.39   0.002    -.0554028   -.0134715
                   5  |  -.0886158   .0093341    -9.49   0.000    -.1078805   -.0693511
                   6  |   -.005597   .0069836    -0.80   0.431    -.0200104    .0088164
                   7  |   .0069575   .0082984     0.84   0.410    -.0101696    .0240845
                   8  |  -.0479933    .012535    -3.83   0.001    -.0738641   -.0221224
                   9  |  -.0652042   .0094462    -6.90   0.000    -.0847003   -.0457082
                  10  |   .0131507   .0081602     1.61   0.120    -.0036912    .0299925
                  11  |   .0068136   .0099562     0.68   0.500     -.013735    .0273621
                  12  |  -.0646664   .0150289    -4.30   0.000    -.0956846   -.0336482
                  13  |    .016039     .00932     1.72   0.098    -.0031966    .0352745
                  14  |   .0245571   .0083717     2.93   0.007     .0072788    .0418355
                  15  |  -.0035303   .0103242    -0.34   0.735    -.0248385    .0177779
                  16  |   -.072449   .0162026    -4.47   0.000    -.1058896   -.0390083
                      |
                 marr |   .0194253   .0017456    11.13   0.000     .0158225    .0230281
                partt |  -.0762278   .0044035   -17.31   0.000    -.0853163   -.0671393
               public |   .3379199   .0219696    15.38   0.000     .2925769    .3832629
                 cmsa |   .0500571   .0074755     6.70   0.000     .0346283    .0654858
                      |
                nocc2 |
                   2  |   .0575689   .0035331    16.29   0.000     .0502769    .0648608
                   3  |   .0415824   .0057834     7.19   0.000     .0296461    .0535188
                   4  |   .1948516   .0052028    37.45   0.000     .1841136    .2055896
                   5  |   .1891867   .0173092    10.93   0.000     .1534623    .2249111
                   6  |   .1543544    .006054    25.50   0.000     .1418596    .1668491
                   7  |   .0829623   .0030042    27.62   0.000     .0767619    .0891627
                   8  |   .0707669   .0092311     7.67   0.000     .0517148     .089819
                   9  |   .1991407   .0066073    30.14   0.000     .1855039    .2127775
                  10  |   .2360856   .0080669    29.27   0.000     .2194364    .2527349
                  11  |   .2552933   .0096716    26.40   0.000     .2353322    .2752545
                  12  |   .2611929   .0084704    30.84   0.000     .2437109    .2786748
                      |
                unemp |  -.0037477   .0012641    -2.96   0.007    -.0063566   -.0011388
                      |
              quarter |
                   2  |  -.0016007   .0020812    -0.77   0.449     -.005896    .0026946
                   3  |  -.0036533   .0017169    -2.13   0.044    -.0071969   -.0001098
                   4  |  -.0047209    .001347    -3.50   0.002    -.0075011   -.0019407
                      |
                _cons |  -.2630649   .0295008    -8.92   0.000    -.3239515   -.2021783
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee
> _cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 5,692,881,058)

Linear regression                               Number of obs     =    612,127
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2560
                                                Root MSE          =     .35765

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0512362   .0074359     6.89   0.000     .0358892    .0665832
             treat_st |   .0185751   .0089201     2.08   0.048     .0001648    .0369853
treat_stblackrelwhite |  -.0250199   .0118918    -2.10   0.046    -.0495634   -.0004764
                      |
                state |
                  RI  |   .0141321   .0048739     2.90   0.008     .0040729    .0241913
                  CT  |  -.0124527   .0075501    -1.65   0.112    -.0280353    .0031299
                  NY  |   .1145196   .0060859    18.82   0.000     .1019588    .1270803
                  NJ  |   .1252807   .0049751    25.18   0.000     .1150126    .1355489
                  PA  |   .1705173   .0028492    59.85   0.000     .1646367    .1763978
                  OH  |   .2899813   .0042499    68.23   0.000     .2812099    .2987527
                  IN  |   .4503179   .0302893    14.87   0.000     .3878039     .512832
                  IL  |   .1829167   .0037756    48.45   0.000     .1751241    .1907092
                  MI  |   .4333098   .0251227    17.25   0.000      .381459    .4851605
                  WI  |    .341801   .0221053    15.46   0.000     .2961778    .3874241
                  MN  |    .115415   .0034198    33.75   0.000     .1083569     .122473
                  MO  |   .0655339   .0031204    21.00   0.000     .0590938     .071974
                  DE  |   .0889794   .0149981     5.93   0.000     .0580249    .1199339
                  MD  |  -.0905411   .0069282   -13.07   0.000    -.1048401    -.076242
                  DC  |  -.1629018    .019415    -8.39   0.000    -.2029725   -.1228311
                  KY  |  -.0742064   .0179495    -4.13   0.000    -.1112523   -.0371605
                  OK  |   .0091272   .0412528     0.22   0.827    -.0760144    .0942688
                  CO  |  -.2466569    .004013   -61.46   0.000    -.2549394   -.2383745
                  NM  |  -.2507895   .0188611   -13.30   0.000    -.2897168   -.2118622
                  WA  |   .1915662   .0052788    36.29   0.000     .1806713     .202461
                  OR  |   .0708831   .0065797    10.77   0.000     .0573033     .084463
                  CA  |  -.0106004   .0038128    -2.78   0.010    -.0184698   -.0027311
                  AK  |  -.0536658   .0076056    -7.06   0.000     -.069363   -.0379685
                  HI  |   .2393559   .0076048    31.47   0.000     .2236605    .2550513
                      |
        state#c.lyear |
                  MA  |  -.0013726   .0000614   -22.34   0.000    -.0014994   -.0012457
                  RI  |  -.0015001   .0000689   -21.76   0.000    -.0016424   -.0013579
                  CT  |  -.0012532   .0000962   -13.03   0.000    -.0014518   -.0010546
                  NY  |  -.0016743    .000059   -28.39   0.000     -.001796   -.0015526
                  NJ  |  -.0022481   .0000717   -31.36   0.000    -.0023961   -.0021001
                  PA  |  -.0029135   .0000584   -49.87   0.000    -.0030341   -.0027929
                  OH  |  -.0041753   .0000506   -82.48   0.000    -.0042797   -.0040708
                  IN  |  -.0060079   .0003064   -19.61   0.000    -.0066403   -.0053754
                  IL  |  -.0028242   .0000694   -40.69   0.000    -.0029675    -.002681
                  MI  |  -.0052364   .0002558   -20.47   0.000    -.0057643   -.0047085
                  WI  |    -.00484   .0002212   -21.88   0.000    -.0052965   -.0043835
                  MN  |  -.0023393   .0000445   -52.53   0.000    -.0024312   -.0022474
                  MO  |  -.0022045   .0000513   -43.00   0.000    -.0023103   -.0020986
                  DE  |  -.0029054   .0001491   -19.49   0.000    -.0032131   -.0025977
                  MD  |  -.0011174   .0000581   -19.24   0.000    -.0012372   -.0009975
                  DC  |  -.0003891   .0001642    -2.37   0.026     -.000728   -.0000503
                  KY  |   -.001245   .0001678    -7.42   0.000    -.0015914   -.0008985
                  OK  |  -.0026476   .0004369    -6.06   0.000    -.0035493    -.001746
                  CO  |   .0003898   .0000582     6.69   0.000     .0002696    .0005101
                  NM  |   -.000095   .0001869    -0.51   0.616    -.0004807    .0002907
                  WA  |  -.0028215   .0000828   -34.07   0.000    -.0029924   -.0026505
                  OR  |  -.0020196   .0000931   -21.68   0.000    -.0022118   -.0018274
                  CA  |  -.0010429   .0000512   -20.37   0.000    -.0011486   -.0009372
                  AK  |  -.0006424   .0000294   -21.83   0.000    -.0007031   -.0005816
                  HI  |  -.0036155   .0000398   -90.86   0.000    -.0036976   -.0035333
                      |
                 nind |
                   2  |   .1601323   .0137561    11.64   0.000     .1317411    .1885234
                   3  |   .1208934   .0124248     9.73   0.000     .0952498     .146537
                   4  |   .0359976   .0101057     3.56   0.002     .0151405    .0568547
                   5  |   .2038042    .011286    18.06   0.000     .1805111    .2270974
                   6  |   .0281297   .0106107     2.65   0.014     .0062302    .0500291
                   7  |   .0156404   .0096273     1.62   0.117    -.0042295    .0355102
                   8  |   .0467564   .0162616     2.88   0.008     .0131941    .0803188
                   9  |   .1674455   .0125414    13.35   0.000     .1415613    .1933296
                  10  |    .025812    .020661     1.25   0.224    -.0168301    .0684542
                  11  |    .123061   .0202308     6.08   0.000     .0813067    .1648154
                      |
                 educ |    .010697   .0017265     6.20   0.000     .0071337    .0142603
                exper |   .0099521   .0014001     7.11   0.000     .0070624    .0128418
               exper2 |   -.000131   .0000876    -1.49   0.148    -.0003118    .0000499
               exper3 |   4.65e-06   2.66e-06     1.75   0.094    -8.49e-07    .0000102
               exper4 |  -8.68e-08   2.72e-08    -3.19   0.004    -1.43e-07   -3.06e-08
                 edex |  -.0003118   .0000547    -5.70   0.000    -.0004247   -.0001989
                      |
                ee_cl |
                   2  |  -.0234905   .0073462    -3.20   0.004    -.0386523   -.0083287
                   3  |  -.0182399   .0076555    -2.38   0.025    -.0340402   -.0024397
                   4  |  -.0372627   .0094709    -3.93   0.001    -.0568096   -.0177158
                   5  |  -.0871811   .0094777    -9.20   0.000    -.1067421   -.0676201
                   6  |  -.0059492   .0067218    -0.89   0.385    -.0198222    .0079239
                   7  |   .0063393    .007921     0.80   0.431    -.0100089    .0226875
                   8  |  -.0501427   .0117588    -4.26   0.000    -.0744118   -.0258736
                   9  |  -.0644928    .009306    -6.93   0.000    -.0836995   -.0452861
                  10  |   .0123726   .0078394     1.58   0.128    -.0038071    .0285524
                  11  |   .0059914    .009555     0.63   0.537    -.0137292    .0257121
                  12  |   -.066436   .0142061    -4.68   0.000    -.0957559   -.0371161
                  13  |    .015971   .0091132     1.75   0.092    -.0028376    .0347796
                  14  |   .0240157   .0082033     2.93   0.007     .0070849    .0409466
                  15  |  -.0048792   .0099105    -0.49   0.627    -.0253336    .0155751
                  16  |  -.0745258   .0155721    -4.79   0.000    -.1066651   -.0423866
                      |
                 marr |   .0192027   .0017458    11.00   0.000     .0155997    .0228058
                partt |  -.0762678   .0043856   -17.39   0.000    -.0853192   -.0672164
               public |   .3379519   .0220024    15.36   0.000     .2925412    .3833626
                 cmsa |   .0497287   .0078948     6.30   0.000     .0334346    .0660229
                      |
                nocc2 |
                   2  |   .0572741   .0035434    16.16   0.000     .0499609    .0645873
                   3  |   .0415416   .0058454     7.11   0.000     .0294772     .053606
                   4  |   .1942214   .0052098    37.28   0.000     .1834689    .2049738
                   5  |   .1891323   .0173558    10.90   0.000     .1533118    .2249529
                   6  |   .1545928   .0059974    25.78   0.000     .1422147    .1669709
                   7  |   .0832021   .0029646    28.07   0.000     .0770835    .0893207
                   8  |   .0707012   .0092974     7.60   0.000     .0515123    .0898901
                   9  |   .1990856    .006523    30.52   0.000     .1856228    .2125484
                  10  |   .2358464   .0080221    29.40   0.000     .2192897    .2524031
                  11  |   .2552446   .0096072    26.57   0.000     .2354163    .2750729
                  12  |   .2614707   .0084482    30.95   0.000     .2440344    .2789069
                      |
                unemp |  -.0005795   .0004922    -1.18   0.251    -.0015953    .0004363
                      |
              quarter |
                   2  |  -.0016073   .0020804    -0.77   0.447     -.005901    .0026865
                   3  |  -.0037642    .001712    -2.20   0.038    -.0072977   -.0002308
                   4  |  -.0048361   .0013716    -3.53   0.002    -.0076669   -.0020053
                      |
                _cons |  -.1854504   .0320787    -5.78   0.000    -.2516576   -.1192432
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_mal_all_sltt 

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,564,229,473)

Linear regression                               Number of obs     =    617,004
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3164
                                                Root MSE          =     .31716

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0718828   .0112157     6.41   0.000     .0487346    .0950309
             treat_st |  -.0250921   .0119546    -2.10   0.047    -.0497652    -.000419
treat_stblackrelwhite |  -.0248809   .0204975    -1.21   0.237    -.0671858    .0174239
                      |
                state |
                  RI  |   .0143361   .0006705    21.38   0.000     .0129522      .01572
                  CT  |   .0082031   .0007514    10.92   0.000     .0066524    .0097539
                  NY  |   .0728808   .0027691    26.32   0.000     .0671656    .0785959
                  NJ  |   .0147547   .0013449    10.97   0.000      .011979    .0175303
                  PA  |   -.007477   .0008564    -8.73   0.000    -.0092446   -.0057095
                  OH  |  -.0244731   .0013022   -18.79   0.000    -.0271608   -.0217855
                  IN  |  -.0621649   .0036102   -17.22   0.000    -.0696159   -.0547139
                  IL  |  -.0165568    .001286   -12.87   0.000    -.0192111   -.0139026
                  MI  |   .0246399   .0025382     9.71   0.000     .0194014    .0298784
                  WI  |  -.0207956   .0028192    -7.38   0.000    -.0266142    -.014977
                  MN  |   .0197066   .0012698    15.52   0.000      .017086    .0223273
                  MO  |  -.0697572    .001316   -53.01   0.000    -.0724733   -.0670411
                  DE  |  -.0522284   .0054952    -9.50   0.000    -.0635699   -.0408868
                  MD  |  -.0667286    .006034   -11.06   0.000    -.0791821   -.0542751
                  DC  |  -.0851731   .0079039   -10.78   0.000    -.1014861   -.0688602
                  KY  |  -.0819712   .0029235   -28.04   0.000    -.0880049   -.0759375
                  OK  |  -.0923998   .0065527   -14.10   0.000    -.1059238   -.0788757
                  CO  |   -.062694   .0008759   -71.58   0.000    -.0645018   -.0608862
                  NM  |  -.1053871   .0042958   -24.53   0.000    -.1142532   -.0965211
                  WA  |   .0415719   .0013526    30.73   0.000     .0387802    .0443636
                  OR  |   .0245491   .0016444    14.93   0.000     .0211553     .027943
                  CA  |   .0239098    .001407    16.99   0.000     .0210059    .0268136
                  AK  |   .0353577    .005269     6.71   0.000     .0244831    .0462324
                  HI  |   .0308943   .0024497    12.61   0.000     .0258384    .0359503
                      |
                 year |
                1990  |   -.000958    .002147    -0.45   0.659    -.0053893    .0034732
                1991  |  -.0034283   .0022376    -1.53   0.139    -.0080464    .0011898
                1992  |  -.0020886   .0027659    -0.76   0.458    -.0077971    .0036199
                1993  |  -.0015438   .0030978    -0.50   0.623    -.0079374    .0048497
                1996  |   -.000338   .0032504    -0.10   0.918    -.0070465    .0063705
                1997  |   -.003326   .0032249    -1.03   0.313    -.0099818    .0033298
                1998  |  -.0089775   .0041021    -2.19   0.039    -.0174439   -.0005112
                1999  |  -.0108255   .0036585    -2.96   0.007    -.0183764   -.0032747
                2000  |  -.0065317   .0031531    -2.07   0.049    -.0130394    -.000024
                2001  |  -.0064311   .0025139    -2.56   0.017    -.0116194   -.0012427
                2002  |  -.0071158   .0046664    -1.52   0.140    -.0167467    .0025151
                2003  |  -.0143367   .0035798    -4.00   0.001    -.0217252   -.0069483
                2004  |  -.0168007   .0043114    -3.90   0.001    -.0256991   -.0079024
                2005  |  -.0195742   .0047968    -4.08   0.000    -.0294744   -.0096741
                2006  |  -.0212912   .0045723    -4.66   0.000    -.0307279   -.0118544
                2007  |  -.0176182   .0059642    -2.95   0.007    -.0299278   -.0053086
                2008  |  -.0176818   .0054934    -3.22   0.004    -.0290197   -.0063439
                2009  |  -.0154831   .0053915    -2.87   0.008    -.0266106   -.0043557
                2010  |  -.0195672   .0054268    -3.61   0.001    -.0307677   -.0083668
                2011  |   -.016831   .0050684    -3.32   0.003    -.0272916   -.0063704
                2012  |  -.0239361    .005559    -4.31   0.000    -.0354094   -.0124628
                2013  |  -.0213999   .0065342    -3.28   0.003    -.0348858   -.0079139
                2014  |  -.0220276   .0063213    -3.48   0.002    -.0350742    -.008981
                2015  |  -.0269337   .0071592    -3.76   0.001    -.0417096   -.0121578
                2016  |  -.0190605    .006223    -3.06   0.005    -.0319042   -.0062168
                2017  |  -.0231481      .0071    -3.26   0.003    -.0378019   -.0084944
                2018  |  -.0290253   .0047222    -6.15   0.000    -.0387714   -.0192793
                2019  |  -.0263896   .0071759    -3.68   0.001    -.0411999   -.0115793
                      |
                 nind |
                   2  |   .0609018   .0119801     5.08   0.000     .0361761    .0856274
                   3  |   .0743272   .0122402     6.07   0.000     .0490646    .0995897
                   4  |   .0663427   .0082178     8.07   0.000      .049382    .0833033
                   5  |   .1989482   .0101856    19.53   0.000     .1779261    .2199702
                   6  |   .0345732   .0091531     3.78   0.001      .015682    .0534643
                   7  |   .0237234   .0090019     2.64   0.014     .0051445    .0423024
                   8  |   .0546974   .0108154     5.06   0.000     .0323755    .0770193
                   9  |   .1940191   .0134291    14.45   0.000     .1663029    .2217353
                  10  |   .0192162   .0089472     2.15   0.042     .0007501    .0376823
                  11  |    .039209   .0226704     1.73   0.097    -.0075804    .0859983
                      |
                 educ |   .0154879   .0024126     6.42   0.000     .0105085    .0204673
                exper |   .0112302   .0015149     7.41   0.000     .0081035    .0143568
               exper2 |  -.0004288   .0000942    -4.55   0.000    -.0006231   -.0002344
               exper3 |   .0000107   3.10e-06     3.44   0.002     4.27e-06    .0000171
               exper4 |  -1.04e-07   3.31e-08    -3.13   0.005    -1.72e-07   -3.53e-08
                 edex |  -.0001977   .0000536    -3.69   0.001    -.0003083    -.000087
                      |
                ee_cl |
                   2  |   -.036542   .0058203    -6.28   0.000    -.0485545   -.0245295
                   3  |   -.069589   .0068242   -10.20   0.000    -.0836734   -.0555046
                   4  |  -.1000136   .0140272    -7.13   0.000    -.1289644   -.0710628
                   5  |  -.0476278   .0084211    -5.66   0.000    -.0650082   -.0302475
                   6  |  -.0417296   .0063801    -6.54   0.000    -.0548973   -.0285618
                   7  |  -.0631908     .00884    -7.15   0.000    -.0814357   -.0449459
                   8  |  -.0920067   .0133417    -6.90   0.000    -.1195427   -.0644708
                   9  |  -.0276981   .0094856    -2.92   0.007    -.0472753   -.0081208
                  10  |  -.0423039   .0079328    -5.33   0.000    -.0586764   -.0259315
                  11  |  -.0634235   .0097107    -6.53   0.000    -.0834655   -.0433816
                  12  |   -.084585   .0125147    -6.76   0.000    -.1104141   -.0587559
                  13  |  -.0003269   .0089978    -0.04   0.971    -.0188974    .0182435
                  14  |  -.0374621   .0090486    -4.14   0.000    -.0561376   -.0187866
                  15  |  -.0602859    .010588    -5.69   0.000    -.0821385   -.0384332
                  16  |  -.0784075   .0142253    -5.51   0.000    -.1077671   -.0490479
                      |
                 marr |  -.0004779   .0012147    -0.39   0.697    -.0029849     .002029
                partt |  -.0670209   .0056484   -11.87   0.000    -.0786786   -.0553632
               public |   .3686847   .0231871    15.90   0.000     .3208289    .4165404
                 cmsa |   .0264265   .0041977     6.30   0.000     .0177629      .03509
                      |
                nocc2 |
                   2  |   .0233886   .0023564     9.93   0.000     .0185253    .0282519
                   3  |   .0423635    .007023     6.03   0.000     .0278687    .0568583
                   4  |    .169448   .0043528    38.93   0.000     .1604644    .1784317
                   5  |   .1771639   .0147724    11.99   0.000     .1466751    .2076527
                   6  |   .0765252   .0036519    20.95   0.000      .068988    .0840625
                   7  |   .1056626   .0058529    18.05   0.000     .0935828    .1177425
                   8  |   .0577361   .0047821    12.07   0.000     .0478663    .0676059
                   9  |   .1208306    .008441    14.31   0.000     .1034094    .1382519
                  10  |   .2282394   .0090016    25.36   0.000      .209661    .2468179
                  11  |   .2595738    .009471    27.41   0.000     .2400267    .2791209
                  12  |   .2260079   .0118558    19.06   0.000     .2015388     .250477
                      |
              quarter |
                   2  |  -.0023106   .0012545    -1.84   0.078    -.0048998    .0002787
                   3  |  -.0002309   .0011914    -0.19   0.848    -.0026899    .0022281
                   4  |  -.0039584   .0016359    -2.42   0.023    -.0073347   -.0005821
                      |
                _cons |  -.2820379   .0336702    -8.38   0.000    -.3515297   -.2125461
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,564,229,473)

Linear regression                               Number of obs     =    617,004
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3164
                                                Root MSE          =     .31716

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0718738   .0112107     6.41   0.000     .0487361    .0950115
             treat_st |  -.0256765     .01176    -2.18   0.039     -.049948    -.001405
treat_stblackrelwhite |   -.025039   .0205199    -1.22   0.234    -.0673901    .0173121
                      |
                state |
                  RI  |   .0166172   .0014551    11.42   0.000      .013614    .0196203
                  CT  |   .0083603   .0007045    11.87   0.000     .0069062    .0098143
                  NY  |   .0744623   .0024531    30.35   0.000     .0693993    .0795252
                  NJ  |   .0158903   .0012394    12.82   0.000     .0133322    .0184484
                  PA  |  -.0066972   .0008487    -7.89   0.000    -.0084488   -.0049456
                  OH  |  -.0231467   .0012477   -18.55   0.000    -.0257217   -.0205716
                  IN  |  -.0620076   .0035511   -17.46   0.000    -.0693366   -.0546786
                  IL  |  -.0144053   .0012998   -11.08   0.000    -.0170879   -.0117227
                  MI  |   .0280025   .0031326     8.94   0.000     .0215371    .0344679
                  WI  |  -.0217386   .0028355    -7.67   0.000    -.0275908   -.0158863
                  MN  |   .0177537   .0017323    10.25   0.000     .0141785    .0213289
                  MO  |  -.0694034   .0012428   -55.84   0.000    -.0719685   -.0668383
                  DE  |  -.0537076   .0059155    -9.08   0.000    -.0659167   -.0414985
                  MD  |  -.0675716   .0062453   -10.82   0.000    -.0804613    -.054682
                  DC  |  -.0813394   .0071822   -11.33   0.000    -.0961627   -.0665161
                  KY  |  -.0801636    .002904   -27.60   0.000    -.0861572     -.07417
                  OK  |  -.0933389   .0063943   -14.60   0.000    -.1065361   -.0801418
                  CO  |  -.0636574   .0009494   -67.05   0.000    -.0656168    -.061698
                  NM  |  -.1038874   .0042293   -24.56   0.000    -.1126163   -.0951585
                  WA  |   .0433957   .0018045    24.05   0.000     .0396715    .0471199
                  OR  |   .0271033   .0023764    11.41   0.000     .0221987    .0320078
                  CA  |   .0273616   .0021655    12.64   0.000     .0228923    .0318309
                  AK  |   .0398703   .0055278     7.21   0.000     .0284615    .0512792
                  HI  |   .0283711   .0030263     9.37   0.000      .022125    .0346171
                      |
                 year |
                1990  |   .0000549   .0024403     0.02   0.982    -.0049815    .0050914
                1991  |   .0005588   .0038432     0.15   0.886    -.0073731    .0084907
                1992  |   .0033707   .0034796     0.97   0.342    -.0038108    .0105522
                1993  |   .0027062   .0038096     0.71   0.484    -.0051565    .0105689
                1996  |   .0002406   .0032601     0.07   0.942     -.006488    .0069691
                1997  |  -.0037588   .0032008    -1.17   0.252    -.0103649    .0028474
                1998  |  -.0103718   .0041345    -2.51   0.019     -.018905   -.0018387
                1999  |  -.0128817   .0037069    -3.48   0.002    -.0205323   -.0052311
                2000  |  -.0090029    .003012    -2.99   0.006    -.0152194   -.0027865
                2001  |  -.0073092    .002477    -2.95   0.007    -.0124214   -.0021969
                2002  |  -.0056006   .0049081    -1.14   0.265    -.0157304    .0045292
                2003  |   -.012113   .0039454    -3.07   0.005    -.0202559     -.00397
                2004  |  -.0154651   .0046121    -3.35   0.003     -.024984   -.0059462
                2005  |  -.0192631   .0048747    -3.95   0.001    -.0293239   -.0092022
                2006  |  -.0217924   .0046347    -4.70   0.000    -.0313579   -.0122269
                2007  |  -.0181023   .0061761    -2.93   0.007    -.0308491   -.0053555
                2008  |  -.0158536   .0058694    -2.70   0.012    -.0279675   -.0037397
                2009  |  -.0061238   .0076648    -0.80   0.432    -.0219431    .0096955
                2010  |   -.009543   .0077821    -1.23   0.232    -.0256046    .0065185
                2011  |    -.00856   .0071205    -1.20   0.241     -.023256     .006136
                2012  |  -.0172636   .0071032    -2.43   0.023     -.031924   -.0026033
                2013  |  -.0159306   .0075072    -2.12   0.044    -.0314246   -.0004365
                2014  |  -.0194803   .0065458    -2.98   0.007    -.0329902   -.0059704
                2015  |  -.0265292   .0073289    -3.62   0.001    -.0416553    -.011403
                2016  |   -.019444   .0062327    -3.12   0.005    -.0323077   -.0065803
                2017  |  -.0245362   .0071959    -3.41   0.002    -.0393878   -.0096846
                2018  |  -.0313566   .0052755    -5.94   0.000    -.0422447   -.0204686
                2019  |   -.029078     .00782    -3.72   0.001    -.0452176   -.0129384
                      |
                 nind |
                   2  |   .0607877   .0119757     5.08   0.000      .036071    .0855044
                   3  |   .0742446   .0122259     6.07   0.000     .0490115    .0994777
                   4  |   .0662679   .0082323     8.05   0.000     .0492773    .0832586
                   5  |   .1988779   .0102091    19.48   0.000     .1778073    .2199484
                   6  |   .0344919   .0091653     3.76   0.001     .0155756    .0534083
                   7  |   .0236231   .0090103     2.62   0.015     .0050268    .0422195
                   8  |   .0546272   .0108127     5.05   0.000     .0323108    .0769436
                   9  |   .1939229   .0134209    14.45   0.000     .1662236    .2216222
                  10  |   .0191273   .0089751     2.13   0.044     .0006035    .0376511
                  11  |   .0390799   .0226692     1.72   0.098     -.007707    .0858667
                      |
                 educ |   .0154798   .0024152     6.41   0.000     .0104951    .0204646
                exper |   .0112413   .0015144     7.42   0.000     .0081156    .0143669
               exper2 |  -.0004298    .000094    -4.57   0.000    -.0006239   -.0002358
               exper3 |   .0000107   3.09e-06     3.46   0.002     4.32e-06    .0000171
               exper4 |  -1.04e-07   3.30e-08    -3.15   0.004    -1.72e-07   -3.57e-08
                 edex |  -.0001976   .0000535    -3.69   0.001    -.0003081   -.0000871
                      |
                ee_cl |
                   2  |   -.036489   .0058112    -6.28   0.000    -.0484828   -.0244951
                   3  |  -.0695146   .0067959   -10.23   0.000    -.0835406   -.0554886
                   4  |  -.0999242   .0140113    -7.13   0.000     -.128842   -.0710063
                   5  |  -.0475872   .0083995    -5.67   0.000     -.064923   -.0302514
                   6  |  -.0416732   .0063612    -6.55   0.000     -.054802   -.0285444
                   7  |  -.0630869   .0088018    -7.17   0.000    -.0812528    -.044921
                   8  |  -.0919005   .0133076    -6.91   0.000    -.1193661   -.0644349
                   9  |  -.0276467    .009483    -2.92   0.008    -.0472186   -.0080748
                  10  |  -.0422458   .0079046    -5.34   0.000    -.0585601   -.0259315
                  11  |  -.0633163   .0096676    -6.55   0.000    -.0832693   -.0433634
                  12  |   -.084468   .0124736    -6.77   0.000    -.1102123   -.0587237
                  13  |  -.0002658   .0089711    -0.03   0.977    -.0187811    .0182495
                  14  |  -.0373679   .0090068    -4.15   0.000     -.055957   -.0187788
                  15  |  -.0601579   .0105329    -5.71   0.000    -.0818967    -.038419
                  16  |  -.0782905   .0141933    -5.52   0.000     -.107584   -.0489969
                      |
                 marr |  -.0004787   .0012145    -0.39   0.697    -.0029853    .0020279
                partt |  -.0669957   .0056349   -11.89   0.000    -.0786255   -.0553658
               public |     .36871   .0231952    15.90   0.000     .3208374    .4165825
                 cmsa |   .0264365   .0042019     6.29   0.000     .0177643    .0351088
                      |
                nocc2 |
                   2  |   .0233715   .0023525     9.93   0.000     .0185161    .0282268
                   3  |    .042353   .0070178     6.04   0.000      .027869     .056837
                   4  |   .1694413   .0043515    38.94   0.000     .1604603    .1784223
                   5  |   .1771448   .0147749    11.99   0.000     .1466508    .2076388
                   6  |   .0765268   .0036508    20.96   0.000     .0689918    .0840618
                   7  |   .1056525   .0058455    18.07   0.000     .0935879    .1177171
                   8  |   .0577803   .0047926    12.06   0.000     .0478889    .0676718
                   9  |   .1208252     .00844    14.32   0.000     .1034059    .1382446
                  10  |   .2281856   .0089863    25.39   0.000     .2096387    .2467325
                  11  |   .2595433   .0094723    27.40   0.000     .2399934    .2790932
                  12  |   .2259705   .0118681    19.04   0.000     .2014759    .2504651
                      |
                unemp |  -.0021651    .001314    -1.65   0.112    -.0048771    .0005469
                      |
              quarter |
                   2  |  -.0023001   .0012531    -1.84   0.079    -.0048864    .0002861
                   3  |  -.0002093   .0011815    -0.18   0.861    -.0026478    .0022291
                   4  |  -.0039179   .0016102    -2.43   0.023    -.0072412   -.0005946
                      |
                _cons |  -.2721018   .0314138    -8.66   0.000    -.3369366    -.207267
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee
> _cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,564,229,473)

Linear regression                               Number of obs     =    617,004
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3168
                                                Root MSE          =     .31705

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0720264   .0111986     6.43   0.000     .0489136    .0951392
             treat_st |  -.0080755   .0121418    -0.67   0.512    -.0331348    .0169839
treat_stblackrelwhite |  -.0274409   .0202678    -1.35   0.188    -.0692716    .0143898
                      |
                state |
                  RI  |    -.03901   .0048341    -8.07   0.000     -.048987   -.0290329
                  CT  |  -.0713078   .0064009   -11.14   0.000    -.0845186    -.058097
                  NY  |   .0177689   .0047219     3.76   0.001     .0080235    .0275144
                  NJ  |   .1465347   .0059462    24.64   0.000     .1342624    .1588069
                  PA  |    .129276   .0050063    25.82   0.000     .1189435    .1396085
                  OH  |   .1257823   .0046676    26.95   0.000     .1161489    .1354157
                  IN  |    .139152   .0390931     3.56   0.002     .0584678    .2198363
                  IL  |   .0360295   .0056927     6.33   0.000     .0242804    .0477786
                  MI  |   .1297228   .0350387     3.70   0.001     .0574065    .2020392
                  WI  |    .323527   .0297581    10.87   0.000     .2621093    .3849448
                  MN  |   .1733284   .0036673    47.26   0.000     .1657594    .1808974
                  MO  |    .038853   .0046619     8.33   0.000     .0292312    .0484748
                  DE  |   .0169057   .0192582     0.88   0.389    -.0228412    .0566526
                  MD  |   .1096753   .0075037    14.62   0.000     .0941884    .1251622
                  DC  |  -.0857621   .0365513    -2.35   0.028    -.1612002    -.010324
                  KY  |  -.0859939   .0202684    -4.24   0.000    -.1278259   -.0441619
                  OK  |  -.0148114   .0525709    -0.28   0.781    -.1233124    .0936896
                  CO  |  -.1518927   .0039628   -38.33   0.000    -.1600716   -.1437138
                  NM  |  -.1331555   .0098684   -13.49   0.000    -.1535229   -.1127882
                  WA  |   .1432711   .0037445    38.26   0.000     .1355428    .1509995
                  OR  |   .0025689    .005261     0.49   0.630    -.0082892    .0134271
                  CA  |  -.0284514   .0036045    -7.89   0.000    -.0358906   -.0210121
                  AK  |   -.014527    .004242    -3.42   0.002    -.0232821   -.0057718
                  HI  |   .2015623   .0067497    29.86   0.000     .1876317    .2154929
                      |
        state#c.lyear |
                  MA  |  -.0003839   .0000616    -6.23   0.000    -.0005111   -.0002567
                  RI  |   .0001306   .0000824     1.58   0.126    -.0000395    .0003006
                  CT  |   .0003849    .000086     4.48   0.000     .0002075    .0005624
                  NY  |   .0001565   .0000435     3.60   0.001     .0000667    .0002464
                  NJ  |  -.0016528   .0000473   -34.94   0.000    -.0017504   -.0015552
                  PA  |  -.0017043   .0000348   -49.00   0.000    -.0017761   -.0016325
                  OH  |  -.0018343     .00005   -36.69   0.000    -.0019375   -.0017311
                  IN  |  -.0023679   .0004081    -5.80   0.000    -.0032103   -.0015255
                  IL  |  -.0008924   .0000457   -19.53   0.000    -.0009867   -.0007981
                  MI  |  -.0014326   .0003599    -3.98   0.001    -.0021753   -.0006899
                  WI  |  -.0037378   .0003125   -11.96   0.000    -.0043828   -.0030929
                  MN  |  -.0018642   .0000414   -45.07   0.000    -.0019496   -.0017788
                  MO  |  -.0014316   .0000646   -22.15   0.000     -.001565   -.0012982
                  DE  |  -.0010593   .0001269    -8.35   0.000    -.0013212   -.0007974
                  MD  |  -.0020714   .0000559   -37.03   0.000    -.0021868   -.0019559
                  DC  |  -.0003831   .0002343    -1.63   0.115    -.0008667    .0001005
                  KY  |  -.0003646   .0002018    -1.81   0.083    -.0007812    .0000519
                  OK  |  -.0012261   .0005755    -2.13   0.044    -.0024138   -.0000383
                  CO  |   .0004641   .0000682     6.80   0.000     .0003233    .0006049
                  NM  |  -.0001267   .0001068    -1.19   0.247    -.0003472    .0000937
                  WA  |  -.0013643   .0000414   -32.95   0.000    -.0014498   -.0012789
                  OR  |  -.0001758   .0000733    -2.40   0.025    -.0003272   -.0000245
                  CA  |   .0001283   .0000629     2.04   0.052    -1.50e-06    .0002582
                  AK  |   .0001163   .0000872     1.33   0.195    -.0000638    .0002963
                  HI  |  -.0020579   .0001044   -19.71   0.000    -.0022734   -.0018424
                      |
                 nind |
                   2  |   .0600954   .0120666     4.98   0.000     .0351911    .0849997
                   3  |   .0738807   .0122426     6.03   0.000     .0486133    .0991481
                   4  |   .0656011   .0082807     7.92   0.000     .0485106    .0826915
                   5  |   .1980296   .0102154    19.39   0.000      .176946    .2191132
                   6  |   .0340868   .0092069     3.70   0.001     .0150847    .0530889
                   7  |   .0229963   .0090744     2.53   0.018     .0042676    .0417251
                   8  |   .0540559   .0109438     4.94   0.000      .031469    .0766427
                   9  |   .1933489   .0135585    14.26   0.000     .1653654    .2213323
                  10  |    .018652   .0089007     2.10   0.047     .0002819    .0370222
                  11  |   .0383576   .0227839     1.68   0.105    -.0086662    .0853813
                      |
                 educ |   .0153718    .002288     6.72   0.000     .0106496    .0200939
                exper |   .0112551   .0015137     7.44   0.000      .008131    .0143792
               exper2 |  -.0004284   .0000932    -4.60   0.000    -.0006208    -.000236
               exper3 |   .0000106   3.07e-06     3.46   0.002     4.29e-06     .000017
               exper4 |  -1.03e-07   3.28e-08    -3.14   0.004    -1.71e-07   -3.52e-08
                 edex |  -.0001984   .0000538    -3.69   0.001    -.0003094   -.0000875
                      |
                ee_cl |
                   2  |  -.0369774    .005715    -6.47   0.000    -.0487726   -.0251821
                   3  |  -.0693889   .0065409   -10.61   0.000    -.0828886   -.0558892
                   4  |   -.099776   .0134946    -7.39   0.000    -.1276274   -.0719245
                   5  |   -.048398   .0086037    -5.63   0.000    -.0661551   -.0306409
                   6  |  -.0425862   .0064347    -6.62   0.000    -.0558668   -.0293056
                   7  |   -.062767    .008665    -7.24   0.000    -.0806508   -.0448833
                   8  |  -.0916538   .0129239    -7.09   0.000    -.1183274   -.0649803
                   9  |  -.0285865   .0096441    -2.96   0.007    -.0484909   -.0086821
                  10  |  -.0428322   .0079371    -5.40   0.000    -.0592136   -.0264508
                  11  |  -.0631524   .0095647    -6.60   0.000    -.0828929    -.043412
                  12  |  -.0842351   .0120602    -6.98   0.000    -.1091261   -.0593441
                  13  |  -.0012592   .0091848    -0.14   0.892    -.0202157    .0176973
                  14  |  -.0376366   .0089737    -4.19   0.000    -.0561574   -.0191157
                  15  |  -.0602506   .0103938    -5.80   0.000    -.0817023   -.0387988
                  16  |  -.0785004   .0137473    -5.71   0.000    -.1068734   -.0501274
                      |
                 marr |  -.0004528   .0012122    -0.37   0.712    -.0029546    .0020491
                partt |   -.067028   .0055939   -11.98   0.000    -.0785732   -.0554828
               public |   .3686549   .0232161    15.88   0.000     .3207393    .4165705
                 cmsa |   .0262875   .0043164     6.09   0.000      .017379    .0351961
                      |
                nocc2 |
                   2  |   .0235473   .0023314    10.10   0.000     .0187356     .028359
                   3  |   .0423221   .0070117     6.04   0.000     .0278506    .0567936
                   4  |   .1692393   .0043699    38.73   0.000     .1602204    .1782582
                   5  |      .1771   .0147843    11.98   0.000     .1465867    .2076132
                   6  |   .0764646    .003659    20.90   0.000     .0689129    .0840164
                   7  |   .1057371   .0057509    18.39   0.000     .0938679    .1176064
                   8  |   .0577077   .0048319    11.94   0.000     .0477351    .0676804
                   9  |   .1206052   .0084194    14.32   0.000     .1032284    .1379819
                  10  |   .2274738   .0090469    25.14   0.000     .2088019    .2461456
                  11  |    .259673   .0095154    27.29   0.000     .2400342    .2793118
                  12  |   .2259838   .0119052    18.98   0.000     .2014127    .2505549
                      |
                unemp |   .0000757    .000428     0.18   0.861    -.0008076     .000959
                      |
              quarter |
                   2  |   -.002412   .0012537    -1.92   0.066    -.0049996    .0001755
                   3  |  -.0003271   .0012263    -0.27   0.792    -.0028581     .002204
                   4  |  -.0040256   .0016459    -2.45   0.022    -.0074226   -.0006286
                      |
                _cons |  -.2531042   .0286939    -8.82   0.000    -.3123256   -.1938828
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,700,864,564)

Linear regression                               Number of obs     =    613,198
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5099
                                                Root MSE          =     .41761

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1438453   .0067131   -21.43   0.000    -.1577006     -.12999
             treat_st |  -.0347589   .0187194    -1.86   0.076    -.0733939    .0038761
treat_stblackrelwhite |   -.011029   .0076036    -1.45   0.160     -.026722     .004664
                      |
                state |
                  RI  |  -.0883848   .0010993   -80.40   0.000    -.0906537    -.086116
                  CT  |   .0126486   .0007822    16.17   0.000     .0110343    .0142629
                  NY  |  -.0220439   .0011248   -19.60   0.000    -.0243654   -.0197224
                  NJ  |   .0511139   .0009687    52.76   0.000     .0491145    .0531133
                  PA  |  -.1083306   .0030174   -35.90   0.000    -.1145583   -.1021029
                  OH  |  -.1364049   .0036914   -36.95   0.000    -.1440236   -.1287861
                  IN  |  -.1129322   .0075495   -14.96   0.000    -.1285136   -.0973509
                  IL  |  -.0380076   .0022018   -17.26   0.000     -.042552   -.0334633
                  MI  |  -.0727677   .0048557   -14.99   0.000    -.0827894   -.0627459
                  WI  |  -.0973982   .0066836   -14.57   0.000    -.1111926   -.0836039
                  MN  |  -.0497195   .0035331   -14.07   0.000    -.0570114   -.0424276
                  MO  |  -.1393835   .0037088   -37.58   0.000     -.147038    -.131729
                  DE  |  -.0679398   .0133578    -5.09   0.000    -.0955089   -.0403707
                  MD  |   .0042505   .0014151     3.00   0.006     .0013298    .0071712
                  DC  |   .0505882   .0054797     9.23   0.000     .0392787    .0618977
                  KY  |  -.1616308   .0071773   -22.52   0.000     -.176444   -.1468176
                  OK  |  -.1762599   .0122588   -14.38   0.000    -.2015609    -.150959
                  CO  |  -.0836437   .0012309   -67.95   0.000    -.0861842   -.0811032
                  NM  |  -.1547578   .0053669   -28.84   0.000    -.1658346    -.143681
                  WA  |   -.021167   .0018504   -11.44   0.000    -.0249861    -.017348
                  OR  |  -.0934027   .0028519   -32.75   0.000    -.0992888   -.0875167
                  CA  |   .0394901   .0007962    49.60   0.000     .0378468    .0411334
                  AK  |   .1159413   .0059133    19.61   0.000     .1037369    .1281457
                  HI  |  -.0075477   .0039011    -1.93   0.065    -.0155992    .0005038
                      |
                 year |
                1990  |  -.0086166   .0033692    -2.56   0.017    -.0155703   -.0016628
                1991  |  -.0217173   .0034664    -6.27   0.000    -.0288716   -.0145629
                1992  |  -.0226061   .0037176    -6.08   0.000    -.0302789   -.0149333
                1993  |  -.0320908   .0039753    -8.07   0.000    -.0402954   -.0238862
                1996  |  -.0285331   .0070745    -4.03   0.000    -.0431341   -.0139321
                1997  |  -.0176111   .0071386    -2.47   0.021    -.0323445   -.0028778
                1998  |   .0021084   .0054722     0.39   0.703    -.0091857    .0134025
                1999  |   .0245419   .0072996     3.36   0.003     .0094763    .0396074
                2000  |   .0349907   .0068919     5.08   0.000     .0207665    .0492149
                2001  |   .0497218   .0074862     6.64   0.000      .034271    .0651726
                2002  |   .0566993   .0074549     7.61   0.000     .0413132    .0720854
                2003  |   .0421043    .008218     5.12   0.000     .0251431    .0590655
                2004  |   .0368006   .0080475     4.57   0.000     .0201913    .0534099
                2005  |   .0211729   .0077519     2.73   0.012     .0051738     .037172
                2006  |    .014965    .008679     1.72   0.098    -.0029475    .0328776
                2007  |   .0158031   .0100113     1.58   0.128    -.0048591    .0364654
                2008  |   .0065375   .0106685     0.61   0.546    -.0154811    .0285562
                2009  |   .0188792   .0096053     1.97   0.061    -.0009453    .0387036
                2010  |   .0127229   .0111818     1.14   0.266    -.0103552     .035801
                2011  |  -.0057343   .0091035    -0.63   0.535    -.0245229    .0130544
                2012  |  -.0136589    .010659    -1.28   0.212    -.0356579    .0083401
                2013  |  -.0117804   .0092363    -1.28   0.214    -.0308431    .0072824
                2014  |  -.0122438   .0075805    -1.62   0.119    -.0278891    .0034016
                2015  |   .0119978   .0076867     1.56   0.132    -.0038668    .0278623
                2016  |   .0185354   .0096893     1.91   0.068    -.0014624    .0385332
                2017  |   .0330141    .010685     3.09   0.005     .0109613    .0550668
                2018  |   .0397821    .010201     3.90   0.001     .0187283    .0608359
                2019  |   .0603097   .0090871     6.64   0.000     .0415549    .0790645
                      |
                 nind |
                   2  |   .1416244   .0289542     4.89   0.000     .0818659    .2013828
                   3  |   .1302005   .0252492     5.16   0.000     .0780888    .1823122
                   4  |  -.0568348   .0259042    -2.19   0.038    -.1102985   -.0033712
                   5  |   .1596015   .0249548     6.40   0.000     .1080974    .2111056
                   6  |   .1336605   .0304387     4.39   0.000     .0708381     .196483
                   7  |   .0306367   .0279804     1.09   0.284    -.0271121    .0883854
                   8  |  -.0364284   .0263045    -1.38   0.179    -.0907182    .0178613
                   9  |  -.0265087   .0281129    -0.94   0.355     -.084531    .0315135
                  10  |  -.0680026   .0290461    -2.34   0.028    -.1279508   -.0080544
                  11  |   .1476389   .0283144     5.21   0.000     .0892009     .206077
                      |
                 educ |   .0670104   .0025907    25.87   0.000     .0616635    .0723572
                exper |   .0455012   .0025262    18.01   0.000     .0402875    .0507149
               exper2 |  -.0010358   .0001147    -9.03   0.000    -.0012725   -.0007992
               exper3 |   7.15e-06   2.72e-06     2.63   0.015     1.54e-06    .0000128
               exper4 |   8.35e-09   2.59e-08     0.32   0.750    -4.50e-08    6.17e-08
                 edex |    -.00033   .0000744    -4.44   0.000    -.0004835   -.0001765
                      |
                ee_cl |
                   2  |  -.0623733   .0058268   -10.70   0.000    -.0743992   -.0503474
                   3  |  -.0729445   .0072026   -10.13   0.000      -.08781   -.0580791
                   4  |  -.0334334   .0116119    -2.88   0.008    -.0573991   -.0094676
                   5  |  -.1365077   .0094741   -14.41   0.000    -.1560614    -.116954
                   6  |  -.0824368   .0072408   -11.39   0.000     -.097381   -.0674926
                   7  |  -.0648175   .0081463    -7.96   0.000    -.0816306   -.0480045
                   8  |   .0160475   .0112584     1.43   0.167    -.0071888    .0392837
                   9  |  -.1415951   .0110782   -12.78   0.000    -.1644593   -.1187309
                  10  |  -.0885328   .0100282    -8.83   0.000      -.10923   -.0678357
                  11  |  -.0585906    .009789    -5.99   0.000     -.078794   -.0383871
                  12  |   .0150252   .0122267     1.23   0.231    -.0102096    .0402599
                  13  |  -.0486238   .0121554    -4.00   0.001    -.0737114   -.0235363
                  14  |  -.0683782    .011798    -5.80   0.000    -.0927281   -.0440283
                  15  |  -.0504015   .0105893    -4.76   0.000    -.0722568   -.0285463
                  16  |   .0076985   .0130434     0.59   0.561    -.0192218    .0346188
                      |
                 marr |   .1207528   .0033072    36.51   0.000     .1139271    .1275785
                partt |   -.224643   .0060337   -37.23   0.000    -.2370959   -.2121901
               public |   .0342105   .0072641     4.71   0.000     .0192181    .0492028
                 cmsa |   .1450471   .0130091    11.15   0.000     .1181978    .1718965
                      |
                nocc2 |
                   2  |  -.1425527    .004562   -31.25   0.000    -.1519681   -.1331372
                   3  |   -.044486   .0080881    -5.50   0.000    -.0611789    -.027793
                   4  |  -.2801422   .0125736   -22.28   0.000    -.3060929   -.2541915
                   5  |  -.0731787   .0094935    -7.71   0.000    -.0927723   -.0535852
                   6  |   -.373901   .0079179   -47.22   0.000    -.3902426   -.3575593
                   7  |  -.2304777   .0068713   -33.54   0.000    -.2446593   -.2162961
                   8  |  -.0930907   .0148538    -6.27   0.000    -.1237475   -.0624338
                   9  |  -.3860946   .0052206   -73.96   0.000    -.3968693   -.3753199
                  10  |  -.3267579   .0067944   -48.09   0.000    -.3407808    -.312735
                  11  |  -.2158035   .0060173   -35.86   0.000    -.2282225   -.2033844
                  12  |  -.3795033   .0078469   -48.36   0.000    -.3956984   -.3633081
                      |
              quarter |
                   2  |   .0013099   .0022509     0.58   0.566    -.0033359    .0059556
                   3  |   .0024243   .0027832     0.87   0.392    -.0033199    .0081686
                   4  |   .0130874   .0020827     6.28   0.000      .008789    .0173859
                      |
                _cons |   .7232357   .0508131    14.23   0.000     .6183626    .8281087
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,700,864,564)

Linear regression                               Number of obs     =    613,198
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5099
                                                Root MSE          =     .41759

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1438654   .0067158   -21.42   0.000    -.1577261   -.1300046
             treat_st |  -.0360184   .0194113    -1.86   0.076    -.0760813    .0040446
treat_stblackrelwhite |  -.0112477   .0077383    -1.45   0.159    -.0272187    .0047234
                      |
                state |
                  RI  |  -.0835241   .0024335   -34.32   0.000    -.0885467   -.0785016
                  CT  |   .0128816   .0006915    18.63   0.000     .0114544    .0143089
                  NY  |  -.0186628   .0020379    -9.16   0.000    -.0228688   -.0144569
                  NJ  |    .053502   .0016467    32.49   0.000     .0501033    .0569007
                  PA  |  -.1067078   .0028618   -37.29   0.000    -.1126141   -.1008014
                  OH  |  -.1336425   .0033605   -39.77   0.000    -.1405783   -.1267067
                  IN  |  -.1127871   .0076067   -14.83   0.000    -.1284866   -.0970876
                  IL  |  -.0333943   .0025024   -13.35   0.000     -.038559   -.0282297
                  MI  |  -.0655494   .0060659   -10.81   0.000    -.0780687     -.05303
                  WI  |  -.0996768   .0067964   -14.67   0.000    -.1137039   -.0856497
                  MN  |  -.0541028   .0046074   -11.74   0.000    -.0636121   -.0445935
                  MO  |  -.1387046   .0036384   -38.12   0.000    -.1462138   -.1311954
                  DE  |  -.0714077    .013789    -5.18   0.000    -.0998668   -.0429487
                  MD  |   .0023304   .0017536     1.33   0.196    -.0012888    .0059496
                  DC  |   .0588572   .0076301     7.71   0.000     .0431094     .074605
                  KY  |  -.1578036   .0073611   -21.44   0.000    -.1729962    -.142611
                  OK  |  -.1784149   .0119886   -14.88   0.000    -.2031581   -.1536717
                  CO  |   -.085882   .0015449   -55.59   0.000    -.0890705   -.0826936
                  NM  |  -.1513506   .0055166   -27.44   0.000    -.1627363   -.1399649
                  WA  |  -.0173075   .0022266    -7.77   0.000     -.021903    -.012712
                  OR  |  -.0879569   .0034272   -25.66   0.000    -.0950304   -.0808835
                  CA  |   .0469113   .0037866    12.39   0.000     .0390962    .0547265
                  AK  |   .1257043   .0074285    16.92   0.000     .1103726     .141036
                  HI  |  -.0132782   .0044579    -2.98   0.007    -.0224789   -.0040775
                      |
                 year |
                1990  |  -.0064675   .0035271    -1.83   0.079     -.013747    .0008121
                1991  |  -.0130651   .0056573    -2.31   0.030    -.0247412   -.0013891
                1992  |  -.0107227   .0073168    -1.47   0.156    -.0258239    .0043785
                1993  |  -.0229345   .0052135    -4.40   0.000    -.0336947   -.0121744
                1996  |   -.027373    .006365    -4.30   0.000    -.0405098   -.0142362
                1997  |  -.0186967   .0063269    -2.96   0.007    -.0317548   -.0056385
                1998  |  -.0010758   .0048767    -0.22   0.827    -.0111409    .0089892
                1999  |   .0198804   .0071067     2.80   0.010      .005213    .0345478
                2000  |   .0294446   .0073326     4.02   0.001     .0143108    .0445783
                2001  |   .0476905   .0077842     6.13   0.000     .0316247    .0637563
                2002  |   .0599957   .0073528     8.16   0.000     .0448202    .0751712
                2003  |    .046919   .0080599     5.82   0.000     .0302842    .0635539
                2004  |   .0396205   .0078737     5.03   0.000       .02337    .0558711
                2005  |   .0217604   .0077335     2.81   0.010     .0057991    .0377216
                2006  |   .0137517   .0087844     1.57   0.131    -.0043785    .0318818
                2007  |   .0145964    .010327     1.41   0.170    -.0067175    .0359104
                2008  |   .0104184   .0102502     1.02   0.320     -.010737    .0315738
                2009  |   .0392856   .0123454     3.18   0.004      .013806    .0647651
                2010  |    .034627   .0101578     3.41   0.002     .0136622    .0555917
                2011  |   .0123927   .0096709     1.28   0.212    -.0075671    .0323525
                2012  |   .0009014   .0116623     0.08   0.939    -.0231684    .0249711
                2013  |   .0001065   .0100776     0.01   0.992    -.0206925    .0209056
                2014  |  -.0067404   .0075434    -0.89   0.380    -.0223091    .0088284
                2015  |   .0127656   .0080028     1.60   0.124    -.0037514    .0292826
                2016  |   .0175417   .0100005     1.75   0.092    -.0030983    .0381816
                2017  |   .0297975   .0108393     2.75   0.011     .0074263    .0521687
                2018  |   .0345398   .0108155     3.19   0.004     .0122176     .056862
                2019  |   .0542568   .0103595     5.24   0.000     .0328757    .0756378
                      |
                 nind |
                   2  |   .1415892   .0289223     4.90   0.000     .0818964     .201282
                   3  |   .1302197   .0252145     5.16   0.000     .0781795    .1822599
                   4  |  -.0567712   .0258617    -2.20   0.038    -.1101471   -.0033954
                   5  |   .1596567   .0249109     6.41   0.000     .1082432    .2110702
                   6  |   .1337061   .0303965     4.40   0.000     .0709708    .1964414
                   7  |   .0306361   .0279529     1.10   0.284    -.0270559    .0883281
                   8  |  -.0363475   .0262613    -1.38   0.179     -.090548    .0178531
                   9  |  -.0264634   .0280653    -0.94   0.355    -.0843874    .0314606
                  10  |  -.0679552   .0290071    -2.34   0.028    -.1278229   -.0080875
                  11  |   .1476732   .0282619     5.23   0.000     .0893434    .2060029
                      |
                 educ |   .0670291   .0025878    25.90   0.000     .0616882      .07237
                exper |   .0455629   .0025145    18.12   0.000     .0403731    .0507526
               exper2 |  -.0010387   .0001148    -9.05   0.000    -.0012756   -.0008018
               exper3 |   7.24e-06   2.73e-06     2.65   0.014     1.61e-06    .0000129
               exper4 |   7.29e-09   2.60e-08     0.28   0.782    -4.64e-08    6.10e-08
                 edex |  -.0003318    .000074    -4.48   0.000    -.0004846   -.0001791
                      |
                ee_cl |
                   2  |  -.0622621   .0058361   -10.67   0.000    -.0743072    -.050217
                   3  |  -.0729038   .0071961   -10.13   0.000    -.0877559   -.0580518
                   4  |  -.0334121   .0116208    -2.88   0.008    -.0573963    -.009428
                   5  |  -.1365824   .0094631   -14.43   0.000    -.1561133   -.1170515
                   6  |  -.0824207   .0072207   -11.41   0.000    -.0973235   -.0675179
                   7  |  -.0647393   .0081438    -7.95   0.000    -.0815472   -.0479313
                   8  |   .0161294   .0112654     1.43   0.165    -.0071214    .0393801
                   9  |  -.1416255   .0110689   -12.79   0.000    -.1644707   -.1187803
                  10  |  -.0886433   .0100167    -8.85   0.000    -.1093168   -.0679699
                  11  |  -.0585591   .0097934    -5.98   0.000    -.0787717   -.0383465
                  12  |   .0151191   .0122317     1.24   0.228    -.0101259    .0403641
                  13  |  -.0488766   .0121365    -4.03   0.000    -.0739251   -.0238282
                  14  |  -.0684943   .0117706    -5.82   0.000    -.0927876   -.0442009
                  15  |  -.0504161   .0105805    -4.76   0.000    -.0722532   -.0285789
                  16  |   .0078156   .0130563     0.60   0.555    -.0191312    .0347624
                      |
                 marr |   .1207663   .0033023    36.57   0.000     .1139508    .1275819
                partt |  -.2245075   .0060213   -37.29   0.000    -.2369349   -.2120802
               public |   .0342344   .0072745     4.71   0.000     .0192205    .0492483
                 cmsa |   .1450443   .0130121    11.15   0.000     .1181886    .1718999
                      |
                nocc2 |
                   2  |  -.1425467   .0045692   -31.20   0.000    -.1519771   -.1331162
                   3  |  -.0444783   .0080935    -5.50   0.000    -.0611826   -.0277741
                   4  |  -.2801447   .0125605   -22.30   0.000    -.3060682   -.2542212
                   5  |  -.0732345   .0094892    -7.72   0.000    -.0928193   -.0536497
                   6  |  -.3738728   .0079395   -47.09   0.000     -.390259   -.3574865
                   7  |  -.2304573   .0068913   -33.44   0.000    -.2446803   -.2162343
                   8  |  -.0931869   .0148848    -6.26   0.000    -.1239076   -.0624663
                   9  |  -.3860716   .0052211   -73.94   0.000    -.3968473   -.3752958
                  10  |  -.3267868   .0067937   -48.10   0.000    -.3408084   -.3127653
                  11  |  -.2158246   .0060177   -35.87   0.000    -.2282444   -.2034048
                  12  |   -.379524   .0078523   -48.33   0.000    -.3957303   -.3633176
                      |
                unemp |  -.0047487   .0024362    -1.95   0.063    -.0097768    .0002793
                      |
              quarter |
                   2  |   .0013115   .0022562     0.58   0.566     -.003345     .005968
                   3  |   .0024842   .0027946     0.89   0.383    -.0032836     .008252
                   4  |   .0131868   .0020608     6.40   0.000     .0089336      .01744
                      |
                _cons |    .744563   .0560862    13.28   0.000     .6288067    .8603193
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all_unemp

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 5,700,864,564)

Linear regression                               Number of obs     =    613,198
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5094
                                                Root MSE          =      .4178

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1446743      .0066   -21.92   0.000    -.1582959   -.1310526
             treat_st |  -.0215495   .0111242    -1.94   0.065    -.0445087    .0014098
treat_stblackrelwhite |  -.0068554    .007016    -0.98   0.338    -.0213357    .0076249
                      |
                state |
                  RI  |  -.0301662   .0092881    -3.25   0.003    -.0493359   -.0109965
                  CT  |   .1122906   .0097026    11.57   0.000     .0922655    .1323157
                  NY  |   .1810715   .0049449    36.62   0.000     .1708658    .1912772
                  NJ  |   .1899606   .0080387    23.63   0.000     .1733695    .2065517
                  PA  |  -.0189958   .0042757    -4.44   0.000    -.0278205   -.0101711
                  OH  |   .1539688   .0075871    20.29   0.000     .1383098    .1696278
                  IN  |   .1451976   .0457085     3.18   0.004       .05086    .2395352
                  IL  |   .1856927   .0058538    31.72   0.000     .1736111    .1977742
                  MI  |    .490275    .035672    13.74   0.000     .4166516    .5638984
                  WI  |  -.0640111    .033567    -1.91   0.069    -.1332899    .0052677
                  MN  |   -.090659   .0052105   -17.40   0.000     -.101413   -.0799049
                  MO  |   .0201759   .0060332     3.34   0.003     .0077241    .0326277
                  DE  |    .234228   .0198219    11.82   0.000     .1933177    .2751384
                  MD  |  -.1711921   .0107169   -15.97   0.000    -.1933108   -.1490735
                  DC  |  -.2253616   .0117861   -19.12   0.000    -.2496869   -.2010363
                  KY  |   .0849116   .0222458     3.82   0.001     .0389986    .1308247
                  OK  |  -.2454777   .0524745    -4.68   0.000    -.3537796   -.1371757
                  CO  |  -.1417282    .004056   -34.94   0.000    -.1500994    -.133357
                  NM  |  -.3025177    .033108    -9.14   0.000    -.3708493    -.234186
                  WA  |  -.2162266   .0057327   -37.72   0.000    -.2280582   -.2043949
                  OR  |   .0588571   .0104603     5.63   0.000     .0372681    .0804461
                  CA  |   .1298081   .0066362    19.56   0.000     .1161117    .1435045
                  AK  |   .6918613   .0076535    90.40   0.000     .6760653    .7076573
                  HI  |  -.0828887   .0082179   -10.09   0.000    -.0998496   -.0659278
                      |
        state#c.lyear |
                  MA  |   .0025845   .0001069    24.19   0.000      .002364     .002805
                  RI  |   .0020921   .0001082    19.33   0.000     .0018687    .0023155
                  CT  |   .0016264   .0001411    11.53   0.000     .0013352    .0019175
                  NY  |   .0006571   .0000764     8.60   0.000     .0004994    .0008147
                  NJ  |    .001277   .0001052    12.14   0.000     .0010598    .0014942
                  PA  |   .0017403   .0000806    21.59   0.000      .001574    .0019067
                  OH  |  -.0001863   .0000736    -2.53   0.018    -.0003382   -.0000343
                  IN  |   .0000575   .0004595     0.13   0.901    -.0008908    .0010058
                  IL  |   .0004737   .0001051     4.51   0.000     .0002569    .0006906
                  MI  |  -.0028385   .0003624    -7.83   0.000    -.0035865   -.0020904
                  WI  |   .0022035   .0003294     6.69   0.000     .0015237    .0028833
                  MN  |   .0029175   .0000871    33.51   0.000     .0027379    .0030972
                  MO  |   .0010509   .0001099     9.57   0.000     .0008242    .0012777
                  DE  |   -.000516   .0001578    -3.27   0.003    -.0008416   -.0001904
                  MD  |   .0042285   .0001164    36.31   0.000     .0039882    .0044688
                  DC  |   .0053324    .000141    37.81   0.000     .0050413    .0056234
                  KY  |   .0002385   .0002347     1.02   0.320    -.0002459    .0007228
                  OK  |    .003164   .0005686     5.57   0.000     .0019906    .0043375
                  CO  |   .0031055   .0001155    26.90   0.000     .0028672    .0033438
                  NM  |   .0040307   .0003539    11.39   0.000     .0033003    .0047611
                  WA  |   .0044996   .0001138    39.52   0.000     .0042647    .0047346
                  OR  |   .0011881   .0001611     7.38   0.000     .0008557    .0015205
                  CA  |   .0018138   .0000819    22.14   0.000     .0016447    .0019828
                  AK  |  -.0029172    .000061   -47.83   0.000    -.0030431   -.0027913
                  HI  |   .0032541   .0000783    41.57   0.000     .0030925    .0034156
                      |
                 nind |
                   2  |   .1432428   .0287332     4.99   0.000     .0839404    .2025452
                   3  |   .1307386   .0249174     5.25   0.000     .0793116    .1821657
                   4  |  -.0558105   .0256682    -2.17   0.040    -.1087871    -.002834
                   5  |   .1606868   .0246286     6.52   0.000     .1098559    .2115177
                   6  |   .1348071   .0299955     4.49   0.000     .0728994    .1967148
                   7  |   .0315973   .0276743     1.14   0.265    -.0255198    .0887143
                   8  |  -.0352786   .0259772    -1.36   0.187    -.0888929    .0183356
                   9  |  -.0251828   .0277972    -0.91   0.374    -.0825533    .0321878
                  10  |  -.0666427   .0288603    -2.31   0.030    -.1262073    -.007078
                  11  |   .1481988   .0281253     5.27   0.000     .0901509    .2062466
                      |
                 educ |   .0669716   .0025837    25.92   0.000     .0616392     .072304
                exper |   .0454746   .0024702    18.41   0.000     .0403764    .0505727
               exper2 |  -.0010182   .0001138    -8.95   0.000    -.0012531   -.0007833
               exper3 |   6.53e-06   2.73e-06     2.39   0.025     9.01e-07    .0000122
               exper4 |   1.39e-08   2.61e-08     0.53   0.600    -3.99e-08    6.77e-08
                 edex |  -.0003336   .0000738    -4.52   0.000     -.000486   -.0001812
                      |
                ee_cl |
                   2  |  -.0638666   .0058672   -10.89   0.000     -.075976   -.0517573
                   3  |  -.0744229   .0071518   -10.41   0.000    -.0891835   -.0596622
                   4  |  -.0350063   .0113369    -3.09   0.005    -.0584046   -.0116081
                   5  |  -.1398937   .0095174   -14.70   0.000    -.1595366   -.1202508
                   6  |  -.0853274   .0068708   -12.42   0.000    -.0995079   -.0711468
                   7  |  -.0664581    .007923    -8.39   0.000    -.0828104   -.0501059
                   8  |   .0148969   .0109206     1.36   0.185    -.0076422    .0374359
                   9  |   -.144162   .0108742   -13.26   0.000    -.1666053   -.1217186
                  10  |  -.0901008    .009635    -9.35   0.000    -.1099866   -.0702151
                  11  |  -.0598656   .0095511    -6.27   0.000    -.0795782    -.040153
                  12  |   .0133561   .0119007     1.12   0.273    -.0112057    .0379179
                  13  |  -.0513983   .0121008    -4.25   0.000     -.076373   -.0264235
                  14  |  -.0698876   .0116087    -6.02   0.000    -.0938467   -.0459285
                  15  |  -.0508143   .0103884    -4.89   0.000    -.0722548   -.0293737
                  16  |   .0061516   .0127959     0.48   0.635    -.0202579    .0325611
                      |
                 marr |   .1204621   .0032774    36.76   0.000     .1136978    .1272263
                partt |  -.2244105   .0059171   -37.93   0.000    -.2366229   -.2121982
               public |   .0341774   .0072197     4.73   0.000     .0192767     .049078
                 cmsa |   .1436436   .0130812    10.98   0.000     .1166455    .1706418
                      |
                nocc2 |
                   2  |  -.1434724   .0044105   -32.53   0.000    -.1525752   -.1343697
                   3  |  -.0451539   .0080292    -5.62   0.000    -.0617253   -.0285825
                   4  |  -.2805458   .0124898   -22.46   0.000    -.3063235   -.2547681
                   5  |  -.0738423   .0096109    -7.68   0.000    -.0936782   -.0540065
                   6  |  -.3743231    .007807   -47.95   0.000    -.3904359   -.3582103
                   7  |  -.2305524   .0068306   -33.75   0.000      -.24465   -.2164548
                   8  |  -.0920374   .0147205    -6.25   0.000     -.122419   -.0616558
                   9  |  -.3867155   .0052133   -74.18   0.000    -.3974753   -.3759558
                  10  |  -.3281046   .0065209   -50.32   0.000    -.3415631   -.3146461
                  11  |   -.216325   .0058775   -36.81   0.000    -.2284555   -.2041945
                  12  |  -.3802804   .0077226   -49.24   0.000    -.3962191   -.3643417
                      |
                unemp |  -.0064442   .0010331    -6.24   0.000    -.0085765    -.004312
                      |
              quarter |
                   2  |   .0010612   .0022567     0.47   0.642    -.0035964    .0057188
                   3  |   .0020421   .0027807     0.73   0.470    -.0036971    .0077813
                   4  |   .0127458   .0020547     6.20   0.000     .0085051    .0169866
                      |
                _cons |   .5022311   .0444158    11.31   0.000     .4105613    .5939009
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_mal_all_sltt  

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,572,432,396)

Linear regression                               Number of obs     =    618,164
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5050
                                                Root MSE          =      .3964

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0670664    .006613   -10.14   0.000    -.0807149   -.0534179
             treat_st |   -.037204   .0086405    -4.31   0.000     -.055037    -.019371
treat_stblackrelwhite |  -.0164694   .0075096    -2.19   0.038    -.0319683   -.0009704
                      |
                state |
                  RI  |   -.076279   .0010406   -73.31   0.000    -.0784266   -.0741314
                  CT  |   .0100858   .0004338    23.25   0.000     .0091905    .0109811
                  NY  |   -.036627   .0017266   -21.21   0.000    -.0401906   -.0330634
                  NJ  |   .0269537   .0010394    25.93   0.000     .0248085     .029099
                  PA  |  -.1306223   .0026597   -49.11   0.000    -.1361116    -.125133
                  OH  |  -.1627387   .0032262   -50.44   0.000    -.1693972   -.1560801
                  IN  |  -.1642478   .0061744   -26.60   0.000    -.1769911   -.1515045
                  IL  |  -.0977309   .0019413   -50.34   0.000    -.1017376   -.0937242
                  MI  |  -.1158884   .0036434   -31.81   0.000    -.1234079   -.1083689
                  WI  |  -.1111066   .0058045   -19.14   0.000    -.1230866   -.0991266
                  MN  |  -.0521798   .0034672   -15.05   0.000    -.0593358   -.0450239
                  MO  |  -.1825128   .0033609   -54.30   0.000    -.1894494   -.1755761
                  DE  |  -.0498374   .0127404    -3.91   0.001    -.0761323   -.0235425
                  MD  |  -.0059836   .0029533    -2.03   0.054     -.012079    .0001117
                  DC  |   .0490219   .0061906     7.92   0.000      .036245    .0617988
                  KY  |   -.191615    .006431   -29.80   0.000     -.204888   -.1783421
                  OK  |  -.2339231   .0070612   -33.13   0.000    -.2484967   -.2193495
                  CO  |  -.1056792   .0008556  -123.51   0.000    -.1074452   -.1039133
                  NM  |  -.1989669   .0051247   -38.83   0.000    -.2095438   -.1883901
                  WA  |  -.0421089   .0016057   -26.22   0.000    -.0454229   -.0387948
                  OR  |  -.1054962   .0024619   -42.85   0.000    -.1105774    -.100415
                  CA  |   .0239536   .0012046    19.88   0.000     .0214673    .0264398
                  AK  |   .0801197   .0059557    13.45   0.000     .0678277    .0924118
                  HI  |  -.0283152   .0037205    -7.61   0.000     -.035994   -.0206363
                      |
                 year |
                1990  |  -.0041578   .0040416    -1.03   0.314    -.0124991    .0041836
                1991  |  -.0008328   .0030198    -0.28   0.785    -.0070653    .0053997
                1992  |   .0186983   .0038413     4.87   0.000     .0107702    .0266263
                1993  |   .0152937   .0049596     3.08   0.005     .0050576    .0255299
                1996  |   .0093015   .0050446     1.84   0.078      -.00111     .019713
                1997  |   .0157778    .005019     3.14   0.004     .0054191    .0261365
                1998  |   .0488712   .0042963    11.38   0.000     .0400041    .0577383
                1999  |   .0617238     .00564    10.94   0.000     .0500835    .0733642
                2000  |   .0736526   .0058658    12.56   0.000     .0615461     .085759
                2001  |    .089725   .0058295    15.39   0.000     .0776936    .1017564
                2002  |   .0996357   .0062986    15.82   0.000     .0866361    .1126353
                2003  |   .1065904   .0060599    17.59   0.000     .0940833    .1190975
                2004  |   .0985578   .0068297    14.43   0.000      .084462    .1126537
                2005  |   .0919278   .0063813    14.41   0.000     .0787573    .1050982
                2006  |   .0816833   .0061799    13.22   0.000     .0689286     .094438
                2007  |   .0797167   .0077597    10.27   0.000     .0637015    .0957319
                2008  |   .0731849   .0086411     8.47   0.000     .0553506    .0910192
                2009  |   .0937017   .0070503    13.29   0.000     .0791505    .1082529
                2010  |   .0927616   .0062847    14.76   0.000     .0797906    .1057327
                2011  |   .0720994   .0062218    11.59   0.000     .0592582    .0849406
                2012  |   .0564058   .0066158     8.53   0.000     .0427514    .0700601
                2013  |   .0599429   .0060824     9.86   0.000     .0473895    .0724963
                2014  |   .0566763   .0066206     8.56   0.000      .043012    .0703406
                2015  |   .0692094   .0068589    10.09   0.000     .0550534    .0833654
                2016  |   .0815885   .0088346     9.24   0.000     .0633548    .0998222
                2017  |   .0943565   .0092156    10.24   0.000     .0753364    .1133766
                2018  |   .0991465   .0093371    10.62   0.000     .0798757    .1184173
                2019  |   .1087903   .0072126    15.08   0.000     .0939041    .1236764
                      |
                 nind |
                   2  |    .113975   .0242321     4.70   0.000     .0639625    .1639876
                   3  |    .183905   .0227935     8.07   0.000     .1368616    .2309483
                   4  |  -.0390998   .0241484    -1.62   0.118    -.0889396      .01074
                   5  |   .1991068   .0225572     8.83   0.000      .152551    .2456627
                   6  |   .1396749   .0248707     5.62   0.000     .0883444    .1910055
                   7  |   .0845334   .0249907     3.38   0.002     .0329552    .1361116
                   8  |   .0309366    .022958     1.35   0.190    -.0164463    .0783196
                   9  |   -.007525   .0244398    -0.31   0.761    -.0579663    .0429163
                  10  |  -.0376524   .0229536    -1.64   0.114    -.0850264    .0097215
                  11  |   .1181615   .0246052     4.80   0.000      .067379    .1689441
                      |
                 educ |    .089898   .0029668    30.30   0.000     .0837749    .0960211
                exper |   .0489257   .0031681    15.44   0.000     .0423871    .0554643
               exper2 |  -.0017091   .0001276   -13.40   0.000    -.0019724   -.0014458
               exper3 |   .0000272   3.69e-06     7.36   0.000     .0000196    .0000348
               exper4 |  -1.45e-07   3.85e-08    -3.77   0.001    -2.25e-07   -6.57e-08
                 edex |  -.0004094   .0001128    -3.63   0.001    -.0006423   -.0001766
                      |
                ee_cl |
                   2  |  -.1246491   .0071854   -17.35   0.000     -.139479   -.1098191
                   3  |  -.1648909   .0107157   -15.39   0.000    -.1870071   -.1427747
                   4  |  -.1731264   .0172197   -10.05   0.000     -.208666   -.1375868
                   5  |  -.1647783   .0129092   -12.76   0.000    -.1914215    -.138135
                   6  |  -.1660894   .0132914   -12.50   0.000    -.1935215   -.1386574
                   7  |   -.176693   .0147245   -12.00   0.000    -.2070829   -.1463032
                   8  |  -.1130817   .0187045    -6.05   0.000    -.1516859   -.0744774
                   9  |  -.1528041   .0139215   -10.98   0.000    -.1815366   -.1240716
                  10  |  -.1722417   .0165488   -10.41   0.000    -.2063968   -.1380867
                  11  |  -.1717941   .0162539   -10.57   0.000    -.2053404   -.1382477
                  12  |  -.1288999   .0149607    -8.62   0.000    -.1597772   -.0980226
                  13  |  -.0939426   .0208691    -4.50   0.000    -.1370143   -.0508708
                  14  |  -.1535273   .0174346    -8.81   0.000    -.1895105    -.117544
                  15  |  -.1398405   .0172675    -8.10   0.000    -.1754789   -.1042022
                  16  |  -.1201562   .0148355    -8.10   0.000    -.1507752   -.0895372
                      |
                 marr |   .0352999   .0033772    10.45   0.000     .0283297    .0422701
                partt |  -.1463675   .0038004   -38.51   0.000    -.1542112   -.1385238
               public |   .0717295   .0082202     8.73   0.000     .0547637    .0886952
                 cmsa |   .1541059   .0120513    12.79   0.000     .1292333    .1789786
                      |
                nocc2 |
                   2  |  -.1271169   .0045404   -28.00   0.000    -.1364878   -.1177461
                   3  |  -.0472619   .0089319    -5.29   0.000    -.0656965   -.0288273
                   4  |  -.2700251   .0080655   -33.48   0.000    -.2866716   -.2533786
                   5  |   .0601593   .0076755     7.84   0.000     .0443178    .0760008
                   6  |  -.3252789   .0057267   -56.80   0.000    -.3370983   -.3134596
                   7  |  -.3474015   .0055392   -62.72   0.000    -.3588339   -.3359691
                   8  |  -.1594998   .0095272   -16.74   0.000    -.1791629   -.1398367
                   9  |  -.4054509   .0071736   -56.52   0.000    -.4202564   -.3906454
                  10  |  -.4066973   .0141729   -28.70   0.000    -.4359486    -.377446
                  11  |   -.146411   .0107714   -13.59   0.000     -.168642   -.1241799
                  12  |  -.3811771   .0116619   -32.69   0.000     -.405246   -.3571082
                      |
              quarter |
                   2  |    .008892   .0019874     4.47   0.000     .0047903    .0129937
                   3  |    .015941   .0021161     7.53   0.000     .0115736    .0203084
                   4  |   .0208852   .0014372    14.53   0.000     .0179191    .0238514
                      |
                _cons |   .3836329   .0480626     7.98   0.000     .2844366    .4828292
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,572,432,396)

Linear regression                               Number of obs     =    618,164
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5050
                                                Root MSE          =      .3964

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0670694   .0066102   -10.15   0.000    -.0807122   -.0534265
             treat_st |   -.037394   .0089766    -4.17   0.000    -.0559207   -.0188672
treat_stblackrelwhite |  -.0165207   .0075367    -2.19   0.038    -.0320758   -.0009657
                      |
                state |
                  RI  |   -.075539   .0018905   -39.96   0.000    -.0794409   -.0716372
                  CT  |   .0101353   .0004081    24.83   0.000      .009293    .0109776
                  NY  |  -.0361143   .0017261   -20.92   0.000    -.0396769   -.0325518
                  NJ  |   .0273214   .0012921    21.15   0.000     .0246547    .0299881
                  PA  |  -.1303702   .0025744   -50.64   0.000    -.1356836   -.1250568
                  OH  |  -.1623093   .0030898   -52.53   0.000    -.1686863   -.1559323
                  IN  |  -.1641982   .0061786   -26.58   0.000    -.1769502   -.1514463
                  IL  |  -.0970331   .0019677   -49.31   0.000    -.1010943    -.092972
                  MI  |  -.1147966   .0043516   -26.38   0.000    -.1237779   -.1058153
                  WI  |  -.1114149   .0059137   -18.84   0.000    -.1236202   -.0992096
                  MN  |  -.0528159   .0040576   -13.02   0.000    -.0611903   -.0444414
                  MO  |  -.1823989   .0033018   -55.24   0.000    -.1892134   -.1755844
                  DE  |   -.050319   .0130693    -3.85   0.001    -.0772927   -.0233453
                  MD  |  -.0062591   .0031289    -2.00   0.057     -.012717    .0001987
                  DC  |   .0502652   .0065103     7.72   0.000     .0368287    .0637017
                  KY  |  -.1910291   .0063212   -30.22   0.000    -.2040755   -.1779828
                  OK  |  -.2342294   .0069156   -33.87   0.000    -.2485026   -.2199562
                  CO  |  -.1059937   .0011381   -93.14   0.000    -.1083426   -.1036449
                  NM  |   -.198481   .0049357   -40.21   0.000    -.2086677   -.1882943
                  WA  |  -.0415178   .0017123   -24.25   0.000    -.0450518   -.0379839
                  OR  |  -.1046685   .0025967   -40.31   0.000    -.1100277   -.0993092
                  CA  |   .0250738    .002547     9.84   0.000      .019817    .0303306
                  AK  |   .0815841   .0056559    14.42   0.000      .069911    .0932572
                  HI  |  -.0291373   .0044594    -6.53   0.000     -.038341   -.0199336
                      |
                 year |
                1990  |  -.0038283   .0040445    -0.95   0.353    -.0121757    .0045191
                1991  |   .0004637   .0045512     0.10   0.920    -.0089295    .0098568
                1992  |   .0204735   .0060626     3.38   0.002     .0079609    .0329861
                1993  |   .0166753   .0063839     2.61   0.015     .0034995    .0298511
                1996  |     .00949   .0050366     1.88   0.072    -.0009049    .0198849
                1997  |   .0156377   .0050278     3.11   0.005     .0052609    .0260145
                1998  |   .0484187   .0043996    11.01   0.000     .0393384    .0574989
                1999  |   .0610562   .0055319    11.04   0.000     .0496389    .0724736
                2000  |   .0728501   .0061779    11.79   0.000     .0600995    .0856007
                2001  |   .0894402   .0058231    15.36   0.000      .077422    .1014585
                2002  |   .1001286   .0062918    15.91   0.000      .087143    .1131141
                2003  |   .1073135   .0062762    17.10   0.000     .0943601    .1202668
                2004  |   .0989923   .0070809    13.98   0.000      .084378    .1136067
                2005  |   .0920294    .006405    14.37   0.000     .0788102    .1052486
                2006  |    .081521   .0061703    13.21   0.000      .068786    .0942559
                2007  |   .0795599    .007777    10.23   0.000      .063509    .0956109
                2008  |   .0737795   .0087531     8.43   0.000      .055714     .091845
                2009  |   .0967433   .0103968     9.31   0.000     .0752854    .1182012
                2010  |   .0960193   .0088499    10.85   0.000     .0777539    .1142846
                2011  |   .0747874    .007345    10.18   0.000      .059628    .0899467
                2012  |   .0585743   .0072401     8.09   0.000     .0436316    .0735171
                2013  |   .0617205   .0076824     8.03   0.000     .0458649    .0775762
                2014  |   .0575045   .0069839     8.23   0.000     .0430905    .0719186
                2015  |   .0693414    .006896    10.06   0.000     .0551087    .0835741
                2016  |   .0814644   .0087814     9.28   0.000     .0633405    .0995884
                2017  |    .093906   .0090967    10.32   0.000     .0751314    .1126807
                2018  |   .0983896   .0093912    10.48   0.000      .079007    .1177722
                2019  |   .1079173   .0070618    15.28   0.000     .0933425    .1224922
                      |
                 nind |
                   2  |   .1139377   .0242527     4.70   0.000     .0638826    .1639929
                   3  |   .1838783   .0227947     8.07   0.000     .1368323    .2309243
                   4  |   -.039124   .0241629    -1.62   0.118    -.0889938    .0107459
                   5  |   .1990839   .0225682     8.82   0.000     .1525054    .2456624
                   6  |   .1396485   .0248863     5.61   0.000     .0882857    .1910112
                   7  |   .0845008   .0250051     3.38   0.002     .0328929    .1361086
                   8  |   .0309138   .0229668     1.35   0.191    -.0164872    .0783149
                   9  |  -.0075562   .0244468    -0.31   0.760     -.058012    .0428995
                  10  |  -.0376811   .0229647    -1.64   0.114    -.0850778    .0097156
                  11  |   .1181198   .0246047     4.80   0.000     .0673381    .1689015
                      |
                 educ |   .0898954   .0029697    30.27   0.000     .0837663    .0960246
                exper |   .0489293   .0031659    15.46   0.000     .0423953    .0554633
               exper2 |  -.0017094   .0001275   -13.40   0.000    -.0019726   -.0014462
               exper3 |   .0000272   3.69e-06     7.36   0.000     .0000196    .0000348
               exper4 |  -1.45e-07   3.85e-08    -3.77   0.001    -2.25e-07   -6.58e-08
                 edex |  -.0004094   .0001128    -3.63   0.001    -.0006423   -.0001766
                      |
                ee_cl |
                   2  |  -.1246319    .007199   -17.31   0.000      -.13949   -.1097739
                   3  |  -.1648669    .010741   -15.35   0.000    -.1870352   -.1426986
                   4  |  -.1730978   .0172461   -10.04   0.000    -.2086921   -.1375036
                   5  |  -.1647651   .0129141   -12.76   0.000    -.1914185   -.1381117
                   6  |  -.1660715   .0133106   -12.48   0.000    -.1935433   -.1385997
                   7  |  -.1766596   .0147592   -11.97   0.000     -.207121   -.1461981
                   8  |  -.1130474   .0187415    -6.03   0.000     -.151728   -.0743669
                   9  |  -.1527878   .0139286   -10.97   0.000    -.1815349   -.1240407
                  10  |  -.1722233   .0165617   -10.40   0.000    -.2064049   -.1380417
                  11  |  -.1717595   .0162863   -10.55   0.000    -.2053729   -.1381462
                  12  |  -.1288623   .0149991    -8.59   0.000     -.159819   -.0979056
                  13  |  -.0939229   .0208759    -4.50   0.000    -.1370085   -.0508372
                  14  |   -.153497   .0174566    -8.79   0.000    -.1895257   -.1174684
                  15  |  -.1397993   .0172997    -8.08   0.000    -.1755041   -.1040944
                  16  |  -.1201183    .014872    -8.08   0.000    -.1508126    -.089424
                      |
                 marr |   .0352996   .0033765    10.45   0.000     .0283308    .0422685
                partt |  -.1463595   .0038003   -38.51   0.000     -.154203    -.138516
               public |   .0717376   .0082214     8.73   0.000     .0547695    .0887056
                 cmsa |   .1541092   .0120491    12.79   0.000     .1292411    .1789774
                      |
                nocc2 |
                   2  |  -.1271224   .0045406   -28.00   0.000    -.1364937   -.1177511
                   3  |  -.0472652   .0089286    -5.29   0.000     -.065693   -.0288375
                   4  |  -.2700272   .0080642   -33.48   0.000    -.2866708   -.2533835
                   5  |   .0601531   .0076736     7.84   0.000     .0443156    .0759907
                   6  |  -.3252785   .0057266   -56.80   0.000    -.3370976   -.3134594
                   7  |  -.3474047   .0055385   -62.73   0.000    -.3588355   -.3359739
                   8  |  -.1594851    .009522   -16.75   0.000    -.1791376   -.1398325
                   9  |  -.4054527   .0071724   -56.53   0.000    -.4202559   -.3906495
                  10  |  -.4067151   .0141627   -28.72   0.000    -.4359454   -.3774848
                  11  |   -.146421   .0107655   -13.60   0.000      -.16864    -.124202
                  12  |  -.3811892   .0116517   -32.72   0.000     -.405237   -.3571413
                      |
                unemp |  -.0007035    .001424    -0.49   0.626    -.0036425    .0022356
                      |
              quarter |
                   2  |   .0088955   .0019906     4.47   0.000     .0047871    .0130039
                   3  |   .0159482   .0021188     7.53   0.000     .0115752    .0203212
                   4  |   .0208987   .0014487    14.43   0.000     .0179088    .0238886
                      |
                _cons |   .3868618   .0501688     7.71   0.000     .2833185    .4904051
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 5,572,432,396)

Linear regression                               Number of obs     =    618,164
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5037
                                                Root MSE          =     .39692

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0678601   .0065323   -10.39   0.000    -.0813421    -.054378
             treat_st |  -.0590247   .0121318    -4.87   0.000    -.0840635   -.0339858
treat_stblackrelwhite |   -.014114   .0068122    -2.07   0.049    -.0281736   -.0000544
                      |
                state |
                  RI  |  -.1037729   .0078253   -13.26   0.000    -.1199235   -.0876224
                  CT  |   .1711277   .0064807    26.41   0.000     .1577522    .1845032
                  NY  |   .0952923   .0050324    18.94   0.000      .084906    .1056786
                  NJ  |   .1434583   .0071669    20.02   0.000     .1286667      .15825
                  PA  |   .0831427   .0044537    18.67   0.000     .0739507    .0923346
                  OH  |   .0443177   .0077343     5.73   0.000     .0283548    .0602805
                  IN  |  -.1072439    .048134    -2.23   0.036    -.2065875   -.0079003
                  IL  |   .0163301   .0052425     3.11   0.005     .0055101      .02715
                  MI  |   .0941467   .0379199     2.48   0.020      .015884    .1724094
                  WI  |  -.2194874   .0358553    -6.12   0.000    -.2934892   -.1454856
                  MN  |  -.0087785   .0057321    -1.53   0.139    -.0206089    .0030519
                  MO  |   .1044155    .006187    16.88   0.000     .0916462    .1171848
                  DE  |   .2741724   .0236868    11.57   0.000     .2252853    .3230596
                  MD  |  -.2030201   .0086457   -23.48   0.000     -.220864   -.1851762
                  DC  |   -.162151   .0168524    -9.62   0.000    -.1969328   -.1273693
                  KY  |  -.0985842   .0268215    -3.68   0.001     -.153941   -.0432275
                  OK  |  -.2730581   .0571084    -4.78   0.000    -.3909241   -.1551921
                  CO  |  -.0871909   .0033974   -25.66   0.000    -.0942028    -.080179
                  NM  |  -.3676034   .0250961   -14.65   0.000    -.4193992   -.3158075
                  WA  |  -.1774362   .0072204   -24.57   0.000    -.1923384    -.162534
                  OR  |  -.0736901   .0088194    -8.36   0.000    -.0918924   -.0554878
                  CA  |   .0470163   .0066311     7.09   0.000     .0333304    .0607023
                  AK  |   .5047757   .0057924    87.14   0.000     .4928208    .5167306
                  HI  |  -.0125509   .0066757    -1.88   0.072    -.0263288     .001227
                      |
        state#c.lyear |
                  MA  |   .0040586   .0001305    31.11   0.000     .0037893    .0043278
                  RI  |   .0043638   .0001461    29.87   0.000     .0040623    .0046654
                  CT  |   .0025169   .0001407    17.88   0.000     .0022264    .0028074
                  NY  |   .0028084   .0001054    26.65   0.000     .0025909     .003026
                  NJ  |   .0029612   .0001173    25.25   0.000     .0027192    .0032033
                  PA  |   .0020128   .0001012    19.89   0.000     .0018039    .0022216
                  OH  |    .002089   .0000788    26.51   0.000     .0019264    .0022517
                  IN  |   .0035733   .0004943     7.23   0.000     .0025532    .0045935
                  IL  |   .0029857   .0001242    24.04   0.000     .0027294     .003242
                  MI  |   .0021081   .0003934     5.36   0.000     .0012961      .00292
                  WI  |   .0051333   .0003675    13.97   0.000     .0043748    .0058917
                  MN  |   .0036353   .0001274    28.54   0.000     .0033723    .0038982
                  MO  |   .0013067   .0001239    10.55   0.000      .001051    .0015623
                  DE  |   .0007744   .0002249     3.44   0.002     .0003102    .0012386
                  MD  |   .0059394   .0001098    54.11   0.000     .0057128    .0061659
                  DC  |   .0061216   .0001716    35.68   0.000     .0057674    .0064757
                  KY  |   .0032094     .00028    11.46   0.000     .0026316    .0037873
                  OK  |   .0045764   .0006246     7.33   0.000     .0032874    .0058654
                  CO  |   .0038776   .0001429    27.14   0.000     .0035827    .0041726
                  NM  |   .0057127   .0002837    20.13   0.000     .0051271    .0062982
                  WA  |   .0053821   .0001697    31.72   0.000     .0050319    .0057322
                  OR  |   .0037903    .000162    23.40   0.000      .003456    .0041246
                  CA  |   .0038863    .000103    37.72   0.000     .0036737    .0040989
                  AK  |  -.0000391   .0000705    -0.55   0.584    -.0001847    .0001064
                  HI  |    .003902    .000114    34.24   0.000     .0036668    .0041372
                      |
                 nind |
                   2  |   .1155896   .0240211     4.81   0.000     .0660126    .1651667
                   3  |   .1835992   .0226462     8.11   0.000     .1368598    .2303386
                   4  |  -.0385857   .0240667    -1.60   0.122    -.0882569    .0110855
                   5  |   .2002931   .0224061     8.94   0.000     .1540491    .2465371
                   6  |   .1405175   .0246724     5.70   0.000     .0895961     .191439
                   7  |   .0853182   .0248285     3.44   0.002     .0340747    .1365618
                   8  |   .0319456   .0228769     1.40   0.175    -.0152699    .0791611
                   9  |  -.0061003   .0243425    -0.25   0.804    -.0563407    .0441402
                  10  |   -.038006   .0227837    -1.67   0.108    -.0850293    .0090174
                  11  |   .1191721   .0245208     4.86   0.000     .0685637    .1697806
                      |
                 educ |    .088199   .0030456    28.96   0.000     .0819131    .0944848
                exper |    .048315   .0031108    15.53   0.000     .0418947    .0547353
               exper2 |   -.001669   .0001251   -13.35   0.000    -.0019271   -.0014109
               exper3 |    .000026   3.69e-06     7.03   0.000     .0000183    .0000336
               exper4 |  -1.35e-07   3.89e-08    -3.46   0.002    -2.15e-07   -5.45e-08
                 edex |  -.0003897   .0001128    -3.45   0.002    -.0006225   -.0001568
                      |
                ee_cl |
                   2  |  -.1256965   .0073437   -17.12   0.000    -.1408531   -.1105399
                   3  |  -.1627955   .0109588   -14.86   0.000    -.1854134   -.1401775
                   4  |  -.1671665   .0175713    -9.51   0.000    -.2034319   -.1309012
                   5  |  -.1694126   .0128875   -13.15   0.000    -.1960111    -.142814
                   6  |  -.1684082   .0132475   -12.71   0.000    -.1957498   -.1410667
                   7  |  -.1744937   .0150075   -11.63   0.000    -.2054677   -.1435197
                   8  |  -.1079714   .0191995    -5.62   0.000    -.1475973   -.0683456
                   9  |  -.1569733   .0139433   -11.26   0.000    -.1857508   -.1281958
                  10  |  -.1722911   .0166095   -10.37   0.000    -.2065715   -.1380107
                  11  |  -.1682961   .0165556   -10.17   0.000    -.2024653    -.134127
                  12  |  -.1237389   .0155209    -7.97   0.000    -.1557724   -.0917055
                  13  |  -.0979454   .0208204    -4.70   0.000    -.1409166   -.0549742
                  14  |  -.1524245   .0175281    -8.70   0.000    -.1886007   -.1162482
                  15  |   -.137383   .0175839    -7.81   0.000    -.1736745   -.1010916
                  16  |  -.1170723   .0152692    -7.67   0.000    -.1485865   -.0855582
                      |
                 marr |   .0349472   .0033176    10.53   0.000        .0281    .0417945
                partt |  -.1462839   .0037807   -38.69   0.000     -.154087   -.1384808
               public |   .0714439   .0081867     8.73   0.000     .0545474    .0883405
                 cmsa |   .1530821   .0120638    12.69   0.000     .1281837    .1779805
                      |
                nocc2 |
                   2  |  -.1264428   .0046524   -27.18   0.000    -.1360448   -.1168408
                   3  |  -.0464106   .0089918    -5.16   0.000    -.0649689   -.0278524
                   4  |  -.2691139   .0080543   -33.41   0.000    -.2857371   -.2524906
                   5  |   .0599456   .0077314     7.75   0.000     .0439888    .0759025
                   6  |  -.3256403   .0058408   -55.75   0.000     -.337695   -.3135855
                   7  |  -.3475582   .0055963   -62.11   0.000    -.3591083   -.3360081
                   8  |  -.1586669   .0097354   -16.30   0.000    -.1787597    -.138574
                   9  |  -.4055119   .0071952   -56.36   0.000    -.4203622   -.3906617
                  10  |  -.4076607   .0143043   -28.50   0.000    -.4371832   -.3781382
                  11  |  -.1455431   .0106312   -13.69   0.000    -.1674849   -.1236013
                  12  |  -.3815126   .0117607   -32.44   0.000    -.4057855   -.3572397
                      |
                unemp |  -.0021436   .0006726    -3.19   0.004    -.0035319   -.0007554
                      |
              quarter |
                   2  |   .0085812   .0019681     4.36   0.000     .0045193    .0126431
                   3  |   .0156467    .002047     7.64   0.000     .0114219    .0198714
                   4  |   .0205553   .0014509    14.17   0.000     .0175609    .0235498
                      |
                _cons |   .0547843   .0393326     1.39   0.176    -.0263942    .1359629
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_fem_all_sltt

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 4,437,265,545)

Linear regression                               Number of obs     =    475,638
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5477
                                                Root MSE          =     .42274

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1564439   .0050664   -30.88   0.000    -.1669005   -.1459873
             treat_st |  -.0254752    .014436    -1.76   0.090    -.0552696    .0043193
treat_stblackrelwhite |   .0029754   .0069285     0.43   0.671    -.0113244    .0172751
                      |
                state |
                  RI  |   -.090537   .0015268   -59.30   0.000    -.0936881   -.0873858
                  CT  |   .0066468   .0005573    11.93   0.000     .0054965     .007797
                  NY  |  -.0465909   .0010072   -46.26   0.000    -.0486696   -.0445122
                  NJ  |   .0348653   .0010178    34.26   0.000     .0327647    .0369658
                  PA  |  -.1142218   .0031675   -36.06   0.000    -.1207592   -.1076845
                  OH  |  -.1474932   .0036846   -40.03   0.000    -.1550979   -.1398884
                  IN  |  -.1203824   .0071823   -16.76   0.000    -.1352058   -.1055589
                  IL  |  -.0578203   .0018638   -31.02   0.000    -.0616671   -.0539736
                  MI  |  -.0994773   .0044858   -22.18   0.000    -.1087356   -.0902191
                  WI  |  -.1018501    .006447   -15.80   0.000    -.1151561   -.0885442
                  MN  |  -.0589219   .0034874   -16.90   0.000    -.0661196   -.0517242
                  MO  |  -.1517537   .0040194   -37.76   0.000    -.1600494   -.1434581
                  DE  |  -.0567702   .0129276    -4.39   0.000    -.0834515   -.0300889
                  MD  |   .0139451   .0023508     5.93   0.000     .0090932     .018797
                  DC  |   .0682265   .0059037    11.56   0.000     .0560419    .0804111
                  KY  |  -.1573009   .0074195   -21.20   0.000    -.1726139   -.1419878
                  OK  |  -.1641772   .0103833   -15.81   0.000    -.1856072   -.1427471
                  CO  |  -.0722646   .0014432   -50.07   0.000    -.0752432    -.069286
                  NM  |  -.1382241   .0060692   -22.77   0.000    -.1507503    -.125698
                  WA  |  -.0293903    .002129   -13.80   0.000    -.0337844   -.0249962
                  OR  |  -.0983081   .0032875   -29.90   0.000    -.1050932    -.091523
                  CA  |   .0288809   .0007335    39.38   0.000     .0273672    .0303947
                  AK  |   .1139711   .0065488    17.40   0.000      .100455    .1274872
                  HI  |  -.0020828   .0039371    -0.53   0.602    -.0102085    .0060429
                      |
                 year |
                1990  |  -.0039793   .0036574    -1.09   0.287    -.0115279    .0035693
                1991  |  -.0163279   .0053533    -3.05   0.006    -.0273765   -.0052793
                1992  |  -.0170682   .0053357    -3.20   0.004    -.0280806   -.0060558
                1993  |  -.0285786   .0044485    -6.42   0.000    -.0377599   -.0193973
                1996  |  -.0262856   .0092676    -2.84   0.009     -.045413   -.0071583
                1997  |  -.0150753   .0086089    -1.75   0.093    -.0328431    .0026926
                1998  |   .0102072   .0077846     1.31   0.202    -.0058594    .0262737
                1999  |   .0366494    .009339     3.92   0.001     .0173745    .0559242
                2000  |   .0508557   .0080998     6.28   0.000     .0341384    .0675729
                2001  |   .0689104   .0093685     7.36   0.000     .0495747    .0882461
                2002  |   .0756722   .0073177    10.34   0.000     .0605692    .0907752
                2003  |   .0559893    .010287     5.44   0.000      .034758    .0772206
                2004  |    .053543   .0088666     6.04   0.000     .0352433    .0718426
                2005  |   .0374617   .0097171     3.86   0.001     .0174065    .0575169
                2006  |   .0308903   .0089067     3.47   0.002     .0125077    .0492729
                2007  |   .0309084   .0100959     3.06   0.005     .0100714    .0517453
                2008  |   .0223565   .0098903     2.26   0.033     .0019439     .042769
                2009  |    .036806   .0111386     3.30   0.003     .0138171    .0597949
                2010  |   .0259527   .0108231     2.40   0.025     .0036149    .0482905
                2011  |   .0082738   .0095036     0.87   0.393    -.0113407    .0278882
                2012  |   .0025973   .0115345     0.23   0.824    -.0212088    .0264034
                2013  |   .0042599   .0096606     0.44   0.663    -.0156786    .0241984
                2014  |   .0030485   .0088915     0.34   0.735    -.0153027    .0213996
                2015  |   .0315185    .007969     3.96   0.001     .0150713    .0479656
                2016  |   .0400748   .0101912     3.93   0.001     .0190411    .0611085
                2017  |   .0499564   .0113449     4.40   0.000     .0265417    .0733711
                2018  |   .0582938   .0115444     5.05   0.000     .0344673    .0821203
                2019  |    .081707   .0099377     8.22   0.000     .0611966    .1022174
                      |
                 nind |
                   2  |   .0809887   .0292732     2.77   0.011     .0205718    .1414057
                   3  |   .1229643   .0265287     4.64   0.000     .0682117    .1777168
                   4  |  -.0462288   .0277935    -1.66   0.109    -.1035918    .0111342
                   5  |   .1115701   .0267282     4.17   0.000     .0564058    .1667343
                   6  |   .1325413   .0323212     4.10   0.000     .0658337    .1992489
                   7  |   .0329844   .0294516     1.12   0.274    -.0278008    .0937696
                   8  |  -.0263993   .0293607    -0.90   0.378    -.0869967    .0341981
                   9  |  -.0574995   .0277399    -2.07   0.049    -.1147518   -.0002473
                  10  |  -.0662564   .0289472    -2.29   0.031    -.1260005   -.0065122
                  11  |   .0916535   .0288941     3.17   0.004      .032019    .1512881
                      |
                 educ |   .0622655   .0027037    23.03   0.000     .0566853    .0678457
                exper |   .0382177   .0023816    16.05   0.000     .0333023    .0431332
               exper2 |   -.000721   .0000947    -7.61   0.000    -.0009165   -.0005255
               exper3 |  -2.96e-06   2.72e-06    -1.09   0.287    -8.57e-06    2.65e-06
               exper4 |   1.21e-07   3.25e-08     3.73   0.001     5.40e-08    1.88e-07
                 edex |  -.0001336   .0000859    -1.55   0.133     -.000311    .0000438
                      |
                ee_cl |
                   2  |  -.0660622   .0059453   -11.11   0.000    -.0783327   -.0537917
                   3  |  -.0794347   .0069437   -11.44   0.000    -.0937658   -.0651037
                   4  |  -.0274341    .011291    -2.43   0.023    -.0507376   -.0041307
                   5  |  -.1279632    .009172   -13.95   0.000    -.1468932   -.1090331
                   6  |  -.0978322   .0072677   -13.46   0.000    -.1128321   -.0828323
                   7  |   -.084667   .0087221    -9.71   0.000    -.1026684   -.0666655
                   8  |   .0333566   .0118287     2.82   0.009     .0089434    .0577698
                   9  |  -.1483654   .0105007   -14.13   0.000    -.1700378   -.1266929
                  10  |  -.1084463   .0098267   -11.04   0.000    -.1287275    -.088165
                  11  |  -.0696704   .0093108    -7.48   0.000    -.0888869    -.050454
                  12  |   .0305767   .0133448     2.29   0.031     .0030345    .0581189
                  13  |  -.0698304   .0135227    -5.16   0.000      -.09774   -.0419209
                  14  |  -.0779645   .0121864    -6.40   0.000    -.1031161   -.0528129
                  15  |  -.0510482   .0106861    -4.78   0.000    -.0731032   -.0289933
                  16  |   .0212812   .0144437     1.47   0.154    -.0085291    .0510915
                      |
                 marr |   .1282895   .0039831    32.21   0.000     .1200688    .1365101
                partt |  -.2191357   .0044328   -49.44   0.000    -.2282845    -.209987
               public |   .0075432   .0059215     1.27   0.215    -.0046782    .0197645
                 cmsa |   .1369483   .0118936    11.51   0.000     .1124011    .1614955
                      |
                nocc2 |
                   2  |  -.1522183   .0046295   -32.88   0.000    -.1617731   -.1426634
                   3  |  -.0449078   .0085078    -5.28   0.000     -.062467   -.0273486
                   4  |  -.3292315   .0116733   -28.20   0.000     -.353324   -.3051389
                   5  |  -.0965964   .0120276    -8.03   0.000    -.1214203   -.0717726
                   6  |  -.3989834   .0075241   -53.03   0.000    -.4145124   -.3834544
                   7  |  -.2509465   .0086012   -29.18   0.000    -.2686985   -.2331945
                   8  |  -.1037846   .0138361    -7.50   0.000     -.132341   -.0752282
                   9  |   -.445152   .0076039   -58.54   0.000    -.4608457   -.4294583
                  10  |  -.3806817   .0078751   -48.34   0.000     -.396935   -.3644283
                  11  |  -.2779483    .008465   -32.84   0.000    -.2954191   -.2604775
                  12  |  -.4533323   .0115514   -39.24   0.000    -.4771732   -.4294913
                      |
              quarter |
                   2  |   .0015266   .0022674     0.67   0.507     -.003153    .0062063
                   3  |   .0017618   .0026803     0.66   0.517    -.0037701    .0072936
                   4  |   .0142532   .0026437     5.39   0.000     .0087969    .0197094
                      |
                _cons |   .8319721   .0444344    18.72   0.000      .740264    .9236802
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 4,437,265,545)

Linear regression                               Number of obs     =    475,638
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5477
                                                Root MSE          =     .42273

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1564757     .00506   -30.92   0.000    -.1669189   -.1460324
             treat_st |   -.026749    .015064    -1.78   0.088    -.0578396    .0043416
treat_stblackrelwhite |   .0027412   .0069727     0.39   0.698    -.0116498    .0171321
                      |
                state |
                  RI  |  -.0857841     .00258   -33.25   0.000    -.0911089   -.0804593
                  CT  |   .0069536    .000484    14.37   0.000     .0059547    .0079524
                  NY  |  -.0432845   .0023009   -18.81   0.000    -.0480333   -.0385357
                  NJ  |   .0372734   .0018736    19.89   0.000     .0334064    .0411404
                  PA  |  -.1126085   .0029975   -37.57   0.000     -.118795    -.106422
                  OH  |  -.1447319   .0033889   -42.71   0.000    -.1517262   -.1377375
                  IN  |  -.1200539   .0072325   -16.60   0.000     -.134981   -.1051267
                  IL  |  -.0532832   .0026754   -19.92   0.000     -.058805   -.0477614
                  MI  |  -.0924089    .005899   -15.67   0.000    -.1045839   -.0802339
                  WI  |  -.1038992   .0066613   -15.60   0.000    -.1176475   -.0901509
                  MN  |  -.0631026   .0047991   -13.15   0.000    -.0730074   -.0531978
                  MO  |  -.1510627   .0039222   -38.51   0.000    -.1591577   -.1429677
                  DE  |  -.0600426   .0134107    -4.48   0.000    -.0877209   -.0323643
                  MD  |   .0121633   .0026545     4.58   0.000     .0066847    .0176418
                  DC  |   .0762861   .0087057     8.76   0.000     .0583185    .0942537
                  KY  |  -.1535239   .0073918   -20.77   0.000    -.1687799    -.138268
                  OK  |  -.1662143   .0102522   -16.21   0.000    -.1873738   -.1450549
                  CO  |  -.0743486   .0020736   -35.86   0.000    -.0786282   -.0700689
                  NM  |   -.134841   .0058404   -23.09   0.000    -.1468949   -.1227871
                  WA  |  -.0255748   .0023625   -10.83   0.000    -.0304509   -.0206988
                  OR  |  -.0929408   .0034745   -26.75   0.000    -.1001119   -.0857697
                  CA  |   .0361171   .0039937     9.04   0.000     .0278745    .0443598
                  AK  |   .1235823   .0073324    16.85   0.000     .1084489    .1387157
                  HI  |  -.0073931   .0050663    -1.46   0.157    -.0178494    .0030633
                      |
                 year |
                1990  |  -.0018931   .0039806    -0.48   0.639    -.0101086    .0063225
                1991  |  -.0080018   .0085239    -0.94   0.357    -.0255943    .0095906
                1992  |  -.0057111   .0089347    -0.64   0.529    -.0241514    .0127293
                1993  |  -.0198209   .0063516    -3.12   0.005    -.0329299    -.006712
                1996  |  -.0251939   .0084496    -2.98   0.006     -.042633   -.0077549
                1997  |  -.0161941   .0076339    -2.12   0.044    -.0319498   -.0004385
                1998  |   .0070934   .0065826     1.08   0.292    -.0064923    .0206792
                1999  |   .0320876   .0088609     3.62   0.001     .0137996    .0503756
                2000  |   .0454502   .0083562     5.44   0.000     .0282039    .0626965
                2001  |   .0668826   .0091957     7.27   0.000     .0479037    .0858616
                2002  |   .0787973   .0073856    10.67   0.000     .0635541    .0940405
                2003  |   .0606028   .0106976     5.67   0.000      .038524    .0826817
                2004  |   .0562472   .0090596     6.21   0.000     .0375491    .0749452
                2005  |   .0380426   .0097413     3.91   0.001     .0179376    .0581476
                2006  |   .0297443   .0088067     3.38   0.002     .0115682    .0479204
                2007  |   .0297485   .0101154     2.94   0.007     .0088713    .0506257
                2008  |   .0260926   .0099636     2.62   0.015     .0055288    .0466564
                2009  |   .0565582    .016822     3.36   0.003     .0218394     .091277
                2010  |   .0471035   .0144517     3.26   0.003     .0172767    .0769303
                2011  |   .0257325    .013885     1.85   0.076    -.0029246    .0543897
                2012  |   .0165685   .0150378     1.10   0.281     -.014468    .0476049
                2013  |   .0156989   .0121331     1.29   0.208    -.0093426    .0407404
                2014  |   .0083144   .0092557     0.90   0.378    -.0107885    .0274173
                2015  |    .032222   .0081069     3.97   0.001     .0154903    .0489537
                2016  |   .0391282   .0101852     3.84   0.001     .0181069    .0601495
                2017  |   .0468276   .0111943     4.18   0.000     .0237237    .0699316
                2018  |   .0532359   .0116743     4.56   0.000     .0291413    .0773305
                2019  |   .0758635    .010854     6.99   0.000      .053462     .098265
                      |
                 nind |
                   2  |    .080966   .0292494     2.77   0.011     .0205981    .1413338
                   3  |   .1230364   .0264994     4.64   0.000     .0683444    .1777284
                   4  |  -.0461363   .0277526    -1.66   0.109    -.1034148    .0111421
                   5  |   .1116439   .0266842     4.18   0.000     .0565704    .1667174
                   6  |   .1326037   .0322756     4.11   0.000     .0659901    .1992173
                   7  |   .0330058   .0294272     1.12   0.273     -.027729    .0937405
                   8  |  -.0262859   .0293156    -0.90   0.379    -.0867903    .0342185
                   9  |  -.0574326   .0276974    -2.07   0.049    -.1145972   -.0002679
                  10  |  -.0661965   .0289097    -2.29   0.031    -.1258632   -.0065299
                  11  |   .0917816   .0288509     3.18   0.004     .0322363    .1513269
                      |
                 educ |   .0622845   .0026929    23.13   0.000     .0567266    .0678424
                exper |   .0382753   .0023663    16.18   0.000     .0333916     .043159
               exper2 |  -.0007238    .000095    -7.62   0.000    -.0009198   -.0005277
               exper3 |  -2.87e-06   2.73e-06    -1.05   0.304    -8.51e-06    2.77e-06
               exper4 |   1.20e-07   3.26e-08     3.68   0.001     5.27e-08    1.87e-07
                 edex |  -.0001352   .0000852    -1.59   0.126     -.000311    .0000406
                      |
                ee_cl |
                   2  |  -.0659564   .0059724   -11.04   0.000    -.0782829   -.0536299
                   3  |   -.079407   .0069455   -11.43   0.000    -.0937417   -.0650723
                   4  |  -.0274227   .0112841    -2.43   0.023    -.0507119   -.0041335
                   5  |  -.1280802   .0091507   -14.00   0.000    -.1469664    -.109194
                   6  |  -.0978232   .0072487   -13.50   0.000    -.1127837   -.0828627
                   7  |  -.0846069   .0087225    -9.70   0.000    -.1026093   -.0666045
                   8  |   .0334274   .0118418     2.82   0.009     .0089872    .0578676
                   9  |  -.1484131   .0104876   -14.15   0.000    -.1700585   -.1267676
                  10  |   -.108524   .0098003   -11.07   0.000    -.1287508   -.0882972
                  11  |  -.0696358    .009311    -7.48   0.000    -.0888528   -.0504189
                  12  |   .0306318    .013352     2.29   0.031     .0030747    .0581889
                  13  |  -.0700797   .0134358    -5.22   0.000    -.0978098   -.0423497
                  14  |  -.0780924   .0121288    -6.44   0.000     -.103125   -.0530598
                  15  |  -.0510778   .0106558    -4.79   0.000    -.0730702   -.0290853
                  16  |   .0213606     .01447     1.48   0.153    -.0085039    .0512252
                      |
                 marr |   .1282915    .003977    32.26   0.000     .1200833    .1364997
                partt |  -.2190161   .0044357   -49.38   0.000    -.2281711   -.2098612
               public |   .0075203   .0059072     1.27   0.215    -.0046715    .0197121
                 cmsa |   .1369503   .0118907    11.52   0.000     .1124092    .1614914
                      |
                nocc2 |
                   2  |  -.1522085   .0046392   -32.81   0.000    -.1617834   -.1426337
                   3  |   -.044898   .0085139    -5.27   0.000    -.0624697   -.0273263
                   4  |  -.3292108   .0116715   -28.21   0.000    -.3532995    -.305122
                   5  |  -.0966071   .0120326    -8.03   0.000    -.1214413    -.071773
                   6  |  -.3989276    .007549   -52.85   0.000     -.414508   -.3833473
                   7  |   -.250926   .0086214   -29.11   0.000    -.2687197   -.2331323
                   8  |  -.1038545   .0138729    -7.49   0.000    -.1324867   -.0752223
                   9  |  -.4451322   .0076302   -58.34   0.000    -.4608801   -.4293843
                  10  |  -.3806881    .007885   -48.28   0.000     -.396962   -.3644142
                  11  |  -.2779279   .0084791   -32.78   0.000    -.2954278   -.2604279
                  12  |  -.4533466   .0115606   -39.21   0.000    -.4772064   -.4294868
                      |
                unemp |  -.0045917   .0026229    -1.75   0.093    -.0100051    .0008218
                      |
              quarter |
                   2  |   .0015263   .0022732     0.67   0.508    -.0031653    .0062178
                   3  |   .0018062   .0026961     0.67   0.509    -.0037582    .0073706
                   4  |   .0143007   .0026309     5.44   0.000     .0088707    .0197306
                      |
                _cons |   .8525378   .0520425    16.38   0.000     .7451274    .9599483
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all_unemp 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 4,437,265,545)

Linear regression                               Number of obs     =    475,638
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5469
                                                Root MSE          =      .4231

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1569488   .0050134   -31.31   0.000    -.1672959   -.1466017
             treat_st |  -.0214356   .0118829    -1.80   0.084    -.0459607    .0030895
treat_stblackrelwhite |   .0054207   .0072916     0.74   0.464    -.0096285    .0204698
                      |
                state |
                  RI  |   -.024655   .0086796    -2.84   0.009    -.0425688   -.0067412
                  CT  |   .1274644   .0084923    15.01   0.000     .1099372    .1449917
                  NY  |   .1605651   .0042204    38.05   0.000     .1518547    .1692755
                  NJ  |   .1924856   .0077964    24.69   0.000     .1763947    .2085765
                  PA  |  -.0465701   .0048058    -9.69   0.000    -.0564887   -.0366515
                  OH  |   .0540856   .0080771     6.70   0.000     .0374153    .0707558
                  IN  |   .0392127   .0492441     0.80   0.434    -.0624222    .1408476
                  IL  |   .1218836   .0062075    19.63   0.000     .1090719    .1346952
                  MI  |   .3281865   .0379785     8.64   0.000     .2498028    .4065703
                  WI  |  -.1243388   .0363804    -3.42   0.002    -.1994242   -.0492533
                  MN  |  -.1610827   .0064924   -24.81   0.000    -.1744823   -.1476832
                  MO  |  -.0748093   .0068885   -10.86   0.000    -.0890265   -.0605921
                  DE  |    .156974   .0187701     8.36   0.000     .1182344    .1957136
                  MD  |  -.1379876   .0092629   -14.90   0.000    -.1571052     -.11887
                  DC  |  -.1978182   .0112533   -17.58   0.000    -.2210439   -.1745925
                  KY  |   .0424342   .0241383     1.76   0.092    -.0073849    .0922532
                  OK  |  -.2487731    .056307    -4.42   0.000    -.3649851   -.1325612
                  CO  |  -.1633393   .0055582   -29.39   0.000    -.1748109   -.1518677
                  NM  |  -.2544781   .0325272    -7.82   0.000    -.3216109   -.1873453
                  WA  |   -.367619   .0063512   -57.88   0.000    -.3807273   -.3545108
                  OR  |  -.0135708   .0106868    -1.27   0.216    -.0356274    .0084857
                  CA  |   .0675532   .0067664     9.98   0.000     .0535881    .0815183
                  AK  |   .6528597   .0068818    94.87   0.000     .6386564    .6670629
                  HI  |  -.2168489   .0104205   -20.81   0.000    -.2383558    -.195342
                      |
        state#c.lyear |
                  MA  |   .0026898   .0001132    23.77   0.000     .0024562    .0029234
                  RI  |   .0021305   .0000996    21.40   0.000      .001925     .002336
                  CT  |   .0015324   .0001267    12.09   0.000     .0012708    .0017939
                  NY  |   .0007303    .000087     8.40   0.000     .0005508    .0009098
                  NJ  |    .001213   .0000833    14.56   0.000     .0010411    .0013849
                  PA  |    .002061   .0000808    25.52   0.000     .0018943    .0022278
                  OH  |   .0007916   .0000654    12.11   0.000     .0006567    .0009265
                  IN  |   .0011484   .0004867     2.36   0.027     .0001439    .0021528
                  IL  |   .0010152   .0000862    11.78   0.000     .0008373    .0011931
                  MI  |  -.0013639   .0003841    -3.55   0.002    -.0021567   -.0005711
                  WI  |   .0028606    .000353     8.10   0.000     .0021321     .003589
                  MN  |   .0036111    .000097    37.24   0.000      .003411    .0038112
                  MO  |   .0019579    .000109    17.97   0.000      .001733    .0021828
                  DE  |   .0004717   .0001401     3.37   0.003     .0001825    .0007609
                  MD  |   .0041132    .000116    35.45   0.000     .0038737    .0043527
                  DC  |   .0053399   .0001312    40.71   0.000     .0050692    .0056106
                  KY  |   .0008159    .000245     3.33   0.003     .0003102    .0013216
                  OK  |   .0034664   .0006026     5.75   0.000     .0022228      .00471
                  CO  |   .0035378   .0001205    29.36   0.000     .0032891    .0037865
                  NM  |   .0038521   .0003452    11.16   0.000     .0031396    .0045646
                  WA  |   .0059737   .0001191    50.16   0.000     .0057279    .0062195
                  OR  |   .0019583   .0001565    12.52   0.000     .0016354    .0022813
                  CA  |   .0024294    .000082    29.64   0.000     .0022603    .0025986
                  AK  |  -.0024392   .0000648   -37.66   0.000    -.0025728   -.0023055
                  HI  |   .0047137   .0000928    50.81   0.000     .0045222    .0049052
                      |
                 nind |
                   2  |   .0827768   .0290418     2.85   0.009     .0228374    .1427162
                   3  |   .1240147   .0262302     4.73   0.000     .0698782    .1781511
                   4  |  -.0450305   .0274773    -1.64   0.114    -.1017409    .0116799
                   5  |   .1126869   .0263526     4.28   0.000     .0582978    .1670759
                   6  |   .1340874    .031817     4.21   0.000     .0684203    .1997545
                   7  |   .0343563   .0291151     1.18   0.250    -.0257344     .094447
                   8  |  -.0249036    .029007    -0.86   0.399    -.0847711    .0349639
                   9  |  -.0561618   .0273668    -2.05   0.051     -.112644    .0003204
                  10  |  -.0646305   .0286865    -2.25   0.034    -.1238364   -.0054245
                  11  |   .0925116   .0287224     3.22   0.004     .0332314    .1517918
                      |
                 educ |   .0622152   .0026817    23.20   0.000     .0566805    .0677499
                exper |   .0380808   .0023636    16.11   0.000     .0332025    .0429591
               exper2 |  -.0006963   .0000973    -7.16   0.000    -.0008972   -.0004955
               exper3 |  -3.78e-06   2.77e-06    -1.37   0.184    -9.49e-06    1.93e-06
               exper4 |   1.28e-07   3.24e-08     3.96   0.001     6.13e-08    1.95e-07
                 edex |  -.0001338   .0000851    -1.57   0.129    -.0003094    .0000418
                      |
                ee_cl |
                   2  |  -.0677914   .0059743   -11.35   0.000    -.0801218   -.0554611
                   3  |  -.0810694     .00699   -11.60   0.000     -.095496   -.0666428
                   4  |  -.0292226   .0110128    -2.65   0.014    -.0519518   -.0064934
                   5  |   -.131881   .0091877   -14.35   0.000    -.1508435   -.1129186
                   6  |  -.1009073   .0069483   -14.52   0.000    -.1152478   -.0865667
                   7  |  -.0865266   .0086079   -10.05   0.000    -.1042923   -.0687608
                   8  |   .0319811   .0115504     2.77   0.011     .0081423    .0558199
                   9  |  -.1507145   .0101067   -14.91   0.000    -.1715737   -.1298554
                  10  |  -.1095599   .0094748   -11.56   0.000     -.129115   -.0900048
                  11  |  -.0710569   .0091471    -7.77   0.000    -.0899356   -.0521782
                  12  |   .0283916   .0130627     2.17   0.040     .0014314    .0553517
                  13  |   -.071983   .0132089    -5.45   0.000    -.0992449   -.0447211
                  14  |  -.0796888   .0117782    -6.77   0.000    -.1039977   -.0553798
                  15  |  -.0521522   .0103186    -5.05   0.000    -.0734489   -.0308556
                  16  |   .0189291   .0140797     1.34   0.191    -.0101301    .0479882
                      |
                 marr |    .128008   .0039919    32.07   0.000     .1197692    .1362469
                partt |  -.2190254   .0043762   -50.05   0.000    -.2280574   -.2099933
               public |   .0073303   .0058575     1.25   0.223     -.004759    .0194197
                 cmsa |   .1356026   .0118873    11.41   0.000     .1110684    .1601368
                      |
                nocc2 |
                   2  |  -.1531014   .0045051   -33.98   0.000    -.1623996   -.1438033
                   3  |  -.0456063    .008424    -5.41   0.000    -.0629925   -.0282201
                   4  |  -.3294543    .011546   -28.53   0.000     -.353284   -.3056245
                   5  |  -.0973862   .0121287    -8.03   0.000    -.1224186   -.0723539
                   6  |  -.3993975   .0074774   -53.41   0.000    -.4148301   -.3839649
                   7  |      -.251   .0085619   -29.32   0.000    -.2686708   -.2333291
                   8  |  -.1026182   .0136555    -7.51   0.000    -.1308018   -.0744345
                   9  |   -.445708   .0075488   -59.04   0.000    -.4612879   -.4301281
                  10  |  -.3817408   .0076878   -49.66   0.000    -.3976076   -.3658741
                  11  |  -.2781655    .008444   -32.94   0.000    -.2955931   -.2607379
                  12  |  -.4539032   .0114476   -39.65   0.000    -.4775299   -.4302766
                      |
                unemp |  -.0068129   .0010655    -6.39   0.000     -.009012   -.0046138
                      |
              quarter |
                   2  |   .0012496   .0022931     0.54   0.591    -.0034831    .0059823
                   3  |   .0014117   .0026549     0.53   0.600    -.0040677    .0068911
                   4  |   .0138019   .0026191     5.27   0.000     .0083963    .0192075
                      |
                _cons |    .613751   .0370925    16.55   0.000     .5371958    .6903062
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 4,566,873,592)

Linear regression                               Number of obs     =    505,518
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5105
                                                Root MSE          =     .39731

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0849072   .0070918   -11.97   0.000     -.099544   -.0702704
             treat_st |  -.0325736   .0073223    -4.45   0.000    -.0476861   -.0174612
treat_stblackrelwhite |  -.0165882    .008721    -1.90   0.069    -.0345874    .0014111
                      |
                state |
                  RI  |  -.0954706   .0011515   -82.91   0.000    -.0978473    -.093094
                  CT  |   .0040912    .000456     8.97   0.000       .00315    .0050325
                  NY  |  -.0526671   .0011672   -45.12   0.000     -.055076   -.0502582
                  NJ  |   .0132892   .0009705    13.69   0.000     .0112862    .0152922
                  PA  |  -.1379555   .0027057   -50.99   0.000    -.1435398   -.1323712
                  OH  |  -.1688682   .0034146   -49.45   0.000    -.1759156   -.1618207
                  IN  |  -.1618837   .0060859   -26.60   0.000    -.1744442   -.1493231
                  IL  |  -.0970154   .0019832   -48.92   0.000    -.1011084   -.0929223
                  MI  |  -.1363516   .0035811   -38.07   0.000    -.1437427   -.1289604
                  WI  |  -.1127292   .0058129   -19.39   0.000    -.1247265    -.100732
                  MN  |  -.0562397   .0033232   -16.92   0.000    -.0630985   -.0493809
                  MO  |  -.1762048    .003716   -47.42   0.000    -.1838743   -.1685353
                  DE  |  -.0529366   .0128134    -4.13   0.000    -.0793821   -.0264911
                  MD  |  -.0014026   .0034431    -0.41   0.687    -.0085089    .0057037
                  DC  |   .0639536    .006335    10.10   0.000     .0508788    .0770284
                  KY  |  -.1829214   .0067762   -26.99   0.000    -.1969068    -.168936
                  OK  |  -.2215701   .0068953   -32.13   0.000    -.2358014   -.2073388
                  CO  |  -.0947017   .0011488   -82.44   0.000    -.0970726   -.0923308
                  NM  |  -.1815836   .0056982   -31.87   0.000    -.1933441   -.1698231
                  WA  |  -.0428608   .0015206   -28.19   0.000    -.0459991   -.0397225
                  OR  |  -.1042872   .0024594   -42.40   0.000    -.1093631   -.0992113
                  CA  |   .0153483    .001034    14.84   0.000     .0132142    .0174823
                  AK  |   .0758539    .005995    12.65   0.000     .0634808    .0882271
                  HI  |   -.021746   .0034569    -6.29   0.000    -.0288806   -.0146114
                      |
                 year |
                1990  |  -.0048215   .0037515    -1.29   0.211    -.0125643    .0029213
                1991  |   .0004117   .0032225     0.13   0.899    -.0062392    .0070627
                1992  |    .022002   .0039678     5.55   0.000     .0138128    .0301912
                1993  |   .0152561   .0051207     2.98   0.007     .0046876    .0258247
                1996  |   .0058484    .004824     1.21   0.237    -.0041078    .0158046
                1997  |   .0131248   .0059046     2.22   0.036     .0009383    .0253113
                1998  |   .0513351   .0055141     9.31   0.000     .0399546    .0627157
                1999  |   .0680224   .0072169     9.43   0.000     .0531275    .0829173
                2000  |   .0824502   .0072268    11.41   0.000     .0675347    .0973657
                2001  |    .098571   .0077843    12.66   0.000      .082505     .114637
                2002  |   .1083149   .0071608    15.13   0.000     .0935358    .1230941
                2003  |   .1204795   .0075793    15.90   0.000     .1048366    .1361223
                2004  |   .1112495   .0087245    12.75   0.000     .0932431    .1292559
                2005  |   .1056071   .0075822    13.93   0.000     .0899582     .121256
                2006  |    .094165   .0072422    13.00   0.000     .0792178    .1091122
                2007  |   .0935687   .0084012    11.14   0.000     .0762295     .110908
                2008  |   .0859079   .0096294     8.92   0.000     .0660338    .1057819
                2009  |   .1051242   .0085516    12.29   0.000     .0874747    .1227738
                2010  |   .1034588   .0062399    16.58   0.000     .0905801    .1163374
                2011  |   .0839096   .0071355    11.76   0.000     .0691825    .0986366
                2012  |    .071207   .0072001     9.89   0.000     .0563466    .0860673
                2013  |   .0724365   .0073564     9.85   0.000     .0572536    .0876195
                2014  |   .0731265   .0082914     8.82   0.000      .056014    .0902391
                2015  |   .0851136   .0073135    11.64   0.000     .0700193    .1002078
                2016  |   .0981418   .0100609     9.75   0.000     .0773772    .1189065
                2017  |   .1154829   .0101004    11.43   0.000     .0946367    .1363291
                2018  |   .1218363   .0103929    11.72   0.000     .1003865    .1432862
                2019  |   .1323279   .0086431    15.31   0.000     .1144894    .1501664
                      |
                 nind |
                   2  |   .0975168   .0234763     4.15   0.000     .0490641    .1459695
                   3  |   .1723228   .0223001     7.73   0.000     .1262976    .2183479
                   4  |  -.0423435   .0237385    -1.78   0.087    -.0913373    .0066504
                   5  |   .1498629   .0229098     6.54   0.000     .1025794    .1971463
                   6  |   .1354084   .0250799     5.40   0.000     .0836461    .1871708
                   7  |   .0846911   .0250737     3.38   0.002     .0329416    .1364406
                   8  |   .0328717   .0225407     1.46   0.158      -.01365    .0793934
                   9  |  -.0356647   .0235898    -1.51   0.144    -.0843515    .0130222
                  10  |  -.0364851   .0225426    -1.62   0.119    -.0830107    .0100405
                  11  |    .142023   .0284599     4.99   0.000     .0832847    .2007614
                      |
                 educ |   .0842054   .0021917    38.42   0.000     .0796819    .0887288
                exper |   .0478742   .0033338    14.36   0.000     .0409935    .0547549
               exper2 |  -.0016321   .0001278   -12.77   0.000     -.001896   -.0013683
               exper3 |   .0000252   3.77e-06     6.68   0.000     .0000174     .000033
               exper4 |  -1.23e-07   3.89e-08    -3.17   0.004    -2.04e-07   -4.29e-08
                 edex |  -.0004721   .0001261    -3.75   0.001    -.0007323    -.000212
                      |
                ee_cl |
                   2  |  -.1175511   .0066735   -17.61   0.000    -.1313246   -.1037776
                   3  |  -.1491852   .0090812   -16.43   0.000    -.1679278   -.1304425
                   4  |   -.143385   .0151962    -9.44   0.000    -.1747486   -.1120215
                   5  |  -.1630285   .0129988   -12.54   0.000    -.1898567   -.1362003
                   6  |  -.1587103   .0126281   -12.57   0.000    -.1847733   -.1326472
                   7  |  -.1591476   .0129271   -12.31   0.000    -.1858279   -.1324673
                   8  |  -.0681264    .015343    -4.44   0.000    -.0997929     -.03646
                   9  |  -.1616321   .0159133   -10.16   0.000    -.1944755   -.1287886
                  10  |  -.1639045   .0161969   -10.12   0.000    -.1973333   -.1304757
                  11  |  -.1494609   .0141122   -10.59   0.000     -.178587   -.1203348
                  12  |  -.0957889   .0123242    -7.77   0.000    -.1212247   -.0703531
                  13  |  -.1165724   .0244463    -4.77   0.000    -.1670271   -.0661177
                  14  |  -.1457108    .018151    -8.03   0.000    -.1831727   -.1082489
                  15  |  -.1182235    .016058    -7.36   0.000    -.1513656   -.0850813
                  16  |  -.0927248   .0154412    -6.01   0.000    -.1245938   -.0608557
                      |
                 marr |   .0412737   .0036991    11.16   0.000     .0336391    .0489084
                partt |  -.1432047   .0030529   -46.91   0.000    -.1495056   -.1369039
               public |   .0093407   .0080048     1.17   0.255    -.0071804    .0258618
                 cmsa |   .1551143   .0119287    13.00   0.000     .1304947    .1797338
                      |
                nocc2 |
                   2  |  -.1344421   .0048002   -28.01   0.000    -.1443493   -.1245349
                   3  |  -.0458981   .0092915    -4.94   0.000    -.0650747   -.0267215
                   4  |  -.3293353   .0068133   -48.34   0.000    -.3433974   -.3152733
                   5  |   .0345243   .0086816     3.98   0.001     .0166063    .0524423
                   6  |  -.3412155   .0059957   -56.91   0.000    -.3535899   -.3288411
                   7  |  -.3686591   .0060326   -61.11   0.000    -.3811099   -.3562083
                   8  |   -.171739   .0097462   -17.62   0.000    -.1918543   -.1516238
                   9  |  -.4326214   .0078153   -55.36   0.000    -.4487514   -.4164914
                  10  |  -.4597971    .012479   -36.85   0.000    -.4855524   -.4340418
                  11  |  -.2349109   .0113885   -20.63   0.000    -.2584157   -.2114062
                  12  |  -.4399462    .014382   -30.59   0.000    -.4696292   -.4102632
                      |
              quarter |
                   2  |   .0103245   .0022286     4.63   0.000      .005725    .0149241
                   3  |    .016204   .0024425     6.63   0.000      .011163     .021245
                   4  |   .0221804   .0014237    15.58   0.000     .0192421    .0251187
                      |
                _cons |   .4694896   .0412951    11.37   0.000     .3842607    .5547186
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 4,566,873,592)

Linear regression                               Number of obs     =    505,518
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5105
                                                Root MSE          =     .39731

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.084909   .0070902   -11.98   0.000    -.0995424   -.0702756
             treat_st |   -.032743   .0076274    -4.29   0.000    -.0484851   -.0170009
treat_stblackrelwhite |   -.016631   .0087591    -1.90   0.070    -.0347089     .001447
                      |
                state |
                  RI  |  -.0948088   .0021976   -43.14   0.000    -.0993445   -.0902731
                  CT  |   .0041292   .0004558     9.06   0.000     .0031884    .0050699
                  NY  |  -.0522025   .0014992   -34.82   0.000    -.0552967   -.0491084
                  NJ  |   .0136219    .001394     9.77   0.000     .0107448     .016499
                  PA  |  -.1377291   .0025689   -53.61   0.000    -.1430311    -.132427
                  OH  |  -.1684831   .0031946   -52.74   0.000    -.1750765   -.1618897
                  IN  |  -.1618336   .0060736   -26.65   0.000    -.1743688   -.1492983
                  IL  |  -.0963921   .0020918   -46.08   0.000    -.1007093   -.0920749
                  MI  |  -.1353784   .0043307   -31.26   0.000    -.1443166   -.1264401
                  WI  |  -.1129993   .0060114   -18.80   0.000    -.1254062   -.1005924
                  MN  |  -.0568077   .0041819   -13.58   0.000    -.0654386   -.0481767
                  MO  |  -.1761041   .0036246   -48.59   0.000    -.1835849   -.1686234
                  DE  |  -.0533651   .0132335    -4.03   0.000    -.0806778   -.0260524
                  MD  |  -.0016539   .0036912    -0.45   0.658    -.0092722    .0059644
                  DC  |   .0650664   .0068746     9.46   0.000     .0508779    .0792549
                  KY  |  -.1823964   .0065337   -27.92   0.000    -.1958814   -.1689115
                  OK  |   -.221846   .0068518   -32.38   0.000    -.2359873   -.2077046
                  CO  |   -.094981   .0016221   -58.55   0.000    -.0983289   -.0916332
                  NM  |  -.1811443   .0053425   -33.91   0.000    -.1921707   -.1701179
                  WA  |  -.0423328   .0016207   -26.12   0.000    -.0456777   -.0389879
                  OR  |   -.103546   .0025729   -40.24   0.000    -.1088563   -.0982358
                  CA  |   .0163492   .0030173     5.42   0.000     .0101219    .0225766
                  AK  |   .0771778   .0055267    13.96   0.000     .0657713    .0885843
                  HI  |  -.0224633   .0044946    -5.00   0.000    -.0317398   -.0131869
                      |
                 year |
                1990  |   -.004526   .0036812    -1.23   0.231    -.0121236    .0030715
                1991  |   .0015609   .0047957     0.33   0.748     -.008337    .0114588
                1992  |   .0235691    .006861     3.44   0.002     .0094087    .0377295
                1993  |   .0164723   .0071422     2.31   0.030     .0017315     .031213
                1996  |   .0059991   .0047735     1.26   0.221     -.003853    .0158512
                1997  |   .0129786   .0058801     2.21   0.037     .0008427    .0251144
                1998  |   .0509115   .0053156     9.58   0.000     .0399407    .0618823
                1999  |   .0674078   .0069708     9.67   0.000     .0530208    .0817947
                2000  |   .0817187   .0072212    11.32   0.000     .0668148    .0966226
                2001  |   .0983099    .007648    12.85   0.000     .0825251    .1140946
                2002  |   .1087471   .0074075    14.68   0.000     .0934589    .1240354
                2003  |   .1211183   .0081832    14.80   0.000      .104229    .1380076
                2004  |   .1116348   .0091927    12.14   0.000      .092662    .1306076
                2005  |   .1057035   .0076531    13.81   0.000     .0899082    .1214987
                2006  |    .094022   .0071898    13.08   0.000     .0791829     .108861
                2007  |   .0934304   .0083496    11.19   0.000     .0761977    .1106631
                2008  |   .0864339    .009861     8.77   0.000     .0660819     .106786
                2009  |   .1078494   .0131042     8.23   0.000     .0808038    .1348951
                2010  |   .1063715   .0109038     9.76   0.000      .083867    .1288759
                2011  |   .0862998   .0098767     8.74   0.000     .0659152    .1066843
                2012  |   .0731275   .0087057     8.40   0.000     .0551598    .0910952
                2013  |   .0740169   .0093477     7.92   0.000     .0547242    .0933097
                2014  |   .0738564    .008805     8.39   0.000     .0556838     .092029
                2015  |   .0852234   .0073525    11.59   0.000     .0700485    .1003982
                2016  |   .0980309   .0099772     9.83   0.000     .0774389    .1186229
                2017  |   .1150766   .0098816    11.65   0.000      .094682    .1354711
                2018  |   .1211538   .0102821    11.78   0.000     .0999327     .142375
                2019  |   .1315486   .0083941    15.67   0.000     .1142241    .1488732
                      |
                 nind |
                   2  |   .0974905   .0234997     4.15   0.000     .0489896    .1459914
                   3  |   .1723057   .0223096     7.72   0.000     .1262608    .2183505
                   4  |  -.0423608   .0237549    -1.78   0.087    -.0913884    .0066668
                   5  |   .1498463   .0229227     6.54   0.000     .1025362    .1971564
                   6  |   .1353897   .0251007     5.39   0.000     .0835844    .1871949
                   7  |   .0846662    .025095     3.37   0.003     .0328727    .1364596
                   8  |   .0328554   .0225516     1.46   0.158    -.0136888    .0793996
                   9  |   -.035686   .0236056    -1.51   0.144    -.0844055    .0130335
                  10  |  -.0365078   .0225591    -1.62   0.119    -.0830675    .0100519
                  11  |    .141999   .0284636     4.99   0.000     .0832529     .200745
                      |
                 educ |   .0842039    .002195    38.36   0.000     .0796737    .0887341
                exper |   .0478775   .0033296    14.38   0.000     .0410056    .0547494
               exper2 |  -.0016325   .0001276   -12.79   0.000    -.0018958   -.0013691
               exper3 |   .0000252   3.76e-06     6.70   0.000     .0000174     .000033
               exper4 |  -1.23e-07   3.89e-08    -3.17   0.004    -2.04e-07   -4.31e-08
                 edex |  -.0004721    .000126    -3.75   0.001    -.0007323    -.000212
                      |
                ee_cl |
                   2  |   -.117537   .0066914   -17.57   0.000    -.1313473   -.1037267
                   3  |  -.1491663   .0091184   -16.36   0.000    -.1679858   -.1303467
                   4  |   -.143364   .0152288    -9.41   0.000    -.1747946   -.1119334
                   5  |  -.1630123    .013019   -12.52   0.000    -.1898823   -.1361424
                   6  |  -.1586941   .0126589   -12.54   0.000    -.1848207   -.1325675
                   7  |   -.159117   .0129859   -12.25   0.000    -.1859187   -.1323154
                   8  |  -.0680992   .0153916    -4.42   0.000    -.0998659   -.0363324
                   9  |  -.1616052    .015934   -10.14   0.000    -.1944912   -.1287191
                  10  |  -.1638839   .0162259   -10.10   0.000    -.1973724   -.1303953
                  11  |  -.1494249   .0141772   -10.54   0.000    -.1786851   -.1201646
                  12  |  -.0957566   .0123752    -7.74   0.000    -.1212976   -.0702155
                  13  |   -.116548   .0244685    -4.76   0.000    -.1670485   -.0660475
                  14  |  -.1456808   .0181945    -8.01   0.000    -.1832325   -.1081292
                  15  |  -.1181806    .016126    -7.33   0.000    -.1514631   -.0848981
                  16  |  -.0926907   .0154743    -5.99   0.000    -.1246281   -.0607533
                      |
                 marr |   .0412736   .0036983    11.16   0.000     .0336407    .0489064
                partt |  -.1431993   .0030562   -46.86   0.000    -.1495069   -.1368916
               public |   .0093431   .0080072     1.17   0.255    -.0071829    .0258692
                 cmsa |   .1551191   .0119242    13.01   0.000     .1305088    .1797295
                      |
                nocc2 |
                   2  |  -.1344473   .0047993   -28.01   0.000    -.1443526    -.124542
                   3  |  -.0459035   .0092816    -4.95   0.000    -.0650597   -.0267473
                   4  |  -.3293356   .0068129   -48.34   0.000    -.3433968   -.3152745
                   5  |   .0345207   .0086796     3.98   0.001      .016607    .0524344
                   6  |  -.3412148   .0059956   -56.91   0.000    -.3535891   -.3288406
                   7  |  -.3686617   .0060321   -61.12   0.000    -.3811114   -.3562119
                   8  |  -.1717263   .0097383   -17.63   0.000    -.1918251   -.1516275
                   9  |  -.4326228   .0078141   -55.36   0.000    -.4487502   -.4164954
                  10  |  -.4598085   .0124757   -36.86   0.000     -.485557     -.43406
                  11  |  -.2349312   .0113681   -20.67   0.000    -.2583938   -.2114687
                  12  |  -.4399579   .0143735   -30.61   0.000    -.4696233   -.4102924
                      |
                unemp |    -.00063    .001716    -0.37   0.717    -.0041717    .0029117
                      |
              quarter |
                   2  |   .0103258   .0022306     4.63   0.000     .0057221    .0149294
                   3  |     .01621   .0024465     6.63   0.000     .0111606    .0212593
                   4  |   .0221903   .0014341    15.47   0.000     .0192304    .0251502
                      |
                _cons |   .4723783   .0453899    10.41   0.000     .3786982    .5660584
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 4,566,873,592)

Linear regression                               Number of obs     =    505,518
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5090
                                                Root MSE          =     .39789

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0854089   .0068752   -12.42   0.000    -.0995986   -.0712192
             treat_st |  -.0599968   .0121476    -4.94   0.000    -.0850682   -.0349254
treat_stblackrelwhite |  -.0159574   .0080433    -1.98   0.059     -.032558    .0006432
                      |
                state |
                  RI  |  -.0677792   .0076899    -8.81   0.000    -.0836503   -.0519081
                  CT  |   .1455709   .0074232    19.61   0.000     .1302502    .1608916
                  NY  |   .0830985   .0046183    17.99   0.000     .0735668    .0926303
                  NJ  |   .1463586   .0077019    19.00   0.000     .1304628    .1622545
                  PA  |   .0589357   .0046165    12.77   0.000     .0494077    .0684637
                  OH  |  -.0176146   .0081479    -2.16   0.041    -.0344311    -.000798
                  IN  |  -.1548541   .0485795    -3.19   0.004    -.2551173   -.0545909
                  IL  |  -.0315301   .0054206    -5.82   0.000    -.0427177   -.0203425
                  MI  |  -.0376637   .0386018    -0.98   0.339    -.1173339    .0420065
                  WI  |  -.3046675   .0369773    -8.24   0.000     -.380985   -.2283501
                  MN  |  -.0975759   .0064218   -15.19   0.000    -.1108298    -.084322
                  MO  |   .0688711    .006484    10.62   0.000     .0554889    .0822534
                  DE  |    .248886    .022137    11.24   0.000     .2031975    .2945745
                  MD  |  -.2426294   .0090663   -26.76   0.000    -.2613413   -.2239175
                  DC  |  -.1378335   .0191334    -7.20   0.000    -.1773229   -.0983442
                  KY  |  -.1271165    .027366    -4.65   0.000    -.1835971   -.0706358
                  OK  |  -.3341586    .057832    -5.78   0.000     -.453518   -.2147992
                  CO  |  -.1507085   .0045348   -33.23   0.000    -.1600678   -.1413492
                  NM  |  -.3865547   .0269714   -14.33   0.000    -.4422209   -.3308885
                  WA  |  -.3274144   .0088055   -37.18   0.000     -.345588   -.3092407
                  OR  |  -.0911167   .0095961    -9.50   0.000    -.1109221   -.0713113
                  CA  |  -.0158635   .0061378    -2.58   0.016    -.0285314   -.0031957
                  AK  |   .4841766    .004566   106.04   0.000     .4747529    .4936004
                  HI  |  -.0878959   .0101349    -8.67   0.000    -.1088133   -.0669786
                      |
        state#c.lyear |
                  MA  |   .0043855   .0001242    35.30   0.000     .0041291    .0046419
                  RI  |   .0041628   .0001339    31.10   0.000     .0038865    .0044391
                  CT  |   .0030316   .0001107    27.39   0.000     .0028032      .00326
                  NY  |   .0030955   .0000942    32.84   0.000     .0029009      .00329
                  NJ  |   .0031322   .0000965    32.47   0.000     .0029331    .0033313
                  PA  |   .0025053   .0001004    24.96   0.000     .0022981    .0027125
                  OH  |   .0029578   .0000773    38.26   0.000     .0027982    .0031173
                  IN  |   .0043942   .0004969     8.84   0.000     .0033686    .0054198
                  IL  |    .003785   .0001163    32.55   0.000      .003545     .004025
                  MI  |   .0035325   .0004058     8.71   0.000      .002695      .00437
                  WI  |   .0062658     .00038    16.49   0.000     .0054815    .0070502
                  MN  |   .0047741   .0001227    38.91   0.000     .0045209    .0050274
                  MO  |   .0020394    .000123    16.58   0.000     .0017855    .0022933
                  DE  |   .0013059   .0002023     6.45   0.000     .0008882    .0017235
                  MD  |   .0066849   .0001109    60.26   0.000      .006456    .0069139
                  DC  |   .0063599   .0001892    33.62   0.000     .0059694    .0067503
                  KY  |   .0039054   .0002835    13.78   0.000     .0033203    .0044906
                  OK  |   .0056438   .0006367     8.86   0.000     .0043297     .006958
                  CO  |   .0049223   .0001341    36.70   0.000     .0046455    .0051991
                  NM  |    .006393   .0002951    21.67   0.000     .0057841     .007002
                  WA  |   .0071449   .0001729    41.32   0.000     .0067881    .0075018
                  OR  |   .0043035   .0001608    26.76   0.000     .0039716    .0046355
                  CA  |   .0047457      .0001    47.47   0.000     .0045394    .0049521
                  AK  |   .0004465   .0000692     6.46   0.000     .0003038    .0005893
                  HI  |   .0050253   .0000788    63.76   0.000     .0048626     .005188
                      |
                 nind |
                   2  |   .0993273   .0233361     4.26   0.000      .051164    .1474906
                   3  |   .1721524   .0221884     7.76   0.000     .1263579     .217947
                   4  |  -.0416893   .0236841    -1.76   0.091    -.0905707    .0071922
                   5  |   .1516002   .0227915     6.65   0.000     .1045608    .1986396
                   6  |   .1364017   .0248906     5.48   0.000       .08503    .1877733
                   7  |   .0856581   .0249463     3.43   0.002     .0341715    .1371447
                   8  |   .0340321   .0224883     1.51   0.143    -.0123815    .0804457
                   9  |  -.0346591   .0235036    -1.47   0.153    -.0831682    .0138499
                  10  |  -.0368445   .0223554    -1.65   0.112    -.0829838    .0092948
                  11  |   .1433355   .0284667     5.04   0.000     .0845833    .2020878
                      |
                 educ |   .0824555   .0022415    36.79   0.000     .0778292    .0870818
                exper |   .0471398   .0032979    14.29   0.000     .0403332    .0539464
               exper2 |    -.00159   .0001269   -12.53   0.000    -.0018519   -.0013281
               exper3 |   .0000239   3.80e-06     6.29   0.000      .000016    .0000317
               exper4 |  -1.12e-07   3.94e-08    -2.83   0.009    -1.93e-07   -3.01e-08
                 edex |   -.000445   .0001268    -3.51   0.002    -.0007066   -.0001833
                      |
                ee_cl |
                   2  |  -.1182824   .0068393   -17.29   0.000    -.1323981   -.1041667
                   3  |  -.1469054   .0093499   -15.71   0.000    -.1662027   -.1276081
                   4  |  -.1375551   .0153401    -8.97   0.000    -.1692154   -.1058947
                   5  |  -.1670989   .0129551   -12.90   0.000     -.193837   -.1403608
                   6  |  -.1605134   .0126014   -12.74   0.000    -.1865215   -.1345053
                   7  |  -.1566124   .0132468   -11.82   0.000    -.1839524   -.1292724
                   8  |   -.062662   .0156661    -4.00   0.001    -.0949953   -.0303288
                   9  |  -.1646753   .0157466   -10.46   0.000    -.1971746   -.1321759
                  10  |  -.1633266   .0163327   -10.00   0.000    -.1970357   -.1296176
                  11  |  -.1457752   .0143859   -10.13   0.000    -.1754662   -.1160842
                  12  |  -.0906198   .0124714    -7.27   0.000    -.1163595   -.0648801
                  13  |   -.119631   .0242398    -4.94   0.000    -.1696595   -.0696026
                  14  |  -.1441844   .0182901    -7.88   0.000    -.1819334   -.1064354
                  15  |  -.1156666   .0164277    -7.04   0.000    -.1495717   -.0817615
                  16  |  -.0903784   .0153075    -5.90   0.000    -.1219716   -.0587852
                      |
                 marr |   .0409547   .0036266    11.29   0.000     .0334697    .0484397
                partt |  -.1432598   .0030605   -46.81   0.000    -.1495764   -.1369431
               public |   .0087734    .007873     1.11   0.276    -.0074757    .0250225
                 cmsa |   .1540422   .0118914    12.95   0.000     .1294995    .1785849
                      |
                nocc2 |
                   2  |  -.1339458   .0049464   -27.08   0.000    -.1441546    -.123737
                   3  |  -.0450435    .009363    -4.81   0.000    -.0643678   -.0257192
                   4  |    -.32858   .0068242   -48.15   0.000    -.3426644   -.3144956
                   5  |   .0342677   .0087382     3.92   0.001     .0162329    .0523024
                   6  |  -.3415344   .0060837   -56.14   0.000    -.3540905   -.3289783
                   7  |  -.3688614   .0061098   -60.37   0.000    -.3814713   -.3562514
                   8  |  -.1707517   .0100088   -17.06   0.000    -.1914089   -.1500945
                   9  |  -.4326046   .0078441   -55.15   0.000     -.448794   -.4164151
                  10  |  -.4603325   .0126339   -36.44   0.000    -.4864076   -.4342574
                  11  |  -.2342614   .0114706   -20.42   0.000    -.2579354   -.2105873
                  12  |   -.440304   .0146009   -30.16   0.000    -.4704387   -.4101693
                      |
                unemp |  -.0026056   .0007863    -3.31   0.003    -.0042285   -.0009827
                      |
              quarter |
                   2  |   .0099489   .0021562     4.61   0.000     .0054987    .0143991
                   3  |   .0158598   .0023741     6.68   0.000     .0109598    .0207597
                   4  |   .0217043   .0014172    15.31   0.000     .0187793    .0246293
                      |
                _cons |   .1191321   .0360058     3.31   0.003     .0448197    .1934444
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,255,615,513)

Linear regression                               Number of obs     =    136,489
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3504
                                                Root MSE          =     .35754

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1370071   .0123994   -11.05   0.000    -.1625983   -.1114159
             treat_st |  -.0550701   .0311835    -1.77   0.090    -.1194297    .0092896
treat_stblackrelwhite |  -.0234975   .0187728    -1.25   0.223    -.0622427    .0152477
                      |
                state |
                  RI  |  -.0622639   .0013152   -47.34   0.000    -.0649783   -.0595495
                  CT  |   .0469607   .0017273    27.19   0.000     .0433956    .0505258
                  NY  |   .0161355   .0027835     5.80   0.000     .0103908    .0218803
                  NJ  |   .0861666   .0013439    64.12   0.000     .0833931    .0889402
                  PA  |  -.0875669   .0050234   -17.43   0.000    -.0979348   -.0771991
                  OH  |  -.0876219   .0067318   -13.02   0.000    -.1015157   -.0737282
                  IN  |  -.0633529    .011199    -5.66   0.000    -.0864665   -.0402394
                  IL  |   -.005216   .0054018    -0.97   0.344    -.0163647    .0059327
                  MI  |  -.0048823   .0077073    -0.63   0.532    -.0207893    .0110247
                  WI  |  -.0649526    .007818    -8.31   0.000    -.0810882   -.0488169
                  MN  |  -.0271248   .0039669    -6.84   0.000    -.0353121   -.0189374
                  MO  |  -.0673119   .0073863    -9.11   0.000    -.0825565   -.0520673
                  DE  |  -.0286436   .0162991    -1.76   0.092    -.0622832     .004996
                  MD  |   .0280034   .0037549     7.46   0.000     .0202536    .0357531
                  DC  |   .0344802   .0086307     4.00   0.001     .0166673    .0522931
                  KY  |  -.1105652   .0101342   -10.91   0.000    -.1314812   -.0896493
                  OK  |  -.1298029   .0158453    -8.19   0.000     -.162506   -.0970998
                  CO  |   -.079388    .002642   -30.05   0.000    -.0848409   -.0739352
                  NM  |  -.1315193   .0044236   -29.73   0.000    -.1406492   -.1223893
                  WA  |   .0114419   .0036733     3.11   0.005     .0038605    .0190233
                  OR  |  -.0626185   .0033687   -18.59   0.000    -.0695711   -.0556659
                  CA  |   .0815494   .0019888    41.00   0.000     .0774448     .085654
                  AK  |   .1439393   .0067339    21.38   0.000     .1300414    .1578373
                  HI  |  -.0023935   .0061977    -0.39   0.703     -.015185    .0103979
                      |
                 year |
                1990  |  -.0160092   .0063797    -2.51   0.019    -.0291762   -.0028422
                1991  |  -.0275054   .0050381    -5.46   0.000    -.0379034   -.0171073
                1992  |  -.0264798   .0077595    -3.41   0.002    -.0424946    -.010465
                1993  |  -.0253194   .0053491    -4.73   0.000    -.0363594   -.0142795
                1996  |  -.0114798   .0061938    -1.85   0.076     -.024263    .0013035
                1997  |   .0006046   .0065357     0.09   0.927    -.0128845    .0140936
                1998  |   .0051976   .0059031     0.88   0.387    -.0069858     .017381
                1999  |   .0153853   .0066198     2.32   0.029     .0017227    .0290479
                2000  |   .0153319   .0082157     1.87   0.074    -.0016244    .0322883
                2001  |   .0182997   .0069341     2.64   0.014     .0039884     .032611
                2002  |   .0335194   .0086923     3.86   0.001     .0155794    .0514594
                2003  |   .0404549   .0089207     4.53   0.000     .0220435    .0588663
                2004  |   .0273371   .0075668     3.61   0.001     .0117201    .0429542
                2005  |   .0251916   .0078199     3.22   0.004     .0090521    .0413311
                2006  |   .0213549   .0107436     1.99   0.058    -.0008188    .0435285
                2007  |   .0219362   .0133153     1.65   0.112    -.0055451    .0494176
                2008  |    .004657   .0095329     0.49   0.630    -.0150179    .0243319
                2009  |   .0138485   .0105757     1.31   0.203    -.0079787    .0356758
                2010  |   .0311938   .0125147     2.49   0.020     .0053647    .0570229
                2011  |   .0106591   .0116122     0.92   0.368    -.0133073    .0346256
                2012  |  -.0042524    .013492    -0.32   0.755    -.0320985    .0235936
                2013  |  -.0045871   .0090393    -0.51   0.616    -.0232432     .014069
                2014  |   .0019076   .0104268     0.18   0.856    -.0196123    .0234275
                2015  |   .0107216   .0093249     1.15   0.262    -.0085241    .0299673
                2016  |   .0058533   .0103612     0.56   0.577    -.0155312    .0272377
                2017  |   .0306145   .0098575     3.11   0.005     .0102697    .0509594
                2018  |   .0298873   .0113521     2.63   0.015     .0064577    .0533168
                2019  |   .0439581   .0124221     3.54   0.002     .0183201    .0695961
                      |
                 nind |
                   2  |   .1102376   .0220458     5.00   0.000     .0647374    .1557379
                   3  |  -.0327407   .0209558    -1.56   0.131    -.0759915      .01051
                   4  |  -.1932998   .0272922    -7.08   0.000    -.2496281   -.1369715
                   5  |   .0755487   .0221748     3.41   0.002      .029782    .1213153
                   6  |  -.0621551    .026998    -2.30   0.030    -.1178762    -.006434
                   7  |  -.0782046   .0244617    -3.20   0.004     -.128691   -.0277181
                   8  |  -.1777978   .0243581    -7.30   0.000    -.2280705   -.1275251
                   9  |  -.1053741    .022837    -4.61   0.000    -.1525074   -.0582409
                  10  |  -.1229085   .0473871    -2.59   0.016    -.2207107   -.0251064
                  11  |   .1115663   .0249829     4.47   0.000     .0600042    .1631284
                      |
                 educ |   .0692485   .0048837    14.18   0.000     .0591689     .079328
                exper |   .0689073   .0030124    22.87   0.000       .06269    .0751246
               exper2 |  -.0025379   .0002082   -12.19   0.000    -.0029676   -.0021082
               exper3 |   .0000509   5.88e-06     8.65   0.000     .0000387     .000063
               exper4 |  -4.12e-07   5.71e-08    -7.22   0.000    -5.30e-07   -2.94e-07
                 edex |  -.0006526   .0001216    -5.37   0.000    -.0009036   -.0004016
                      |
                ee_cl |
                   2  |   .0633308   .0183721     3.45   0.002     .0254126     .101249
                   3  |   .0500372   .0189459     2.64   0.014     .0109348    .0891397
                   4  |   .0034361   .0245976     0.14   0.890    -.0473309     .054203
                   5  |    .020413   .0248511     0.82   0.419    -.0308771     .071703
                   6  |   .0455286    .017831     2.55   0.017     .0087273      .08233
                   7  |   .0527838   .0230723     2.29   0.031     .0051649    .1004028
                   8  |   .0046696   .0228398     0.20   0.840    -.0424694    .0518086
                   9  |   .0317985   .0256984     1.24   0.228    -.0212405    .0848374
                  10  |   .0337752   .0213293     1.58   0.126    -.0102464    .0777968
                  11  |    .045389   .0225494     2.01   0.055    -.0011506    .0919287
                  12  |   .0493858   .0241021     2.05   0.052    -.0003584    .0991301
                  13  |   .0606153    .023364     2.59   0.016     .0123945    .1088362
                  14  |   .0257282   .0223686     1.15   0.261    -.0204383    .0718947
                  15  |   .0415358   .0237934     1.75   0.094    -.0075713    .0906429
                  16  |   .0613138   .0216307     2.83   0.009     .0166703    .1059573
                      |
                 marr |   .0640472   .0033234    19.27   0.000      .057188    .0709064
                partt |   -.123915   .0158216    -7.83   0.000    -.1565691   -.0912609
               public |  -.0476188   .0104247    -4.57   0.000    -.0691344   -.0261032
                 cmsa |   .1156609   .0138287     8.36   0.000     .0871199    .1442019
                      |
                nocc2 |
                   2  |  -.0247962   .0121728    -2.04   0.053    -.0499196    .0003273
                   3  |  -.0119575   .0159298    -0.75   0.460     -.044835    .0209201
                   4  |  -.0474574   .0115491    -4.11   0.000    -.0712937   -.0236212
                   5  |   .0333999   .0160351     2.08   0.048     .0003051    .0664946
                   6  |  -.2423156   .0130497   -18.57   0.000    -.2692489   -.2153822
                   7  |  -.1889112   .0101615   -18.59   0.000    -.2098835   -.1679389
                   8  |   -.083529   .0319247    -2.62   0.015    -.1494183   -.0176396
                   9  |  -.2091466   .0089418   -23.39   0.000    -.2276016   -.1906916
                  10  |  -.1450011   .0074452   -19.48   0.000    -.1603673   -.1296349
                  11  |  -.0593136   .0090468    -6.56   0.000    -.0779852    -.040642
                  12  |  -.1948812   .0080741   -24.14   0.000    -.2115452   -.1782171
                      |
              quarter |
                   2  |   .0002975   .0027777     0.11   0.916    -.0054353    .0060304
                   3  |    .007236   .0034821     2.08   0.049     .0000493    .0144227
                   4  |   .0124426    .001977     6.29   0.000     .0083622     .016523
                      |
                _cons |   .6232143    .074016     8.42   0.000     .4704527    .7759758
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,255,615,513)

Linear regression                               Number of obs     =    136,489
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3505
                                                Root MSE          =     .35753

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1369899   .0124135   -11.04   0.000      -.16261   -.1113697
             treat_st |  -.0558982   .0321057    -1.74   0.094    -.1221612    .0103648
treat_stblackrelwhite |  -.0235395   .0188486    -1.25   0.224    -.0624411    .0153621
                      |
                state |
                  RI  |  -.0587385   .0024002   -24.47   0.000    -.0636923   -.0537846
                  CT  |   .0468976   .0017403    26.95   0.000     .0433058    .0504893
                  NY  |   .0185573    .003835     4.84   0.000     .0106423    .0264723
                  NJ  |   .0877078   .0018259    48.04   0.000     .0839393    .0914762
                  PA  |  -.0864779    .005259   -16.44   0.000    -.0973319    -.075624
                  OH  |  -.0857801   .0069872   -12.28   0.000     -.100201   -.0713592
                  IN  |  -.0638191   .0110617    -5.77   0.000    -.0866493   -.0409888
                  IL  |  -.0019367   .0064317    -0.30   0.766     -.015211    .0113376
                  MI  |   .0003589    .009629     0.04   0.971    -.0195144    .0202322
                  WI  |   -.067139   .0072434    -9.27   0.000    -.0820886   -.0521894
                  MN  |  -.0306251   .0034476    -8.88   0.000    -.0377406   -.0235096
                  MO  |  -.0668767   .0074819    -8.94   0.000    -.0823185   -.0514348
                  DE  |  -.0315102   .0155971    -2.02   0.055     -.063701    .0006806
                  MD  |   .0263197   .0040392     6.52   0.000     .0179831    .0346562
                  DC  |    .040591   .0097666     4.16   0.000     .0204336    .0607483
                  KY  |  -.1078661   .0112467    -9.59   0.000    -.1310781   -.0846541
                  OK  |  -.1314037   .0152905    -8.59   0.000    -.1629617   -.0998458
                  CO  |  -.0813483   .0023104   -35.21   0.000    -.0861166   -.0765799
                  NM  |  -.1292876   .0055241   -23.40   0.000    -.1406888   -.1178864
                  WA  |    .014159   .0046044     3.08   0.005      .004656     .023662
                  OR  |  -.0587687   .0055232   -10.64   0.000    -.0701681   -.0473693
                  CA  |   .0870074   .0050893    17.10   0.000     .0765036    .0975113
                  AK  |   .1509535   .0105433    14.32   0.000     .1291933    .1727137
                  HI  |  -.0073057   .0045908    -1.59   0.125    -.0167806    .0021692
                      |
                 year |
                1990  |  -.0143985   .0057211    -2.52   0.019    -.0262063   -.0025907
                1991  |  -.0208624    .006508    -3.21   0.004    -.0342942   -.0074307
                1992  |   -.017184   .0067229    -2.56   0.017    -.0310595   -.0033085
                1993  |   -.018189    .005742    -3.17   0.004    -.0300399    -.006338
                1996  |  -.0105609   .0060529    -1.74   0.094    -.0230535    .0019317
                1997  |  -.0000842   .0062009    -0.01   0.989    -.0128823    .0127139
                1998  |   .0028235   .0069801     0.40   0.689    -.0115828    .0172298
                1999  |   .0119395   .0067619     1.77   0.090    -.0020163    .0258953
                2000  |   .0111832    .007444     1.50   0.146    -.0041806    .0265469
                2001  |    .016877   .0079181     2.13   0.043     .0005348    .0332191
                2002  |   .0361401   .0079601     4.54   0.000     .0197114    .0525689
                2003  |   .0441761    .008687     5.09   0.000     .0262469    .0621053
                2004  |   .0294825   .0073975     3.99   0.001     .0142147    .0447502
                2005  |   .0255249   .0077442     3.30   0.003     .0095416    .0415081
                2006  |   .0202615   .0114404     1.77   0.089    -.0033503    .0438733
                2007  |   .0209251    .013958     1.50   0.147    -.0078829    .0497331
                2008  |   .0075875   .0086074     0.88   0.387    -.0101773    .0253523
                2009  |   .0292286   .0143698     2.03   0.053    -.0004292    .0588864
                2010  |   .0478595   .0147811     3.24   0.004     .0173527    .0783663
                2011  |   .0245884   .0119257     2.06   0.050    -.0000251    .0492019
                2012  |      .0071   .0118372     0.60   0.554    -.0173307    .0315308
                2013  |   .0045552   .0073914     0.62   0.544       -.0107    .0198103
                2014  |   .0062003   .0108464     0.57   0.573    -.0161856    .0285863
                2015  |   .0113628   .0095032     1.20   0.244    -.0082508    .0309764
                2016  |    .004965   .0110901     0.45   0.658    -.0179238    .0278538
                2017  |    .028157   .0107215     2.63   0.015      .006029     .050285
                2018  |   .0257915   .0110894     2.33   0.029      .002904    .0486789
                2019  |   .0392349   .0132305     2.97   0.007     .0119285    .0665412
                      |
                 nind |
                   2  |   .1100977   .0220453     4.99   0.000     .0645985    .1555969
                   3  |  -.0329496   .0209663    -1.57   0.129    -.0762219    .0103226
                   4  |  -.1934508   .0273265    -7.08   0.000    -.2498499   -.1370516
                   5  |   .0754513   .0221957     3.40   0.002     .0296417    .1212609
                   6  |  -.0622001   .0269911    -2.30   0.030    -.1179069   -.0064932
                   7  |    -.07837   .0245097    -3.20   0.004    -.1289555   -.0277844
                   8  |  -.1779288   .0243859    -7.30   0.000    -.2282587   -.1275988
                   9  |   -.105446   .0228192    -4.62   0.000    -.1525424   -.0583496
                  10  |  -.1229396   .0473673    -2.60   0.016    -.2207009   -.0251783
                  11  |   .1114009   .0250133     4.45   0.000     .0597759    .1630259
                      |
                 educ |   .0692615   .0048849    14.18   0.000     .0591796    .0793434
                exper |   .0689619   .0030095    22.91   0.000     .0627505    .0751732
               exper2 |  -.0025403   .0002077   -12.23   0.000    -.0029689   -.0021116
               exper3 |    .000051   5.88e-06     8.67   0.000     .0000388    .0000631
               exper4 |  -4.13e-07   5.71e-08    -7.23   0.000    -5.31e-07   -2.95e-07
                 edex |  -.0006545   .0001224    -5.35   0.000    -.0009071    -.000402
                      |
                ee_cl |
                   2  |   .0634028   .0183684     3.45   0.002     .0254923    .1013134
                   3  |   .0501152   .0189343     2.65   0.014     .0110367    .0891936
                   4  |   .0034707   .0246082     0.14   0.889    -.0473181    .0542595
                   5  |    .020516   .0249487     0.82   0.419    -.0309755    .0720076
                   6  |   .0455696   .0178499     2.55   0.017     .0087291    .0824101
                   7  |   .0529016   .0230661     2.29   0.031     .0052956    .1005076
                   8  |   .0047484   .0228133     0.21   0.837    -.0423359    .0518328
                   9  |    .031838   .0257633     1.24   0.228     -.021335    .0850109
                  10  |   .0336761   .0213675     1.58   0.128    -.0104243    .0777765
                  11  |   .0454369   .0225558     2.01   0.055    -.0011159    .0919896
                  12  |   .0495675   .0240602     2.06   0.050    -.0000903    .0992253
                  13  |   .0604401   .0234331     2.58   0.016     .0120765    .1088037
                  14  |   .0257017   .0223803     1.15   0.262    -.0204891    .0718924
                  15  |   .0415939   .0237831     1.75   0.093     -.007492    .0906798
                  16  |   .0614892   .0215958     2.85   0.009     .0169177    .1060607
                      |
                 marr |   .0640848   .0033112    19.35   0.000     .0572509    .0709188
                partt |  -.1237169    .015751    -7.85   0.000    -.1562253   -.0912085
               public |  -.0475505     .01046    -4.55   0.000     -.069139   -.0259621
                 cmsa |   .1156455   .0138251     8.36   0.000     .0871119    .1441791
                      |
                nocc2 |
                   2  |  -.0247724   .0121506    -2.04   0.053      -.04985    .0003053
                   3  |  -.0119428    .015946    -0.75   0.461    -.0448537    .0209681
                   4  |  -.0474729   .0115181    -4.12   0.000    -.0712452   -.0237006
                   5  |   .0332958   .0161004     2.07   0.050     .0000663    .0665253
                   6  |  -.2423267    .013084   -18.52   0.000    -.2693308   -.2153226
                   7  |  -.1888376   .0101811   -18.55   0.000    -.2098504   -.1678248
                   8  |    -.08381   .0318513    -2.63   0.015    -.1495478   -.0180721
                   9  |  -.2090814   .0089607   -23.33   0.000    -.2275754   -.1905875
                  10  |  -.1449834   .0074448   -19.47   0.000    -.1603487   -.1296181
                  11  |  -.0593402   .0090643    -6.55   0.000    -.0780479   -.0406324
                  12  |  -.1948512   .0080921   -24.08   0.000    -.2115525   -.1781499
                      |
                unemp |  -.0036099   .0026748    -1.35   0.190    -.0091304    .0019106
                      |
              quarter |
                   2  |   .0003011   .0027768     0.11   0.915    -.0054299    .0060321
                   3  |   .0073114   .0034602     2.11   0.045     .0001699    .0144528
                   4  |   .0126447    .001976     6.40   0.000     .0085663     .016723
                      |
                _cons |   .6396326   .0740128     8.64   0.000     .4868777    .7923876
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,255,615,513)

Linear regression                               Number of obs     =    136,489
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3507
                                                Root MSE          =     .35747

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1380562   .0123334   -11.19   0.000    -.1635111   -.1126013
             treat_st |  -.0451467     .01975    -2.29   0.031    -.0859086   -.0043847
treat_stblackrelwhite |   -.015276   .0173301    -0.88   0.387    -.0510435    .0204916
                      |
                state |
                  RI  |  -.0926401   .0117304    -7.90   0.000    -.1168504   -.0684298
                  CT  |   .0595255   .0144364     4.12   0.000     .0297303    .0893207
                  NY  |   .0845712   .0082869    10.21   0.000     .0674679    .1016745
                  NJ  |   .0405962   .0132599     3.06   0.005     .0132291    .0679634
                  PA  |  -.0192473   .0095644    -2.01   0.056    -.0389873    .0004927
                  OH  |   .2167842   .0189633    11.43   0.000     .1776458    .2559225
                  IN  |   .0987665   .0664647     1.49   0.150    -.0384099    .2359429
                  IL  |   .1712366   .0122141    14.02   0.000     .1460279    .1964452
                  MI  |   .5783436   .0628647     9.20   0.000     .4485973    .7080898
                  WI  |  -.1146529   .0486369    -2.36   0.027    -.2150344   -.0142713
                  MN  |   .0584814   .0077865     7.51   0.000      .042411    .0745519
                  MO  |   .2337633   .0087366    26.76   0.000     .2157318    .2517948
                  DE  |   .4858514   .0328835    14.77   0.000     .4179833    .5537195
                  MD  |  -.1334023   .0137684    -9.69   0.000     -.161819   -.1049856
                  DC  |  -.1359733   .0192232    -7.07   0.000     -.175648   -.0962987
                  KY  |    .312957   .0386575     8.10   0.000     .2331718    .3927422
                  OK  |  -.3104819   .0942343    -3.29   0.003    -.5049719   -.1159919
                  CO  |   .1524424   .0125442    12.15   0.000     .1265525    .1783324
                  NM  |  -.2087341   .0305847    -6.82   0.000    -.2718577   -.1456105
                  WA  |   .1583162   .0101256    15.64   0.000      .137418    .1792144
                  OR  |   .2049339   .0132428    15.48   0.000     .1776021    .2322657
                  CA  |   .3305828   .0089586    36.90   0.000     .3120933    .3490724
                  AK  |   .8237971   .0115153    71.54   0.000     .8000308    .8475634
                  HI  |   .0611701   .0220971     2.77   0.011     .0155639    .1067763
                      |
        state#c.lyear |
                  MA  |   .0030717   .0002027    15.16   0.000     .0026534    .0034899
                  RI  |    .003411   .0001539    22.17   0.000     .0030935    .0037286
                  CT  |   .0029488   .0002441    12.08   0.000     .0024451    .0034526
                  NY  |   .0024368   .0001232    19.77   0.000     .0021825    .0026912
                  NJ  |   .0035321   .0002359    14.97   0.000     .0030453    .0040189
                  PA  |   .0024195   .0001688    14.34   0.000     .0020712    .0027679
                  OH  |    .000109    .000219     0.50   0.623     -.000343    .0005609
                  IN  |   .0014718   .0006485     2.27   0.033     .0001333    .0028103
                  IL  |   .0013871   .0002115     6.56   0.000     .0009505    .0018237
                  MI  |  -.0026652   .0006122    -4.35   0.000    -.0039288   -.0014017
                  WI  |   .0035533   .0004591     7.74   0.000     .0026057    .0045009
                  MN  |    .002196   .0001352    16.24   0.000      .001917     .002475
                  MO  |   .0001406   .0001602     0.88   0.389      -.00019    .0004712
                  DE  |  -.0022459   .0003395    -6.62   0.000    -.0029466   -.0015452
                  MD  |   .0046056   .0001936    23.79   0.000     .0042059    .0050052
                  DC  |   .0048237    .000258    18.70   0.000     .0042912    .0053562
                  KY  |  -.0010331   .0003848    -2.68   0.013    -.0018272   -.0002389
                  OK  |   .0048044   .0009931     4.84   0.000     .0027547     .006854
                  CO  |   .0007889   .0001493     5.28   0.000     .0004807     .001097
                  NM  |   .0037956   .0004092     9.28   0.000     .0029511    .0046401
                  WA  |   .0016679   .0001635    10.20   0.000     .0013303    .0020054
                  OR  |   .0005035   .0002378     2.12   0.045     .0000126    .0009943
                  CA  |   .0006963   .0001511     4.61   0.000     .0003843    .0010082
                  AK  |  -.0035233   .0001368   -25.76   0.000    -.0038056   -.0032411
                  HI  |   .0023935    .000244     9.81   0.000       .00189     .002897
                      |
                 nind |
                   2  |   .1112068   .0225125     4.94   0.000     .0647433    .1576704
                   3  |  -.0339508   .0208658    -1.63   0.117    -.0770156     .009114
                   4  |   -.192917     .02775    -6.95   0.000    -.2501902   -.1356437
                   5  |   .0763402   .0225859     3.38   0.002     .0297251    .1229553
                   6  |  -.0618469   .0277434    -2.23   0.035    -.1191064   -.0045874
                   7  |  -.0785038   .0251037    -3.13   0.005    -.1303153   -.0266923
                   8  |  -.1766743   .0247315    -7.14   0.000    -.2277176   -.1256311
                   9  |  -.1035926   .0231172    -4.48   0.000    -.1513043    -.055881
                  10  |  -.1231651   .0477763    -2.58   0.017    -.2217706   -.0245596
                  11  |   .1119153   .0255441     4.38   0.000     .0591948    .1646357
                      |
                 educ |    .068351   .0048405    14.12   0.000     .0583606    .0783413
                exper |   .0685898   .0028761    23.85   0.000     .0626539    .0745258
               exper2 |   -.002511   .0002014   -12.47   0.000    -.0029267   -.0020954
               exper3 |   .0000499   5.74e-06     8.70   0.000     .0000381    .0000618
               exper4 |  -4.03e-07   5.57e-08    -7.22   0.000    -5.18e-07   -2.88e-07
                 edex |  -.0006435    .000123    -5.23   0.000    -.0008973   -.0003896
                      |
                ee_cl |
                   2  |   .0629351   .0186113     3.38   0.002     .0245233    .1013469
                   3  |   .0504682   .0191609     2.63   0.015     .0109221    .0900142
                   4  |   .0051387   .0254026     0.20   0.841    -.0472898    .0575672
                   5  |   .0186324   .0252598     0.74   0.468    -.0335012     .070766
                   6  |   .0436604    .018236     2.39   0.025     .0060231    .0812976
                   7  |   .0525405   .0234053     2.24   0.034     .0042344    .1008466
                   8  |   .0060807   .0234287     0.26   0.797    -.0422737    .0544352
                   9  |   .0289574   .0263148     1.10   0.282    -.0253537    .0832684
                  10  |   .0328838   .0219709     1.50   0.148     -.012462    .0782295
                  11  |   .0451351   .0230224     1.96   0.062    -.0023808    .0926509
                  12  |   .0506852   .0247785     2.05   0.052     -.000455    .1018254
                  13  |   .0592278    .024485     2.42   0.024     .0086933    .1097624
                  14  |   .0256403   .0230122     1.11   0.276    -.0218544    .0731351
                  15  |   .0436263   .0243842     1.79   0.086    -.0067002    .0939529
                  16  |   .0636476   .0223201     2.85   0.009     .0175811    .1097141
                      |
                 marr |   .0642043   .0032601    19.69   0.000     .0574758    .0709328
                partt |  -.1231131   .0156733    -7.85   0.000    -.1554613    -.090765
               public |  -.0476336    .010481    -4.54   0.000    -.0692654   -.0260018
                 cmsa |   .1151072   .0137633     8.36   0.000     .0867012    .1435132
                      |
                nocc2 |
                   2  |  -.0238271   .0121663    -1.96   0.062    -.0489372     .001283
                   3  |  -.0115092   .0159731    -0.72   0.478    -.0444761    .0214577
                   4  |  -.0475141   .0116019    -4.10   0.000    -.0714593   -.0235689
                   5  |   .0337303   .0159351     2.12   0.045     .0008419    .0666187
                   6  |  -.2420323   .0131091   -18.46   0.000    -.2690883   -.2149764
                   7  |  -.1895739   .0101785   -18.62   0.000    -.2105813   -.1685666
                   8  |   -.083729   .0320887    -2.61   0.015    -.1499569   -.0175012
                   9  |  -.2090924   .0089607   -23.33   0.000    -.2275864   -.1905984
                  10  |  -.1448768   .0074644   -19.41   0.000    -.1602827    -.129471
                  11  |  -.0594148   .0090068    -6.60   0.000    -.0780039   -.0408258
                  12  |  -.1949161    .008008   -24.34   0.000    -.2114437   -.1783885
                      |
                unemp |  -.0042013   .0013775    -3.05   0.006    -.0070443   -.0013582
                      |
              quarter |
                   2  |   .0001944   .0027047     0.07   0.943    -.0053878    .0057766
                   3  |    .006862   .0035733     1.92   0.067    -.0005129    .0142369
                   4  |   .0122362   .0019696     6.21   0.000     .0081713    .0163012
                      |
                _cons |   .3499264   .0675444     5.18   0.000     .2105216    .4893311
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 997,355,881)

Linear regression                               Number of obs     =    111,486
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4382
                                                Root MSE          =     .36913

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0494323   .0100188    -4.93   0.000    -.0701101   -.0287545
             treat_st |  -.0707596   .0169703    -4.17   0.000    -.1057846   -.0357346
treat_stblackrelwhite |   .0417477    .027935     1.49   0.148    -.0159073    .0994028
                      |
                state |
                  RI  |   .0049958   .0014877     3.36   0.003     .0019253    .0080662
                  CT  |   .0370257   .0022589    16.39   0.000     .0323635    .0416879
                  NY  |   -.008151    .003007    -2.71   0.012    -.0143572   -.0019448
                  NJ  |   .0791853   .0019182    41.28   0.000     .0752263    .0831442
                  PA  |  -.0942379   .0033308   -28.29   0.000    -.1011124   -.0873633
                  OH  |  -.1150306   .0041212   -27.91   0.000    -.1235364   -.1065248
                  IN  |  -.1285136     .00867   -14.82   0.000    -.1464075   -.1106197
                  IL  |  -.0943017   .0038551   -24.46   0.000    -.1022583   -.0863451
                  MI  |    -.04414   .0055998    -7.88   0.000    -.0556974   -.0325827
                  WI  |   -.085366   .0061776   -13.82   0.000     -.098116    -.072616
                  MN  |  -.0434301   .0042035   -10.33   0.000    -.0521057   -.0347544
                  MO  |  -.1736704   .0043458   -39.96   0.000    -.1826397   -.1647011
                  DE  |    .013781   .0149757     0.92   0.367    -.0171273    .0446893
                  MD  |   .0315622   .0060236     5.24   0.000     .0191301    .0439942
                  DC  |   .0539777    .009266     5.83   0.000     .0348535    .0731018
                  KY  |  -.1684675   .0060688   -27.76   0.000     -.180993    -.155942
                  OK  |  -.2280492   .0097901   -23.29   0.000     -.248255   -.2078433
                  CO  |  -.1250245   .0014315   -87.34   0.000     -.127979   -.1220699
                  NM  |  -.2003965   .0057796   -34.67   0.000    -.2123249    -.188468
                  WA  |  -.0448708   .0031432   -14.28   0.000     -.051358   -.0383836
                  OR  |  -.1152902   .0025681   -44.89   0.000    -.1205905   -.1099899
                  CA  |   .0590426   .0015133    39.02   0.000     .0559193    .0621658
                  AK  |   .0954883   .0066814    14.29   0.000     .0816985    .1092781
                  HI  |   -.054017   .0062977    -8.58   0.000    -.0670147   -.0410192
                      |
                 year |
                1990  |  -.0005272   .0058175    -0.09   0.929    -.0125339    .0114795
                1991  |  -.0041998   .0076545    -0.55   0.588    -.0199979    .0115983
                1992  |   .0063584   .0097787     0.65   0.522    -.0138237    .0265406
                1993  |   .0161922   .0084505     1.92   0.067    -.0012488    .0336332
                1996  |   .0250004   .0091615     2.73   0.012     .0060919    .0439088
                1997  |   .0296343   .0077473     3.83   0.001     .0136447    .0456239
                1998  |    .045357   .0070194     6.46   0.000     .0308696    .0598444
                1999  |   .0446063   .0073159     6.10   0.000      .029507    .0597056
                2000  |   .0377224   .0081552     4.63   0.000      .020891    .0545538
                2001  |   .0551823   .0088417     6.24   0.000      .036934    .0734306
                2002  |   .0647167    .008264     7.83   0.000     .0476606    .0817728
                2003  |   .0527106   .0070283     7.50   0.000     .0382048    .0672164
                2004  |   .0530644   .0086469     6.14   0.000      .035218    .0709107
                2005  |   .0421243   .0108643     3.88   0.001     .0197015    .0645471
                2006  |    .040347   .0088924     4.54   0.000      .021994       .0587
                2007  |   .0336162    .009175     3.66   0.001     .0146799    .0525526
                2008  |   .0307651   .0141971     2.17   0.040     .0014637    .0600666
                2009  |    .056663   .0122885     4.61   0.000     .0313008    .0820252
                2010  |   .0617313    .013193     4.68   0.000     .0345023    .0889602
                2011  |   .0358887   .0118829     3.02   0.006     .0113636    .0604137
                2012  |   .0110677   .0118365     0.94   0.359    -.0133615     .035497
                2013  |   .0268257   .0093762     2.86   0.009     .0074741    .0461772
                2014  |   .0087147    .021007     0.41   0.682    -.0346415     .052071
                2015  |   .0244592   .0159683     1.53   0.139    -.0084977    .0574162
                2016  |   .0319708   .0096077     3.33   0.003     .0121416    .0518001
                2017  |   .0210673   .0123786     1.70   0.102    -.0044809    .0466155
                2018  |   .0231677   .0110054     2.11   0.046     .0004537    .0458816
                2019  |   .0272397   .0099738     2.73   0.012     .0066548    .0478246
                      |
                 nind |
                   2  |    .088626    .065784     1.35   0.190    -.0471454    .2243975
                   3  |   .0676151    .048202     1.40   0.173    -.0318689    .1670991
                   4  |  -.2139395   .0641083    -3.34   0.003    -.3462524   -.0816266
                   5  |    .141228    .055209     2.56   0.017     .0272823    .2551738
                   6  |  -.0266466   .0604753    -0.44   0.663    -.1514615    .0981682
                   7  |  -.0822095   .0584115    -1.41   0.172     -.202765     .038346
                   8  |  -.1117987   .0621819    -1.80   0.085    -.2401359    .0165385
                   9  |  -.1449451   .0563071    -2.57   0.017    -.2611572   -.0287329
                  10  |   -.119244   .0786208    -1.52   0.142    -.2815094    .0430213
                  11  |   .0263945   .0593754     0.44   0.661    -.0961504    .1489394
                      |
                 educ |   .1051188   .0064767    16.23   0.000     .0917515    .1184862
                exper |    .050911   .0038957    13.07   0.000     .0428708    .0589513
               exper2 |  -.0017447   .0002862    -6.10   0.000    -.0023353   -.0011541
               exper3 |   .0000302   9.78e-06     3.09   0.005     .0000101    .0000504
               exper4 |  -2.01e-07   1.10e-07    -1.83   0.080    -4.27e-07    2.55e-08
                 edex |  -.0004418   .0001496    -2.95   0.007    -.0007505    -.000133
                      |
                ee_cl |
                   2  |  -.0686848   .0156396    -4.39   0.000    -.1009634   -.0364063
                   3  |   -.129181   .0199388    -6.48   0.000    -.1703326   -.0880294
                   4  |   -.193215   .0359559    -5.37   0.000    -.2674243   -.1190057
                   5  |  -.0774333   .0270269    -2.87   0.009    -.1332141   -.0216525
                   6  |    -.10903   .0187803    -5.81   0.000    -.1477907   -.0702693
                   7  |  -.1552893   .0240249    -6.46   0.000    -.2048742   -.1057044
                   8  |  -.1853536   .0386049    -4.80   0.000    -.2650302   -.1056771
                   9  |   -.061657   .0174121    -3.54   0.002    -.0975939   -.0257201
                  10  |  -.1345876   .0258447    -5.21   0.000    -.1879284   -.0812469
                  11  |  -.1750387   .0267638    -6.54   0.000    -.2302764   -.1198009
                  12  |  -.1691358     .03396    -4.98   0.000    -.2392257   -.0990459
                  13  |  -.0100388   .0239375    -0.42   0.679    -.0594433    .0393657
                  14  |  -.1287414   .0230242    -5.59   0.000    -.1762609   -.0812219
                  15  |  -.1410601   .0283204    -4.98   0.000    -.1995105   -.0826097
                  16  |  -.1446865   .0334794    -4.32   0.000    -.2137846   -.0755884
                      |
                 marr |   .0081583    .004444     1.84   0.079    -.0010136    .0173302
                partt |  -.0746864   .0064663   -11.55   0.000    -.0880323   -.0613406
               public |   .0210118   .0154555     1.36   0.187    -.0108868    .0529103
                 cmsa |   .1243767   .0120128    10.35   0.000     .0995835    .1491699
                      |
                nocc2 |
                   2  |  -.0347728   .0111941    -3.11   0.005    -.0578762   -.0116693
                   3  |  -.0169651   .0165557    -1.02   0.316    -.0511343    .0172042
                   4  |  -.0902457   .0107431    -8.40   0.000    -.1124184    -.068073
                   5  |   .1574365   .0174882     9.00   0.000     .1213427    .1935304
                   6  |  -.2257341   .0116156   -19.43   0.000    -.2497074   -.2017607
                   7  |  -.2352719   .0274195    -8.58   0.000     -.291863   -.1786808
                   8  |   -.093542   .0595151    -1.57   0.129    -.2163751    .0292911
                   9  |  -.2879551   .0170997   -16.84   0.000     -.323247   -.2526631
                  10  |  -.2573961   .0223328   -11.53   0.000    -.3034887   -.2113035
                  11  |   .0184211   .0243853     0.76   0.457    -.0319076    .0687498
                  12  |  -.2356554   .0162599   -14.49   0.000    -.2692141   -.2020967
                      |
              quarter |
                   2  |   .0043548   .0031479     1.38   0.179    -.0021423    .0108518
                   3  |   .0146194   .0030404     4.81   0.000     .0083444    .0208944
                   4  |   .0193685   .0034713     5.58   0.000     .0122041    .0265329
                      |
                _cons |   .2649952   .0718472     3.69   0.001     .1167099    .4132805
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 997,355,881)

Linear regression                               Number of obs     =    111,486
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4382
                                                Root MSE          =     .36913

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0494436   .0100129    -4.94   0.000    -.0701093   -.0287779
             treat_st |  -.0713952    .017597    -4.06   0.000    -.1077136   -.0350768
treat_stblackrelwhite |   .0416072    .027895     1.49   0.149    -.0159653    .0991797
                      |
                state |
                  RI  |   .0071081   .0028423     2.50   0.020     .0012418    .0129744
                  CT  |   .0372859   .0021527    17.32   0.000     .0328431    .0417288
                  NY  |  -.0067224   .0035491    -1.89   0.070    -.0140473    .0006026
                  NJ  |   .0802113   .0018533    43.28   0.000     .0763864    .0840362
                  PA  |  -.0935175   .0036758   -25.44   0.000     -.101104    -.085931
                  OH  |  -.1138066   .0046869   -24.28   0.000    -.1234799   -.1041334
                  IN  |  -.1284912   .0086499   -14.85   0.000    -.1463437   -.1106388
                  IL  |  -.0922868    .004706   -19.61   0.000    -.1019996   -.0825741
                  MI  |   -.040979    .007853    -5.22   0.000    -.0571867   -.0247712
                  WI  |   -.086312   .0057355   -15.05   0.000    -.0981495   -.0744745
                  MN  |  -.0452197   .0034617   -13.06   0.000    -.0523643   -.0380751
                  MO  |  -.1733015   .0044942   -38.56   0.000    -.1825772   -.1640259
                  DE  |   .0124043   .0145803     0.85   0.403     -.017688    .0424966
                  MD  |    .030878   .0062213     4.96   0.000     .0180378    .0437182
                  DC  |   .0575052   .0095117     6.05   0.000     .0378741    .0771363
                  KY  |  -.1667893   .0070049   -23.81   0.000    -.1812467   -.1523318
                  OK  |  -.2288173   .0095667   -23.92   0.000     -.248562   -.2090725
                  CO  |  -.1259316    .001819   -69.23   0.000    -.1296858   -.1221773
                  NM  |  -.1990906   .0060342   -32.99   0.000    -.2115445   -.1866366
                  WA  |  -.0431613   .0042572   -10.14   0.000    -.0519478   -.0343748
                  OR  |  -.1129259   .0041923   -26.94   0.000    -.1215784   -.1042734
                  CA  |   .0622451   .0036131    17.23   0.000      .054788    .0697022
                  AK  |   .0995153   .0087119    11.42   0.000     .0815347    .1174958
                  HI  |  -.0565001   .0057181    -9.88   0.000    -.0683017   -.0446984
                      |
                 year |
                1990  |   .0003889   .0064157     0.06   0.952    -.0128523    .0136302
                1991  |  -.0004096   .0099374    -0.04   0.967    -.0209193    .0201001
                1992  |   .0116335   .0141898     0.82   0.420    -.0176528    .0409199
                1993  |   .0203476   .0120526     1.69   0.104    -.0045277    .0452229
                1996  |   .0257685   .0100124     2.57   0.017      .005104     .046433
                1997  |   .0295217   .0080287     3.68   0.001     .0129514    .0460921
                1998  |   .0443364   .0070452     6.29   0.000     .0297959    .0588769
                1999  |   .0429518   .0072798     5.90   0.000     .0279271    .0579766
                2000  |   .0356344   .0079454     4.48   0.000      .019236    .0520328
                2001  |    .054454   .0087364     6.23   0.000      .036423    .0724849
                2002  |   .0662156   .0082082     8.07   0.000     .0492748    .0831565
                2003  |    .054849   .0074461     7.37   0.000     .0394811    .0702169
                2004  |   .0543206   .0092243     5.89   0.000     .0352826    .0733587
                2005  |   .0423115   .0109465     3.87   0.001     .0197191    .0649039
                2006  |   .0398305   .0089889     4.43   0.000     .0212783    .0583827
                2007  |    .033126   .0091842     3.61   0.001     .0141707    .0520814
                2008  |   .0325105    .015085     2.16   0.041     .0013766    .0636444
                2009  |   .0651783    .018903     3.45   0.002     .0261644    .1041922
                2010  |   .0709335   .0194151     3.65   0.001     .0308627    .1110043
                2011  |   .0436667    .017425     2.51   0.019     .0077034    .0796301
                2012  |   .0174663   .0156164     1.12   0.274    -.0147643     .049697
                2013  |   .0319772   .0136938     2.34   0.028     .0037147    .0602397
                2014  |   .0112008   .0226296     0.49   0.625    -.0355045    .0579061
                2015  |   .0249351   .0163982     1.52   0.141    -.0089092    .0587793
                2016  |   .0316032   .0095042     3.33   0.003     .0119875     .051219
                2017  |   .0198234   .0126729     1.56   0.131    -.0063321    .0459789
                2018  |   .0210851   .0100935     2.09   0.047     .0002531     .041917
                2019  |   .0247193   .0091715     2.70   0.013     .0057903    .0436483
                      |
                 nind |
                   2  |   .0881312   .0659095     1.34   0.194    -.0478994    .2241618
                   3  |   .0671983   .0483246     1.39   0.177    -.0325387    .1669353
                   4  |  -.2142962   .0642102    -3.34   0.003    -.3468196   -.0817727
                   5  |   .1408896   .0553763     2.54   0.018     .0265985    .2551807
                   6  |  -.0270324   .0605914    -0.45   0.659    -.1520869    .0980221
                   7  |  -.0826086   .0585768    -1.41   0.171    -.2035052    .0382881
                   8  |  -.1121347   .0623435    -1.80   0.085    -.2408054     .016536
                   9  |   -.145319   .0564459    -2.57   0.017    -.2618176   -.0288205
                  10  |  -.1195034   .0787663    -1.52   0.142     -.282069    .0430621
                  11  |   .0259742   .0595122     0.44   0.666     -.096853    .1488014
                      |
                 educ |   .1051122   .0064808    16.22   0.000     .0917365    .1184878
                exper |   .0509378    .003902    13.05   0.000     .0428844    .0589912
               exper2 |  -.0017461   .0002861    -6.10   0.000    -.0023366   -.0011556
               exper3 |   .0000303   9.77e-06     3.10   0.005     .0000101    .0000505
               exper4 |  -2.01e-07   1.10e-07    -1.84   0.079    -4.27e-07    2.48e-08
                 edex |  -.0004421   .0001499    -2.95   0.007    -.0007515   -.0001326
                      |
                ee_cl |
                   2  |  -.0686605   .0156181    -4.40   0.000    -.1008947   -.0364264
                   3  |  -.1291338   .0199012    -6.49   0.000    -.1702079   -.0880598
                   4  |  -.1931499   .0359153    -5.38   0.000    -.2672754   -.1190244
                   5  |  -.0775051   .0269853    -2.87   0.008    -.1332002   -.0218101
                   6  |  -.1090103   .0187474    -5.81   0.000     -.147703   -.0703175
                   7  |  -.1552651   .0239651    -6.48   0.000    -.2047266   -.1058036
                   8  |  -.1852957   .0385543    -4.81   0.000    -.2648679   -.1057235
                   9  |  -.0618129   .0173919    -3.55   0.002    -.0977081   -.0259178
                  10  |  -.1346309   .0258134    -5.22   0.000     -.187907   -.0813547
                  11  |  -.1750697   .0267544    -6.54   0.000    -.2302881   -.1198512
                  12  |  -.1690948   .0339129    -4.99   0.000    -.2390876    -.099102
                  13  |    -.01013    .023947    -0.42   0.676    -.0595541    .0392941
                  14  |  -.1287546   .0230016    -5.60   0.000    -.1762277   -.0812816
                  15  |  -.1410881   .0283062    -4.98   0.000    -.1995092    -.082667
                  16  |  -.1446502   .0334449    -4.33   0.000     -.213677   -.0756233
                      |
                 marr |    .008156   .0044433     1.84   0.079    -.0010145    .0173265
                partt |  -.0746289   .0064473   -11.58   0.000    -.0879355   -.0613222
               public |   .0210757   .0154671     1.36   0.186    -.0108468    .0529983
                 cmsa |   .1243515   .0119969    10.37   0.000     .0995911    .1491119
                      |
                nocc2 |
                   2  |  -.0347306   .0112134    -3.10   0.005    -.0578739   -.0115874
                   3  |   -.016879   .0165649    -1.02   0.318    -.0510674    .0173094
                   4  |  -.0902008   .0107275    -8.41   0.000    -.1123412   -.0680605
                   5  |   .1574632   .0174633     9.02   0.000     .1214208    .1935056
                   6  |  -.2256931    .011622   -19.42   0.000    -.2496797   -.2017065
                   7  |  -.2352237   .0273971    -8.59   0.000    -.2917686   -.1786789
                   8  |  -.0934491   .0595116    -1.57   0.129    -.2162751    .0293768
                   9  |  -.2879131   .0170985   -16.84   0.000    -.3232028   -.2526235
                  10  |   -.257394   .0223344   -11.52   0.000    -.3034898   -.2112981
                  11  |   .0185722   .0243437     0.76   0.453    -.0316707    .0688151
                  12  |  -.2356217    .016238   -14.51   0.000    -.2691353   -.2021082
                      |
                unemp |  -.0019773   .0019866    -1.00   0.329    -.0060774    .0021227
                      |
              quarter |
                   2  |    .004389   .0031543     1.39   0.177    -.0021212    .0108992
                   3  |   .0146428   .0030519     4.80   0.000      .008344    .0209416
                   4  |   .0194308   .0035012     5.55   0.000     .0122047    .0266569
                      |
                _cons |   .2740881    .066071     4.15   0.000     .1377242    .4104519
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 997,355,881)

Linear regression                               Number of obs     =    111,486
                                                F(23, 24)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4377
                                                Root MSE          =     .36927

                                          (Std. Err. adjusted for 25 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0505382   .0096879    -5.22   0.000     -.070533   -.0305435
             treat_st |  -.0600323   .0218426    -2.75   0.011    -.1051132   -.0149514
treat_stblackrelwhite |   .0477703     .02904     1.64   0.113    -.0121653    .1077059
                      |
                state |
                  RI  |  -.1348737   .0108589   -12.42   0.000    -.1572854    -.112462
                  CT  |   .3147045   .0116656    26.98   0.000      .290628    .3387811
                  NY  |   .0921341   .0066595    13.84   0.000     .0783896    .1058786
                  NJ  |   .0288944   .0116048     2.49   0.020     .0049432    .0528455
                  PA  |   .0769026    .013842     5.56   0.000     .0483342     .105471
                  OH  |   .2263789    .014657    15.45   0.000     .1961284    .2566295
                  IN  |   .0590212   .0936091     0.63   0.534    -.1341785    .2522209
                  IL  |   .2731414   .0134248    20.35   0.000     .2454339    .3008489
                  MI  |   .4621923   .0689061     6.71   0.000     .3199771    .6044075
                  WI  |   .0538422   .0528537     1.02   0.319    -.0552425     .162927
                  MN  |   .2640821   .0098206    26.89   0.000     .2438134    .2843508
                  MO  |   .4155923   .0200966    20.68   0.000      .374115    .4570696
                  DE  |   .3627107   .0539199     6.73   0.000     .2514255    .4739959
                  MD  |  -.0887144   .0093126    -9.53   0.000    -.1079346   -.0694941
                  DC  |  -.1416693   .0224201    -6.32   0.000     -.187942   -.0953966
                  KY  |   .2449782   .0484451     5.06   0.000     .1449925    .3449639
                  OK  |   .3908013    .111782     3.50   0.002     .1600947     .621508
                  CO  |   .3859463     .01918    20.12   0.000     .3463607     .425532
                  NM  |   .1647017   .0229527     7.18   0.000     .1173297    .2120736
                  WA  |    .289667   .0069264    41.82   0.000     .2753715    .3039625
                  OR  |    .015906   .0133119     1.19   0.244    -.0115685    .0433805
                  CA  |   .2924859   .0099864    29.29   0.000     .2718749    .3130969
                  AK  |   .5736078   .0188618    30.41   0.000      .534679    .6125365
                  HI  |   .1307934   .0405807     3.22   0.004     .0470389    .2145479
                      |
        state#c.lyear |
                  MA  |   .0029347   .0001719    17.08   0.000       .00258    .0032894
                  RI  |   .0042968   .0001816    23.66   0.000      .003922    .0046715
                  CT  |   .0002748   .0002642     1.04   0.309    -.0002705    .0008201
                  NY  |   .0019977   .0001405    14.22   0.000     .0017078    .0022876
                  NJ  |   .0034412   .0002618    13.14   0.000     .0029008    .0039816
                  PA  |   .0013143   .0002377     5.53   0.000     .0008237    .0018049
                  OH  |  -.0003387    .000231    -1.47   0.156    -.0008155    .0001381
                  IN  |   .0011581   .0009605     1.21   0.240    -.0008243    .0031405
                  IL  |  -.0005961   .0002557    -2.33   0.028    -.0011238   -.0000684
                  MI  |  -.0019778   .0007006    -2.82   0.009    -.0034237   -.0005318
                  WI  |   .0016312   .0005514     2.96   0.007     .0004932    .0027692
                  MN  |  -.0000146   .0002065    -0.07   0.944    -.0004407    .0004115
                  MO  |  -.0027472   .0003122    -8.80   0.000    -.0033915   -.0021029
                  DE  |  -.0005076   .0005664    -0.90   0.379    -.0016765    .0006614
                  MD  |   .0041154   .0001963    20.97   0.000     .0037103    .0045205
                  DC  |   .0048911   .0001997    24.50   0.000      .004479    .0053031
                  KY  |  -.0010357   .0004887    -2.12   0.045    -.0020444    -.000027
                  OK  |  -.0031334   .0011817    -2.65   0.014    -.0055723   -.0006945
                  CO  |  -.0019364   .0001434   -13.50   0.000    -.0022324   -.0016403
                  NM  |     -.0005   .0001471    -3.40   0.002    -.0008036   -.0001964
                  WA  |  -.0002718   .0001549    -1.76   0.092    -.0005915    .0000478
                  OR  |   .0016917   .0001578    10.72   0.000      .001366    .0020175
                  CA  |   .0007027   .0001173     5.99   0.000     .0004606    .0009448
                  AK  |  -.0016786   .0001046   -16.04   0.000    -.0018945   -.0014626
                  HI  |   .0011627   .0004446     2.62   0.015     .0002451    .0020802
                      |
                 nind |
                   2  |    .089547   .0668821     1.34   0.193    -.0484909    .2275849
                   3  |   .0641815   .0484446     1.32   0.198    -.0358031    .1641662
                   4  |  -.2148084   .0651147    -3.30   0.003    -.3491984   -.0804183
                   5  |   .1397045   .0560961     2.49   0.020     .0239277    .2554812
                   6  |  -.0262547   .0608583    -0.43   0.670    -.1518601    .0993508
                   7  |  -.0824369   .0595302    -1.38   0.179    -.2053013    .0404274
                   8  |  -.1116364   .0632814    -1.76   0.090    -.2422428    .0189701
                   9  |  -.1443099   .0572931    -2.52   0.019    -.2625571   -.0260627
                  10  |  -.1191033   .0799781    -1.49   0.149      -.28417    .0459634
                  11  |   .0261667   .0604013     0.43   0.669    -.0984955    .1508289
                      |
                 educ |   .1036209   .0064161    16.15   0.000     .0903788     .116863
                exper |   .0500673   .0038509    13.00   0.000     .0421195    .0580151
               exper2 |  -.0016663   .0002892    -5.76   0.000    -.0022632   -.0010694
               exper3 |   .0000281   9.91e-06     2.84   0.009     7.65e-06    .0000486
               exper4 |  -1.84e-07   1.11e-07    -1.65   0.112    -4.14e-07    4.58e-08
                 edex |  -.0004435   .0001467    -3.02   0.006    -.0007463   -.0001407
                      |
                ee_cl |
                   2  |   -.070761   .0164169    -4.31   0.000    -.1046439   -.0368781
                   3  |  -.1270788   .0198291    -6.41   0.000     -.168004   -.0861537
                   4  |  -.1861409   .0359663    -5.18   0.000    -.2603717     -.11191
                   5  |  -.0827055   .0261733    -3.16   0.004    -.1367245   -.0286865
                   6  |  -.1131278   .0189646    -5.97   0.000    -.1522688   -.0739868
                   7  |  -.1536577   .0239008    -6.43   0.000    -.2029865    -.104329
                   8  |  -.1802879   .0385254    -4.68   0.000    -.2598003   -.1007754
                   9  |   -.067547   .0185612    -3.64   0.001    -.1058554   -.0292385
                  10  |  -.1359887   .0258178    -5.27   0.000    -.1892741   -.0827033
                  11  |  -.1719816   .0271406    -6.34   0.000     -.227997   -.1159663
                  12  |  -.1626707   .0344268    -4.73   0.000    -.2337242   -.0916172
                  13  |  -.0144103   .0238928    -0.60   0.552    -.0637227    .0349021
                  14  |  -.1284624   .0233174    -5.51   0.000    -.1765872   -.0803375
                  15  |   -.138325   .0288283    -4.80   0.000    -.1978238   -.0788263
                  16  |  -.1388353   .0339903    -4.08   0.000    -.2089878   -.0686827
                      |
                 marr |   .0077469   .0043749     1.77   0.089    -.0012824    .0167761
                partt |  -.0735224    .006395   -11.50   0.000     -.086721   -.0603238
               public |     .02096   .0154862     1.35   0.189    -.0110018    .0529219
                 cmsa |   .1248115   .0120961    10.32   0.000     .0998464    .1497766
                      |
                nocc2 |
                   2  |  -.0331656    .010977    -3.02   0.006     -.055821   -.0105102
                   3  |   -.015817   .0162719    -0.97   0.341    -.0494005    .0177665
                   4  |  -.0891701     .01051    -8.48   0.000    -.1108617   -.0674786
                   5  |   .1579341   .0168098     9.40   0.000     .1232404    .1926278
                   6  |  -.2252468   .0115689   -19.47   0.000    -.2491237   -.2013698
                   7  |  -.2351818    .026942    -8.73   0.000    -.2907874   -.1795762
                   8  |  -.0964853   .0602035    -1.60   0.122    -.2207392    .0277687
                   9  |  -.2871669   .0166382   -17.26   0.000    -.3215064   -.2528274
                  10  |  -.2569363   .0220914   -11.63   0.000    -.3025306   -.2113419
                  11  |   .0198146   .0238391     0.83   0.414    -.0293868     .069016
                  12  |    -.23478   .0156154   -15.04   0.000    -.2670087   -.2025514
                      |
                unemp |  -.0002191   .0009872    -0.22   0.826    -.0022565    .0018184
                      |
              quarter |
                   2  |   .0044822   .0030562     1.47   0.155    -.0018255      .01079
                   3  |   .0146926   .0029413     5.00   0.000     .0086221     .020763
                   4  |   .0196003   .0035815     5.47   0.000     .0122084    .0269921
                      |
                _cons |   .0087026   .0690252     0.13   0.901    -.1337584    .1511637
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_fem_all_sltt

. 
. ** RUST BELT ONLY BLACK-WHITE + WV, KY - IA
. ** keep if inrange(state, 31, 35) | inlist(state, 23, 41, 43) | inlist(state, 55, 61)
. 
. ** DROP ALWAYS RTW BLACK-WHITE
. ** drop if alwaysr2w == 1
. 
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl ma
> rr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo covstagdid_mal_cf 
.         
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl ma
> rr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo covstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo wagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo wagstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_fem_cf
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_fem_cf 
. 
. label variable blackrelwhite "$ Black $"

. label variable treat_st "$ Treat_{st} $"

. label variable treat_stblackrelwhite "$ Treat_{st} \times Black $"

. 
. ** FIXME ignore rust best stuff, dropping always rtw
. esttab covstagdid_mal_all covstagdid_mal_all_unemp covstagdid_mal_all_sltt covstagdid_fem_all covstagdid_fem_all_unemp covstagdid
> _fem_all_sltt using $tabs/covstagdid-wo-ar2w.tex, se title(Difference in Differences of Union Coverage on Right to Work Laws Trea
> tment in State and Time - W/O Always RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suff
> ix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(*
>  0.1 ** 0.05 *** 0.01) scalars("unemp_level State Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time T
> rends")
(output written to /Users/amedeusdsouza/econ499/tabs/covstagdid-wo-ar2w.tex)

. 
. esttab wagstagdid_mal_all wagstagdid_mal_all_unemp wagstagdid_mal_all_sltt wagstagdid_fem_all wagstagdid_fem_all_unemp wagstagdid
> _fem_all_sltt using $tabs/wagstagdid1-wo-ar2w.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Tre
> atment in State and Time - W/O Always RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suf
> fix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(
> * 0.1 ** 0.05 *** 0.01) 
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid1-wo-ar2w.tex)

. 
. esttab nwagstagdid_mal_all nwagstagdid_mal_all_unemp nwagstagdid_mal_all_sltt nwagstagdid_fem_all nwagstagdid_fem_all_unemp nwags
> tagdid_fem_all_sltt using $tabs/wagstagdid2-wo-ar2w.tex, se title(Difference in Differences of Real Log Wages on Right to Work La
> ws Treatment in State and Time - W/O Always RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}
> {) suffix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starl
> evels(* 0.1 ** 0.05 *** 0.01)
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid2-wo-ar2w.tex)

. 
. esttab uwagstagdid_mal_all uwagstagdid_mal_all_unemp uwagstagdid_mal_all_sltt uwagstagdid_fem_all uwagstagdid_fem_all_unemp uwags
> tagdid_fem_all_sltt using $tabs/wagstagdid3-wo-ar2w.tex, se title(Difference in Differences of Real Log Wages on Right to Work La
> ws Treatment in State and Time - W/O Always RTW States) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}
> {) suffix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starl
> evels(* 0.1 ** 0.05 *** 0.01) scalars("unemp_level State Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear
>  Time Trends")
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid3-wo-ar2w.tex)

. 
. panelcombine, use($tabs/wagstagdid1-wo-ar2w.tex $tabs/wagstagdid2-wo-ar2w.tex $tabs/wagstagdid3-wo-ar2w.tex) paneltitles("All (Bl
> ack and White) People" "People Not Covered by Union - Spillover Effect" "People Covered by Union - Direct Effect") columncount(3)
>  save($tabs/wagstagdid-wo-ar2w.tex)

. 
. *** esttab wagstagdid_mal_all wagstagdid_fem_all nwagstagdid_mal_all nwagstagdid_fem_all uwagstagdid_mal_all uwagstagdid_fem_all 
> using $tabs/wagstagdid.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Tim
> e) nonumbers mtitles("men" "women" "men not covered by union" "women not covered by union" "men covered by union" "women covered 
> by union") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
. 
. ** esttab wagstagdid_mal_cf wagstagdid_fem_cf nwagstagdid_mal_cf nwagstagdid_fem_cf uwagstagdid_mal_cf uwagstagdid_fem_cf using $
> tabs/wagstagdid_cf.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Time) n
> onumbers mtitles("men" "women" "men not covered by union" "women not covered by union" "men covered by union" "women covered by u
> nion") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
. 
. ** panelcombine, use($tabs/wagstagdid_all.tex $tabs/wagstagdid_cf.tex) paneltitles("All States" "W/O Always RTW States") columnco
> unt(3) save($tabs/wagstagdid.tex)
. 
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid-wo-ar2w.log
  log type:  text
 closed on:   2 Apr 2021, 13:38:03
-----------------------------------------------------------------------------------------------------------------------------------
