--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagarnr.log
  log type:  text
 opened on:  15 Mar 2021, 03:05:19

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt pu
> blic marr hisprace hispracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unem
> p.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effectiv
> e; signed Dec2012) Mar1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72
> , 82) //incl Idaho which changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57
> , 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57
> , 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change t
> o treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. drop if stater2w == 2
(314,813 observations deleted)

. 
. ** NOTE TREAT_ST == TREAT_S (not DiD, post treat and post cont comparison) / drop i.state - collinearity
. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.year i.nind educ exper exper2 exper3 exper4 edex 
> i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 8,037,779,990)

Linear regression                               Number of obs     =    942,313
                                                F(43, 44)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2192
                                                Root MSE          =     .33318

                                          (Std. Err. adjusted for 45 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0529992   .0114864     4.61   0.000       .02985    .0761484
             treat_st |  -.1162175   .0107161   -10.85   0.000    -.1378143   -.0946207
treat_stblackrelwhite |   -.065405   .0126119    -5.19   0.000    -.0908227   -.0399873
                      |
                 year |
                1990  |  -.0058812   .0032505    -1.81   0.077    -.0124321    .0006697
                1991  |  -.0120711   .0057686    -2.09   0.042    -.0236969   -.0004452
                1992  |  -.0199959    .007536    -2.65   0.011    -.0351838    -.004808
                1993  |  -.0188797   .0071342    -2.65   0.011    -.0332578   -.0045016
                1996  |  -.0278181   .0041946    -6.63   0.000    -.0362717   -.0193644
                1997  |  -.0274699   .0047523    -5.78   0.000    -.0370475   -.0178922
                1998  |  -.0294797    .004882    -6.04   0.000    -.0393186   -.0196407
                1999  |  -.0292468   .0043865    -6.67   0.000    -.0380872   -.0204064
                2000  |  -.0331412   .0052175    -6.35   0.000    -.0436564    -.022626
                2001  |  -.0366342   .0040467    -9.05   0.000    -.0447899   -.0284786
                2002  |  -.0401034   .0057346    -6.99   0.000    -.0516608    -.028546
                2003  |  -.0479187   .0052132    -9.19   0.000    -.0584252   -.0374121
                2004  |  -.0509472   .0051255    -9.94   0.000     -.061277   -.0406174
                2005  |  -.0564568   .0047774   -11.82   0.000    -.0660849   -.0468287
                2006  |  -.0580437    .005794   -10.02   0.000    -.0697208   -.0463667
                2007  |  -.0583284   .0057623   -10.12   0.000    -.0699415   -.0467153
                2008  |  -.0501529   .0048972   -10.24   0.000    -.0600225   -.0402833
                2009  |  -.0642492   .0133349    -4.82   0.000    -.0911239   -.0373745
                2010  |  -.0692135   .0147325    -4.70   0.000    -.0989048   -.0395222
                2011  |  -.0729606   .0122907    -5.94   0.000    -.0977309   -.0481902
                2012  |  -.0669549   .0110022    -6.09   0.000    -.0891283   -.0447815
                2013  |  -.0668633   .0088464    -7.56   0.000     -.084692   -.0490346
                2014  |   -.063813   .0067332    -9.48   0.000    -.0773828   -.0502432
                2015  |  -.0622481   .0056439   -11.03   0.000    -.0736225   -.0508736
                2016  |  -.0612735   .0053305   -11.49   0.000    -.0720165   -.0505305
                2017  |  -.0556052    .005413   -10.27   0.000    -.0665144    -.044696
                2018  |   -.053897   .0050188   -10.74   0.000    -.0640118   -.0437822
                2019  |  -.0571374   .0067543    -8.46   0.000    -.0707497    -.043525
                      |
                 nind |
                   2  |   .0936517   .0182658     5.13   0.000     .0568395    .1304639
                   3  |    .082306   .0105864     7.77   0.000     .0609705    .1036416
                   4  |   .0121228    .008501     1.43   0.161    -.0050099    .0292555
                   5  |   .1804001   .0093235    19.35   0.000     .1616097    .1991904
                   6  |   .0044257   .0097734     0.45   0.653    -.0152714    .0241227
                   7  |  -.0007511   .0068259    -0.11   0.913    -.0145078    .0130057
                   8  |   .0155569     .01459     1.07   0.292    -.0138472    .0449611
                   9  |   .1169261   .0163902     7.13   0.000     .0838938    .1499584
                  10  |   .0097555   .0152734     0.64   0.526    -.0210261     .040537
                  11  |   .0691306   .0186038     3.72   0.001      .031637    .1066241
                      |
                 educ |   .0065734    .001617     4.07   0.000     .0033145    .0098324
                exper |   .0074681   .0013011     5.74   0.000     .0048459    .0100903
               exper2 |  -.0001097   .0000606    -1.81   0.077    -.0002317    .0000124
               exper3 |   2.97e-06   2.00e-06     1.48   0.145    -1.06e-06    7.00e-06
               exper4 |  -5.38e-08   2.37e-08    -2.27   0.028    -1.02e-07   -6.14e-09
                 edex |   -.000197     .00005    -3.94   0.000    -.0002977   -.0000963
                      |
                ee_cl |
                   2  |  -.0146503   .0052103    -2.81   0.007    -.0251509   -.0041497
                   3  |   -.005483   .0061513    -0.89   0.378    -.0178802    .0069142
                   4  |  -.0183759   .0093819    -1.96   0.057    -.0372838    .0005321
                   5  |  -.0706518   .0092895    -7.61   0.000    -.0893734   -.0519301
                   6  |  -.0008807   .0041103    -0.21   0.831    -.0091644    .0074031
                   7  |   .0177475   .0067836     2.62   0.012      .004076    .0314191
                   8  |  -.0265624   .0111988    -2.37   0.022    -.0491321   -.0039927
                   9  |  -.0640791   .0070251    -9.12   0.000    -.0782372    -.049921
                  10  |   .0132186    .006227     2.12   0.039     .0006689    .0257683
                  11  |   .0171597   .0083372     2.06   0.046     .0003572    .0339622
                  12  |  -.0353656   .0128607    -2.75   0.009    -.0612846   -.0094466
                  13  |  -.0038573   .0079685    -0.48   0.631    -.0199168    .0122022
                  14  |   .0303919   .0066831     4.55   0.000     .0169231    .0438607
                  15  |   .0104711   .0097019     1.08   0.286    -.0090818    .0300241
                  16  |  -.0396797   .0137263    -2.89   0.006    -.0673431   -.0120162
                      |
                 marr |   .0170069   .0016769    10.14   0.000     .0136274    .0203864
                partt |  -.0578509   .0068265    -8.47   0.000    -.0716087   -.0440931
               public |   .2738517   .0281195     9.74   0.000     .2171806    .3305229
                 cmsa |   .0434504   .0060866     7.14   0.000     .0311837     .055717
                      |
                nocc2 |
                   2  |    .050325   .0033168    15.17   0.000     .0436403    .0570096
                   3  |   .0315612   .0051656     6.11   0.000     .0211505    .0419718
                   4  |   .1637465   .0118248    13.85   0.000     .1399152    .1875778
                   5  |   .1525773   .0182882     8.34   0.000     .1157199    .1894347
                   6  |   .1336047   .0068322    19.56   0.000     .1198353     .147374
                   7  |   .0708071   .0053812    13.16   0.000      .059962    .0816522
                   8  |   .0690787   .0076111     9.08   0.000     .0537396    .0844178
                   9  |   .1670078   .0123813    13.49   0.000     .1420549    .1919607
                  10  |   .1878035   .0147495    12.73   0.000     .1580778    .2175292
                  11  |   .2048706   .0161645    12.67   0.000     .1722932    .2374479
                  12  |   .2043858   .0177194    11.53   0.000     .1686746     .240097
                      |
                unemp |   .0031809   .0029703     1.07   0.290    -.0028054    .0091671
                      |
              quarter |
                   2  |  -.0027079   .0016035    -1.69   0.098    -.0059394    .0005237
                   3  |  -.0035658   .0014387    -2.48   0.017    -.0064653   -.0006663
                   4  |  -.0037161   .0010981    -3.38   0.002    -.0059293   -.0015029
                      |
                _cons |  -.1596137   .0410802    -3.89   0.000    -.2424054    -.076822
---------------------------------------------------------------------------------------

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.year i.nind educ exper exper2 exper3 exper4 edex 
> i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 7,891,225,801)

Linear regression                               Number of obs     =    956,180
                                                F(44, 44)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2648
                                                Root MSE          =     .29932

                                          (Std. Err. adjusted for 45 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0748499   .0182464     4.10   0.000     .0380767    .1116231
             treat_st |  -.1038606   .0122311    -8.49   0.000    -.1285107   -.0792105
treat_stblackrelwhite |  -.0716271   .0193481    -3.70   0.001    -.1106207   -.0326335
                      |
                 year |
                1990  |  -.0026977   .0019838    -1.36   0.181    -.0066958    .0013003
                1991  |  -.0094994   .0058187    -1.63   0.110    -.0212262    .0022273
                1992  |  -.0092325   .0083057    -1.11   0.272    -.0259715    .0075065
                1993  |  -.0068838   .0072676    -0.95   0.349    -.0215307    .0077631
                1996  |  -.0046987   .0034151    -1.38   0.176    -.0115814     .002184
                1997  |  -.0078724   .0028595    -2.75   0.009    -.0136354   -.0021095
                1998  |  -.0085761   .0033564    -2.56   0.014    -.0153404   -.0018117
                1999  |   -.009823   .0037526    -2.62   0.012    -.0173858   -.0022601
                2000  |  -.0076891   .0041195    -1.87   0.069    -.0159913    .0006132
                2001  |  -.0091117   .0023895    -3.81   0.000    -.0139274   -.0042961
                2002  |  -.0119692   .0032589    -3.67   0.001     -.018537   -.0054013
                2003  |  -.0199262    .003458    -5.76   0.000    -.0268953    -.012957
                2004  |  -.0227143   .0030954    -7.34   0.000    -.0289527    -.016476
                2005  |  -.0223776   .0031668    -7.07   0.000    -.0287598   -.0159953
                2006  |  -.0235397   .0034927    -6.74   0.000    -.0305787   -.0165007
                2007  |  -.0230237   .0046419    -4.96   0.000    -.0323788   -.0136685
                2008  |  -.0246236   .0038801    -6.35   0.000    -.0324435   -.0168037
                2009  |  -.0340045   .0130859    -2.60   0.013    -.0603773   -.0076317
                2010  |  -.0381712   .0141444    -2.70   0.010    -.0666773   -.0096651
                2011  |  -.0350005    .012337    -2.84   0.007    -.0598642   -.0101369
                2012  |  -.0385652    .010279    -3.75   0.001    -.0592812   -.0178491
                2013  |   -.032668   .0081511    -4.01   0.000    -.0490955   -.0162405
                2014  |  -.0324769   .0045554    -7.13   0.000    -.0416576   -.0232962
                2015  |    -.02709   .0045745    -5.92   0.000    -.0363093   -.0178708
                2016  |  -.0228489    .004199    -5.44   0.000    -.0313114   -.0143864
                2017  |  -.0280159   .0056563    -4.95   0.000    -.0394153   -.0166165
                2018  |  -.0279094   .0058157    -4.80   0.000    -.0396302   -.0161887
                2019  |  -.0270322    .007855    -3.44   0.001     -.042863   -.0112015
                      |
                 nind |
                   2  |    .028466   .0100284     2.84   0.007     .0082551     .048677
                   3  |   .0403591   .0099683     4.05   0.000     .0202693    .0604489
                   4  |   .0365406   .0094609     3.86   0.000     .0174735    .0556078
                   5  |   .1673966   .0093244    17.95   0.000     .1486044    .1861888
                   6  |    .009837   .0082098     1.20   0.237    -.0067088    .0263827
                   7  |   .0004529   .0084376     0.05   0.957    -.0165519    .0174578
                   8  |   .0196452   .0126065     1.56   0.126    -.0057616     .045052
                   9  |   .1345807   .0178547     7.54   0.000     .0985969    .1705646
                  10  |   .0072714   .0105986     0.69   0.496    -.0140887    .0286316
                  11  |  -.0024146   .0159646    -0.15   0.880    -.0345892      .02976
                      |
                 educ |   .0150874   .0031977     4.72   0.000      .008643    .0215319
                exper |   .0085643   .0015285     5.60   0.000     .0054839    .0116447
               exper2 |  -.0002839   .0000729    -3.89   0.000    -.0004309    -.000137
               exper3 |   6.27e-06   2.36e-06     2.66   0.011     1.51e-06     .000011
               exper4 |  -5.78e-08   2.53e-08    -2.29   0.027    -1.09e-07   -6.85e-09
                 edex |  -.0001477   .0000654    -2.26   0.029    -.0002795   -.0000158
                      |
                ee_cl |
                   2  |  -.0345832   .0060625    -5.70   0.000    -.0468014    -.022365
                   3  |    -.06172   .0096139    -6.42   0.000    -.0810957   -.0423444
                   4  |  -.0951251   .0182552    -5.21   0.000     -.131916   -.0583341
                   5  |  -.0379385    .006456    -5.88   0.000    -.0509497   -.0249273
                   6  |  -.0431506   .0070788    -6.10   0.000     -.057417   -.0288841
                   7  |  -.0640162   .0105772    -6.05   0.000    -.0853331   -.0426993
                   8  |  -.0877572   .0176921    -4.96   0.000    -.1234133   -.0521011
                   9  |   -.030893   .0063027    -4.90   0.000    -.0435953   -.0181907
                  10  |  -.0473309   .0083222    -5.69   0.000    -.0641032   -.0305585
                  11  |  -.0648068   .0116631    -5.56   0.000    -.0883123   -.0413012
                  12  |  -.0806216   .0168953    -4.77   0.000    -.1146718   -.0465714
                  13  |  -.0120441   .0078962    -1.53   0.134    -.0279578    .0038696
                  14  |  -.0425044   .0092393    -4.60   0.000     -.061125   -.0238839
                  15  |  -.0598489   .0131876    -4.54   0.000    -.0864267   -.0332711
                  16  |  -.0721467   .0174367    -4.14   0.000     -.107288   -.0370054
                      |
                 marr |  -.0013612   .0010068    -1.35   0.183    -.0033903    .0006679
                partt |  -.0522705   .0055591    -9.40   0.000     -.063474    -.041067
               public |   .2906854   .0317227     9.16   0.000     .2267525    .3546184
                 cmsa |   .0289858   .0050099     5.79   0.000     .0188889    .0390827
                      |
                nocc2 |
                   2  |   .0225365   .0019785    11.39   0.000     .0185491    .0265238
                   3  |   .0299947   .0068003     4.41   0.000     .0162897    .0436997
                   4  |   .1495016   .0077596    19.27   0.000     .1338632    .1651399
                   5  |   .1370607   .0171344     8.00   0.000     .1025287    .1715927
                   6  |   .0636491   .0058919    10.80   0.000     .0517748    .0755233
                   7  |   .0828561   .0087996     9.42   0.000     .0651217    .1005904
                   8  |   .0564318   .0037345    15.11   0.000     .0489054    .0639582
                   9  |   .0974858   .0104348     9.34   0.000     .0764559    .1185158
                  10  |   .1681372     .01553    10.83   0.000     .1368386    .1994358
                  11  |   .2017606   .0164766    12.25   0.000     .1685542     .234967
                  12  |    .163967   .0192179     8.53   0.000     .1252358    .2026982
                      |
                unemp |   .0033107   .0032254     1.03   0.310    -.0031897    .0098112
                      |
              quarter |
                   2  |  -.0010732    .000977    -1.10   0.278    -.0030422    .0008959
                   3  |   .0001113   .0008706     0.13   0.899    -.0016432    .0018658
                   4  |  -.0035563   .0011379    -3.13   0.003    -.0058496    -.001263
                      |
                _cons |  -.2178795    .049479    -4.40   0.000    -.3175978   -.1181611
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.year i.nind educ exper exper2 exper3 exper4 edex i
> .ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 8,047,578,749)

Linear regression                               Number of obs     =    943,639
                                                F(43, 44)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5014
                                                Root MSE          =      .4244

                                          (Std. Err. adjusted for 45 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1379505    .008008   -17.23   0.000    -.1540896   -.1218113
             treat_st |  -.0869546   .0210935    -4.12   0.000    -.1294658   -.0444434
treat_stblackrelwhite |  -.0266224   .0104248    -2.55   0.014    -.0476322   -.0056127
                      |
                 year |
                1990  |  -.0122894    .003565    -3.45   0.001    -.0194741   -.0051046
                1991  |  -.0307209   .0118307    -2.60   0.013    -.0545642   -.0068776
                1992  |  -.0342501   .0180865    -1.89   0.065     -.070701    .0022008
                1993  |  -.0398408   .0138925    -2.87   0.006    -.0678392   -.0118423
                1996  |  -.0432723   .0071354    -6.06   0.000    -.0576527   -.0288918
                1997  |  -.0249477   .0060893    -4.10   0.000    -.0372199   -.0126755
                1998  |  -.0006318   .0064092    -0.10   0.922    -.0135488    .0122852
                1999  |   .0212156    .008087     2.62   0.012     .0049173    .0375139
                2000  |    .029208   .0097328     3.00   0.004     .0095929    .0488231
                2001  |    .043623   .0063573     6.86   0.000     .0308107    .0564352
                2002  |   .0479764   .0089419     5.37   0.000     .0299551    .0659977
                2003  |   .0368685   .0107453     3.43   0.001     .0152127    .0585242
                2004  |   .0305824   .0067923     4.50   0.000     .0168934    .0442714
                2005  |   .0177853   .0059577     2.99   0.005     .0057784    .0297923
                2006  |   .0161447    .007206     2.24   0.030     .0016218    .0306675
                2007  |   .0179443   .0088621     2.02   0.049     .0000839    .0358047
                2008  |   .0149348   .0091337     1.64   0.109    -.0034729    .0333426
                2009  |   .0172361    .033965     0.51   0.614    -.0512159     .085688
                2010  |    .010333   .0360123     0.29   0.776    -.0622451    .0829111
                2011  |  -.0139528   .0309764    -0.45   0.655    -.0763816    .0484759
                2012  |  -.0144623   .0272778    -0.53   0.599    -.0694371    .0405125
                2013  |  -.0158014   .0212267    -0.74   0.461     -.058581    .0269782
                2014  |   -.016388   .0150676    -1.09   0.283    -.0467548    .0139788
                2015  |   .0056092   .0085183     0.66   0.514    -.0115583    .0227767
                2016  |     .02129   .0085672     2.49   0.017     .0040239    .0385561
                2017  |   .0252172   .0104465     2.41   0.020     .0041637    .0462708
                2018  |   .0368686   .0119859     3.08   0.004     .0127126    .0610246
                2019  |   .0559468   .0135149     4.14   0.000     .0287094    .0831842
                      |
                 nind |
                   2  |   .0891529   .0302508     2.95   0.005     .0281865    .1501193
                   3  |   .0981418   .0246778     3.98   0.000     .0484071    .1478765
                   4  |  -.0741591   .0274752    -2.70   0.010    -.1295318   -.0187865
                   5  |   .1498937   .0273831     5.47   0.000     .0947066    .2050808
                   6  |   .1046296    .030754     3.40   0.001     .0426489    .1666103
                   7  |   .0124579    .029875     0.42   0.679    -.0477511     .072667
                   8  |  -.0593086   .0292612    -2.03   0.049    -.1182807   -.0003366
                   9  |  -.0611433   .0327516    -1.87   0.069    -.1271498    .0048631
                  10  |  -.0826025   .0308467    -2.68   0.010      -.14477    -.020435
                  11  |   .1284849   .0308982     4.16   0.000     .0662137    .1907561
                      |
                 educ |   .0687456   .0018997    36.19   0.000     .0649171    .0725741
                exper |    .046781   .0018457    25.35   0.000     .0430613    .0505008
               exper2 |   -.000971   .0001146    -8.47   0.000    -.0012019     -.00074
               exper3 |   4.56e-06   3.38e-06     1.35   0.183    -2.24e-06    .0000114
               exper4 |   4.14e-08   3.52e-08     1.18   0.246    -2.96e-08    1.12e-07
                 edex |  -.0004825   .0000657    -7.35   0.000    -.0006149   -.0003502
                      |
                ee_cl |
                   2  |  -.0587083   .0051998   -11.29   0.000    -.0691877   -.0482289
                   3  |  -.0646328   .0077138    -8.38   0.000     -.080179   -.0490867
                   4  |  -.0220593    .013172    -1.67   0.101    -.0486058    .0044872
                   5  |  -.1303331   .0061106   -21.33   0.000    -.1426483    -.118018
                   6  |  -.0859607   .0066791   -12.87   0.000    -.0994215      -.0725
                   7  |   -.057725   .0088504    -6.52   0.000    -.0755618   -.0398882
                   8  |   .0324673   .0136717     2.37   0.022     .0049138    .0600207
                   9  |  -.1542419    .008671   -17.79   0.000    -.1717173   -.1367666
                  10  |  -.0981506   .0087174   -11.26   0.000    -.1157194   -.0805819
                  11  |  -.0553732   .0108396    -5.11   0.000     -.077219   -.0335273
                  12  |   .0365914     .01376     2.66   0.011     .0088599    .0643228
                  13  |  -.0806123   .0134726    -5.98   0.000    -.1077646     -.05346
                  14  |  -.0763044   .0107372    -7.11   0.000    -.0979439   -.0546649
                  15  |   -.041974   .0120552    -3.48   0.001    -.0662695   -.0176784
                  16  |   .0398698   .0144562     2.76   0.008     .0107353    .0690043
                      |
                 marr |   .1200994   .0030485    39.40   0.000     .1139555    .1262432
                partt |  -.2075958   .0070343   -29.51   0.000    -.2217725   -.1934192
               public |     .01978   .0084554     2.34   0.024     .0027393    .0368207
                 cmsa |   .1713591   .0112342    15.25   0.000     .1487181    .1940001
                      |
                nocc2 |
                   2  |  -.1440673   .0035991   -40.03   0.000    -.1513208   -.1368137
                   3  |  -.0396637   .0064935    -6.11   0.000    -.0527505   -.0265768
                   4  |  -.2972931   .0107476   -27.66   0.000    -.3189534   -.2756328
                   5  |  -.0906358   .0068364   -13.26   0.000    -.1044136   -.0768579
                   6  |   -.377289   .0062478   -60.39   0.000    -.3898806   -.3646974
                   7  |  -.2362818   .0052798   -44.75   0.000    -.2469225    -.225641
                   8  |  -.0990378   .0112382    -8.81   0.000    -.1216868   -.0763888
                   9  |  -.3956687   .0040678   -97.27   0.000    -.4038668   -.3874706
                  10  |  -.3412107   .0040525   -84.20   0.000    -.3493779   -.3330435
                  11  |  -.2329379   .0051898   -44.88   0.000    -.2433974   -.2224785
                  12  |  -.3899679   .0051557   -75.64   0.000    -.4003586   -.3795772
                      |
                unemp |   .0020074   .0077901     0.26   0.798    -.0136926    .0177074
                      |
              quarter |
                   2  |   .0038559   .0021196     1.82   0.076    -.0004159    .0081277
                   3  |   .0055386    .002022     2.74   0.009     .0014637    .0096136
                   4  |   .0139299   .0017033     8.18   0.000     .0104972    .0173627
                      |
                _cons |   .6587331   .0542715    12.14   0.000      .549356    .7681102
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.year i.nind educ exper exper2 exper3 exper4 edex i
> .ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 7,901,244,750)

Linear regression                               Number of obs     =    957,638
                                                F(44, 44)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4911
                                                Root MSE          =     .40012

                                          (Std. Err. adjusted for 45 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0606118   .0118973    -5.09   0.000    -.0845893   -.0366344
             treat_st |  -.0947693   .0213658    -4.44   0.000    -.1378293   -.0517094
treat_stblackrelwhite |  -.0499483   .0128309    -3.89   0.000    -.0758072   -.0240893
                      |
                 year |
                1990  |  -.0048513   .0042303    -1.15   0.258    -.0133768    .0036742
                1991  |  -.0063396   .0130039    -0.49   0.628    -.0325472     .019868
                1992  |   .0112891   .0184343     0.61   0.543    -.0258627     .048441
                1993  |   .0100242   .0148975     0.67   0.505    -.0199997    .0400481
                1996  |  -.0037876   .0052322    -0.72   0.473    -.0143325    .0067573
                1997  |   .0080569    .003572     2.26   0.029      .000858    .0152559
                1998  |   .0370369    .006376     5.81   0.000     .0241868    .0498869
                1999  |   .0539965   .0069923     7.72   0.000     .0399045    .0680886
                2000  |   .0672698   .0081078     8.30   0.000     .0509295      .08361
                2001  |   .0764119   .0059005    12.95   0.000     .0645203    .0883035
                2002  |   .0910533   .0074922    12.15   0.000     .0759538    .1061529
                2003  |     .09694     .00854    11.35   0.000     .0797287    .1141513
                2004  |   .0869831   .0055401    15.70   0.000     .0758178    .0981483
                2005  |   .0778075   .0052217    14.90   0.000     .0672838    .0883311
                2006  |   .0736058   .0055361    13.30   0.000     .0624485    .0847631
                2007  |   .0743698   .0068992    10.78   0.000     .0604654    .0882741
                2008  |    .067789   .0076395     8.87   0.000     .0523926    .0831853
                2009  |   .0804972   .0337162     2.39   0.021     .0125467    .1484478
                2010  |   .0795253   .0369641     2.15   0.037     .0050291    .1540214
                2011  |   .0612057   .0320723     1.91   0.063    -.0034317    .1258432
                2012  |   .0439259   .0263335     1.67   0.102    -.0091457    .0969976
                2013  |   .0456566   .0215586     2.12   0.040      .002208    .0891052
                2014  |      .0408   .0124541     3.28   0.002     .0157005    .0658995
                2015  |    .057062   .0066301     8.61   0.000     .0436999    .0704242
                2016  |   .0688653   .0074907     9.19   0.000     .0537688    .0839619
                2017  |    .076087   .0099428     7.65   0.000     .0560485    .0961254
                2018  |   .0807569   .0121312     6.66   0.000      .056308    .1052059
                2019  |   .0931853   .0132422     7.04   0.000     .0664974    .1198733
                      |
                 nind |
                   2  |   .0581705   .0469492     1.24   0.222    -.0364494    .1527904
                   3  |   .1216991   .0436533     2.79   0.008     .0337217    .2096765
                   4  |  -.0872802   .0447664    -1.95   0.058    -.1775009    .0029406
                   5  |   .1535341   .0431337     3.56   0.001      .066604    .2404643
                   6  |   .0863557   .0450826     1.92   0.062    -.0045024    .1772138
                   7  |   .0357633   .0471846     0.76   0.453    -.0593309    .1308576
                   8  |  -.0297496   .0474275    -0.63   0.534    -.1253335    .0658342
                   9  |     -.0786   .0510049    -1.54   0.130    -.1813936    .0241936
                  10  |  -.0787871    .046164    -1.71   0.095    -.1718246    .0142504
                  11  |   .0725351   .0484069     1.50   0.141    -.0250227    .1700929
                      |
                 educ |   .0923958   .0029464    31.36   0.000     .0864578    .0983338
                exper |   .0498349   .0021717    22.95   0.000     .0454581    .0542118
               exper2 |  -.0016123   .0001132   -14.24   0.000    -.0018405   -.0013842
               exper3 |   .0000253   3.31e-06     7.65   0.000     .0000186     .000032
               exper4 |  -1.36e-07   3.43e-08    -3.97   0.000    -2.05e-07   -6.71e-08
                 edex |  -.0005867   .0000978    -6.00   0.000    -.0007839   -.0003896
                      |
                ee_cl |
                   2  |  -.1243927   .0064871   -19.18   0.000    -.1374667   -.1113187
                   3  |  -.1604295   .0111743   -14.36   0.000    -.1829499   -.1379092
                   4  |  -.1610008   .0168484    -9.56   0.000    -.1949566   -.1270451
                   5  |  -.1556035   .0083796   -18.57   0.000    -.1724915   -.1387155
                   6  |  -.1707822   .0103526   -16.50   0.000    -.1916465   -.1499179
                   7  |  -.1741163    .013445   -12.95   0.000     -.201213   -.1470197
                   8  |  -.1066249   .0178013    -5.99   0.000    -.1425012   -.0707487
                   9  |  -.1584032   .0094711   -16.72   0.000    -.1774909   -.1393154
                  10  |  -.1809913   .0118409   -15.29   0.000    -.2048551   -.1571274
                  11  |  -.1688637   .0145609   -11.60   0.000    -.1982092   -.1395182
                  12  |  -.1131864   .0158816    -7.13   0.000    -.1451936   -.0811792
                  13  |  -.1205031   .0142502    -8.46   0.000    -.1492224   -.0917837
                  14  |   -.164938    .011755   -14.03   0.000    -.1886288   -.1412473
                  15  |  -.1365826   .0150509    -9.07   0.000    -.1669156   -.1062496
                  16  |  -.0958572   .0154328    -6.21   0.000    -.1269598   -.0647545
                      |
                 marr |   .0293537   .0024813    11.83   0.000     .0243529    .0343545
                partt |  -.1379104    .003987   -34.59   0.000    -.1459457    -.129875
               public |   .0617467   .0067373     9.16   0.000     .0481686    .0753248
                 cmsa |   .1841722   .0099372    18.53   0.000      .164145    .2041994
                      |
                nocc2 |
                   2  |  -.1339178    .002931   -45.69   0.000    -.1398247   -.1280108
                   3  |  -.0381694   .0075425    -5.06   0.000    -.0533703   -.0229686
                   4  |  -.2858857   .0070414   -40.60   0.000    -.3000768   -.2716947
                   5  |   .0394792   .0054543     7.24   0.000     .0284868    .0504715
                   6  |  -.3336965   .0046663   -71.51   0.000    -.3431009   -.3242921
                   7  |  -.3581496   .0044011   -81.38   0.000    -.3670195   -.3492798
                   8  |  -.1667884   .0084814   -19.67   0.000    -.1838815   -.1496952
                   9  |   -.415028   .0055537   -74.73   0.000    -.4262207   -.4038352
                  10  |  -.4316222   .0081605   -52.89   0.000    -.4480687   -.4151758
                  11  |  -.1821258   .0074816   -24.34   0.000    -.1972039   -.1670477
                  12  |   -.400546   .0068305   -58.64   0.000     -.414312   -.3867799
                      |
                unemp |    .000632   .0082453     0.08   0.939    -.0159853    .0172492
                      |
              quarter |
                   2  |   .0086582   .0015281     5.67   0.000     .0055786    .0117378
                   3  |   .0173728   .0017937     9.69   0.000     .0137578    .0209878
                   4  |   .0200918   .0012673    15.85   0.000     .0175377    .0226459
                      |
                _cons |   .3357098   .0611242     5.49   0.000     .2125222    .4588975
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.year i.nind educ exper exper2 exper3 exper4 edex i
> .ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cl
> uster state)
(sum of wgt is 6,658,409,553)

Linear regression                               Number of obs     =    778,950
                                                F(43, 44)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5311
                                                Root MSE          =     .42659

                                          (Std. Err. adjusted for 45 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1484674    .009704   -15.30   0.000    -.1680245   -.1289102
             treat_st |  -.0643019   .0214128    -3.00   0.004    -.1074565   -.0211472
treat_stblackrelwhite |   -.009398   .0122425    -0.77   0.447    -.0340712    .0152751
                      |
                 year |
                1990  |  -.0090675   .0037613    -2.41   0.020    -.0166478   -.0014871
                1991  |  -.0240031   .0114886    -2.09   0.042    -.0471568   -.0008494
                1992  |  -.0260649   .0176135    -1.48   0.146    -.0615625    .0094328
                1993  |  -.0326099   .0125367    -2.60   0.013    -.0578759    -.007344
                1996  |  -.0414436   .0071183    -5.82   0.000    -.0557895   -.0270976
                1997  |  -.0230597   .0056349    -4.09   0.000     -.034416   -.0117034
                1998  |   .0026301   .0069477     0.38   0.707    -.0113721    .0166322
                1999  |   .0280462   .0093003     3.02   0.004     .0093027    .0467897
                2000  |   .0388054   .0112026     3.46   0.001      .016228    .0613827
                2001  |   .0562868   .0066697     8.44   0.000     .0428449    .0697286
                2002  |   .0638902   .0077911     8.20   0.000     .0481882    .0795921
                2003  |   .0504891   .0105702     4.78   0.000     .0291863    .0717918
                2004  |   .0445578   .0065035     6.85   0.000     .0314509    .0576647
                2005  |   .0306104   .0063478     4.82   0.000     .0178172    .0434035
                2006  |   .0280664   .0070213     4.00   0.000     .0139158    .0422169
                2007  |   .0288798   .0086928     3.32   0.002     .0113607     .046399
                2008  |   .0290055   .0088054     3.29   0.002     .0112594    .0467517
                2009  |   .0402489    .032951     1.22   0.228    -.0261595    .1066572
                2010  |   .0319946   .0356926     0.90   0.375    -.0399392    .1039283
                2011  |   .0066688   .0302785     0.22   0.827    -.0543536    .0676911
                2012  |   .0055838   .0258943     0.22   0.830    -.0466026    .0577703
                2013  |   .0020147   .0203139     0.10   0.921    -.0389253    .0429547
                2014  |  -.0031337   .0144968    -0.22   0.830    -.0323501    .0260827
                2015  |   .0201492   .0080889     2.49   0.017     .0038471    .0364513
                2016  |   .0374255   .0086011     4.35   0.000     .0200911    .0547599
                2017  |   .0379065   .0107772     3.52   0.001     .0161865    .0596265
                2018  |   .0499092    .013119     3.80   0.000     .0234696    .0763487
                2019  |   .0695613   .0145829     4.77   0.000     .0401713    .0989512
                      |
                 nind |
                   2  |   .0520601   .0272512     1.91   0.063    -.0028612    .1069813
                   3  |   .0952589   .0255442     3.73   0.001      .043778    .1467399
                   4  |  -.0648727   .0282764    -2.29   0.027    -.1218601   -.0078853
                   5  |     .10228    .028281     3.62   0.001     .0452835    .1592766
                   6  |    .104582   .0316341     3.31   0.002     .0408276    .1683363
                   7  |   .0147811   .0306172     0.48   0.632    -.0469237    .0764859
                   8  |   -.051533   .0303583    -1.70   0.097    -.1127162    .0096502
                   9  |  -.0774981   .0311099    -2.49   0.017    -.1401961   -.0148002
                  10  |  -.0815114   .0308361    -2.64   0.011    -.1436575   -.0193653
                  11  |    .099145   .0338422     2.93   0.005     .0309406    .1673494
                      |
                 educ |   .0663261   .0017947    36.96   0.000     .0627092    .0699431
                exper |   .0414435   .0018092    22.91   0.000     .0377972    .0450898
               exper2 |   -.000722   .0001045    -6.91   0.000    -.0009326   -.0005114
               exper3 |  -2.91e-06   3.36e-06    -0.87   0.392    -9.69e-06    3.87e-06
               exper4 |   1.22e-07   3.74e-08     3.25   0.002     4.62e-08    1.97e-07
                 edex |  -.0003764   .0000781    -4.82   0.000    -.0005338   -.0002189
                      |
                ee_cl |
                   2  |  -.0642065   .0044969   -14.28   0.000    -.0732693   -.0551437
                   3  |  -.0745597   .0065124   -11.45   0.000    -.0876845   -.0614349
                   4  |  -.0241864   .0113631    -2.13   0.039    -.0470873   -.0012855
                   5  |  -.1208389   .0057855   -20.89   0.000    -.1324989   -.1091789
                   6  |  -.1002867   .0065073   -15.41   0.000    -.1134014   -.0871721
                   7  |  -.0766786   .0079285    -9.67   0.000    -.0926575   -.0606997
                   8  |   .0410094   .0115706     3.54   0.001     .0176905    .0643283
                   9  |   -.148751   .0085065   -17.49   0.000    -.1658948   -.1316072
                  10  |  -.1159848    .008823   -13.15   0.000    -.1337665   -.0982031
                  11  |  -.0684506   .0098077    -6.98   0.000    -.0882166   -.0486845
                  12  |    .043576   .0121497     3.59   0.001     .0190899     .068062
                  13  |  -.0920663   .0142109    -6.48   0.000    -.1207065   -.0634261
                  14  |  -.0912978   .0111939    -8.16   0.000    -.1138576   -.0687381
                  15  |  -.0482975   .0118456    -4.08   0.000    -.0721708   -.0244242
                  16  |   .0452703   .0133778     3.38   0.002      .018309    .0722315
                      |
                 marr |   .1251761   .0032314    38.74   0.000     .1186638    .1316885
                partt |  -.2060467   .0052327   -39.38   0.000    -.2165925    -.195501
               public |  -.0101287   .0074394    -1.36   0.180    -.0251219    .0048645
                 cmsa |   .1640965   .0104624    15.68   0.000     .1430108    .1851821
                      |
                nocc2 |
                   2  |  -.1526876   .0040551   -37.65   0.000      -.16086   -.1445152
                   3  |  -.0397926   .0067581    -5.89   0.000    -.0534128   -.0261725
                   4  |  -.3373695   .0085047   -39.67   0.000    -.3545095   -.3202295
                   5  |  -.1106374   .0084185   -13.14   0.000    -.1276038   -.0936709
                   6  |  -.4011561   .0068216   -58.81   0.000    -.4149041    -.387408
                   7  |  -.2544735   .0067424   -37.74   0.000    -.2680619   -.2408851
                   8  |  -.1091977   .0104902   -10.41   0.000    -.1303394    -.088056
                   9  |  -.4433998   .0061404   -72.21   0.000    -.4557751   -.4310246
                  10  |  -.3869703    .006599   -58.64   0.000    -.4002697   -.3736708
                  11  |  -.2840797   .0063881   -44.47   0.000    -.2969541   -.2712053
                  12  |  -.4504813   .0095356   -47.24   0.000     -.469699   -.4312635
                      |
                unemp |  -.0004411   .0078809    -0.06   0.956    -.0163241    .0154418
                      |
              quarter |
                   2  |   .0043321   .0020651     2.10   0.042     .0001701     .008494
                   3  |   .0054452   .0020814     2.62   0.012     .0012503      .00964
                   4  |   .0153704   .0019494     7.88   0.000     .0114417    .0192991
                      |
                _cons |   .7292444    .047949    15.21   0.000     .6326095    .8258792
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.year i.nind educ exper exper2 exper3 exper4 edex i
> .ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cl
> uster state)
(sum of wgt is 6,770,561,965)

Linear regression                               Number of obs     =    819,519
                                                F(44, 44)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4945
                                                Root MSE          =     .40042

                                          (Std. Err. adjusted for 45 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0770889   .0135589    -5.69   0.000    -.1044152   -.0497627
             treat_st |  -.0772669   .0211757    -3.65   0.001    -.1199437   -.0345901
treat_stblackrelwhite |  -.0369487   .0145662    -2.54   0.015    -.0663048   -.0075925
                      |
                 year |
                1990  |  -.0055633   .0034266    -1.62   0.112    -.0124691    .0013425
                1991  |  -.0028383   .0120417    -0.24   0.815    -.0271067    .0214301
                1992  |   .0163427   .0165445     0.99   0.329    -.0170007     .049686
                1993  |   .0125163   .0126111     0.99   0.326    -.0128998    .0379323
                1996  |  -.0078367   .0041472    -1.89   0.065    -.0161947    .0005214
                1997  |   .0061317   .0037092     1.65   0.105    -.0013438    .0136072
                1998  |   .0370602   .0067744     5.47   0.000     .0234074    .0507131
                1999  |   .0562566   .0075956     7.41   0.000     .0409487    .0715646
                2000  |   .0712452    .008833     8.07   0.000     .0534436    .0890469
                2001  |   .0814569   .0067276    12.11   0.000     .0678982    .0950155
                2002  |   .0981052   .0073413    13.36   0.000     .0833097    .1129006
                2003  |   .1078244   .0078806    13.68   0.000     .0919422    .1237067
                2004  |   .0968353   .0057339    16.89   0.000     .0852794    .1083912
                2005  |   .0870401   .0060969    14.28   0.000     .0747525    .0993276
                2006  |   .0812878   .0061384    13.24   0.000     .0689167    .0936589
                2007  |   .0837849   .0072995    11.48   0.000     .0690737    .0984961
                2008  |   .0783392   .0076713    10.21   0.000     .0628786    .0937998
                2009  |   .0959938   .0312563     3.07   0.004     .0330008    .1589868
                2010  |   .0946564   .0338317     2.80   0.008      .026473    .1628397
                2011  |   .0753687   .0300517     2.51   0.016     .0148036    .1359339
                2012  |   .0598478   .0236264     2.53   0.015     .0122318    .1074637
                2013  |   .0585149   .0198209     2.95   0.005     .0185684    .0984614
                2014  |   .0533789   .0115476     4.62   0.000     .0301062    .0766515
                2015  |    .067211    .006529    10.29   0.000     .0540528    .0803693
                2016  |    .079131    .008082     9.79   0.000     .0628429    .0954191
                2017  |   .0893136   .0103232     8.65   0.000     .0685085    .1101188
                2018  |   .0948267   .0134867     7.03   0.000     .0676461    .1220074
                2019  |   .1074543    .014025     7.66   0.000     .0791887    .1357198
                      |
                 nind |
                   2  |   .0508427   .0461623     1.10   0.277    -.0421913    .1438767
                   3  |   .1176562   .0437642     2.69   0.010     .0294551    .2058572
                   4  |  -.0878888   .0441037    -1.99   0.053    -.1767739    .0009963
                   5  |   .1088205   .0435141     2.50   0.016     .0211236    .1965173
                   6  |   .0858133   .0450782     1.90   0.064    -.0050358    .1766623
                   7  |    .038885   .0472261     0.82   0.415    -.0562929    .1340629
                   8  |  -.0264113   .0470784    -0.56   0.578    -.1212915    .0684689
                   9  |  -.0933593   .0490244    -1.90   0.063    -.1921615    .0054429
                  10  |  -.0764328   .0454873    -1.68   0.100    -.1681063    .0152408
                  11  |   .0916598   .0511203     1.79   0.080    -.0113665    .1946861
                      |
                 educ |   .0881798   .0020249    43.55   0.000     .0840989    .0922607
                exper |   .0489721   .0022178    22.08   0.000     .0445024    .0534417
               exper2 |  -.0015446   .0001089   -14.18   0.000    -.0017641   -.0013251
               exper3 |   .0000238   3.35e-06     7.10   0.000      .000017    .0000305
               exper4 |  -1.22e-07   3.53e-08    -3.44   0.001    -1.93e-07   -5.03e-08
                 edex |  -.0006437   .0001046    -6.15   0.000    -.0008545   -.0004329
                      |
                ee_cl |
                   2  |  -.1206646   .0048426   -24.92   0.000    -.1304242    -.110905
                   3  |   -.149603   .0084669   -17.67   0.000     -.166667    -.132539
                   4  |   -.139269    .012026   -11.58   0.000    -.1635057   -.1150322
                   5  |  -.1544946   .0079969   -19.32   0.000    -.1706112    -.138378
                   6  |  -.1672683   .0084417   -19.81   0.000    -.1842815   -.1502551
                   7  |  -.1625358   .0099234   -16.38   0.000    -.1825351   -.1425366
                   8  |   -.072548   .0122445    -5.92   0.000    -.0972251   -.0478709
                   9  |  -.1643402   .0101069   -16.26   0.000    -.1847093   -.1439711
                  10  |  -.1777932   .0096713   -18.38   0.000    -.1972844    -.158302
                  11  |  -.1545292   .0104796   -14.75   0.000    -.1756495   -.1334089
                  12  |  -.0883308   .0103697    -8.52   0.000    -.1092295   -.0674321
                  13  |  -.1377981   .0150542    -9.15   0.000    -.1681378   -.1074583
                  14  |   -.162227   .0098751   -16.43   0.000     -.182129   -.1423249
                  15  |  -.1234015   .0111323   -11.08   0.000    -.1458372   -.1009658
                  16  |  -.0783636   .0114257    -6.86   0.000    -.1013905   -.0553366
                      |
                 marr |   .0341799   .0026633    12.83   0.000     .0288123    .0395474
                partt |  -.1374489   .0034535   -39.80   0.000    -.1444091   -.1304888
               public |    .012691   .0061579     2.06   0.045     .0002805    .0251014
                 cmsa |   .1815188   .0092842    19.55   0.000     .1628077    .2002299
                      |
                nocc2 |
                   2  |  -.1410555   .0030119   -46.83   0.000    -.1471256   -.1349854
                   3  |   -.037626   .0075716    -4.97   0.000    -.0528854   -.0223665
                   4  |  -.3307954   .0047234   -70.03   0.000    -.3403147   -.3212761
                   5  |   .0166455   .0060363     2.76   0.008     .0044801     .028811
                   6  |  -.3472399   .0050363   -68.95   0.000      -.35739   -.3370898
                   7  |  -.3752172   .0049085   -76.44   0.000    -.3851097   -.3653246
                   8  |  -.1777617   .0082901   -21.44   0.000    -.1944693   -.1610541
                   9  |  -.4369512   .0061568   -70.97   0.000    -.4493594    -.424543
                  10  |  -.4675955   .0087302   -53.56   0.000    -.4851901   -.4500008
                  11  |  -.2480986   .0068391   -36.28   0.000    -.2618819   -.2343153
                  12  |  -.4426888   .0098792   -44.81   0.000    -.4625989   -.4227787
                      |
                unemp |  -.0011754   .0078504    -0.15   0.882    -.0169969     .014646
                      |
              quarter |
                   2  |   .0091071   .0016773     5.43   0.000     .0057266    .0124875
                   3  |   .0176602   .0020004     8.83   0.000     .0136286    .0216917
                   4  |   .0211509   .0012605    16.78   0.000     .0186105    .0236912
                      |
                _cons |   .4022113   .0552394     7.28   0.000     .2908836    .5135391
---------------------------------------------------------------------------------------

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.year i.nind educ exper exper2 exper3 exper4 edex i
> .ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cl
> uster state)
(sum of wgt is 1,379,370,437)

Linear regression                               Number of obs     =    163,363
                                                F(43, 44)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3249
                                                Root MSE          =     .37027

                                          (Std. Err. adjusted for 45 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1412926    .012499   -11.30   0.000    -.1664826   -.1161025
             treat_st |  -.0728476   .0193116    -3.77   0.000    -.1117677   -.0339276
treat_stblackrelwhite |  -.0137691    .015486    -0.89   0.379     -.044979    .0174408
                      |
                 year |
                1990  |  -.0217111   .0052327    -4.15   0.000    -.0322568   -.0111654
                1991  |  -.0523808   .0154532    -3.39   0.001    -.0835247   -.0212369
                1992  |   -.061032   .0203784    -2.99   0.004    -.1021021    -.019962
                1993  |  -.0594904   .0192354    -3.09   0.003    -.0982568    -.020724
                1996  |  -.0260542   .0108408    -2.40   0.021    -.0479024    -.004206
                1997  |  -.0093861   .0097381    -0.96   0.340     -.029012    .0102398
                1998  |   .0126031   .0085377     1.48   0.147    -.0046035    .0298097
                1999  |   .0225539   .0083486     2.70   0.010     .0057284    .0393794
                2000  |   .0184032   .0077534     2.37   0.022     .0027772    .0340292
                2001  |   .0190208   .0066938     2.84   0.007     .0055303    .0325113
                2002  |   .0119733   .0130036     0.92   0.362    -.0142338    .0381804
                2003  |   .0225937   .0129577     1.74   0.088    -.0035208    .0487082
                2004  |   .0176222   .0112668     1.56   0.125    -.0050846     .040329
                2005  |   .0211424   .0089951     2.35   0.023     .0030141    .0392708
                2006  |   .0261589   .0117454     2.23   0.031     .0024876    .0498302
                2007  |   .0328621   .0126946     2.59   0.013     .0072777    .0584464
                2008  |   .0031796   .0112451     0.28   0.779    -.0194834    .0258426
                2009  |  -.0266631   .0422348    -0.63   0.531    -.1117818    .0584555
                2010  |  -.0234919    .042871    -0.55   0.586    -.1098927     .062909
                2011  |   -.037456   .0390497    -0.96   0.343    -.1161555    .0412435
                2012  |  -.0412278    .036727    -1.12   0.268    -.1152462    .0327905
                2013  |  -.0309528   .0274158    -1.13   0.265    -.0862057    .0243001
                2014  |  -.0085076   .0189016    -0.45   0.655    -.0466013    .0295861
                2015  |   .0100214   .0118836     0.84   0.404    -.0139284    .0339713
                2016  |   .0121016   .0101006     1.20   0.237    -.0082549    .0324581
                2017  |   .0313992   .0104544     3.00   0.004     .0103297    .0524687
                2018  |   .0368521   .0097498     3.78   0.000     .0172025    .0565016
                2019  |   .0539836   .0120418     4.48   0.000     .0297149    .0782522
                      |
                 nind |
                   2  |   .0862307   .0222224     3.88   0.000     .0414444    .1310171
                   3  |  -.0543645   .0203977    -2.67   0.011    -.0954732   -.0132557
                   4  |  -.2003969   .0247686    -8.09   0.000    -.2503147    -.150479
                   5  |   .0890467   .0192194     4.63   0.000     .0503127    .1277808
                   6  |  -.0577295   .0187249    -3.08   0.004    -.0954671   -.0199919
                   7  |  -.0707566   .0203822    -3.47   0.001    -.1118342   -.0296789
                   8  |  -.1726611   .0207511    -8.32   0.000    -.2144822     -.13084
                   9  |  -.1310952   .0247156    -5.30   0.000    -.1809062   -.0812843
                  10  |  -.1175963    .041189    -2.86   0.007    -.2006072   -.0345854
                  11  |   .1033068   .0211469     4.89   0.000     .0606881    .1459255
                      |
                 educ |   .0699837   .0044364    15.77   0.000     .0610426    .0789247
                exper |   .0728293   .0026585    27.39   0.000     .0674714    .0781872
               exper2 |  -.0026263   .0001755   -14.96   0.000      -.00298   -.0022725
               exper3 |   .0000511   5.03e-06    10.16   0.000      .000041    .0000612
               exper4 |  -3.99e-07   4.85e-08    -8.21   0.000    -4.96e-07   -3.01e-07
                 edex |  -.0007375   .0001171    -6.30   0.000    -.0009735   -.0005014
                      |
                ee_cl |
                   2  |   .0734705   .0184912     3.97   0.000     .0362039    .1107371
                   3  |   .0698587   .0215124     3.25   0.002     .0265032    .1132141
                   4  |   .0291648   .0301045     0.97   0.338     -.031507    .0898365
                   5  |   .0126543   .0205602     0.62   0.541    -.0287821    .0540906
                   6  |   .0468762   .0185695     2.52   0.015     .0094519    .0843005
                   7  |   .0592961   .0250547     2.37   0.022     .0088016    .1097905
                   8  |   .0267809   .0279246     0.96   0.343    -.0294974    .0830593
                   9  |  -.0031539   .0237783    -0.13   0.895     -.051076    .0447682
                  10  |   .0292764   .0210008     1.39   0.170    -.0130479    .0716007
                  11  |   .0495149   .0247833     2.00   0.052    -.0004325    .0994622
                  12  |   .0741141   .0278679     2.66   0.011       .01795    .1302782
                  13  |   .0428165   .0232702     1.84   0.073    -.0040815    .0897144
                  14  |   .0278245   .0226048     1.23   0.225    -.0177325    .0733814
                  15  |   .0510376   .0246461     2.07   0.044     .0013667    .1007085
                  16  |   .0957948   .0255763     3.75   0.001     .0442491    .1473405
                      |
                 marr |   .0626896   .0032277    19.42   0.000     .0561847    .0691945
                partt |  -.0893869   .0204756    -4.37   0.000    -.1306527    -.048121
               public |  -.0473968   .0088576    -5.35   0.000    -.0652481   -.0295456
                 cmsa |   .1379662   .0120406    11.46   0.000        .1137    .1622323
                      |
                nocc2 |
                   2  |  -.0450276   .0119241    -3.78   0.000    -.0690591   -.0209962
                   3  |  -.0197592   .0132961    -1.49   0.144    -.0465558    .0070373
                   4  |  -.0785256   .0147866    -5.31   0.000     -.108326   -.0487251
                   5  |   .0011749    .020698     0.06   0.955    -.0405391    .0428889
                   6  |  -.2537527   .0109413   -23.19   0.000    -.2758034    -.231702
                   7  |  -.1970364   .0120999   -16.28   0.000    -.2214222   -.1726505
                   8  |  -.1089065   .0302302    -3.60   0.001    -.1698314   -.0479816
                   9  |  -.2256656   .0122594   -18.41   0.000    -.2503728   -.2009583
                  10  |  -.1535285   .0090159   -17.03   0.000    -.1716988   -.1353582
                  11  |   -.076546   .0091598    -8.36   0.000    -.0950064   -.0580856
                  12  |  -.1976175   .0098961   -19.97   0.000    -.2175618   -.1776733
                      |
                unemp |   .0125165   .0079267     1.58   0.121    -.0034587    .0284917
                      |
              quarter |
                   2  |   .0018175   .0034039     0.53   0.596    -.0050426    .0086777
                   3  |   .0084313   .0031432     2.68   0.010     .0020966     .014766
                   4  |   .0098727   .0026376     3.74   0.001     .0045571    .0151884
                      |
                _cons |   .5224924   .0775427     6.74   0.000     .3662153    .6787696
---------------------------------------------------------------------------------------

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.year i.nind educ exper exper2 exper3 exper4 edex i
> .ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cl
> uster state)
(sum of wgt is 1,120,663,836)

Linear regression                               Number of obs     =    136,661
                                                F(43, 44)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4084
                                                Root MSE          =     .37407

                                          (Std. Err. adjusted for 45 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0529043   .0132658    -3.99   0.000    -.0796398   -.0261688
             treat_st |   -.110772   .0216121    -5.13   0.000    -.1543284   -.0672156
treat_stblackrelwhite |  -.0136235   .0175615    -0.78   0.442    -.0490164    .0217694
                      |
                 year |
                1990  |   -.000733   .0087621    -0.08   0.934    -.0183919    .0169259
                1991  |  -.0202674   .0164685    -1.23   0.225    -.0534575    .0129228
                1992  |  -.0140159   .0267005    -0.52   0.602    -.0678272    .0397953
                1993  |  -.0032921   .0254876    -0.13   0.898    -.0546589    .0480747
                1996  |   .0196443   .0132871     1.48   0.146    -.0071341    .0464228
                1997  |   .0221631   .0079079     2.80   0.008     .0062259    .0381004
                1998  |   .0427902   .0073108     5.85   0.000     .0280562    .0575241
                1999  |   .0496034   .0081643     6.08   0.000     .0331492    .0660575
                2000  |   .0482767   .0081832     5.90   0.000     .0317846    .0647688
                2001  |     .05306   .0083563     6.35   0.000     .0362189     .069901
                2002  |   .0581097   .0095599     6.08   0.000      .038843    .0773763
                2003  |   .0464082   .0129981     3.57   0.001     .0202122    .0726041
                2004  |   .0447988   .0086013     5.21   0.000     .0274639    .0621336
                2005  |   .0408771    .010399     3.93   0.000     .0199192     .061835
                2006  |   .0474783   .0082556     5.75   0.000     .0308402    .0641164
                2007  |   .0395922   .0074756     5.30   0.000     .0245262    .0546583
                2008  |    .026005   .0139104     1.87   0.068    -.0020295    .0540395
                2009  |   .0196803   .0460276     0.43   0.671    -.0730823    .1124429
                2010  |   .0257226   .0517487     0.50   0.622    -.0785701    .1300153
                2011  |    .009628   .0427669     0.23   0.823     -.076563     .095819
                2012  |  -.0143688   .0401284    -0.36   0.722    -.0952423    .0665047
                2013  |   .0004787   .0298601     0.02   0.987    -.0597004    .0606577
                2014  |  -.0008159   .0252963    -0.03   0.974    -.0517973    .0501655
                2015  |   .0226944   .0143377     1.58   0.121    -.0062012    .0515901
                2016  |    .033642   .0086393     3.89   0.000     .0162306    .0510534
                2017  |   .0239807   .0140464     1.71   0.095     -.004328    .0522893
                2018  |   .0219838   .0116022     1.89   0.065     -.001399    .0453666
                2019  |   .0329703   .0146146     2.26   0.029     .0035165    .0624241
                      |
                 nind |
                   2  |   .0629475   .0490735     1.28   0.206    -.0359536    .1618486
                   3  |   .0301283   .0399927     0.75   0.455    -.0504716    .1107282
                   4  |  -.2085155     .04899    -4.26   0.000    -.3072483   -.1097827
                   5  |   .1477235   .0412156     3.58   0.001     .0646589    .2307881
                   6  |  -.0284194     .04604    -0.62   0.540     -.121207    .0643681
                   7  |  -.0859561   .0441983    -1.94   0.058     -.175032    .0031198
                   8  |   -.116721   .0470838    -2.48   0.017    -.2116122   -.0218298
                   9  |  -.1748695   .0448865    -3.90   0.000    -.2653322   -.0844067
                  10  |    -.10968   .0596058    -1.84   0.073    -.2298076    .0104475
                  11  |   .0209653   .0445807     0.47   0.640    -.0688812    .1108118
                      |
                 educ |   .1044641   .0078045    13.39   0.000     .0887352     .120193
                exper |   .0521674   .0039668    13.15   0.000     .0441728    .0601621
               exper2 |  -.0018057   .0003075    -5.87   0.000    -.0024254   -.0011861
               exper3 |   .0000323   .0000106     3.06   0.004      .000011    .0000536
               exper4 |  -2.20e-07   1.18e-07    -1.87   0.069    -4.58e-07    1.77e-08
                 edex |  -.0005178   .0001466    -3.53   0.001    -.0008133   -.0002223
                      |
                ee_cl |
                   2  |    -.04162   .0179565    -2.32   0.025     -.077809   -.0054311
                   3  |  -.1077921   .0235089    -4.59   0.000    -.1551711   -.0604132
                   4  |  -.1460861   .0454492    -3.21   0.002     -.237683   -.0544892
                   5  |  -.0650865   .0234617    -2.77   0.008    -.1123705   -.0178025
                   6  |  -.0776423   .0213607    -3.63   0.001     -.120692   -.0345926
                   7  |  -.1153212   .0310782    -3.71   0.001    -.1779552   -.0526873
                   8  |  -.1455138   .0485274    -3.00   0.004    -.2433144   -.0477131
                   9  |  -.0399485   .0173019    -2.31   0.026    -.0748182   -.0050787
                  10  |  -.0964395   .0276881    -3.48   0.001    -.1522412   -.0406377
                  11  |  -.1308562   .0330307    -3.96   0.000    -.1974252   -.0642871
                  12  |  -.1209349   .0449779    -2.69   0.010    -.2115819   -.0302879
                  13  |    .007402    .022484     0.33   0.744    -.0379115    .0527155
                  14  |  -.0933245   .0256227    -3.64   0.001    -.1449637   -.0416854
                  15  |  -.0956629   .0332848    -2.87   0.006     -.162744   -.0285819
                  16  |   -.084266   .0450211    -1.87   0.068    -.1749999     .006468
                      |
                 marr |   .0025317   .0030179     0.84   0.406    -.0035505     .008614
                partt |  -.0555869   .0082106    -6.77   0.000    -.0721343   -.0390395
               public |   .0252174   .0125602     2.01   0.051     -.000096    .0505308
                 cmsa |   .1626805   .0142322    11.43   0.000     .1339975    .1913636
                      |
                nocc2 |
                   2  |  -.0429963    .011191    -3.84   0.000    -.0655503   -.0204424
                   3  |  -.0135181   .0149287    -0.91   0.370    -.0436049    .0165686
                   4  |   -.117182   .0106299   -11.02   0.000    -.1386052   -.0957588
                   5  |    .133189   .0162022     8.22   0.000     .1005357    .1658423
                   6  |  -.2456565   .0097523   -25.19   0.000    -.2653109   -.2260021
                   7  |  -.2557603   .0242167   -10.56   0.000    -.3045658   -.2069548
                   8  |  -.1179493   .0502791    -2.35   0.024    -.2192801   -.0166185
                   9  |  -.3044555   .0160763   -18.94   0.000    -.3368551   -.2720558
                  10  |  -.2858796   .0180782   -15.81   0.000    -.3223138   -.2494454
                  11  |  -.0141601   .0179691    -0.79   0.435    -.0503745    .0220543
                  12  |  -.2655406   .0130544   -20.34   0.000    -.2918501   -.2392312
                      |
                unemp |   .0082808    .009513     0.87   0.389    -.0108914     .027453
                      |
              quarter |
                   2  |   .0063948    .002975     2.15   0.037     .0003991    .0123905
                   3  |    .014663   .0027689     5.30   0.000     .0090827    .0202433
                   4  |   .0176982   .0034326     5.16   0.000     .0107801    .0246162
                      |
                _cons |     .17318   .0756097     2.29   0.027     .0207986    .3255613
---------------------------------------------------------------------------------------

. 
. 
. cap log close
