--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 opened on:  22 Mar 2021, 12:47:11

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt pu
> blic marr hisprace hispracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unem
> p.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effectiv
> e; signed Dec2012) Mar1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72
> , 82) //incl Idaho which changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57
> , 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57
> , 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change t
> o treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. gen lyear = year - 1900

. 
. eststo clear

. 
. ** BLACK-WHITE
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 expe
> r4 edex i.ee_cl marr partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 9,209,848,884)

Linear regression                               Number of obs     =  1,068,180
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2229
                                                Root MSE          =     .33515

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0594263   .0076568     7.76   0.000     .0440472    .0748054
             treat_st |  -.0294146   .0104581    -2.81   0.007    -.0504204   -.0084089
treat_stblackrelwhite |  -.0608902   .0080942    -7.52   0.000    -.0771479   -.0446324
                      |
                state |
                  NH  |  -.0434948   .0034018   -12.79   0.000    -.0503275    -.036662
                  VT  |  -.0454188   .0010936   -41.53   0.000    -.0476154   -.0432222
                  MA  |  -.0019101   .0050473    -0.38   0.707    -.0120479    .0082276
                  RI  |   .0055775   .0045238     1.23   0.223    -.0035087    .0146637
                  CT  |   .0000627   .0048254     0.01   0.990    -.0096294    .0097548
                  NY  |   .0880911   .0041143    21.41   0.000     .0798272     .096355
                  NJ  |   .0353286   .0051744     6.83   0.000     .0249355    .0457218
                  PA  |   .0151128   .0036848     4.10   0.000     .0077116     .022514
                  OH  |   .0047031   .0036745     1.28   0.206    -.0026773    .0120835
                  IN  |  -.0113427   .0039236    -2.89   0.006    -.0192234    -.003462
                  IL  |   .0332705   .0042974     7.74   0.000      .024639     .041902
                  MI  |   .0479802   .0044967    10.67   0.000     .0389483    .0570122
                  WI  |  -.0038968   .0033343    -1.17   0.248     -.010594    .0028004
                  MN  |    .015387   .0041571     3.70   0.001     .0070372    .0237368
                  IA  |    .005655   .0106426     0.53   0.598    -.0157213    .0270312
                  MO  |  -.0171139   .0036908    -4.64   0.000    -.0245272   -.0097006
                  ND  |  -.0540526   .0106034    -5.10   0.000    -.0753501   -.0327551
                  SD  |  -.0762158   .0105647    -7.21   0.000    -.0974355    -.054996
                  NE  |  -.0304146   .0109383    -2.78   0.008    -.0523847   -.0084444
                  KS  |  -.0366339   .0109512    -3.35   0.002    -.0586301   -.0146377
                  DE  |  -.0575939   .0017961   -32.07   0.000    -.0612016   -.0539863
                  MD  |   -.055584   .0055059   -10.10   0.000    -.0666429   -.0445252
                  DC  |  -.0607104   .0067327    -9.02   0.000    -.0742334   -.0471875
                  VA  |  -.0865138   .0111244    -7.78   0.000    -.1088578   -.0641698
                  WV  |  -.0199696   .0021339    -9.36   0.000    -.0242557   -.0156834
                  NC  |  -.1173868   .0109949   -10.68   0.000    -.1394707   -.0953028
                  SC  |  -.1276423   .0109654   -11.64   0.000    -.1496669   -.1056177
                  GA  |  -.0816564   .0113222    -7.21   0.000    -.1043977    -.058915
                  FL  |  -.0643268    .011497    -5.60   0.000    -.0874193   -.0412344
                  KY  |  -.0502678   .0026872   -18.71   0.000    -.0556652   -.0448704
                  TN  |  -.0656325   .0110663    -5.93   0.000    -.0878598   -.0434052
                  AL  |  -.0427849   .0109401    -3.91   0.000    -.0647589    -.020811
                  MS  |  -.0983201   .0106827    -9.20   0.000    -.1197769   -.0768633
                  AR  |  -.0949927   .0108448    -8.76   0.000    -.1167752   -.0732102
                  LA  |  -.0759104   .0111918    -6.78   0.000    -.0983899    -.053431
                  OK  |  -.0874684   .0067157   -13.02   0.000    -.1009573   -.0739795
                  TX  |  -.0739361   .0115221    -6.42   0.000    -.0970789   -.0507934
                  MT  |   -.004107   .0022554    -1.82   0.075    -.0086371    .0004232
                  ID  |  -.0629906   .0107614    -5.85   0.000    -.0846055   -.0413757
                  WY  |  -.0576818    .011074    -5.21   0.000    -.0799246    -.035439
                  CO  |  -.0636036   .0052923   -12.02   0.000    -.0742335   -.0529737
                  NM  |  -.1095559   .0037428   -29.27   0.000    -.1170735   -.1020383
                  AZ  |  -.0708883   .0115281    -6.15   0.000    -.0940432   -.0477333
                  UT  |  -.0692552   .0116766    -5.93   0.000    -.0927083    -.045802
                  NV  |    .036177   .0114345     3.16   0.003     .0132102    .0591438
                  WA  |   .0436184   .0041598    10.49   0.000     .0352632    .0519736
                  OR  |   .0067798    .003781     1.79   0.079    -.0008145    .0143741
                  CA  |   .0218606    .004914     4.45   0.000     .0119906    .0317306
                  AK  |   .0317446   .0044338     7.16   0.000      .022839    .0406502
                  HI  |   .0192631   .0038739     4.97   0.000     .0114821    .0270441
                      |
                 year |
                1990  |  -.0061764   .0024666    -2.50   0.016    -.0111306   -.0012222
                1991  |  -.0089241    .003039    -2.94   0.005     -.015028   -.0028201
                1992  |  -.0143942   .0026355    -5.46   0.000    -.0196878   -.0091005
                1993  |  -.0157744   .0036263    -4.35   0.000     -.023058   -.0084907
                1996  |  -.0276333   .0037085    -7.45   0.000     -.035082   -.0201846
                1997  |  -.0288506   .0042197    -6.84   0.000    -.0373262    -.020375
                1998  |  -.0333512   .0041499    -8.04   0.000    -.0416865   -.0250159
                1999  |  -.0335243   .0036723    -9.13   0.000    -.0409004   -.0261483
                2000  |   -.038112   .0042712    -8.92   0.000     -.046691   -.0295329
                2001  |  -.0411464   .0046571    -8.84   0.000    -.0505005   -.0317923
                2002  |  -.0419674   .0054996    -7.63   0.000    -.0530137   -.0309212
                2003  |  -.0489036   .0046892   -10.43   0.000    -.0583222    -.039485
                2004  |  -.0526307   .0051106   -10.30   0.000    -.0628956   -.0423659
                2005  |  -.0603309   .0054181   -11.14   0.000    -.0712134   -.0494484
                2006  |   -.062614   .0060707   -10.31   0.000    -.0748074   -.0504205
                2007  |  -.0614081   .0057163   -10.74   0.000    -.0728896   -.0499266
                2008  |  -.0533947   .0059051    -9.04   0.000    -.0652555    -.041534
                2009  |  -.0555823     .00547   -10.16   0.000    -.0665692   -.0445954
                2010  |  -.0590518   .0068814    -8.58   0.000    -.0728734   -.0452301
                2011  |  -.0634413   .0055287   -11.47   0.000    -.0745461   -.0523365
                2012  |  -.0608987   .0063372    -9.61   0.000    -.0736275     -.04817
                2013  |  -.0612113   .0054198   -11.29   0.000    -.0720973   -.0503253
                2014  |  -.0621006   .0054977   -11.30   0.000    -.0731431   -.0510581
                2015  |  -.0630227   .0056814   -11.09   0.000     -.074434   -.0516113
                2016  |  -.0629779   .0056453   -11.16   0.000    -.0743168   -.0516391
                2017  |  -.0561826    .005041   -11.15   0.000    -.0663078   -.0460574
                2018  |  -.0578944   .0038237   -15.14   0.000    -.0655746   -.0502143
                2019  |  -.0620556   .0052046   -11.92   0.000    -.0725093   -.0516019
                      |
                 nind |
                   2  |   .0954931   .0162469     5.88   0.000     .0628601    .1281261
                   3  |      .0903   .0109652     8.24   0.000     .0682757    .1123242
                   4  |   .0105467   .0083028     1.27   0.210      -.00613    .0272233
                   5  |   .1769666   .0086598    20.44   0.000     .1595729    .1943604
                   6  |   .0003122   .0079408     0.04   0.969    -.0156374    .0162617
                   7  |  -.0023105   .0069329    -0.33   0.740    -.0162356    .0116146
                   8  |   .0124505   .0124111     1.00   0.321     -.012478    .0373789
                   9  |   .1178404   .0142395     8.28   0.000     .0892395    .1464412
                  10  |   .0033774   .0136381     0.25   0.805    -.0240155    .0307703
                  11  |   .0780272   .0163091     4.78   0.000     .0452694     .110785
                      |
                 educ |   .0067931   .0013708     4.96   0.000     .0040399    .0095464
                exper |   .0068633    .001151     5.96   0.000     .0045513    .0091752
               exper2 |  -.0000636   .0000622    -1.02   0.312    -.0001885    .0000614
               exper3 |   1.83e-06   2.05e-06     0.89   0.376    -2.28e-06    5.93e-06
               exper4 |  -4.62e-08   2.30e-08    -2.00   0.051    -9.24e-08    1.10e-10
                 edex |   -.000179   .0000416    -4.31   0.000    -.0002625   -.0000956
                      |
                ee_cl |
                   2  |  -.0159743   .0047631    -3.35   0.002    -.0255413   -.0064074
                   3  |  -.0070685   .0053155    -1.33   0.190    -.0177449     .003608
                   4  |  -.0182297    .008215    -2.22   0.031      -.03473   -.0017294
                   5  |  -.0699041   .0081459    -8.58   0.000    -.0862655   -.0535427
                   6  |  -.0028964   .0041668    -0.70   0.490    -.0112655    .0054728
                   7  |   .0160261   .0060347     2.66   0.011      .003905    .0281472
                   8  |  -.0283073   .0101463    -2.79   0.007    -.0486867   -.0079279
                   9  |  -.0612069   .0067849    -9.02   0.000    -.0748348   -.0475789
                  10  |   .0129332   .0059485     2.17   0.034     .0009853     .024881
                  11  |   .0154949   .0075254     2.06   0.045     .0003797    .0306101
                  12  |  -.0400766   .0120744    -3.32   0.002    -.0643287   -.0158244
                  13  |   .0011101   .0075329     0.15   0.883    -.0140201    .0162403
                  14  |   .0272048   .0066193     4.11   0.000     .0139095    .0405001
                  15  |   .0078926   .0082966     0.95   0.346    -.0087717    .0245568
                  16  |  -.0478404   .0130688    -3.66   0.001    -.0740898   -.0215909
                      |
                 marr |    .017291   .0015951    10.84   0.000     .0140872    .0204949
                partt |     -.0586   .0060772    -9.64   0.000    -.0708064   -.0463936
               public |   .2666139   .0253971    10.50   0.000     .2156024    .3176254
                 cmsa |   .0436221   .0049292     8.85   0.000     .0337215    .0535227
                      |
                nocc2 |
                   2  |   .0519168   .0030309    17.13   0.000      .045829    .0580047
                   3  |   .0326811   .0048374     6.76   0.000      .022965    .0423972
                   4  |   .1658057   .0108277    15.31   0.000     .1440577    .1875536
                   5  |   .1500158   .0165279     9.08   0.000     .1168184    .1832132
                   6  |    .136674   .0066844    20.45   0.000      .123248       .1501
                   7  |   .0710005   .0047444    14.97   0.000      .061471    .0805299
                   8  |    .068963   .0070369     9.80   0.000     .0548289     .083097
                   9  |   .1661387    .010743    15.46   0.000     .1445607    .1877167
                  10  |   .1945039   .0136812    14.22   0.000     .1670244    .2219834
                  11  |   .2097645   .0148135    14.16   0.000     .1800108    .2395182
                  12  |   .2078077   .0163344    12.72   0.000      .174999    .2406163
                      |
              quarter |
                   2  |  -.0029448   .0014853    -1.98   0.053    -.0059281    .0000386
                   3  |  -.0033793   .0013168    -2.57   0.013    -.0060243   -.0007344
                   4  |  -.0041269     .00095    -4.34   0.000     -.006035   -.0022187
                      |
                _cons |  -.1642665   .0331117    -4.96   0.000    -.2307733   -.0977597
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 expe
> r4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster s
> tate)
(sum of wgt is 9,209,848,884)

Linear regression                               Number of obs     =  1,068,180
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2229
                                                Root MSE          =     .33515

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0594229   .0076615     7.76   0.000     .0440344    .0748115
             treat_st |  -.0298521   .0103789    -2.88   0.006    -.0506987   -.0090054
treat_stblackrelwhite |  -.0608892   .0080999    -7.52   0.000    -.0771584   -.0446201
                      |
                state |
                  NH  |  -.0454326   .0036274   -12.52   0.000    -.0527184   -.0381468
                  VT  |  -.0472338   .0017424   -27.11   0.000    -.0507334   -.0437342
                  MA  |  -.0018002   .0050631    -0.36   0.724    -.0119698    .0083694
                  RI  |   .0073699   .0048702     1.51   0.137    -.0024121     .017152
                  CT  |    .000261   .0048391     0.05   0.957    -.0094586    .0099806
                  NY  |   .0893631   .0043156    20.71   0.000     .0806949    .0980313
                  NJ  |   .0362678   .0053042     6.84   0.000     .0256141    .0469216
                  PA  |   .0157858   .0037599     4.20   0.000     .0082338    .0233377
                  OH  |   .0057645    .003779     1.53   0.133    -.0018259    .0133549
                  IN  |  -.0111857   .0039153    -2.86   0.006    -.0190499   -.0033215
                  IL  |   .0349641    .004583     7.63   0.000     .0257588    .0441695
                  MI  |    .050565   .0050696     9.97   0.000     .0403824    .0607477
                  WI  |  -.0045749   .0033403    -1.37   0.177    -.0112842    .0021343
                  MN  |   .0139909   .0042554     3.29   0.002     .0054437    .0225382
                  IA  |   .0039658   .0103619     0.38   0.704    -.0168466    .0247783
                  MO  |  -.0167688   .0037247    -4.50   0.000    -.0242501   -.0092876
                  ND  |  -.0566927   .0102595    -5.53   0.000    -.0772996   -.0360858
                  SD  |  -.0787293   .0102833    -7.66   0.000    -.0993839   -.0580746
                  NE  |  -.0333488    .010608    -3.14   0.003    -.0546557   -.0120419
                  KS  |  -.0373944   .0107191    -3.49   0.001    -.0589243   -.0158645
                  DE  |  -.0586975   .0022063   -26.60   0.000     -.063129    -.054266
                  MD  |   -.056124   .0055181   -10.17   0.000    -.0672074   -.0450406
                  DC  |  -.0577531   .0071176    -8.11   0.000    -.0720491   -.0434571
                  VA  |  -.0875897    .010868    -8.06   0.000    -.1094187   -.0657607
                  WV  |  -.0172258   .0034403    -5.01   0.000    -.0241358   -.0103158
                  NC  |  -.1164899   .0110229   -10.57   0.000    -.1386301   -.0943497
                  SC  |  -.1258313   .0111923   -11.24   0.000    -.1483117   -.1033509
                  GA  |  -.0804738    .011438    -7.04   0.000    -.1034478   -.0574998
                  FL  |  -.0630696   .0116708    -5.40   0.000     -.086511   -.0396282
                  KY  |  -.0488399   .0030738   -15.89   0.000    -.0550138    -.042666
                  TN  |  -.0645276   .0111436    -5.79   0.000    -.0869102    -.042145
                  AL  |  -.0410199   .0111609    -3.68   0.001    -.0634373   -.0186025
                  MS  |   -.095337   .0112621    -8.47   0.000    -.1179576   -.0727165
                  AR  |  -.0937712   .0109479    -8.57   0.000    -.1157607   -.0717816
                  LA  |  -.0738449   .0115559    -6.39   0.000    -.0970556   -.0506342
                  OK  |  -.0880956   .0065719   -13.40   0.000    -.1012957   -.0748955
                  TX  |  -.0728178   .0116387    -6.26   0.000    -.0961949   -.0494408
                  MT  |  -.0042685   .0022293    -1.91   0.061    -.0087462    .0002091
                  ID  |  -.0625465   .0107151    -5.84   0.000    -.0840684   -.0410246
                  WY  |  -.0586504   .0107944    -5.43   0.000    -.0803315   -.0369693
                  CO  |  -.0642666   .0052603   -12.22   0.000    -.0748323   -.0537009
                  NM  |  -.1082784   .0040687   -26.61   0.000    -.1164507   -.1001061
                  AZ  |  -.0694656   .0117363    -5.92   0.000    -.0930386   -.0458926
                  UT  |  -.0703478   .0114132    -6.16   0.000    -.0932719   -.0474238
                  NV  |   .0379796   .0117983     3.22   0.002     .0142822    .0616771
                  WA  |   .0450577   .0044552    10.11   0.000     .0361092    .0540063
                  OR  |   .0087698   .0042953     2.04   0.046     .0001424    .0173972
                  CA  |   .0245221   .0056177     4.37   0.000     .0132386    .0358056
                  AK  |   .0351783   .0055902     6.29   0.000       .02395    .0464067
                  HI  |   .0174053   .0039951     4.36   0.000     .0093809    .0254297
                      |
                 year |
                1990  |  -.0056616   .0025425    -2.23   0.030    -.0107683   -.0005549
                1991  |  -.0064379   .0033662    -1.91   0.062     -.013199    .0003232
                1992  |  -.0109138   .0039192    -2.78   0.008    -.0187859   -.0030418
                1993  |  -.0132779   .0040524    -3.28   0.002    -.0214173   -.0051384
                1996  |  -.0276049   .0036618    -7.54   0.000    -.0349599     -.02025
                1997  |  -.0295515   .0041518    -7.12   0.000    -.0378907   -.0212122
                1998  |  -.0347536   .0043268    -8.03   0.000    -.0434443    -.026063
                1999  |  -.0353654   .0039564    -8.94   0.000     -.043312   -.0274188
                2000  |  -.0402534   .0044335    -9.08   0.000    -.0491583   -.0313484
                2001  |  -.0420663   .0047819    -8.80   0.000     -.051671   -.0324617
                2002  |  -.0411444   .0055676    -7.39   0.000    -.0523273   -.0299615
                2003  |  -.0477271    .004608   -10.36   0.000    -.0569826   -.0384717
                2004  |   -.052171   .0050496   -10.33   0.000    -.0623135   -.0420285
                2005  |  -.0605288   .0053758   -11.26   0.000    -.0713265   -.0497312
                2006  |  -.0635164   .0061079   -10.40   0.000    -.0757845   -.0512483
                2007  |  -.0624098   .0059583   -10.47   0.000    -.0743773   -.0504423
                2008  |  -.0525572   .0058098    -9.05   0.000    -.0642265   -.0408878
                2009  |  -.0491558   .0074129    -6.63   0.000    -.0640452   -.0342665
                2010  |  -.0520581   .0081542    -6.38   0.000    -.0684363   -.0356798
                2011  |  -.0575977   .0069326    -8.31   0.000    -.0715222   -.0436732
                2012  |  -.0564713   .0072643    -7.77   0.000    -.0710621   -.0418806
                2013  |  -.0578099   .0057125   -10.12   0.000    -.0692838    -.046336
                2014  |  -.0606522   .0055902   -10.85   0.000    -.0718804    -.049424
                2015  |  -.0630125    .005706   -11.04   0.000    -.0744733   -.0515516
                2016  |  -.0635916   .0057711   -11.02   0.000    -.0751832   -.0520001
                2017  |  -.0576073   .0051557   -11.17   0.000    -.0679629   -.0472517
                2018  |  -.0600322   .0045165   -13.29   0.000    -.0691038   -.0509606
                2019  |  -.0645432   .0058105   -11.11   0.000    -.0762139   -.0528724
                      |
                 nind |
                   2  |   .0954928   .0162431     5.88   0.000     .0628675    .1281181
                   3  |   .0903008   .0109655     8.23   0.000     .0682758    .1123257
                   4  |   .0105699   .0082991     1.27   0.209    -.0060993     .027239
                   5  |   .1769949   .0086545    20.45   0.000      .159612    .1943779
                   6  |   .0003398    .007937     0.04   0.966    -.0156022    .0162817
                   7  |  -.0022921   .0069298    -0.33   0.742     -.016211    .0116268
                   8  |   .0124753   .0124084     1.01   0.320    -.0124476    .0373983
                   9  |   .1178599   .0142386     8.28   0.000     .0892607     .146459
                  10  |   .0034085   .0136266     0.25   0.804    -.0239614    .0307784
                  11  |   .0780396   .0163052     4.79   0.000     .0452897    .1107895
                      |
                 educ |   .0067959   .0013749     4.94   0.000     .0040343    .0095575
                exper |   .0068769   .0011527     5.97   0.000     .0045618    .0091921
               exper2 |  -.0000643   .0000621    -1.04   0.305    -.0001891    .0000604
               exper3 |   1.85e-06   2.04e-06     0.90   0.370    -2.26e-06    5.96e-06
               exper4 |  -4.64e-08   2.31e-08    -2.01   0.050    -9.27e-08   -1.01e-10
                 edex |  -.0001793   .0000417    -4.30   0.000     -.000263   -.0000955
                      |
                ee_cl |
                   2  |  -.0159349   .0047585    -3.35   0.002    -.0254926   -.0063772
                   3  |  -.0070328   .0053127    -1.32   0.192    -.0177036    .0036379
                   4  |  -.0181993   .0082202    -2.21   0.031    -.0347101   -.0016885
                   5  |  -.0699172   .0081458    -8.58   0.000    -.0862785    -.053556
                   6  |  -.0028823   .0041654    -0.69   0.492    -.0112489    .0054842
                   7  |   .0160627   .0060338     2.66   0.010     .0039435    .0281818
                   8  |  -.0282558   .0101508    -2.78   0.008    -.0486443   -.0078673
                   9  |  -.0611983   .0067813    -9.02   0.000    -.0748189   -.0475776
                  10  |   .0129323   .0059467     2.17   0.034      .000988    .0248765
                  11  |    .015534   .0075257     2.06   0.044     .0004182    .0306498
                  12  |  -.0400215   .0120704    -3.32   0.002    -.0642656   -.0157774
                  13  |    .001083   .0075234     0.14   0.886    -.0140282    .0161941
                  14  |   .0272099   .0066171     4.11   0.000     .0139191    .0405006
                  15  |   .0079158   .0082957     0.95   0.345    -.0087467    .0245782
                  16  |  -.0477974   .0130641    -3.66   0.001    -.0740374   -.0215574
                      |
                 marr |   .0172968   .0015947    10.85   0.000     .0140939    .0204998
                partt |  -.0585391   .0060758    -9.63   0.000    -.0707427   -.0463355
               public |    .266622   .0254009    10.50   0.000     .2156027    .3176413
                 cmsa |     .04359   .0049351     8.83   0.000     .0336776    .0535024
                      |
                nocc2 |
                   2  |   .0519197    .003031    17.13   0.000     .0458317    .0580077
                   3  |   .0326845   .0048349     6.76   0.000     .0229732    .0423957
                   4  |   .1658014   .0108281    15.31   0.000     .1440525    .1875503
                   5  |   .1500053   .0165264     9.08   0.000     .1168111    .1831995
                   6  |   .1366857   .0066846    20.45   0.000     .1232593    .1501121
                   7  |   .0710118   .0047411    14.98   0.000      .061489    .0805345
                   8  |   .0689268   .0070354     9.80   0.000     .0547959    .0830577
                   9  |   .1661565   .0107413    15.47   0.000      .144582     .187731
                  10  |   .1945017   .0136777    14.22   0.000     .1670292    .2219743
                  11  |   .2097604   .0148111    14.16   0.000     .1800114    .2395094
                  12  |   .2078091   .0163324    12.72   0.000     .1750044    .2406137
                      |
                unemp |  -.0016323   .0014287    -1.14   0.259    -.0045019    .0012373
                      |
              quarter |
                   2  |  -.0029486   .0014886    -1.98   0.053    -.0059386    .0000414
                   3  |  -.0033814   .0013184    -2.56   0.013    -.0060295   -.0007334
                   4  |  -.0041272   .0009508    -4.34   0.000    -.0060368   -.0022175
                      |
                _cons |  -.1565765   .0331059    -4.73   0.000    -.2230718   -.0900813
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 ex
> per3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(
> cluster state)
(sum of wgt is 9,209,848,884)

Linear regression                               Number of obs     =  1,068,180
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2236
                                                Root MSE          =       .335

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0597193   .0076405     7.82   0.000     .0443729    .0750658
             treat_st |   .0223594   .0086903     2.57   0.013     .0049044    .0398145
treat_stblackrelwhite |  -.0611817   .0080409    -7.61   0.000    -.0773324   -.0450311
                      |
                state |
                  NH  |   -.175289   .0053995   -32.46   0.000    -.1861343   -.1644437
                  VT  |   -.250133   .0059607   -41.96   0.000    -.2621054   -.2381606
                  MA  |  -.0727797   .0078242    -9.30   0.000    -.0884952   -.0570642
                  RI  |  -.0521102   .0094069    -5.54   0.000    -.0710045    -.033216
                  CT  |  -.0831331   .0090678    -9.17   0.000    -.1013463   -.0649198
                  NY  |   .0576811   .0099455     5.80   0.000      .037705    .0776572
                  NJ  |   .0558218   .0094231     5.92   0.000     .0368949    .0747487
                  PA  |   .1066993    .007464    14.30   0.000     .0917074    .1216911
                  OH  |   .2185482   .0095074    22.99   0.000     .1994519    .2376444
                  IN  |   .3899703   .0282399    13.81   0.000     .3332488    .4466919
                  IL  |   .1172272   .0072267    16.22   0.000     .1027119    .1317425
                  MI  |   .3725923   .0255461    14.59   0.000     .3212814    .4239031
                  WI  |   .2867954   .0220554    13.00   0.000     .2424959     .331095
                  MN  |   .0469934   .0078917     5.95   0.000     .0311425    .0628443
                  IA  |   .0608273    .009298     6.54   0.000     .0421517    .0795029
                  MO  |  -.0066032   .0067142    -0.98   0.330    -.0200892    .0068827
                  ND  |  -.1790441   .0135151   -13.25   0.000      -.20619   -.1518983
                  SD  |  -.0664088   .0140749    -4.72   0.000     -.094679   -.0381386
                  NE  |  -.0460352   .0096095    -4.79   0.000    -.0653364    -.026734
                  KS  |  -.0079058   .0101736    -0.78   0.441      -.02834    .0125284
                  DE  |   .0379304   .0120619     3.14   0.003     .0137034    .0621573
                  MD  |   -.138096    .011213   -12.32   0.000    -.1606179   -.1155741
                  DC  |  -.1960797   .0212897    -9.21   0.000    -.2388413    -.153318
                  VA  |   -.224474   .0103583   -21.67   0.000    -.2452792   -.2036688
                  WV  |   .1351143   .0139258     9.70   0.000     .1071435    .1630851
                  NC  |  -.3465477   .0108325   -31.99   0.000    -.3683055   -.3247899
                  SC  |  -.4130919   .0115952   -35.63   0.000    -.4363816   -.3898023
                  GA  |  -.2542445   .0094979   -26.77   0.000    -.2733216   -.2351674
                  FL  |  -.2460062   .0118201   -20.81   0.000    -.2697475   -.2222649
                  KY  |  -.1395869   .0154295    -9.05   0.000     -.170578   -.1085959
                  TN  |  -.0717122   .0103513    -6.93   0.000    -.0925033    -.050921
                  AL  |   .0509349   .0098547     5.17   0.000     .0311411    .0707287
                  MS  |  -.1096833   .0121925    -9.00   0.000    -.1341727    -.085194
                  AR  |   -.098951   .0091275   -10.84   0.000    -.1172841   -.0806178
                  LA  |  -.2099296   .0099181   -21.17   0.000    -.2298507   -.1900085
                  OK  |  -.0625941   .0391439    -1.60   0.116    -.1412169    .0160288
                  TX  |  -.2917846   .0116367   -25.07   0.000    -.3151576   -.2684116
                  MT  |   .0031989   .0083728     0.38   0.704    -.0136184    .0200162
                  ID  |  -.0369764   .0093256    -3.97   0.000    -.0557073   -.0182454
                  WY  |  -.0834066   .0095587    -8.73   0.000    -.1026058   -.0642073
                  CO  |  -.3254977   .0078753   -41.33   0.000    -.3413157   -.3096797
                  NM  |  -.3526476   .0101443   -34.76   0.000     -.373023   -.3322722
                  AZ  |  -.3531456   .0106426   -33.18   0.000     -.374522   -.3317692
                  UT  |  -.1354972   .0120356   -11.26   0.000    -.1596713    -.111323
                  NV  |  -.0757022   .0148816    -5.09   0.000    -.1055927   -.0458117
                  WA  |    .129541   .0065223    19.86   0.000     .1164405    .1426415
                  OR  |   .0084581   .0045021     1.88   0.066    -.0005846    .0175008
                  CA  |  -.0837687   .0094108    -8.90   0.000    -.1026708   -.0648667
                  AK  |  -.1387515   .0105937   -13.10   0.000    -.1600296   -.1174735
                  HI  |   .1696704   .0097753    17.36   0.000     .1500361    .1893046
                      |
        state#c.lyear |
                  ME  |  -.0022791   .0000839   -27.16   0.000    -.0024476   -.0021105
                  NH  |  -.0010381   .0001298    -8.00   0.000    -.0012989   -.0007774
                  VT  |  -.0003056   .0000517    -5.91   0.000    -.0004095   -.0002017
                  MA  |  -.0015836   .0000746   -21.23   0.000    -.0017334   -.0014338
                  RI  |  -.0017147   .0000698   -24.58   0.000    -.0018548   -.0015745
                  CT  |  -.0014693   .0000852   -17.25   0.000    -.0016403   -.0012982
                  NY  |  -.0019755   .0000946   -20.89   0.000    -.0021655   -.0017856
                  NJ  |  -.0024725   .0000783   -31.56   0.000    -.0026299   -.0023152
                  PA  |  -.0031637   .0000802   -39.44   0.000    -.0033248   -.0030025
                  OH  |  -.0043443   .0000582   -74.60   0.000    -.0044613   -.0042274
                  IN  |  -.0062864   .0002896   -21.71   0.000     -.006868   -.0057048
                  IL  |   -.003091    .000087   -35.52   0.000    -.0032657   -.0029162
                  MI  |   -.005539   .0002532   -21.88   0.000    -.0060475   -.0050305
                  WI  |  -.0051729   .0002223   -23.27   0.000    -.0056195   -.0047264
                  MN  |  -.0025847    .000079   -32.71   0.000    -.0027434    -.002426
                  IA  |  -.0033226   .0000832   -39.95   0.000    -.0034896   -.0031556
                  MO  |  -.0023772   .0000597   -39.84   0.000     -.002497   -.0022573
                  ND  |  -.0015803   .0001097   -14.41   0.000    -.0018006     -.00136
                  SD  |  -.0028952   .0000651   -44.49   0.000    -.0030259   -.0027645
                  NE  |  -.0026335     .00007   -37.61   0.000    -.0027742   -.0024929
                  KS  |  -.0030648    .000068   -45.08   0.000    -.0032013   -.0029282
                  DE  |  -.0032626   .0001478   -22.07   0.000    -.0035595   -.0029656
                  MD  |  -.0014926   .0001065   -14.02   0.000    -.0017064   -.0012788
                  DC  |  -.0009653   .0002176    -4.44   0.000    -.0014024   -.0005282
                  VA  |  -.0014411   .0001103   -13.06   0.000    -.0016627   -.0012194
                  WV  |  -.0038218   .0001264   -30.23   0.000    -.0040757   -.0035678
                  NC  |  -.0005576   .0001237    -4.51   0.000    -.0008061   -.0003091
                  SC  |  -.0000217    .000081    -0.27   0.790    -.0001845     .000141
                  GA  |  -.0011098   .0001002   -11.08   0.000     -.001311   -.0009086
                  FL  |  -.0010301   .0000617   -16.70   0.000    -.0011541   -.0009062
                  KY  |  -.0014637   .0001545    -9.47   0.000     -.001774   -.0011534
                  TN  |  -.0027179   .0000936   -29.04   0.000    -.0029059   -.0025299
                  AL  |  -.0036858    .000067   -55.01   0.000    -.0038204   -.0035513
                  MS  |  -.0026657    .000068   -39.22   0.000    -.0028022   -.0025292
                  AR  |   -.002745   .0001021   -26.90   0.000      -.00295     -.00254
                  LA  |  -.0014729   .0000727   -20.27   0.000    -.0016189    -.001327
                  OK  |  -.0028047   .0004113    -6.82   0.000    -.0036307   -.0019787
                  TX  |  -.0006735   .0000765    -8.80   0.000    -.0008271   -.0005198
                  MT  |  -.0023564   .0000778   -30.28   0.000    -.0025127   -.0022001
                  ID  |  -.0030314    .000118   -25.69   0.000    -.0032684   -.0027945
                  WY  |   -.002544   .0000529   -48.12   0.000    -.0026502   -.0024379
                  CO  |   .0002286   .0000619     3.69   0.001     .0001042     .000353
                  NM  |   .0000348   .0001201     0.29   0.773    -.0002065     .000276
                  AZ  |  -.0000612   .0000909    -0.67   0.504    -.0002439    .0001214
                  UT  |  -.0021411   .0001096   -19.54   0.000    -.0023612   -.0019209
                  NV  |   -.001699   .0000695   -24.46   0.000    -.0018386   -.0015595
                  WA  |  -.0030961    .000097   -31.93   0.000    -.0032909   -.0029013
                  OR  |  -.0022941   .0000971   -23.62   0.000    -.0024892   -.0020991
                  CA  |  -.0012419   .0000643   -19.33   0.000    -.0013709   -.0011128
                  AK  |  -.0005907   .0000228   -25.92   0.000    -.0006365    -.000545
                  HI  |  -.0037597   .0000522   -72.04   0.000    -.0038645   -.0036549
                      |
                 nind |
                   2  |   .0942821   .0162702     5.79   0.000     .0616025    .1269617
                   3  |   .0893148   .0109032     8.19   0.000     .0674151    .1112144
                   4  |    .009305    .008299     1.12   0.268     -.007364     .025974
                   5  |   .1758047   .0086187    20.40   0.000     .1584935    .1931158
                   6  |  -.0007933   .0079332    -0.10   0.921    -.0167276    .0151411
                   7  |   -.003775   .0068736    -0.55   0.585     -.017581    .0100311
                   8  |   .0114956   .0123851     0.93   0.358    -.0133805    .0363718
                   9  |   .1167273    .014189     8.23   0.000     .0882277    .1452268
                  10  |    .003099   .0135444     0.23   0.820    -.0241058    .0303037
                  11  |   .0772642   .0162765     4.75   0.000      .044572    .1099565
                      |
                 educ |    .007394   .0013373     5.53   0.000     .0047078    .0100801
                exper |   .0072827   .0011537     6.31   0.000     .0049655    .0095999
               exper2 |  -.0000893   .0000616    -1.45   0.153     -.000213    .0000344
               exper3 |   2.63e-06   2.03e-06     1.29   0.201    -1.45e-06    6.72e-06
               exper4 |  -5.37e-08   2.30e-08    -2.34   0.023    -9.98e-08   -7.56e-09
                 edex |  -.0001928   .0000414    -4.66   0.000    -.0002758   -.0001097
                      |
                ee_cl |
                   2  |   -.016674   .0047714    -3.49   0.001    -.0262576   -.0070904
                   3  |  -.0086186   .0052023    -1.66   0.104    -.0190677    .0018306
                   4  |  -.0210409   .0081459    -2.58   0.013    -.0374024   -.0046795
                   5  |  -.0684618   .0081388    -8.41   0.000     -.084809   -.0521146
                   6  |   -.003449   .0042054    -0.82   0.416    -.0118957    .0049978
                   7  |   .0151905   .0059725     2.54   0.014     .0031944    .0271866
                   8  |  -.0304415    .010007    -3.04   0.004    -.0505412   -.0103419
                   9  |  -.0602571   .0068315    -8.82   0.000    -.0739786   -.0465356
                  10  |   .0117383   .0059396     1.98   0.054    -.0001918    .0236684
                  11  |   .0143474   .0074537     1.92   0.060    -.0006237    .0293186
                  12  |  -.0418353   .0118742    -3.52   0.001    -.0656852   -.0179853
                  13  |   .0005835   .0074635     0.08   0.938    -.0144075    .0155744
                  14  |   .0261831   .0066274     3.95   0.000     .0128716    .0394946
                  15  |   .0063269   .0082175     0.77   0.445    -.0101783    .0228322
                  16  |  -.0497102   .0129191    -3.85   0.000    -.0756591   -.0237613
                      |
                 marr |   .0171459   .0015688    10.93   0.000     .0139949    .0202968
                partt |  -.0584279    .006108    -9.57   0.000    -.0706963   -.0461596
               public |   .2665334   .0254421    10.48   0.000     .2154314    .3176355
                 cmsa |   .0430194   .0053088     8.10   0.000     .0323564    .0536824
                      |
                nocc2 |
                   2  |    .051709   .0030104    17.18   0.000     .0456624    .0577556
                   3  |    .032743   .0048529     6.75   0.000     .0229957    .0424904
                   4  |   .1653072   .0107903    15.32   0.000     .1436343      .18698
                   5  |   .1497484   .0165911     9.03   0.000     .1164242    .1830726
                   6  |   .1368186   .0066775    20.49   0.000     .1234065    .1502307
                   7  |   .0713192   .0047123    15.13   0.000     .0618542    .0807841
                   8  |   .0688794   .0070453     9.78   0.000     .0547284    .0830303
                   9  |   .1659736   .0107513    15.44   0.000     .1443791    .1875682
                  10  |   .1944182    .013637    14.26   0.000     .1670275     .221809
                  11  |     .20985    .014792    14.19   0.000     .1801395    .2395605
                  12  |   .2080456    .016333    12.74   0.000     .1752397    .2408514
                      |
                unemp |  -.0002893    .000363    -0.80   0.429    -.0010184    .0004398
                      |
              quarter |
                   2  |  -.0028907   .0014961    -1.93   0.059    -.0058958    .0001144
                   3  |  -.0034544   .0013361    -2.59   0.013    -.0061382   -.0007707
                   4  |  -.0041937   .0009725    -4.31   0.000     -.006147   -.0022405
                      |
                _cons |   .0257829   .0410932     0.63   0.533    -.0567551    .1083209
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_mal_all_sltt 

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 expe
> r4 edex i.ee_cl marr partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 9,012,682,948)

Linear regression                               Number of obs     =  1,079,084
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2720
                                                Root MSE          =     .29792

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |    .079547   .0115463     6.89   0.000     .0563556    .1027384
             treat_st |  -.0218549   .0114109    -1.92   0.061    -.0447744    .0010645
treat_stblackrelwhite |  -.0646239   .0122926    -5.26   0.000    -.0893144   -.0399334
                      |
                state |
                  NH  |  -.0144104   .0013313   -10.82   0.000    -.0170843   -.0117365
                  VT  |  -.0053746   .0004852   -11.08   0.000     -.006349   -.0044001
                  MA  |   .0150156   .0030849     4.87   0.000     .0088195    .0212118
                  RI  |   .0331211   .0026652    12.43   0.000     .0277678    .0384743
                  CT  |   .0251099   .0028913     8.68   0.000     .0193026    .0309172
                  NY  |   .0948159   .0032363    29.30   0.000     .0883157    .1013161
                  NJ  |   .0330293   .0030863    10.70   0.000     .0268303    .0392282
                  PA  |   .0084221   .0027281     3.09   0.003     .0029426    .0139016
                  OH  |  -.0053147   .0024134    -2.20   0.032    -.0101622   -.0004672
                  IN  |  -.0431874    .003338   -12.94   0.000    -.0498919   -.0364829
                  IL  |  -.0005084   .0030653    -0.17   0.869    -.0066652    .0056484
                  MI  |   .0438375   .0031643    13.85   0.000     .0374819    .0501931
                  WI  |  -.0023184   .0026359    -0.88   0.383    -.0076128    .0029759
                  MN  |   .0369186   .0022268    16.58   0.000     .0324459    .0413912
                  IA  |  -.0020421   .0113328    -0.18   0.858    -.0248046    .0207205
                  MO  |  -.0523302   .0025705   -20.36   0.000    -.0574933   -.0471671
                  ND  |  -.0411355    .011273    -3.65   0.001     -.063778   -.0184931
                  SD  |  -.0532538   .0113563    -4.69   0.000    -.0760636    -.030444
                  NE  |  -.0205949   .0112612    -1.83   0.073    -.0432138    .0020239
                  KS  |  -.0561734   .0112799    -4.98   0.000    -.0788297   -.0335172
                  DE  |  -.0303316   .0026154   -11.60   0.000    -.0355848   -.0250785
                  MD  |  -.0425252   .0056331    -7.55   0.000    -.0538396   -.0312108
                  DC  |   -.065363   .0071703    -9.12   0.000     -.079765    -.050961
                  VA  |  -.0767705   .0112903    -6.80   0.000    -.0994476   -.0540933
                  WV  |  -.0283381   .0024493   -11.57   0.000    -.0332577   -.0234185
                  NC  |  -.1022202   .0116045    -8.81   0.000    -.1255286   -.0789119
                  SC  |  -.1094729    .011577    -9.46   0.000    -.1327261   -.0862197
                  GA  |  -.0871111    .011606    -7.51   0.000    -.1104225   -.0637997
                  FL  |   -.038093   .0114269    -3.33   0.002    -.0610445   -.0151415
                  KY  |  -.0588356   .0020405   -28.83   0.000    -.0629339   -.0547372
                  TN  |  -.0673599   .0115427    -5.84   0.000    -.0905442   -.0441757
                  AL  |  -.0362959   .0115303    -3.15   0.003    -.0594552   -.0131366
                  MS  |  -.0962499   .0116612    -8.25   0.000    -.1196721   -.0728278
                  AR  |  -.0815409   .0114614    -7.11   0.000    -.1045619     -.05852
                  LA  |   -.067436   .0114217    -5.90   0.000    -.0903772   -.0444948
                  OK  |  -.0685704   .0064012   -10.71   0.000    -.0814274   -.0557133
                  TX  |   -.073248   .0114059    -6.42   0.000    -.0961574   -.0503387
                  MT  |   .0077807    .001782     4.37   0.000     .0042015      .01136
                  ID  |  -.0521398   .0112163    -4.65   0.000    -.0746684   -.0296113
                  WY  |  -.0894974   .0117575    -7.61   0.000    -.1131129   -.0658818
                  CO  |  -.0468659   .0028449   -16.47   0.000      -.05258   -.0411518
                  NM  |  -.0777097   .0030675   -25.33   0.000     -.083871   -.0715483
                  AZ  |  -.0535949   .0113839    -4.71   0.000    -.0764601   -.0307298
                  UT  |  -.0533225    .011245    -4.74   0.000    -.0759086   -.0307363
                  NV  |   .0457908    .011417     4.01   0.000     .0228592    .0687224
                  WA  |   .0604533   .0022924    26.37   0.000     .0558488    .0650577
                  OR  |   .0441168   .0020489    21.53   0.000     .0400014    .0482321
                  CA  |   .0433845   .0027232    15.93   0.000     .0379148    .0488541
                  AK  |   .0645431   .0035423    18.22   0.000     .0574282    .0716581
                  HI  |   .0511817   .0017572    29.13   0.000     .0476522    .0547112
                      |
                 year |
                1990  |  -.0023526   .0015968    -1.47   0.147    -.0055599    .0008546
                1991  |  -.0038812    .001921    -2.02   0.049    -.0077397   -.0000228
                1992  |  -.0005087   .0020802    -0.24   0.808    -.0046868    .0036694
                1993  |  -.0006055    .002378    -0.25   0.800     -.005382    .0041709
                1996  |  -.0019838   .0025874    -0.77   0.447    -.0071807    .0032132
                1997  |  -.0058765   .0024293    -2.42   0.019    -.0107559   -.0009971
                1998  |  -.0087984   .0029578    -2.97   0.005    -.0147392   -.0028575
                1999  |   -.011276   .0027268    -4.14   0.000     -.016753    -.005799
                2000  |  -.0089332   .0025773    -3.47   0.001    -.0141097   -.0037566
                2001  |  -.0088219   .0024632    -3.58   0.001    -.0137694   -.0038744
                2002  |  -.0097148   .0034893    -2.78   0.008    -.0167232   -.0027064
                2003  |   -.016173   .0029065    -5.56   0.000    -.0220108   -.0103352
                2004  |  -.0192327   .0032048    -6.00   0.000    -.0256696   -.0127957
                2005  |  -.0206711   .0033964    -6.09   0.000    -.0274928   -.0138493
                2006  |  -.0226049   .0031752    -7.12   0.000    -.0289824   -.0162273
                2007  |  -.0220693   .0043548    -5.07   0.000    -.0308162   -.0133224
                2008  |  -.0204996   .0043077    -4.76   0.000    -.0291519   -.0118473
                2009  |  -.0194361   .0040504    -4.80   0.000    -.0275716   -.0113006
                2010  |  -.0224754   .0039714    -5.66   0.000    -.0304522   -.0144986
                2011  |   -.021112   .0040835    -5.17   0.000     -.029314     -.01291
                2012  |  -.0256822   .0043122    -5.96   0.000    -.0343435   -.0170209
                2013  |  -.0218239   .0045669    -4.78   0.000    -.0309967   -.0126511
                2014  |  -.0252888   .0044808    -5.64   0.000    -.0342887   -.0162888
                2015  |  -.0240676   .0048963    -4.92   0.000    -.0339021    -.014233
                2016  |  -.0213769   .0044928    -4.76   0.000    -.0304008   -.0123529
                2017  |  -.0269851   .0049126    -5.49   0.000    -.0368524   -.0171179
                2018  |   -.029315   .0035774    -8.19   0.000    -.0365004   -.0221296
                2019  |  -.0284894   .0050281    -5.67   0.000    -.0385886   -.0183902
                      |
                 nind |
                   2  |   .0349387   .0104717     3.34   0.002     .0139056    .0559717
                   3  |   .0511496    .010955     4.67   0.000     .0291459    .0731533
                   4  |   .0410975   .0098095     4.19   0.000     .0213945    .0608004
                   5  |    .172262   .0099129    17.38   0.000     .1523515    .1921726
                   6  |   .0144512   .0091169     1.59   0.119    -.0038607    .0327631
                   7  |   .0055519   .0089817     0.62   0.539    -.0124884    .0235923
                   8  |   .0224151   .0115721     1.94   0.058    -.0008282    .0456583
                   9  |    .141546   .0170671     8.29   0.000     .1072657    .1758262
                  10  |   .0083671   .0099639     0.84   0.405    -.0116459    .0283801
                  11  |   .0075743   .0157658     0.48   0.633    -.0240922    .0392408
                      |
                 educ |   .0146604   .0020462     7.16   0.000     .0105504    .0187704
                exper |   .0083776   .0013641     6.14   0.000     .0056378    .0111175
               exper2 |  -.0003093   .0000703    -4.40   0.000    -.0004505   -.0001681
               exper3 |   7.06e-06   2.31e-06     3.06   0.004     2.42e-06    .0000117
               exper4 |  -6.57e-08   2.50e-08    -2.63   0.011    -1.16e-07   -1.56e-08
                 edex |  -.0001227   .0000474    -2.59   0.013    -.0002179   -.0000275
                      |
                ee_cl |
                   2  |  -.0354746    .004333    -8.19   0.000    -.0441776   -.0267715
                   3  |  -.0631292   .0065738    -9.60   0.000    -.0763331   -.0499252
                   4  |   -.094072   .0130678    -7.20   0.000    -.1203195   -.0678245
                   5  |  -.0379269   .0059066    -6.42   0.000    -.0497906   -.0260632
                   6  |  -.0427058    .005328    -8.02   0.000    -.0534073   -.0320043
                   7  |  -.0631163   .0075008    -8.41   0.000     -.078182   -.0480506
                   8  |  -.0864801   .0127158    -6.80   0.000    -.1120206   -.0609396
                   9  |  -.0266118   .0058981    -4.51   0.000    -.0384584   -.0147653
                  10  |  -.0449056   .0065433    -6.86   0.000    -.0580481   -.0317631
                  11  |  -.0631482   .0083783    -7.54   0.000    -.0799764     -.04632
                  12  |  -.0779825    .012208    -6.39   0.000    -.1025029   -.0534621
                  13  |  -.0032814   .0069027    -0.48   0.637    -.0171458    .0105831
                  14  |  -.0374198    .007266    -5.15   0.000    -.0520141   -.0228255
                  15  |  -.0576097    .009353    -6.16   0.000    -.0763957   -.0388236
                  16  |  -.0715472   .0129117    -5.54   0.000    -.0974811   -.0456133
                      |
                 marr |  -.0005969   .0010151    -0.59   0.559    -.0026358     .001442
                partt |  -.0559122   .0049599   -11.27   0.000    -.0658743     -.04595
               public |   .2847504   .0282468    10.08   0.000      .228015    .3414857
                 cmsa |   .0233418   .0028524     8.18   0.000     .0176127     .029071
                      |
                nocc2 |
                   2  |   .0225691   .0020687    10.91   0.000     .0184139    .0267242
                   3  |    .031428   .0066947     4.69   0.000     .0179813    .0448746
                   4  |   .1521513   .0072891    20.87   0.000     .1375106     .166792
                   5  |   .1365596   .0157997     8.64   0.000     .1048249    .1682944
                   6  |   .0640489    .005376    11.91   0.000      .053251    .0748468
                   7  |   .0837146   .0080048    10.46   0.000     .0676366    .0997926
                   8  |   .0566635   .0032546    17.41   0.000     .0501265    .0632005
                   9  |    .097141   .0091531    10.61   0.000     .0787564    .1155256
                  10  |   .1813347   .0151126    12.00   0.000     .1509802    .2116893
                  11  |   .2109494   .0157967    13.35   0.000     .1792207    .2426781
                  12  |   .1705848   .0179783     9.49   0.000     .1344743    .2066953
                      |
              quarter |
                   2  |  -.0010141   .0010142    -1.00   0.322    -.0030511     .001023
                   3  |   .0001331   .0008251     0.16   0.872    -.0015241    .0017903
                   4  |  -.0032237   .0011099    -2.90   0.005     -.005453   -.0009943
                      |
                _cons |   -.217716   .0368991    -5.90   0.000    -.2918301   -.1436019
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 expe
> r4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster s
> tate)
(sum of wgt is 9,012,682,948)

Linear regression                               Number of obs     =  1,079,084
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2720
                                                Root MSE          =     .29792

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0795461   .0115449     6.89   0.000     .0563574    .1027348
             treat_st |  -.0220885   .0113618    -1.94   0.058    -.0449092    .0007323
treat_stblackrelwhite |   -.064626   .0122927    -5.26   0.000    -.0893166   -.0399353
                      |
                state |
                  NH  |  -.0154131   .0015237   -10.12   0.000    -.0184736   -.0123527
                  VT  |  -.0063036    .001053    -5.99   0.000    -.0084186   -.0041886
                  MA  |   .0150683   .0030915     4.87   0.000     .0088587    .0212778
                  RI  |   .0340665   .0028342    12.02   0.000     .0283738    .0397591
                  CT  |   .0252262   .0028843     8.75   0.000     .0194329    .0310194
                  NY  |   .0954831   .0030196    31.62   0.000      .089418    .1015482
                  NJ  |   .0335269   .0030373    11.04   0.000     .0274264    .0396274
                  PA  |   .0087792   .0027575     3.18   0.003     .0032406    .0143177
                  OH  |  -.0047462    .002388    -1.99   0.052    -.0095428    .0000503
                  IN  |  -.0430761   .0033321   -12.93   0.000    -.0497687   -.0363834
                  IL  |   .0003792    .003096     0.12   0.903    -.0058393    .0065977
                  MI  |   .0451951   .0034658    13.04   0.000     .0382339    .0521563
                  WI  |  -.0026366   .0026088    -1.01   0.317    -.0078765    .0026034
                  MN  |   .0362119   .0022799    15.88   0.000     .0316327    .0407911
                  IA  |  -.0028952   .0111677    -0.26   0.797    -.0253261    .0195357
                  MO  |  -.0521412    .002553   -20.42   0.000    -.0572692   -.0470133
                  ND  |  -.0424623   .0111577    -3.81   0.000    -.0648733   -.0200514
                  SD  |   -.054532   .0111924    -4.87   0.000    -.0770126   -.0320514
                  NE  |  -.0220817   .0110761    -1.99   0.052    -.0443287    .0001652
                  KS  |  -.0565328   .0111535    -5.07   0.000    -.0789353   -.0341303
                  DE  |  -.0308723   .0029682   -10.40   0.000     -.036834   -.0249106
                  MD  |  -.0427969   .0057711    -7.42   0.000    -.0543886   -.0312053
                  DC  |  -.0638204   .0065677    -9.72   0.000     -.077012   -.0506289
                  VA  |  -.0773104   .0111511    -6.93   0.000    -.0997081   -.0549127
                  WV  |  -.0270494   .0023908   -11.31   0.000    -.0318515   -.0222473
                  NC  |  -.1016978   .0116039    -8.76   0.000    -.1250048   -.0783907
                  SC  |  -.1084959   .0116381    -9.32   0.000    -.1318718     -.08512
                  GA  |  -.0864761   .0116421    -7.43   0.000      -.10986   -.0630922
                  FL  |  -.0374325   .0114752    -3.26   0.002    -.0604812   -.0143839
                  KY  |  -.0580818   .0020044   -28.98   0.000    -.0621076   -.0540559
                  TN  |  -.0667667   .0115593    -5.78   0.000    -.0899843   -.0435491
                  AL  |  -.0353734    .011613    -3.05   0.004    -.0586988   -.0120481
                  MS  |  -.0946887   .0118299    -8.00   0.000    -.1184498   -.0709275
                  AR  |  -.0809011   .0114546    -7.06   0.000    -.1039083   -.0578938
                  LA  |  -.0663663   .0115244    -5.76   0.000    -.0895137    -.043219
                  OK  |  -.0688822   .0063451   -10.86   0.000    -.0816267   -.0561376
                  TX  |  -.0726547   .0114289    -6.36   0.000    -.0956103   -.0496991
                  MT  |    .007685   .0018122     4.24   0.000     .0040451     .011325
                  ID  |  -.0519041   .0111653    -4.65   0.000    -.0743302   -.0294781
                  WY  |  -.0899911   .0116765    -7.71   0.000    -.1134442   -.0665381
                  CO  |  -.0471911   .0028391   -16.62   0.000    -.0528937   -.0414885
                  NM  |  -.0770784   .0029216   -26.38   0.000    -.0829466   -.0712103
                  AZ  |  -.0528356   .0114723    -4.61   0.000    -.0758783   -.0297929
                  UT  |  -.0538654   .0110835    -4.86   0.000    -.0761272   -.0316037
                  NV  |   .0467457   .0115629     4.04   0.000     .0235209    .0699705
                  WA  |   .0612135   .0024528    24.96   0.000      .056287    .0661401
                  OR  |   .0451642   .0024053    18.78   0.000     .0403331    .0499954
                  CA  |   .0447795   .0028729    15.59   0.000     .0390091      .05055
                  AK  |   .0663323   .0034569    19.19   0.000     .0593889    .0732757
                  HI  |    .050249   .0021282    23.61   0.000     .0459743    .0545237
                      |
                 year |
                1990  |  -.0020751   .0017193    -1.21   0.233    -.0055284    .0013783
                1991  |  -.0025898   .0026046    -0.99   0.325    -.0078212    .0026416
                1992  |   .0012996   .0023701     0.55   0.586    -.0034608    .0060601
                1993  |   .0006994   .0026126     0.27   0.790    -.0045483     .005947
                1996  |  -.0019522   .0025694    -0.76   0.451    -.0071131    .0032087
                1997  |  -.0062169   .0024224    -2.57   0.013    -.0110825   -.0013514
                1998  |  -.0095076   .0029796    -3.19   0.002    -.0154922    -.003523
                1999  |  -.0122075   .0027916    -4.37   0.000    -.0178146   -.0066004
                2000  |  -.0100203   .0024697    -4.06   0.000    -.0149808   -.0050598
                2001  |  -.0092829   .0024189    -3.84   0.000    -.0141414   -.0044244
                2002  |  -.0092864   .0036009    -2.58   0.013    -.0165191   -.0020537
                2003  |  -.0155576   .0030407    -5.12   0.000    -.0216651   -.0094501
                2004  |  -.0189799    .003294    -5.76   0.000    -.0255962   -.0123636
                2005  |  -.0207524   .0033949    -6.11   0.000    -.0275712   -.0139336
                2006  |  -.0230605   .0032207    -7.16   0.000    -.0295295   -.0165916
                2007  |   -.022563    .004461    -5.06   0.000    -.0315232   -.0136028
                2008  |  -.0200447   .0045034    -4.45   0.000    -.0290899   -.0109994
                2009  |  -.0160896   .0057691    -2.79   0.007    -.0276771    -.004502
                2010  |  -.0188505   .0057366    -3.29   0.002    -.0303728   -.0073282
                2011  |  -.0180887   .0055025    -3.29   0.002    -.0291408   -.0070366
                2012  |  -.0233772    .005122    -4.56   0.000    -.0336651   -.0130894
                2013  |  -.0200492   .0050737    -3.95   0.000      -.03024   -.0098583
                2014  |  -.0245209   .0046246    -5.30   0.000    -.0338097    -.015232
                2015  |  -.0240379   .0049254    -4.88   0.000    -.0339308    -.014145
                2016  |   -.021671   .0044536    -4.87   0.000    -.0306163   -.0127257
                2017  |  -.0277013   .0048924    -5.66   0.000    -.0375279   -.0178747
                2018  |  -.0303994   .0037878    -8.03   0.000    -.0380074   -.0227914
                2019  |  -.0297496   .0053458    -5.57   0.000    -.0404869   -.0190123
                      |
                 nind |
                   2  |   .0348977   .0104662     3.33   0.002     .0138757    .0559196
                   3  |   .0511172   .0109553     4.67   0.000     .0291129    .0731215
                   4  |   .0410818   .0098107     4.19   0.000     .0213764    .0607873
                   5  |   .1722511    .009913    17.38   0.000     .1523401     .192162
                   6  |   .0144336   .0091197     1.58   0.120    -.0038838     .032751
                   7  |   .0055277   .0089833     0.62   0.541    -.0125157    .0235711
                   8  |   .0223971   .0115692     1.94   0.059    -.0008402    .0456344
                   9  |    .141521   .0170672     8.29   0.000     .1072406    .1758015
                  10  |   .0083489    .009967     0.84   0.406    -.0116704    .0283683
                  11  |   .0075402   .0157672     0.48   0.635    -.0241292    .0392096
                      |
                 educ |   .0146591   .0020468     7.16   0.000     .0105481    .0187702
                exper |   .0083823   .0013649     6.14   0.000     .0056409    .0111237
               exper2 |  -.0003097   .0000703    -4.40   0.000    -.0004509   -.0001684
               exper3 |   7.07e-06   2.31e-06     3.06   0.004     2.44e-06    .0000117
               exper4 |  -6.58e-08   2.50e-08    -2.64   0.011    -1.16e-07   -1.57e-08
                 edex |  -.0001227   .0000474    -2.59   0.013    -.0002179   -.0000275
                      |
                ee_cl |
                   2  |  -.0354609   .0043257    -8.20   0.000    -.0441493   -.0267725
                   3  |  -.0631083   .0065584    -9.62   0.000    -.0762813   -.0499353
                   4  |  -.0940499   .0130541    -7.20   0.000    -.1202698   -.0678301
                   5  |  -.0379346   .0059015    -6.43   0.000    -.0497881    -.026081
                   6  |  -.0426996   .0053211    -8.02   0.000    -.0533874   -.0320119
                   7  |   -.063095    .007484    -8.43   0.000     -.078127    -.048063
                   8  |   -.086457   .0126985    -6.81   0.000    -.1119627   -.0609513
                   9  |  -.0266129   .0058947    -4.51   0.000    -.0384527    -.014773
                  10  |   -.044897    .006534    -6.87   0.000     -.058021   -.0317731
                  11  |  -.0631229   .0083594    -7.55   0.000    -.0799133   -.0463324
                  12  |  -.0779564   .0121869    -6.40   0.000    -.1024345   -.0534783
                  13  |  -.0032751   .0068985    -0.47   0.637    -.0171312    .0105809
                  14  |  -.0374004    .007252    -5.16   0.000    -.0519664   -.0228344
                  15  |   -.057583   .0093325    -6.17   0.000    -.0763278   -.0388382
                  16  |  -.0715264   .0128957    -5.55   0.000    -.0974282   -.0456246
                      |
                 marr |  -.0005989   .0010142    -0.59   0.558    -.0026361    .0014382
                partt |  -.0558994   .0049522   -11.29   0.000    -.0658462   -.0459526
               public |   .2847584   .0282505    10.08   0.000     .2280155    .3415013
                 cmsa |   .0233273   .0028516     8.18   0.000     .0175997    .0290548
                      |
                nocc2 |
                   2  |    .022563   .0020659    10.92   0.000     .0184136    .0267125
                   3  |   .0314208    .006692     4.70   0.000     .0179794    .0448621
                   4  |   .1521486   .0072875    20.88   0.000     .1375112     .166786
                   5  |   .1365511   .0157988     8.64   0.000     .1048183     .168284
                   6  |   .0640477   .0053758    11.91   0.000       .05325    .0748453
                   7  |   .0837078   .0080015    10.46   0.000     .0676363    .0997793
                   8  |   .0566654   .0032563    17.40   0.000     .0501249    .0632058
                   9  |   .0971388   .0091516    10.61   0.000     .0787572    .1155204
                  10  |   .1813023   .0151082    12.00   0.000     .1509566     .211648
                  11  |    .210938   .0157949    13.35   0.000      .179213     .242663
                  12  |   .1705708   .0179783     9.49   0.000     .1344603    .2066814
                      |
                unemp |  -.0008421   .0009048    -0.93   0.356    -.0026595    .0009752
                      |
              quarter |
                   2  |  -.0010109   .0010133    -1.00   0.323    -.0030462    .0010243
                   3  |   .0001316   .0008243     0.16   0.874     -.001524    .0017872
                   4  |  -.0032224   .0011061    -2.91   0.005    -.0054441   -.0010006
                      |
                _cons |  -.2136998   .0354128    -6.03   0.000    -.2848285    -.142571
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 ex
> per3 exper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(
> cluster state)
(sum of wgt is 9,012,682,948)

Linear regression                               Number of obs     =  1,079,084
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2725
                                                Root MSE          =     .29782

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0795993   .0115314     6.90   0.000     .0564378    .1027607
             treat_st |   -.005251    .011037    -0.48   0.636    -.0274195    .0169175
treat_stblackrelwhite |  -.0647088   .0122437    -5.29   0.000    -.0893009   -.0401167
                      |
                state |
                  NH  |  -.1399224   .0030603   -45.72   0.000    -.1460691   -.1337757
                  VT  |  -.1509536   .0036346   -41.53   0.000     -.158254   -.1436533
                  MA  |  -.0206196   .0067796    -3.04   0.004    -.0342369   -.0070023
                  RI  |   -.052584   .0061598    -8.54   0.000    -.0649563   -.0402117
                  CT  |  -.1097783   .0100828   -10.89   0.000    -.1300301   -.0895265
                  NY  |   .0055772   .0080368     0.69   0.491    -.0105653    .0217196
                  NJ  |   .1223271   .0086316    14.17   0.000     .1049899    .1396642
                  PA  |   .1249316    .008102    15.42   0.000     .1086583    .1412049
                  OH  |   .1137953   .0070531    16.13   0.000     .0996287    .1279618
                  IN  |   .1237274   .0370021     3.34   0.002     .0494064    .1980484
                  IL  |   .0197813   .0070148     2.82   0.007     .0056916     .033871
                  MI  |   .1199255   .0341769     3.51   0.001     .0512792    .1885719
                  WI  |   .3121624   .0286744    10.89   0.000     .2545682    .3697565
                  MN  |   .1639225   .0073007    22.45   0.000     .1492587    .1785863
                  IA  |   .0548525   .0121597     4.51   0.000      .030429    .0792759
                  MO  |   .0298302   .0050192     5.94   0.000     .0197489    .0399115
                  ND  |   .0207898   .0155244     1.34   0.187    -.0103918    .0519714
                  SD  |   .0074347   .0121617     0.61   0.544    -.0169929    .0318623
                  NE  |   .1081212   .0114488     9.44   0.000     .0851256    .1311167
                  KS  |  -.0310996   .0118082    -2.63   0.011    -.0548171   -.0073822
                  DE  |   .0288992   .0168182     1.72   0.092    -.0048812    .0626795
                  MD  |   .1062844   .0105949    10.03   0.000     .0850038     .127565
                  DC  |    -.04873   .0366073    -1.33   0.189    -.1222579    .0247979
                  VA  |    .024626   .0129026     1.91   0.062    -.0012897    .0505417
                  WV  |  -.0280707   .0158605    -1.77   0.083    -.0599275    .0037861
                  NC  |  -.1203292   .0137768    -8.73   0.000    -.1480007   -.0926576
                  SC  |  -.1742328   .0129092   -13.50   0.000    -.2001617   -.1483039
                  GA  |  -.0889435   .0117815    -7.55   0.000    -.1126074   -.0652796
                  FL  |  -.0085294   .0120724    -0.71   0.483    -.0327775    .0157187
                  KY  |   -.087888   .0197464    -4.45   0.000    -.1275498   -.0482261
                  TN  |   .0341411   .0122772     2.78   0.008     .0094816    .0588006
                  AL  |  -.0235888   .0116121    -2.03   0.048    -.0469125   -.0002652
                  MS  |  -.0355293    .011861    -3.00   0.004    -.0593528   -.0117058
                  AR  |   .1207029   .0124063     9.73   0.000     .0957841    .1456218
                  LA  |  -.0412766    .016403    -2.52   0.015    -.0742231   -.0083301
                  OK  |  -.0268747   .0496387    -0.54   0.591     -.126577    .0728275
                  TX  |  -.1027184   .0125444    -8.19   0.000    -.1279146   -.0775222
                  MT  |  -.0176339   .0111635    -1.58   0.121    -.0400565    .0047887
                  ID  |   .0522776   .0133544     3.91   0.000     .0254545    .0791006
                  WY  |   .1210385   .0120951    10.01   0.000     .0967448    .1453323
                  CO  |  -.1887215   .0087196   -21.64   0.000    -.2062353   -.1712078
                  NM  |  -.1427489   .0045504   -31.37   0.000    -.1518885   -.1336092
                  AZ  |   -.043899   .0126968    -3.46   0.001    -.0694012   -.0183969
                  UT  |   .1513473   .0129084    11.72   0.000       .12542    .1772745
                  NV  |   .2333381   .0138385    16.86   0.000     .2055426    .2611335
                  WA  |   .1280204   .0069143    18.52   0.000     .1141327    .1419081
                  OR  |  -.0156207    .004838    -3.23   0.002    -.0253381   -.0059034
                  CA  |  -.0549949   .0079803    -6.89   0.000    -.0710239   -.0389659
                  AK  |  -.0404985   .0069514    -5.83   0.000    -.0544608   -.0265362
                  HI  |   .1498112   .0126158    11.87   0.000     .1244716    .1751509
                      |
        state#c.lyear |
                  ME  |  -.0007016   .0000696   -10.08   0.000    -.0008415   -.0005618
                  NH  |   .0004646    .000084     5.53   0.000     .0002959    .0006333
                  VT  |    .000704   .0000449    15.67   0.000     .0006137    .0007942
                  MA  |  -.0003584   .0000545    -6.58   0.000    -.0004678   -.0002489
                  RI  |   .0001229   .0000582     2.11   0.040     6.05e-06    .0002397
                  CT  |   .0006004   .0000908     6.61   0.000     .0004181    .0007828
                  NY  |   .0001676   .0000354     4.74   0.000     .0000965    .0002386
                  NJ  |  -.0015635   .0000471   -33.23   0.000     -.001658    -.001469
                  PA  |  -.0018281   .0000408   -44.78   0.000    -.0019101   -.0017461
                  OH  |  -.0018531   .0000322   -57.51   0.000    -.0019178   -.0017884
                  IN  |  -.0023543   .0003735    -6.30   0.000    -.0031045   -.0016041
                  IL  |  -.0008993   .0000307   -29.33   0.000    -.0009609   -.0008377
                  MI  |  -.0014718   .0003311    -4.44   0.000    -.0021369   -.0008067
                  WI  |  -.0037672   .0002843   -13.25   0.000    -.0043382   -.0031962
                  MN  |  -.0019261   .0000355   -54.20   0.000    -.0019974   -.0018547
                  IA  |  -.0014123   .0000348   -40.64   0.000    -.0014821   -.0013425
                  MO  |  -.0014952   .0000447   -33.46   0.000     -.001585   -.0014055
                  ND  |  -.0014583   .0000532   -27.39   0.000    -.0015653   -.0013514
                  SD  |  -.0014514    .000025   -58.15   0.000    -.0015016   -.0014013
                  NE  |  -.0021031   .0000418   -50.27   0.000    -.0021871   -.0020191
                  KS  |  -.0011054   .0000336   -32.92   0.000    -.0011728   -.0010379
                  DE  |  -.0012887   .0001241   -10.38   0.000     -.001538   -.0010394
                  MD  |  -.0021247   .0000499   -42.54   0.000    -.0022251   -.0020244
                  DC  |  -.0008659   .0002542    -3.41   0.001    -.0013765   -.0003553
                  VA  |  -.0018451   .0000451   -40.88   0.000    -.0019357   -.0017544
                  WV  |  -.0007204    .000142    -5.07   0.000    -.0010057   -.0004351
                  NC  |  -.0006894   .0000979    -7.04   0.000    -.0008861   -.0004927
                  SC  |  -.0002426   .0000869    -2.79   0.007    -.0004171   -.0000681
                  GA  |  -.0008467   .0000505   -16.77   0.000    -.0009482   -.0007453
                  FL  |  -.0011494   .0000294   -39.04   0.000    -.0012085   -.0010902
                  KY  |  -.0004419   .0001827    -2.42   0.019    -.0008088    -.000075
                  TN  |  -.0018444   .0000626   -29.45   0.000    -.0019702   -.0017186
                  AL  |  -.0009879   .0000535   -18.45   0.000    -.0010955   -.0008804
                  MS  |  -.0014483   .0000733   -19.76   0.000    -.0015956   -.0013011
                  AR  |  -.0028129   .0000981   -28.68   0.000    -.0030099    -.002616
                  LA  |  -.0011165   .0000859   -13.00   0.000     -.001289    -.000944
                  OK  |  -.0011971   .0005295    -2.26   0.028    -.0022607   -.0001336
                  TX  |  -.0005812   .0000331   -17.54   0.000    -.0006478   -.0005147
                  MT  |  -.0004587   .0000541    -8.48   0.000    -.0005673   -.0003501
                  ID  |   -.001865   .0000735   -25.36   0.000    -.0020127   -.0017173
                  WY  |  -.0028364   .0000718   -39.53   0.000    -.0029806   -.0026923
                  CO  |   .0006511   .0000718     9.06   0.000     .0005068    .0007954
                  NM  |  -.0000881   .0000731    -1.21   0.234    -.0002349    .0000587
                  AZ  |  -.0009593   .0000408   -23.52   0.000    -.0010412   -.0008774
                  UT  |  -.0028168   .0000358   -78.69   0.000    -.0028887   -.0027449
                  NV  |  -.0026588   .0000587   -45.29   0.000    -.0027767   -.0025409
                  WA  |  -.0013544    .000031   -43.72   0.000    -.0014167   -.0012922
                  OR  |  -.0001318   .0000457    -2.88   0.006    -.0002237     -.00004
                  CA  |   .0002546   .0000591     4.31   0.000     .0001359    .0003732
                  AK  |   .0003358   .0000836     4.02   0.000     .0001679    .0005036
                  HI  |  -.0016691   .0001298   -12.86   0.000    -.0019298   -.0014084
                      |
                 nind |
                   2  |   .0341971   .0105015     3.26   0.002     .0131042      .05529
                   3  |   .0508681    .010918     4.66   0.000     .0289385    .0727976
                   4  |   .0404932   .0097899     4.14   0.000     .0208296    .0601568
                   5  |   .1715036    .009885    17.35   0.000     .1516491    .1913582
                   6  |   .0140349   .0091055     1.54   0.130    -.0042542    .0323239
                   7  |   .0049711   .0089691     0.55   0.582    -.0130438    .0229861
                   8  |   .0218941   .0115815     1.89   0.065     -.001368    .0451563
                   9  |   .1409927   .0170861     8.25   0.000     .1066744    .1753111
                  10  |   .0078954   .0098721     0.80   0.428    -.0119333     .027724
                  11  |   .0068499   .0157845     0.43   0.666    -.0248542     .038554
                      |
                 educ |   .0145742   .0019679     7.41   0.000     .0106216    .0185269
                exper |   .0084345   .0013649     6.18   0.000      .005693     .011176
               exper2 |  -.0003133   .0000696    -4.50   0.000    -.0004531   -.0001735
               exper3 |   7.15e-06   2.29e-06     3.13   0.003     2.56e-06    .0000117
               exper4 |  -6.63e-08   2.48e-08    -2.68   0.010    -1.16e-07   -1.65e-08
                 edex |   -.000123   .0000475    -2.59   0.013    -.0002185   -.0000275
                      |
                ee_cl |
                   2  |  -.0357096   .0042961    -8.31   0.000    -.0443385   -.0270807
                   3  |  -.0629618   .0064528    -9.76   0.000    -.0759225   -.0500011
                   4  |   -.093872   .0128084    -7.33   0.000    -.1195985   -.0681455
                   5  |  -.0384484   .0061165    -6.29   0.000    -.0507338    -.026163
                   6  |  -.0431092   .0054152    -7.96   0.000    -.0539859   -.0322326
                   7  |  -.0627292   .0074149    -8.46   0.000    -.0776224    -.047836
                   8  |   -.086123   .0125137    -6.88   0.000    -.1112576   -.0609884
                   9  |  -.0271168   .0061235    -4.43   0.000    -.0394162   -.0148174
                  10  |  -.0451403     .00655    -6.89   0.000    -.0582964   -.0319842
                  11  |  -.0628704   .0082866    -7.59   0.000    -.0795147   -.0462262
                  12  |  -.0776019   .0119732    -6.48   0.000    -.1016508    -.053553
                  13  |  -.0037882   .0070942    -0.53   0.596    -.0180373    .0104609
                  14  |  -.0374193   .0072328    -5.17   0.000    -.0519468   -.0228918
                  15  |   -.057514   .0092293    -6.23   0.000    -.0760515   -.0389764
                  16  |  -.0715682   .0126493    -5.66   0.000     -.096975   -.0461614
                      |
                 marr |  -.0006106   .0010091    -0.61   0.548    -.0026375    .0014162
                partt |  -.0559089   .0049264   -11.35   0.000    -.0658039   -.0460139
               public |   .2847709   .0282585    10.08   0.000      .228012    .3415298
                 cmsa |   .0234194   .0030294     7.73   0.000     .0173346    .0295042
                      |
                nocc2 |
                   2  |   .0226952   .0020611    11.01   0.000     .0185554    .0268351
                   3  |   .0314318   .0066879     4.70   0.000     .0179987    .0448649
                   4  |   .1519742   .0073032    20.81   0.000     .1373054    .1666431
                   5  |   .1365473   .0158147     8.63   0.000     .1047826    .1683121
                   6  |   .0640291   .0053955    11.87   0.000     .0531919    .0748662
                   7  |   .0837754   .0079741    10.51   0.000     .0677589    .0997919
                   8  |   .0566186   .0032516    17.41   0.000     .0500875    .0631496
                   9  |   .0969566   .0091376    10.61   0.000     .0786033    .1153099
                  10  |   .1808577   .0150075    12.05   0.000     .1507143     .211001
                  11  |   .2109131   .0158598    13.30   0.000     .1790577    .2427685
                  12  |   .1706159    .017989     9.48   0.000     .1344839    .2067479
                      |
                unemp |   .0001065   .0003232     0.33   0.743    -.0005426    .0007556
                      |
              quarter |
                   2  |  -.0010726   .0010206    -1.05   0.298    -.0031225    .0009773
                   3  |   .0000781   .0008513     0.09   0.927    -.0016318     .001788
                   4  |  -.0032568   .0011205    -2.91   0.005    -.0055075   -.0010061
                      |
                _cons |   -.158249   .0349346    -4.53   0.000    -.2284172   -.0880808
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 9,220,846,537)

Linear regression                               Number of obs     =  1,069,676
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5102
                                                Root MSE          =     .41765

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1438028   .0064576   -22.27   0.000    -.1567733   -.1308323
             treat_st |  -.0376856   .0180158    -2.09   0.042    -.0738714   -.0014997
treat_stblackrelwhite |  -.0223509   .0088244    -2.53   0.014    -.0400752   -.0046266
                      |
                state |
                  NH  |    .087089   .0039499    22.05   0.000     .0791554    .0950226
                  VT  |    .025799   .0007236    35.65   0.000     .0243456    .0272525
                  MA  |   .1162352   .0086885    13.38   0.000     .0987838    .1336865
                  RI  |   .0286328   .0087077     3.29   0.002      .011143    .0461227
                  CT  |    .129654   .0086274    15.03   0.000     .1123253    .1469827
                  NY  |   .0967019   .0080305    12.04   0.000     .0805721    .1128316
                  NJ  |   .1677067   .0092494    18.13   0.000     .1491287    .1862846
                  PA  |   .0088646   .0067582     1.31   0.196    -.0047096    .0224388
                  OH  |  -.0195721   .0066129    -2.96   0.005    -.0328545   -.0062898
                  IN  |   .0054665   .0053579     1.02   0.313    -.0052951    .0162281
                  IL  |   .0783275   .0073884    10.60   0.000     .0634873    .0931676
                  MI  |   .0443254   .0065553     6.76   0.000     .0311587    .0574921
                  WI  |   .0203353   .0050602     4.02   0.000     .0101716    .0304989
                  MN  |   .0657834   .0064884    10.14   0.000     .0527511    .0788157
                  IA  |   .0212843   .0177536     1.20   0.236    -.0143749    .0569435
                  MO  |  -.0222365   .0063253    -3.52   0.001    -.0349412   -.0095317
                  ND  |   .0313145   .0188817     1.66   0.103    -.0066105    .0692396
                  SD  |  -.0373669   .0180771    -2.07   0.044    -.0736759   -.0010579
                  NE  |  -.0228062   .0179739    -1.27   0.210    -.0589078    .0132953
                  KS  |  -.0025856   .0177809    -0.15   0.885    -.0382996    .0331284
                  DE  |   .0544864    .001988    27.41   0.000     .0504933    .0584794
                  MD  |   .1232429   .0091587    13.46   0.000     .1048472    .1416387
                  DC  |   .1691738   .0110553    15.30   0.000     .1469686     .191379
                  VA  |   .1198738    .018286     6.56   0.000     .0831453    .1566023
                  WV  |  -.0455549   .0029463   -15.46   0.000    -.0514728    -.039637
                  NC  |   .0056468   .0177469     0.32   0.752    -.0299988    .0412924
                  SC  |  -.0157136     .01757    -0.89   0.375    -.0510041    .0195768
                  GA  |   .0536955   .0181206     2.96   0.005     .0172992    .0900918
                  FL  |  -.0142285   .0186409    -0.76   0.449      -.05167    .0232129
                  KY  |  -.0442023   .0043337   -10.20   0.000    -.0529067   -.0354979
                  TN  |   -.031868   .0176883    -1.80   0.078     -.067396    .0036599
                  AL  |  -.0092104   .0176598    -0.52   0.604    -.0446812    .0262604
                  MS  |  -.0360031   .0178593    -2.02   0.049    -.0718746   -.0001317
                  AR  |  -.0757354   .0178859    -4.23   0.000    -.1116603   -.0398106
                  LA  |   .0178833   .0181816     0.98   0.330    -.0186356    .0544022
                  OK  |  -.0572883   .0106405    -5.38   0.000    -.0786605   -.0359162
                  TX  |   .0573962   .0183842     3.12   0.003     .0204704     .094322
                  MT  |  -.0346656   .0014888   -23.28   0.000     -.037656   -.0316753
                  ID  |  -.0022407    .017925    -0.13   0.901    -.0382442    .0337627
                  WY  |   .1626735   .0198037     8.21   0.000     .1228967    .2024504
                  CO  |   .0317311   .0084695     3.75   0.000     .0147196    .0487425
                  NM  |  -.0376418   .0058095    -6.48   0.000    -.0493104   -.0259731
                  AZ  |   .0282969   .0184408     1.53   0.131    -.0087425    .0653363
                  UT  |   .0026365    .018435     0.14   0.887    -.0343914    .0396644
                  NV  |   .1078075   .0186191     5.79   0.000     .0704099    .1452051
                  WA  |   .0956317   .0077667    12.31   0.000     .0800318    .1112316
                  OR  |   .0225863   .0070601     3.20   0.002     .0084057     .036767
                  CA  |   .1563519   .0090459    17.28   0.000     .1381827    .1745212
                  AK  |   .2368919   .0049259    48.09   0.000      .226998    .2467859
                  HI  |   .1138266   .0065457    17.39   0.000     .1006792     .126974
                      |
                 year |
                1990  |  -.0129421     .00266    -4.87   0.000    -.0182848   -.0075994
                1991  |  -.0273677    .003454    -7.92   0.000    -.0343053   -.0204301
                1992  |  -.0277938   .0032079    -8.66   0.000    -.0342372   -.0213505
                1993  |  -.0355747   .0034043   -10.45   0.000    -.0424124   -.0287371
                1996  |  -.0374494   .0052184    -7.18   0.000    -.0479308   -.0269679
                1997  |  -.0217358   .0052439    -4.14   0.000    -.0322686   -.0112031
                1998  |   .0010239   .0045314     0.23   0.822    -.0080776    .0101255
                1999  |   .0235046    .005899     3.98   0.000      .011656    .0353532
                2000  |   .0312478   .0052878     5.91   0.000      .020627    .0418687
                2001  |   .0460521   .0055004     8.37   0.000     .0350043    .0570999
                2002  |   .0526567   .0055382     9.51   0.000     .0415328    .0637806
                2003  |   .0430428   .0058116     7.41   0.000       .03137    .0547157
                2004  |   .0351114   .0052965     6.63   0.000     .0244731    .0457497
                2005  |   .0213327    .005823     3.66   0.001     .0096368    .0330285
                2006  |   .0179041    .006095     2.94   0.005     .0056618    .0301464
                2007  |   .0189099   .0071033     2.66   0.010     .0046425    .0331773
                2008  |   .0137895   .0074773     1.84   0.071    -.0012292    .0288081
                2009  |   .0263372   .0079454     3.31   0.002     .0103784     .042296
                2010  |   .0175526   .0077958     2.25   0.029     .0018941     .033211
                2011  |  -.0050895    .007342    -0.69   0.491    -.0198364    .0096573
                2012  |  -.0068088   .0086166    -0.79   0.433    -.0241158    .0104982
                2013  |  -.0088332   .0086045    -1.03   0.310    -.0261159    .0084495
                2014  |  -.0106146   .0088762    -1.20   0.237    -.0284429    .0072136
                2015  |   .0103104   .0070189     1.47   0.148    -.0037874    .0244082
                2016  |   .0248596   .0073803     3.37   0.001     .0100359    .0396833
                2017  |   .0310396   .0080085     3.88   0.000      .014954    .0471253
                2018  |    .040362    .007808     5.17   0.000     .0246791    .0560449
                2019  |   .0604397   .0077174     7.83   0.000      .044939    .0759405
                      |
                 nind |
                   2  |   .0847054   .0264323     3.20   0.002     .0316145    .1377963
                   3  |   .1049119    .022077     4.75   0.000     .0605689    .1492549
                   4  |  -.0792262   .0237972    -3.33   0.002    -.1270243    -.031428
                   5  |   .1436848   .0232286     6.19   0.000     .0970287    .1903409
                   6  |   .0987666   .0258676     3.82   0.000       .04681    .1507232
                   7  |   .0021384   .0250686     0.09   0.932    -.0482133    .0524901
                   8  |  -.0563072   .0249861    -2.25   0.029    -.1064933   -.0061211
                   9  |   -.062451   .0275359    -2.27   0.028    -.1177585   -.0071436
                  10  |  -.0952929   .0260635    -3.66   0.001     -.147643   -.0429427
                  11  |    .118038   .0258031     4.57   0.000     .0662109    .1698651
                      |
                 educ |   .0679175   .0016877    40.24   0.000     .0645278    .0713073
                exper |   .0457749   .0017768    25.76   0.000     .0422061    .0493436
               exper2 |  -.0009605   .0000951   -10.10   0.000    -.0011514   -.0007695
               exper3 |   5.10e-06   2.77e-06     1.84   0.071    -4.63e-07    .0000107
               exper4 |   3.03e-08   2.94e-08     1.03   0.308    -2.88e-08    8.94e-08
                 edex |  -.0004555   .0000621    -7.34   0.000    -.0005801   -.0003308
                      |
                ee_cl |
                   2  |  -.0594024   .0045307   -13.11   0.000    -.0685026   -.0503023
                   3  |  -.0681843    .006045   -11.28   0.000    -.0803259   -.0560426
                   4  |  -.0268753   .0107055    -2.51   0.015     -.048378   -.0053726
                   5  |  -.1341484   .0056925   -23.57   0.000    -.1455822   -.1227147
                   6  |  -.0852323   .0054643   -15.60   0.000    -.0962076    -.074257
                   7  |   -.061352   .0067599    -9.08   0.000    -.0749296   -.0477744
                   8  |   .0276169   .0115514     2.39   0.021     .0044152    .0508186
                   9  |  -.1529272   .0072979   -20.96   0.000    -.1675853    -.138269
                  10  |   -.096715   .0077495   -12.48   0.000    -.1122804   -.0811496
                  11  |  -.0582151   .0081672    -7.13   0.000    -.0746193   -.0418108
                  12  |   .0303401   .0116594     2.60   0.012     .0069215    .0537587
                  13  |  -.0776241    .012478    -6.22   0.000    -.1026868   -.0525613
                  14  |  -.0756857   .0094935    -7.97   0.000    -.0947539   -.0566175
                  15  |  -.0481014   .0094102    -5.11   0.000    -.0670023   -.0292005
                  16  |   .0292147   .0127067     2.30   0.026     .0036925    .0547369
                      |
                 marr |   .1234611   .0023316    52.95   0.000     .1187779    .1281443
                partt |  -.2095489   .0061196   -34.24   0.000    -.2218405   -.1972573
               public |   .0158438   .0074017     2.14   0.037     .0009771    .0307104
                 cmsa |   .1454419   .0089245    16.30   0.000     .1275166    .1633673
                      |
                nocc2 |
                   2  |  -.1399843   .0035592   -39.33   0.000    -.1471331   -.1328355
                   3  |  -.0389586    .005952    -6.55   0.000    -.0509134   -.0270037
                   4  |  -.2919049    .009412   -31.01   0.000    -.3108095   -.2730003
                   5  |  -.0777723   .0069204   -11.24   0.000    -.0916724   -.0638723
                   6  |  -.3673358   .0062001   -59.25   0.000    -.3797892   -.3548825
                   7  |  -.2298729   .0052255   -43.99   0.000    -.2403685   -.2193773
                   8  |  -.1004107   .0107321    -9.36   0.000    -.1219667   -.0788548
                   9  |  -.3880601   .0035677  -108.77   0.000     -.395226   -.3808942
                  10  |  -.3268889   .0049768   -65.68   0.000    -.3368851   -.3168928
                  11  |  -.2229578   .0055092   -40.47   0.000    -.2340234   -.2118922
                  12  |  -.3765119   .0054722   -68.80   0.000    -.3875032   -.3655206
                      |
              quarter |
                   2  |    .003316   .0018942     1.75   0.086    -.0004885    .0071206
                   3  |   .0048817   .0018669     2.61   0.012     .0011318    .0086315
                   4  |   .0140598   .0015056     9.34   0.000     .0110357    .0170839
                      |
                _cons |   .6271038   .0280906    22.32   0.000     .5706822    .6835254
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster s
> tate) 
(sum of wgt is 9,220,846,537)

Linear regression                               Number of obs     =  1,069,676
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5103
                                                Root MSE          =     .41762

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1438147   .0064716   -22.22   0.000    -.1568132   -.1308162
             treat_st |  -.0392645   .0187565    -2.09   0.041    -.0769381   -.0015909
treat_stblackrelwhite |  -.0223464   .0088487    -2.53   0.015    -.0401195   -.0045733
                      |
                state |
                  NH  |   .0801082   .0048486    16.52   0.000     .0703695     .089847
                  VT  |   .0192586   .0019086    10.09   0.000      .015425    .0230922
                  MA  |   .1166404   .0086895    13.42   0.000     .0991871    .1340937
                  RI  |   .0350928   .0087547     4.01   0.000     .0175084    .0526771
                  CT  |   .1303659   .0086021    15.16   0.000     .1130881    .1476438
                  NY  |   .1012896   .0080813    12.53   0.000     .0850579    .1175214
                  NJ  |   .1710916    .009172    18.65   0.000     .1526692     .189514
                  PA  |    .011292   .0066761     1.69   0.097    -.0021173    .0247013
                  OH  |  -.0157478     .00646    -2.44   0.018    -.0287231   -.0027724
                  IN  |   .0060329   .0054265     1.11   0.272    -.0048665    .0169323
                  IL  |   .0844341   .0073179    11.54   0.000     .0697357    .0991325
                  MI  |   .0536479    .007232     7.42   0.000      .039122    .0681738
                  WI  |   .0178894   .0050919     3.51   0.001      .007662    .0281169
                  MN  |   .0607509   .0070051     8.67   0.000     .0466807    .0748211
                  IA  |   .0151996   .0173413     0.88   0.385    -.0196315    .0500306
                  MO  |  -.0209918   .0062696    -3.35   0.002    -.0335847   -.0083989
                  ND  |   .0218077   .0181005     1.20   0.234    -.0145483    .0581637
                  SD  |  -.0464258   .0173061    -2.68   0.010     -.081186   -.0116656
                  NE  |  -.0333815   .0170518    -1.96   0.056    -.0676311    .0008682
                  KS  |  -.0053267   .0177943    -0.30   0.766    -.0410676    .0304142
                  DE  |    .050505   .0023774    21.24   0.000     .0457299    .0552802
                  MD  |   .1212972    .009244    13.12   0.000     .1027301    .1398643
                  DC  |   .1798287   .0114041    15.77   0.000     .1569228    .2027345
                  VA  |   .1160008   .0180759     6.42   0.000     .0796942    .1523073
                  WV  |   -.035635   .0045513    -7.83   0.000    -.0447766   -.0264934
                  NC  |   .0088751   .0187078     0.47   0.637    -.0287006    .0464508
                  SC  |  -.0091853   .0191735    -0.48   0.634    -.0476964    .0293258
                  GA  |   .0579571    .019262     3.01   0.004     .0192682     .096646
                  FL  |  -.0096909   .0198432    -0.49   0.627    -.0495471    .0301652
                  KY  |  -.0390552   .0046797    -8.35   0.000    -.0484546   -.0296558
                  TN  |  -.0278856   .0187996    -1.48   0.144    -.0656456    .0098744
                  AL  |  -.0028427   .0192136    -0.15   0.883    -.0414344    .0357489
                  MS  |  -.0252462   .0203873    -1.24   0.221    -.0661952    .0157029
                  AR  |   -.071323   .0190851    -3.74   0.000    -.1096565   -.0329894
                  LA  |   .0253337   .0199195     1.27   0.209    -.0146758    .0653433
                  OK  |  -.0595434   .0105445    -5.65   0.000    -.0807227   -.0383641
                  TX  |   .0614332   .0194297     3.16   0.003     .0224075     .100459
                  MT  |  -.0352453   .0014442   -24.40   0.000    -.0381462   -.0323445
                  ID  |  -.0006374   .0186705    -0.03   0.973    -.0381383    .0368634
                  WY  |   .1591859   .0198288     8.03   0.000     .1193586    .1990132
                  CO  |   .0293407   .0086115     3.41   0.001     .0120441    .0466374
                  NM  |  -.0330339   .0058209    -5.68   0.000    -.0447255   -.0213424
                  AZ  |   .0334272   .0197161     1.70   0.096    -.0061736    .0730281
                  UT  |  -.0013002   .0183117    -0.07   0.944    -.0380803    .0354799
                  NV  |   .1143041   .0202769     5.64   0.000     .0735768    .1550314
                  WA  |   .1008185   .0076903    13.11   0.000     .0853721    .1162649
                  OR  |   .0297551    .007069     4.21   0.000     .0155567    .0439536
                  CA  |   .1659482   .0092501    17.94   0.000     .1473689    .1845275
                  AK  |   .2492672   .0066023    37.75   0.000     .2360061    .2625284
                  HI  |   .1071147   .0067946    15.76   0.000     .0934675     .120762
                      |
                 year |
                1990  |  -.0110855   .0027325    -4.06   0.000    -.0165738   -.0055972
                1991  |   -.018401   .0046099    -3.99   0.000    -.0276603   -.0091417
                1992  |   -.015241   .0053205    -2.86   0.006    -.0259275   -.0045545
                1993  |  -.0265668    .004204    -6.32   0.000    -.0350107    -.018123
                1996  |  -.0373443   .0049187    -7.59   0.000    -.0472238   -.0274648
                1997  |  -.0242591   .0046657    -5.20   0.000    -.0336304   -.0148877
                1998  |   -.004028   .0040099    -1.00   0.320    -.0120822    .0040262
                1999  |   .0168717   .0052518     3.21   0.002     .0063231    .0274203
                2000  |   .0235325   .0053959     4.36   0.000     .0126945    .0343706
                2001  |   .0427393    .005441     7.86   0.000     .0318107    .0536679
                2002  |    .055626   .0055278    10.06   0.000      .044523    .0667291
                2003  |    .047286   .0058806     8.04   0.000     .0354744    .0590976
                2004  |   .0367713    .005267     6.98   0.000     .0261922    .0473504
                2005  |   .0206222   .0057529     3.58   0.001     .0090671    .0321772
                2006  |   .0146543   .0059929     2.45   0.018     .0026173    .0266914
                2007  |   .0153025   .0071987     2.13   0.038     .0008434    .0297616
                2008  |   .0168111   .0070601     2.38   0.021     .0026305    .0309917
                2009  |   .0495029   .0106571     4.65   0.000     .0280976    .0709082
                2010  |   .0427627    .009159     4.67   0.000     .0243663     .061159
                2011  |   .0159753    .008982     1.78   0.081    -.0020656    .0340161
                2012  |   .0091516   .0100231     0.91   0.366    -.0109804    .0292836
                2013  |   .0034293   .0094238     0.36   0.717    -.0154991    .0223576
                2014  |  -.0053912   .0085657    -0.63   0.532     -.022596    .0118135
                2015  |   .0103503   .0066764     1.55   0.127    -.0030595    .0237602
                2016  |   .0226508   .0071382     3.17   0.003     .0083133    .0369883
                2017  |   .0259078    .007988     3.24   0.002     .0098634    .0419522
                2018  |     .03266   .0079387     4.11   0.000     .0167146    .0486054
                2019  |   .0514771   .0081147     6.34   0.000     .0351781     .067776
                      |
                 nind |
                   2  |   .0847046   .0264122     3.21   0.002     .0316542     .137755
                   3  |   .1049139   .0220647     4.75   0.000     .0605956    .1492321
                   4  |  -.0791443   .0237719    -3.33   0.002    -.1268915   -.0313971
                   5  |   .1437854   .0231884     6.20   0.000     .0972102    .1903607
                   6  |   .0988651   .0258364     3.83   0.000     .0469711    .1507591
                   7  |   .0022034   .0250417     0.09   0.930    -.0480944    .0525012
                   8  |  -.0562173   .0249624    -2.25   0.029    -.1063559   -.0060788
                   9  |  -.0623825   .0275127    -2.27   0.028    -.1176434   -.0071216
                  10  |  -.0951821   .0260203    -3.66   0.001    -.1474454   -.0429189
                  11  |   .1180814   .0257688     4.58   0.000     .0663233    .1698395
                      |
                 educ |    .067927   .0016877    40.25   0.000     .0645373    .0713168
                exper |   .0458239   .0017751    25.81   0.000     .0422585    .0493893
               exper2 |  -.0009631   .0000956   -10.07   0.000    -.0011551   -.0007711
               exper3 |   5.19e-06   2.79e-06     1.86   0.069    -4.18e-07    .0000108
               exper4 |   2.94e-08   2.96e-08     0.99   0.326    -3.01e-08    8.89e-08
                 edex |  -.0004564   .0000618    -7.39   0.000    -.0005805   -.0003323
                      |
                ee_cl |
                   2  |  -.0592578   .0045366   -13.06   0.000    -.0683698   -.0501458
                   3  |  -.0680522   .0060549   -11.24   0.000    -.0802138   -.0558906
                   4  |  -.0267614   .0107263    -2.49   0.016    -.0483058    -.005217
                   5  |  -.1341943    .005685   -23.60   0.000     -.145613   -.1227756
                   6  |  -.0851781   .0054355   -15.67   0.000    -.0960957   -.0742605
                   7  |  -.0612174    .006764    -9.05   0.000    -.0748034   -.0476315
                   8  |   .0278073   .0115769     2.40   0.020     .0045543    .0510603
                   9  |  -.1528958   .0072888   -20.98   0.000    -.1675358   -.1382557
                  10  |  -.0967169   .0077246   -12.52   0.000    -.1122322   -.0812016
                  11  |  -.0580716   .0081825    -7.10   0.000    -.0745066   -.0416366
                  12  |   .0305411   .0116802     2.61   0.012     .0070807    .0540016
                  13  |  -.0777206   .0124468    -6.24   0.000    -.1027208   -.0527204
                  14  |  -.0756666   .0094803    -7.98   0.000    -.0947084   -.0566248
                  15  |  -.0480152   .0094141    -5.10   0.000     -.066924   -.0291064
                  16  |   .0293725   .0127099     2.31   0.025     .0038438    .0549011
                      |
                 marr |   .1234821   .0023309    52.98   0.000     .1188004    .1281638
                partt |  -.2093302   .0061448   -34.07   0.000    -.2216724   -.1969879
               public |   .0158732   .0074058     2.14   0.037     .0009982    .0307483
                 cmsa |   .1453259   .0089312    16.27   0.000      .127387    .1632648
                      |
                nocc2 |
                   2  |   -.139974   .0035646   -39.27   0.000    -.1471338   -.1328142
                   3  |  -.0389461   .0059555    -6.54   0.000    -.0509082    -.026984
                   4  |  -.2919208   .0094016   -31.05   0.000    -.3108045   -.2730371
                   5  |  -.0778123   .0069239   -11.24   0.000    -.0917193   -.0639054
                   6  |  -.3672944   .0062223   -59.03   0.000    -.3797923   -.3547965
                   7  |  -.2298328   .0052509   -43.77   0.000    -.2403794   -.2192861
                   8  |  -.1005409   .0107624    -9.34   0.000    -.1221579   -.0789239
                   9  |  -.3879968   .0035642  -108.86   0.000    -.3951558   -.3808379
                  10  |  -.3268977   .0049765   -65.69   0.000    -.3368933   -.3169022
                  11  |   -.222974   .0055029   -40.52   0.000    -.2340268   -.2119212
                  12  |  -.3765067    .005483   -68.67   0.000    -.3875197   -.3654937
                      |
                unemp |  -.0058833   .0020038    -2.94   0.005    -.0099081   -.0018585
                      |
              quarter |
                   2  |   .0033031   .0018892     1.75   0.087    -.0004915    .0070976
                   3  |   .0048754   .0018779     2.60   0.012     .0011036    .0086472
                   4  |   .0140602   .0014955     9.40   0.000     .0110563    .0170641
                      |
                _cons |   .6548217   .0333155    19.66   0.000     .5879056    .7217378
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all_unemp

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exp
> er3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(
> cluster state) 
(sum of wgt is 9,220,846,537)

Linear regression                               Number of obs     =  1,069,676
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5097
                                                Root MSE          =     .41787

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1445509   .0063595   -22.73   0.000    -.1573243   -.1317775
             treat_st |  -.0186037   .0105989    -1.76   0.085    -.0398922    .0026848
treat_stblackrelwhite |  -.0222434   .0087409    -2.54   0.014       -.0398   -.0046868
                      |
                state |
                  NH  |   .1392516   .0094899    14.67   0.000     .1201906    .1583126
                  VT  |  -.0346933   .0089445    -3.88   0.000    -.0526589   -.0167276
                  MA  |   -.010716   .0140361    -0.76   0.449    -.0389083    .0174763
                  RI  |  -.0364664   .0180726    -2.02   0.049    -.0727663   -.0001665
                  CT  |   .1068052   .0166028     6.43   0.000     .0734576    .1401529
                  NY  |   .1780174   .0165893    10.73   0.000     .1446968    .2113379
                  NJ  |   .1833461   .0180397    10.16   0.000     .1471124    .2195798
                  PA  |  -.0221951   .0144274    -1.54   0.130    -.0511733    .0067831
                  OH  |   .1469827   .0181514     8.10   0.000     .1105246    .1834408
                  IN  |   .1512733   .0390525     3.87   0.000     .0728341    .2297126
                  IL  |   .1831384   .0138866    13.19   0.000     .1552463    .2110305
                  MI  |   .4919065   .0355161    13.85   0.000     .4205703    .5632426
                  WI  |  -.0560149   .0309772    -1.81   0.077    -.1182344    .0062046
                  MN  |  -.0974027   .0144844    -6.72   0.000    -.1264954   -.0683099
                  IA  |  -.0996498   .0116573    -8.55   0.000    -.1230642   -.0762354
                  MO  |   .0093421   .0114826     0.81   0.420    -.0137212    .0324055
                  ND  |   -1.08911   .0162059   -67.20   0.000    -1.121661    -1.05656
                  SD  |  -.5148549   .0197727   -26.04   0.000    -.5545696   -.4751402
                  NE  |  -.3149748   .0124069   -25.39   0.000    -.3398948   -.2900548
                  KS  |  -.0903307    .015234    -5.93   0.000    -.1209291   -.0597323
                  DE  |   .2360108   .0135655    17.40   0.000     .2087637    .2632579
                  MD  |  -.1689437   .0189084    -8.93   0.000    -.2069225    -.130965
                  DC  |  -.2136888   .0182811   -11.69   0.000    -.2504074   -.1769701
                  VA  |  -.1182511   .0134754    -8.78   0.000    -.1453173   -.0911849
                  WV  |   .1173305   .0107584    10.91   0.000     .0957217    .1389394
                  NC  |   .0671077   .0103918     6.46   0.000     .0462352    .0879802
                  SC  |   .0650055   .0118821     5.47   0.000     .0411395    .0888715
                  GA  |   .0622905   .0116884     5.33   0.000     .0388136    .0857674
                  FL  |   .0441617   .0192101     2.30   0.026     .0055771    .0827463
                  KY  |   .0842421   .0183212     4.60   0.000     .0474428    .1210413
                  TN  |   .0018983   .0136639     0.14   0.890    -.0255465    .0293431
                  AL  |  -.1209572    .012814    -9.44   0.000    -.1466949   -.0952196
                  MS  |  -.1249908   .0132778    -9.41   0.000      -.15166   -.0983215
                  AR  |  -.0693034   .0117604    -5.89   0.000    -.0929248    -.045682
                  LA  |  -.1491563   .0159843    -9.33   0.000    -.1812618   -.1170509
                  OK  |  -.2451481   .0478525    -5.12   0.000    -.3412628   -.1490335
                  TX  |  -.1435196   .0198072    -7.25   0.000    -.1833035   -.1037357
                  MT  |  -.3440396   .0116599   -29.51   0.000    -.3674593     -.32062
                  ID  |    .197246   .0135867    14.52   0.000     .1699563    .2245358
                  WY  |  -.7726058   .0137998   -55.99   0.000    -.8003236    -.744888
                  CO  |  -.1479625   .0126014   -11.74   0.000    -.1732733   -.1226518
                  NM  |  -.3200542   .0134226   -23.84   0.000    -.3470143   -.2930941
                  AZ  |  -.1877672   .0167418   -11.22   0.000    -.2213941   -.1541404
                  UT  |   -.226749   .0175599   -12.91   0.000    -.2620192   -.1914788
                  NV  |  -.0399386   .0208891    -1.91   0.062    -.0818956    .0020184
                  WA  |  -.2190239    .011462   -19.11   0.000    -.2420459   -.1960019
                  OR  |   .0585303   .0081331     7.20   0.000     .0421944    .0748661
                  CA  |   .1255975   .0179079     7.01   0.000     .0896285    .1615665
                  AK  |   .6787416    .015866    42.78   0.000     .6468738    .7106093
                  HI  |  -.0766044   .0165359    -4.63   0.000    -.1098178    -.043391
                      |
        state#c.lyear |
                  ME  |    .001359   .0001221    11.13   0.000     .0011137    .0016042
                  NH  |    .000812    .000232     3.50   0.001      .000346     .001278
                  VT  |   .0018828   .0000629    29.94   0.000     .0017566    .0020091
                  MA  |   .0025971   .0000843    30.81   0.000     .0024278    .0027664
                  RI  |   .0020647   .0000719    28.71   0.000     .0019203    .0022092
                  CT  |   .0015952   .0000954    16.72   0.000     .0014036    .0017868
                  NY  |   .0006136   .0000602    10.20   0.000     .0004927    .0007345
                  NJ  |   .0012531   .0000725    17.28   0.000     .0011074    .0013988
                  PA  |   .0016885   .0000616    27.40   0.000     .0015648    .0018123
                  OH  |  -.0002059   .0000493    -4.17   0.000     -.000305   -.0001068
                  IN  |  -.0000821   .0004098    -0.20   0.842    -.0009053    .0007411
                  IL  |   .0004019   .0000786     5.11   0.000     .0002441    .0005597
                  MI  |  -.0029582   .0003379    -8.75   0.000    -.0036369   -.0022796
                  WI  |   .0020441   .0003018     6.77   0.000      .001438    .0026503
                  MN  |    .002893   .0000639    45.30   0.000     .0027647    .0030213
                  IA  |   .0022801   .0000844    27.01   0.000     .0021105    .0024497
                  MO  |   .0010747   .0000795    13.51   0.000      .000915    .0012344
                  ND  |   .0118503   .0000787   150.56   0.000     .0116922    .0120084
                  SD  |   .0057634   .0000489   117.86   0.000     .0056652    .0058616
                  NE  |    .003888   .0001036    37.54   0.000     .0036799     .004096
                  KS  |   .0019947   .0000739    26.98   0.000     .0018462    .0021432
                  DE  |  -.0005733   .0001098    -5.22   0.000    -.0007939   -.0003527
                  MD  |   .0041492   .0000901    46.06   0.000     .0039683    .0043301
                  DC  |   .0051444   .0001369    37.57   0.000     .0048694    .0054195
                  VA  |   .0034394   .0001285    26.76   0.000     .0031812    .0036976
                  WV  |  -.0001505   .0001863    -0.81   0.423    -.0005247    .0002238
                  NC  |   .0005998   .0001678     3.57   0.001     .0002628    .0009368
                  SC  |   .0004485   .0001232     3.64   0.001      .000201     .000696
                  GA  |   .0011247    .000131     8.59   0.000     .0008616    .0013878
                  FL  |   .0006622   .0000707     9.37   0.000     .0005203    .0008041
                  KY  |   .0001605    .000204     0.79   0.435    -.0002492    .0005702
                  TN  |   .0008798   .0000996     8.83   0.000     .0006797    .0010799
                  AL  |   .0023089   .0001127    20.49   0.000     .0020826    .0025352
                  MS  |   .0021295   .0001209    17.61   0.000     .0018866    .0023723
                  AR  |   .0011515   .0001852     6.22   0.000     .0007796    .0015234
                  LA  |   .0028564   .0001228    23.25   0.000     .0026097    .0031032
                  OK  |   .0030707   .0005317     5.77   0.000     .0020027    .0041388
                  TX  |   .0031385   .0000742    42.32   0.000     .0029895    .0032874
                  MT  |    .004351   .0000478    90.94   0.000     .0042549    .0044471
                  ID  |  -.0007197   .0002035    -3.54   0.001    -.0011286   -.0003109
                  WY  |   .0098927   .0000627   157.83   0.000     .0097668    .0100186
                  CO  |   .0030726    .000087    35.31   0.000     .0028978    .0032473
                  NM  |   .0041187   .0002373    17.35   0.000      .003642    .0045953
                  AZ  |   .0033088   .0000915    36.15   0.000     .0031249    .0034926
                  UT  |   .0033345   .0000737    45.23   0.000     .0031864    .0034826
                  NV  |   .0026598   .0000768    34.63   0.000     .0025056    .0028141
                  WA  |   .0044401   .0000908    48.92   0.000     .0042578    .0046224
                  OR  |   .0010949   .0001239     8.84   0.000      .000846    .0013437
                  CA  |   .0017592   .0000636    27.67   0.000     .0016315    .0018869
                  AK  |  -.0028526   .0000475   -60.05   0.000     -.002948   -.0027572
                  HI  |   .0031532   .0000794    39.73   0.000     .0029938    .0033126
                      |
                 nind |
                   2  |   .0867872   .0263189     3.30   0.002     .0339241    .1396503
                   3  |   .1056352   .0219299     4.82   0.000     .0615878    .1496827
                   4  |  -.0777453   .0237382    -3.28   0.002    -.1254249   -.0300657
                   5  |   .1453477   .0230504     6.31   0.000     .0990496    .1916459
                   6  |   .1003048   .0257042     3.90   0.000     .0486764    .1519333
                   7  |   .0036181   .0249016     0.15   0.885    -.0463983    .0536345
                   8  |  -.0547843   .0248864    -2.20   0.032    -.1047701   -.0047984
                   9  |  -.0608049   .0274308    -2.22   0.031    -.1159013   -.0057085
                  10  |  -.0937028    .025898    -3.62   0.001    -.1457205   -.0416851
                  11  |   .1191519   .0256838     4.64   0.000     .0675644    .1707393
                      |
                 educ |   .0678919   .0016796    40.42   0.000     .0645184    .0712654
                exper |   .0456375   .0017424    26.19   0.000     .0421379    .0491372
               exper2 |  -.0009405   .0000955    -9.85   0.000    -.0011323   -.0007486
               exper3 |   4.46e-06   2.80e-06     1.60   0.117    -1.15e-06    .0000101
               exper4 |   3.57e-08   2.97e-08     1.20   0.234    -2.39e-08    9.53e-08
                 edex |  -.0004553   .0000606    -7.52   0.000    -.0005769   -.0003336
                      |
                ee_cl |
                   2  |  -.0605194   .0046352   -13.06   0.000    -.0698296   -.0512092
                   3  |  -.0690647   .0061793   -11.18   0.000    -.0814762   -.0566531
                   4  |  -.0279417   .0108004    -2.59   0.013     -.049635   -.0062484
                   5  |  -.1371465   .0056457   -24.29   0.000    -.1484863   -.1258068
                   6  |  -.0874993   .0053825   -16.26   0.000    -.0983104   -.0766883
                   7  |  -.0626339   .0068286    -9.17   0.000    -.0763496   -.0489182
                   8  |   .0268897   .0116591     2.31   0.025     .0034718    .0503077
                   9  |  -.1547194   .0072259   -21.41   0.000    -.1692331   -.1402057
                  10  |  -.0975558   .0076431   -12.76   0.000    -.1129074   -.0822042
                  11  |  -.0591851    .008215    -7.20   0.000    -.0756854   -.0426847
                  12  |   .0290066   .0117341     2.47   0.017     .0054378    .0525753
                  13  |  -.0792059   .0123417    -6.42   0.000    -.1039949    -.054417
                  14  |  -.0766792    .009468    -8.10   0.000    -.0956962   -.0576622
                  15  |  -.0482021   .0094895    -5.08   0.000    -.0672624   -.0291419
                  16  |   .0279904   .0126637     2.21   0.032     .0025547    .0534261
                      |
                 marr |   .1233111   .0023264    53.01   0.000     .1186384    .1279838
                partt |  -.2093695   .0060962   -34.34   0.000     -.221614    -.197125
               public |   .0157428   .0073551     2.14   0.037     .0009695     .030516
                 cmsa |   .1444626   .0090372    15.99   0.000     .1263109    .1626143
                      |
                nocc2 |
                   2  |  -.1407607   .0035038   -40.17   0.000    -.1477983   -.1337231
                   3  |  -.0394152   .0059543    -6.62   0.000    -.0513749   -.0274556
                   4  |  -.2919844   .0093218   -31.32   0.000    -.3107079    -.273261
                   5  |  -.0783832   .0069292   -11.31   0.000    -.0923009   -.0644654
                   6  |  -.3677205   .0061647   -59.65   0.000    -.3801027   -.3553383
                   7  |  -.2299175   .0052745   -43.59   0.000    -.2405116   -.2193234
                   8  |  -.0998777   .0107263    -9.31   0.000    -.1214221   -.0783333
                   9  |  -.3884538   .0035302  -110.04   0.000    -.3955443   -.3813632
                  10  |  -.3279656   .0048041   -68.27   0.000    -.3376148   -.3183164
                  11  |   -.223319   .0054075   -41.30   0.000    -.2341803   -.2124578
                  12  |  -.3771875   .0054091   -69.73   0.000     -.388052    -.366323
                      |
                unemp |  -.0058726   .0007074    -8.30   0.000    -.0072934   -.0044518
                      |
              quarter |
                   2  |   .0030266   .0019038     1.59   0.118    -.0007973    .0068506
                   3  |   .0044925   .0018817     2.39   0.021      .000713     .008272
                   4  |   .0135852   .0015074     9.01   0.000     .0105576    .0166128
                      |
                _cons |    .526726   .0291575    18.06   0.000     .4681614    .5852907
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_mal_all_sltt  

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 9,024,033,393)

Linear regression                               Number of obs     =  1,080,732
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5037
                                                Root MSE          =     .39284

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0660603   .0065671   -10.06   0.000    -.0792507   -.0528699
             treat_st |  -.0313412    .008319    -3.77   0.000    -.0480504    -.014632
treat_stblackrelwhite |  -.0398885   .0080037    -4.98   0.000    -.0559643   -.0238127
                      |
                state |
                  NH  |   .0569779   .0033787    16.86   0.000     .0501917    .0637642
                  VT  |   .0361018   .0007167    50.37   0.000     .0346623    .0375413
                  MA  |    .099604   .0079736    12.49   0.000     .0835885    .1156195
                  RI  |   .0238283   .0078349     3.04   0.004     .0080914    .0395652
                  CT  |    .110848   .0079271    13.98   0.000      .094926      .12677
                  NY  |   .0643259   .0073871     8.71   0.000     .0494885    .0791632
                  NJ  |   .1276312   .0085021    15.01   0.000     .1105543    .1447082
                  PA  |   -.030987   .0063366    -4.89   0.000    -.0437145   -.0182595
                  OH  |  -.0627682    .006074   -10.33   0.000    -.0749682   -.0505682
                  IN  |  -.0652085   .0045218   -14.42   0.000    -.0742909   -.0561262
                  IL  |   .0016364   .0069191     0.24   0.814     -.012261    .0155338
                  MI  |  -.0167123   .0060975    -2.74   0.008    -.0289594   -.0044652
                  WI  |  -.0123439    .004451    -2.77   0.008     -.021284   -.0034038
                  MN  |   .0472736   .0057364     8.24   0.000     .0357516    .0587956
                  IA  |  -.0284242   .0079958    -3.55   0.001    -.0444842   -.0123642
                  MO  |  -.0827349   .0058788   -14.07   0.000    -.0945429   -.0709269
                  ND  |  -.0547885   .0086135    -6.36   0.000    -.0720893   -.0374877
                  SD  |  -.0757318   .0082874    -9.14   0.000    -.0923775    -.059086
                  NE  |  -.0656139   .0081906    -8.01   0.000    -.0820653   -.0491626
                  KS  |  -.0640644   .0082715    -7.75   0.000    -.0806783   -.0474505
                  DE  |   .0496125   .0023347    21.25   0.000     .0449231    .0543019
                  MD  |   .0952246   .0089512    10.64   0.000     .0772456    .1132035
                  DC  |   .1481072   .0116397    12.72   0.000     .1247283    .1714862
                  VA  |   .0547155   .0093181     5.87   0.000     .0359995    .0734315
                  WV  |  -.1471354   .0014119  -104.21   0.000    -.1499714   -.1442994
                  NC  |  -.0336681   .0083745    -4.02   0.000    -.0504887   -.0168474
                  SC  |  -.0752603    .008339    -9.03   0.000    -.0920098   -.0585109
                  GA  |  -.0053547   .0090865    -0.59   0.558    -.0236054    .0128961
                  FL  |  -.0345024   .0098533    -3.50   0.001    -.0542934   -.0147114
                  KY  |  -.0910946    .003791   -24.03   0.000     -.098709   -.0834801
                  TN  |  -.0766555   .0085854    -8.93   0.000    -.0938998   -.0594112
                  AL  |  -.0903002   .0083737   -10.78   0.000    -.1071192   -.0734812
                  MS  |  -.1149963    .008061   -14.27   0.000    -.1311874   -.0988052
                  AR  |  -.1155685   .0080207   -14.41   0.000    -.1316785   -.0994585
                  LA  |  -.0965502   .0092612   -10.43   0.000    -.1151519   -.0779485
                  OK  |  -.1354673   .0062841   -21.56   0.000    -.1480893   -.1228453
                  TX  |  -.0059946   .0094915    -0.63   0.531    -.0250589    .0130697
                  MT  |  -.0781215   .0008434   -92.62   0.000    -.0798156   -.0764274
                  ID  |  -.0441241   .0080431    -5.49   0.000    -.0602791   -.0279691
                  WY  |   .0020013   .0084772     0.24   0.814    -.0150257    .0190284
                  CO  |  -.0063716    .007845    -0.81   0.421    -.0221286    .0093855
                  NM  |  -.0975796   .0049174   -19.84   0.000    -.1074564   -.0877028
                  AZ  |   .0034745   .0097013     0.36   0.722    -.0160111    .0229602
                  UT  |  -.0501341   .0093965    -5.34   0.000    -.0690075   -.0312608
                  NV  |   .0665226   .0099627     6.68   0.000     .0465119    .0865333
                  WA  |   .0574688   .0070678     8.13   0.000     .0432726     .071665
                  OR  |  -.0058126   .0064456    -0.90   0.371     -.018759    .0071338
                  CA  |   .1244569     .00843    14.76   0.000     .1075248     .141389
                  AK  |   .1808666   .0044782    40.39   0.000     .1718718    .1898614
                  HI  |   .0717119     .00571    12.56   0.000     .0602431    .0831807
                      |
                 year |
                1990  |  -.0062933   .0027477    -2.29   0.026    -.0118122   -.0007743
                1991  |  -.0033188   .0024466    -1.36   0.181    -.0082328    .0015953
                1992  |   .0153094   .0030516     5.02   0.000     .0091801    .0214387
                1993  |   .0128165   .0034331     3.73   0.000     .0059208    .0197122
                1996  |   .0028024   .0039556     0.71   0.482    -.0051427    .0107475
                1997  |   .0153358   .0036534     4.20   0.000     .0079977     .022674
                1998  |   .0440043   .0033494    13.14   0.000     .0372769    .0507317
                1999  |   .0608131   .0039054    15.57   0.000     .0529688    .0686573
                2000  |   .0736837   .0041407    17.80   0.000      .065367    .0820005
                2001  |   .0850345   .0044559    19.08   0.000     .0760845    .0939845
                2002  |   .0976159   .0046202    21.13   0.000     .0883361    .1068958
                2003  |   .1037035    .004337    23.91   0.000     .0949925    .1124145
                2004  |   .0949611   .0046405    20.46   0.000     .0856404    .1042819
                2005  |   .0853178   .0048786    17.49   0.000     .0755188    .0951167
                2006  |    .080885   .0043442    18.62   0.000     .0721594    .0896106
                2007  |   .0808252   .0052466    15.41   0.000     .0702871    .0913632
                2008  |   .0732089    .006225    11.76   0.000     .0607056    .0857121
                2009  |   .0907702   .0049191    18.45   0.000     .0808899    .1006506
                2010  |   .0880982   .0051728    17.03   0.000     .0777083    .0984882
                2011  |   .0696176   .0053058    13.12   0.000     .0589604    .0802747
                2012  |    .052497   .0061684     8.51   0.000     .0401075    .0648866
                2013  |   .0551911   .0063718     8.66   0.000     .0423929    .0679893
                2014  |   .0506074   .0060025     8.43   0.000     .0385511    .0626638
                2015  |   .0662614   .0052941    12.52   0.000     .0556279     .076895
                2016  |   .0784522   .0063355    12.38   0.000      .065727    .0911773
                2017  |   .0868888   .0070639    12.30   0.000     .0727005    .1010771
                2018  |   .0913155   .0065537    13.93   0.000      .078152     .104479
                2019  |   .1022736   .0061364    16.67   0.000     .0899483    .1145988
                      |
                 nind |
                   2  |   .0611767   .0407831     1.50   0.140    -.0207386     .143092
                   3  |    .134663   .0382047     3.52   0.001     .0579266    .2113995
                   4  |  -.0822638   .0387084    -2.13   0.039     -.160012   -.0045156
                   5  |   .1580995   .0373967     4.23   0.000     .0829861    .2332129
                   6  |   .0905719   .0390239     2.32   0.024       .01219    .1689537
                   7  |     .03601   .0403988     0.89   0.377    -.0451335    .1171534
                   8  |  -.0173719   .0414382    -0.42   0.677     -.100603    .0658593
                   9  |  -.0689597   .0446143    -1.55   0.128    -.1585701    .0206508
                  10  |  -.0796596   .0395449    -2.01   0.049    -.1590878   -.0002314
                  11  |   .0729015    .041234     1.77   0.083    -.0099194    .1557224
                      |
                 educ |   .0913751    .002337    39.10   0.000     .0866811    .0960691
                exper |   .0478315   .0021335    22.42   0.000     .0435463    .0521167
               exper2 |  -.0015718   .0000972   -16.17   0.000     -.001767   -.0013766
               exper3 |   .0000244   2.73e-06     8.96   0.000      .000019    .0000299
               exper4 |  -1.28e-07   2.77e-08    -4.64   0.000    -1.84e-07   -7.27e-08
                 edex |  -.0005233   .0000899    -5.82   0.000    -.0007038   -.0003428
                      |
                ee_cl |
                   2  |  -.1257075   .0050934   -24.68   0.000    -.1359379   -.1154771
                   3  |  -.1638526   .0077736   -21.08   0.000    -.1794663   -.1482389
                   4  |  -.1680013   .0124902   -13.45   0.000    -.1930886   -.1429139
                   5  |  -.1528263   .0081873   -18.67   0.000    -.1692709   -.1363816
                   6  |  -.1681972   .0087633   -19.19   0.000    -.1857987   -.1505957
                   7  |  -.1762204    .010161   -17.34   0.000    -.1966294   -.1558114
                   8  |  -.1107598   .0131172    -8.44   0.000    -.1371065    -.084413
                   9  |  -.1544091   .0100397   -15.38   0.000    -.1745744   -.1342437
                  10  |  -.1758314   .0108982   -16.13   0.000    -.1977211   -.1539417
                  11  |  -.1699286    .011235   -15.12   0.000    -.1924947   -.1473625
                  12  |   -.117392    .011874    -9.89   0.000    -.1412417   -.0935424
                  13  |  -.1079731   .0146776    -7.36   0.000    -.1374539   -.0784924
                  14  |    -.15585   .0115577   -13.48   0.000    -.1790643   -.1326358
                  15  |  -.1378531   .0118869   -11.60   0.000    -.1617287   -.1139775
                  16  |  -.1034802   .0123209    -8.40   0.000    -.1282274    -.078733
                      |
                 marr |   .0337925   .0022009    15.35   0.000     .0293719    .0382132
                partt |  -.1405306   .0033137   -42.41   0.000    -.1471863   -.1338748
               public |   .0602947   .0060079    10.04   0.000     .0482275    .0723619
                 cmsa |   .1528057   .0080233    19.05   0.000     .1366904    .1689211
                      |
                nocc2 |
                   2  |  -.1309435   .0030291   -43.23   0.000    -.1370278   -.1248593
                   3  |  -.0389517   .0068531    -5.68   0.000    -.0527164   -.0251869
                   4  |  -.2800685   .0066191   -42.31   0.000    -.2933634   -.2667736
                   5  |   .0508455   .0062071     8.19   0.000     .0383781    .0633128
                   6  |  -.3243109   .0043402   -74.72   0.000    -.3330285   -.3155932
                   7  |  -.3502052   .0042518   -82.37   0.000    -.3587453   -.3416652
                   8  |   -.164512   .0077512   -21.22   0.000    -.1800808   -.1489431
                   9  |  -.4036759   .0051346   -78.62   0.000    -.4139891   -.3933627
                  10  |  -.4086639   .0090693   -45.06   0.000    -.4268801   -.3904478
                  11  |  -.1648205   .0087486   -18.84   0.000    -.1823926   -.1472483
                  12  |  -.3811857   .0077277   -49.33   0.000    -.3967073   -.3656641
                      |
              quarter |
                   2  |   .0086527   .0013332     6.49   0.000     .0059749    .0113306
                   3  |    .017671   .0016512    10.70   0.000     .0143545    .0209875
                   4  |   .0205009   .0011329    18.10   0.000     .0182255    .0227763
                      |
                _cons |   .3313307   .0432631     7.66   0.000     .2444343    .4182271
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster s
> tate)
(sum of wgt is 9,024,033,393)

Linear regression                               Number of obs     =  1,080,732
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5037
                                                Root MSE          =     .39283

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.066063   .0065666   -10.06   0.000    -.0792524   -.0528737
             treat_st |  -.0319481    .008659    -3.69   0.001    -.0493403    -.014556
treat_stblackrelwhite |  -.0398934   .0080072    -4.98   0.000    -.0559762   -.0238105
                      |
                state |
                  NH  |   .0543751   .0037434    14.53   0.000     .0468562     .061894
                  VT  |   .0336903   .0016255    20.73   0.000     .0304254    .0369553
                  MA  |   .0997449    .007973    12.51   0.000     .0837307     .115759
                  RI  |   .0262836   .0079218     3.32   0.002     .0103721    .0421951
                  CT  |   .1111491   .0079201    14.03   0.000      .095241    .1270572
                  NY  |   .0660589   .0073984     8.93   0.000     .0511989    .0809189
                  NJ  |   .1289235   .0084814    15.20   0.000      .111888    .1459589
                  PA  |  -.0300599   .0063228    -4.75   0.000    -.0427597   -.0173601
                  OH  |   -.061293   .0060808   -10.08   0.000    -.0735067   -.0490793
                  IN  |  -.0649204   .0045399   -14.30   0.000     -.074039   -.0558018
                  IL  |   .0039412   .0069267     0.57   0.572    -.0099714    .0178539
                  MI  |  -.0131853   .0064293    -2.05   0.046    -.0260989   -.0002717
                  WI  |  -.0131717   .0044939    -2.93   0.005     -.022198   -.0041454
                  MN  |   .0454382   .0059312     7.66   0.000      .033525    .0573515
                  IA  |  -.0306397    .008034    -3.81   0.000    -.0467765    -.014503
                  MO  |  -.0822435    .005863   -14.03   0.000    -.0940196   -.0704673
                  ND  |   -.058232   .0085964    -6.77   0.000    -.0754984   -.0409657
                  SD  |  -.0790507    .008306    -9.52   0.000    -.0957337   -.0623676
                  NE  |  -.0694765    .008214    -8.46   0.000    -.0859747   -.0529782
                  KS  |  -.0649987   .0083764    -7.76   0.000    -.0818232   -.0481742
                  DE  |    .048209   .0026033    18.52   0.000     .0429801    .0534378
                  MD  |   .0945179   .0089975    10.50   0.000     .0764459    .1125899
                  DC  |   .1521096    .011544    13.18   0.000     .1289228    .1752964
                  VA  |   .0533138   .0093683     5.69   0.000     .0344969    .0721306
                  WV  |  -.1437765   .0027435   -52.41   0.000    -.1492869   -.1382661
                  NC  |  -.0323143   .0087994    -3.67   0.001    -.0499884   -.0146402
                  SC  |  -.0727256   .0090528    -8.03   0.000    -.0909087   -.0545425
                  GA  |  -.0037061   .0095299    -0.39   0.699    -.0228475    .0154353
                  FL  |  -.0327861   .0102822    -3.19   0.002    -.0534384   -.0121338
                  KY  |  -.0891375   .0040021   -22.27   0.000     -.097176    -.081099
                  TN  |  -.0751155    .009039    -8.31   0.000    -.0932709   -.0569602
                  AL  |   -.087904    .009036    -9.73   0.000    -.1060534   -.0697546
                  MS  |   -.110942   .0092503   -11.99   0.000    -.1295219   -.0923621
                  AR  |  -.1139049   .0085554   -13.31   0.000     -.131089   -.0967208
                  LA  |  -.0937709   .0099687    -9.41   0.000    -.1137936   -.0737482
                  OK  |  -.1362761   .0063052   -21.61   0.000    -.1489405   -.1236118
                  TX  |  -.0044525   .0098915    -0.45   0.655    -.0243201    .0154152
                  MT  |  -.0783689    .000891   -87.95   0.000    -.0801586   -.0765792
                  ID  |  -.0435118   .0083818    -5.19   0.000    -.0603471   -.0266765
                  WY  |   .0007196   .0085897     0.08   0.934    -.0165332    .0179725
                  CO  |  -.0072165   .0079045    -0.91   0.366    -.0230931    .0086601
                  NM  |  -.0959405    .004969   -19.31   0.000    -.1059211   -.0859599
                  AZ  |   .0054456   .0101684     0.54   0.595    -.0149782    .0258695
                  UT  |  -.0515443   .0094574    -5.45   0.000      -.07054   -.0325487
                  NV  |   .0689996   .0105423     6.55   0.000     .0478247    .0901746
                  WA  |   .0594422   .0070939     8.38   0.000     .0451938    .0736906
                  OR  |  -.0030953   .0065668    -0.47   0.639    -.0162852    .0100946
                  CA  |   .1280794   .0085801    14.93   0.000     .1108458     .145313
                  AK  |   .1855109   .0050526    36.72   0.000     .1753624    .1956593
                  HI  |    .069287   .0059871    11.57   0.000     .0572615    .0813125
                      |
                 year |
                1990  |  -.0055715   .0027634    -2.02   0.049    -.0111221    -.000021
                1991  |   .0000383    .003168     0.01   0.990    -.0063248    .0064015
                1992  |   .0200091   .0040935     4.89   0.000     .0117872    .0282311
                1993  |   .0162077   .0039235     4.13   0.000     .0083272    .0240882
                1996  |   .0028865   .0041185     0.70   0.487    -.0053858    .0111587
                1997  |   .0144538   .0036515     3.96   0.000     .0071195    .0217881
                1998  |   .0421648   .0037973    11.10   0.000     .0345377    .0497919
                1999  |   .0583964   .0037554    15.55   0.000     .0508533    .0659394
                2000  |    .070863   .0042055    16.85   0.000     .0624161    .0793099
                2001  |   .0838396   .0044693    18.76   0.000     .0748627    .0928165
                2002  |   .0987305   .0047326    20.86   0.000     .0892247    .1082362
                2003  |   .1053036   .0046477    22.66   0.000     .0959685    .1146388
                2004  |   .0956197   .0047044    20.33   0.000     .0861706    .1050688
                2005  |   .0851086   .0049984    17.03   0.000     .0750689    .0951483
                2006  |   .0797039   .0044341    17.98   0.000     .0707977      .08861
                2007  |   .0795451   .0053296    14.93   0.000     .0688403      .09025
                2008  |   .0743924   .0062308    11.94   0.000     .0618775    .0869073
                2009  |   .0994623   .0072198    13.78   0.000     .0849609    .1139636
                2010  |   .0975132   .0066144    14.74   0.000     .0842279    .1107985
                2011  |   .0774702   .0055513    13.96   0.000     .0663201    .0886203
                2012  |   .0584846   .0059662     9.80   0.000     .0465011     .070468
                2013  |   .0598016   .0063576     9.41   0.000     .0470321    .0725712
                2014  |   .0526036   .0057616     9.13   0.000      .041031    .0641761
                2015  |   .0663406   .0052169    12.72   0.000     .0558621    .0768191
                2016  |   .0776905   .0062636    12.40   0.000     .0651097    .0902713
                2017  |   .0850313   .0072933    11.66   0.000     .0703822    .0996803
                2018  |   .0885019   .0072349    12.23   0.000     .0739701    .1030336
                2019  |   .0990033   .0067747    14.61   0.000     .0853959    .1126107
                      |
                 nind |
                   2  |   .0610698   .0407978     1.50   0.141    -.0208749    .1430146
                   3  |   .1345793   .0382209     3.52   0.001     .0578103    .2113483
                   4  |  -.0823039   .0387159    -2.13   0.038    -.1600671   -.0045406
                   5  |    .158071   .0373938     4.23   0.000     .0829633    .2331787
                   6  |   .0905263   .0390354     2.32   0.025     .0121214    .1689312
                   7  |   .0359472   .0404074     0.89   0.378    -.0452135    .1171079
                   8  |  -.0174183   .0414465    -0.42   0.676     -.100666    .0658294
                   9  |  -.0690239   .0446326    -1.55   0.128    -.1586712    .0206233
                  10  |  -.0797064   .0395481    -2.02   0.049    -.1591411   -.0002716
                  11  |   .0728137   .0412509     1.77   0.084    -.0100411    .1556684
                      |
                 educ |   .0913718   .0023405    39.04   0.000     .0866707    .0960729
                exper |   .0478435   .0021321    22.44   0.000     .0435611     .052126
               exper2 |  -.0015728   .0000971   -16.20   0.000    -.0017678   -.0013777
               exper3 |   .0000245   2.73e-06     8.98   0.000      .000019      .00003
               exper4 |  -1.29e-07   2.77e-08    -4.65   0.000    -1.84e-07   -7.31e-08
                 edex |  -.0005233   .0000899    -5.82   0.000    -.0007038   -.0003428
                      |
                ee_cl |
                   2  |  -.1256721   .0051035   -24.62   0.000    -.1359228   -.1154213
                   3  |  -.1637988    .007786   -21.04   0.000    -.1794375   -.1481602
                   4  |  -.1679446   .0125127   -13.42   0.000    -.1930771   -.1428122
                   5  |  -.1528463   .0081835   -18.68   0.000    -.1692834   -.1364092
                   6  |  -.1681818   .0087733   -19.17   0.000    -.1858035   -.1505601
                   7  |  -.1761654   .0101718   -17.32   0.000    -.1965961   -.1557348
                   8  |     -.1107   .0131402    -8.42   0.000    -.1370929   -.0843071
                   9  |  -.1544112   .0100499   -15.36   0.000     -.174597   -.1342255
                  10  |  -.1758096      .0109   -16.13   0.000    -.1977028   -.1539163
                  11  |  -.1698627   .0112449   -15.11   0.000    -.1924487   -.1472766
                  12  |  -.1173242   .0118927    -9.87   0.000    -.1412115    -.093437
                  13  |   -.107957   .0146882    -7.35   0.000    -.1374591    -.078455
                  14  |  -.1557994   .0115593   -13.48   0.000     -.179017   -.1325819
                  15  |  -.1377837   .0118945   -11.58   0.000    -.1616745   -.1138928
                  16  |  -.1034256   .0123338    -8.39   0.000    -.1281988   -.0786525
                      |
                 marr |   .0337871   .0021985    15.37   0.000     .0293713    .0382029
                partt |  -.1404978   .0033163   -42.37   0.000    -.1471588   -.1338368
               public |   .0603153   .0060028    10.05   0.000     .0482583    .0723723
                 cmsa |    .152768   .0080268    19.03   0.000     .1366457    .1688902
                      |
                nocc2 |
                   2  |   -.130959   .0030312   -43.20   0.000    -.1370474   -.1248707
                   3  |  -.0389701   .0068494    -5.69   0.000    -.0527277   -.0252126
                   4  |  -.2800754   .0066158   -42.33   0.000    -.2933636   -.2667871
                   5  |   .0508236     .00621     8.18   0.000     .0383505    .0632967
                   6  |  -.3243141   .0043373   -74.77   0.000    -.3330259   -.3156023
                   7  |  -.3502226   .0042522   -82.36   0.000    -.3587633   -.3416818
                   8  |  -.1645069   .0077604   -21.20   0.000    -.1800941   -.1489197
                   9  |  -.4036816   .0051317   -78.66   0.000    -.4139889   -.3933743
                  10  |  -.4087486   .0090734   -45.05   0.000    -.4269731   -.3905241
                  11  |  -.1648499   .0087506   -18.84   0.000     -.182426   -.1472738
                  12  |  -.3812221   .0077212   -49.37   0.000    -.3967306   -.3657137
                      |
                unemp |  -.0021868   .0013387    -1.63   0.109    -.0048757    .0005021
                      |
              quarter |
                   2  |   .0086612   .0013356     6.48   0.000     .0059786    .0113439
                   3  |   .0176675   .0016519    10.70   0.000     .0143495    .0209855
                   4  |   .0205051   .0011317    18.12   0.000     .0182321    .0227781
                      |
                _cons |   .3417571   .0455681     7.50   0.000      .250231    .4332833
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exp
> er3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(
> cluster state)
(sum of wgt is 9,024,033,393)

Linear regression                               Number of obs     =  1,080,732
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5024
                                                Root MSE          =     .39336

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0670247   .0065091   -10.30   0.000    -.0800987   -.0539507
             treat_st |  -.0546992   .0121036    -4.52   0.000      -.07901   -.0303884
treat_stblackrelwhite |  -.0391621    .008067    -4.85   0.000    -.0553651   -.0229591
                      |
                state |
                  NH  |   .1095655   .0090557    12.10   0.000     .0913767    .1277544
                  VT  |  -.1303838   .0079372   -16.43   0.000    -.1463262   -.1144414
                  MA  |  -.1157528   .0135049    -8.57   0.000    -.1428783   -.0886273
                  RI  |  -.2209207   .0159792   -13.83   0.000    -.2530159   -.1888254
                  CT  |   .0524628   .0164604     3.19   0.002     .0194012    .0855244
                  NY  |  -.0170295   .0155939    -1.09   0.280    -.0483509    .0142918
                  NJ  |   .0286107   .0175703     1.63   0.110    -.0066803    .0639017
                  PA  |  -.0266783   .0144111    -1.85   0.070    -.0556238    .0022671
                  OH  |  -.0676231   .0177834    -3.80   0.000     -.103342   -.0319041
                  IN  |   -.215324   .0428762    -5.02   0.000    -.3014434   -.1292046
                  IL  |  -.0964584   .0136721    -7.06   0.000    -.1239197   -.0689971
                  MI  |  -.0142836   .0377747    -0.38   0.707    -.0901563    .0615891
                  WI  |  -.3281954   .0331222    -9.91   0.000    -.3947233   -.2616675
                  MN  |   -.123523   .0133798    -9.23   0.000    -.1503971    -.096649
                  IA  |  -.1390024   .0131407   -10.58   0.000    -.1653962   -.1126086
                  MO  |  -.0090591   .0109298    -0.83   0.411    -.0310122     .012894
                  ND  |   -.863198   .0152668   -56.54   0.000    -.8938622   -.8325338
                  SD  |   -.439767    .017483   -25.15   0.000    -.4748828   -.4046513
                  NE  |  -.3771222   .0140057   -26.93   0.000    -.4052534    -.348991
                  KS  |  -.1432196   .0172126    -8.32   0.000    -.1777921    -.108647
                  DE  |   .1672469   .0135304    12.36   0.000     .1400704    .1944234
                  MD  |  -.3145324   .0181995   -17.28   0.000    -.3510871   -.2779776
                  DC  |  -.2645033   .0190452   -13.89   0.000    -.3027568   -.2262499
                  VA  |  -.1769198   .0145586   -12.15   0.000    -.2061617   -.1476779
                  WV  |  -.0543658   .0129629    -4.19   0.000    -.0804025    -.028329
                  NC  |    .043909   .0115126     3.81   0.000     .0207852    .0670328
                  SC  |   .0057522   .0121619     0.47   0.638    -.0186756    .0301801
                  GA  |   .1590105   .0134751    11.80   0.000      .131945    .1860759
                  FL  |   .0101083   .0201804     0.50   0.619    -.0304252    .0506419
                  KY  |  -.2060388   .0213438    -9.65   0.000    -.2489091   -.1631685
                  TN  |  -.1421364    .014751    -9.64   0.000    -.1717647   -.1125081
                  AL  |  -.1224879   .0140097    -8.74   0.000    -.1506271   -.0943487
                  MS  |  -.1027201   .0119961    -8.56   0.000     -.126815   -.0786252
                  AR  |  -.1230805   .0121516   -10.13   0.000    -.1474877   -.0986734
                  LA  |  -.0931166   .0168763    -5.52   0.000    -.1270136   -.0592197
                  OK  |  -.3812575   .0533725    -7.14   0.000    -.4884593   -.2740557
                  TX  |  -.1763966    .019799    -8.91   0.000    -.2161642   -.1366291
                  MT  |  -.4997247   .0084758   -58.96   0.000    -.5167489   -.4827004
                  ID  |   .0651772   .0142823     4.56   0.000     .0364903     .093864
                  WY  |  -.6867415   .0168259   -40.81   0.000    -.7205374   -.6529457
                  CO  |   -.207308   .0134386   -15.43   0.000    -.2343002   -.1803159
                  NM  |  -.4820522   .0069057   -69.81   0.000    -.4959226   -.4681818
                  AZ  |  -.1454214    .018034    -8.06   0.000    -.1816438    -.109199
                  UT  |  -.2055922   .0195685   -10.51   0.000    -.2448967   -.1662876
                  NV  |    .068757   .0220588     3.12   0.003     .0244506    .1130634
                  WA  |  -.2946521   .0100681   -29.27   0.000    -.3148746   -.2744296
                  OR  |  -.1874692    .008755   -21.41   0.000    -.2050541   -.1698843
                  CA  |  -.0676355   .0178475    -3.79   0.000    -.1034832   -.0317878
                  AK  |   .3931611   .0151454    25.96   0.000     .3627407    .4235814
                  HI  |  -.1312686   .0172151    -7.63   0.000    -.1658462    -.096691
                      |
        state#c.lyear |
                  ME  |   .0020145   .0001285    15.67   0.000     .0017563    .0022727
                  NH  |   .0015196   .0002304     6.60   0.000     .0010569    .0019823
                  VT  |   .0036051   .0000839    42.97   0.000     .0034366    .0037736
                  MA  |   .0040847   .0000933    43.78   0.000     .0038973    .0042721
                  RI  |   .0044099   .0000951    46.36   0.000     .0042188    .0046009
                  CT  |    .002583   .0000961    26.89   0.000     .0023901     .002776
                  NY  |   .0028172   .0000722    39.03   0.000     .0026722    .0029621
                  NJ  |    .002989    .000079    37.84   0.000     .0028303    .0031476
                  PA  |    .001984   .0000692    28.67   0.000      .001845     .002123
                  OH  |   .0020843   .0000511    40.75   0.000     .0019816     .002187
                  IN  |   .0035276   .0004584     7.70   0.000     .0026069    .0044484
                  IL  |   .0029839   .0000828    36.06   0.000     .0028177    .0031501
                  MI  |   .0020656   .0003807     5.43   0.000     .0013009    .0028303
                  WI  |   .0050888   .0003425    14.86   0.000     .0044008    .0057767
                  MN  |   .0036518   .0000845    43.23   0.000     .0034821    .0038215
                  IA  |   .0032881   .0000993    33.10   0.000     .0030886    .0034877
                  MO  |   .0013144   .0000841    15.62   0.000     .0011454    .0014833
                  ND  |    .010014   .0000912   109.83   0.000     .0098309    .0101971
                  SD  |    .005778   .0000605    95.46   0.000     .0056564    .0058995
                  NE  |   .0052105    .000112    46.50   0.000     .0049855    .0054356
                  KS  |   .0030036   .0000799    37.58   0.000      .002843    .0031641
                  DE  |   .0007272   .0001568     4.64   0.000     .0004123     .001042
                  MD  |   .0059389   .0000767    77.38   0.000     .0057847     .006093
                  DC  |    .006014   .0001438    41.82   0.000     .0057251    .0063028
                  VA  |    .004465   .0001364    32.73   0.000      .004191    .0047391
                  WV  |   .0011648   .0002167     5.37   0.000     .0007296    .0016001
                  NC  |    .001499   .0001592     9.42   0.000     .0011792    .0018188
                  SC  |   .0014856   .0001338    11.10   0.000     .0012168    .0017544
                  GA  |   .0006686   .0001326     5.04   0.000     .0004023     .000935
                  FL  |   .0018373   .0000777    23.65   0.000     .0016812    .0019934
                  KY  |   .0031704   .0002444    12.97   0.000     .0026794    .0036613
                  TN  |   .0028882   .0001093    26.43   0.000     .0026687    .0031077
                  AL  |    .002579   .0001123    22.96   0.000     .0023534    .0028046
                  MS  |   .0021672   .0001248    17.36   0.000     .0019165     .002418
                  AR  |    .002342   .0001811    12.93   0.000     .0019781    .0027058
                  LA  |   .0022251   .0001055    21.09   0.000     .0020132     .002437
                  OK  |   .0045308   .0006054     7.48   0.000     .0033147    .0057469
                  TX  |   .0038854   .0000889    43.69   0.000     .0037068     .004064
                  MT  |   .0060919   .0000648    94.02   0.000     .0059617     .006222
                  ID  |   .0012232   .0002071     5.91   0.000     .0008072    .0016391
                  WY  |   .0087288   .0000821   106.25   0.000     .0085638    .0088938
                  CO  |   .0039415    .000098    40.24   0.000     .0037448    .0041383
                  NM  |   .0057467   .0001971    29.15   0.000     .0053507    .0061426
                  AZ  |   .0036992   .0000883    41.89   0.000     .0035218    .0038765
                  UT  |   .0037313   .0000828    45.04   0.000     .0035649    .0038977
                  NV  |   .0022627   .0000817    27.69   0.000     .0020986    .0024268
                  WA  |   .0054231   .0001151    47.12   0.000     .0051919    .0056542
                  OR  |   .0038009   .0001093    34.78   0.000     .0035813    .0040204
                  CA  |   .0039128   .0000701    55.81   0.000      .003772    .0040536
                  AK  |  -.0000371   .0000539    -0.69   0.495    -.0001453    .0000712
                  HI  |    .003966   .0000799    49.61   0.000     .0038055    .0041266
                      |
                 nind |
                   2  |   .0636794   .0407156     1.56   0.124    -.0181002     .145459
                   3  |    .134567   .0381685     3.53   0.001     .0579034    .2112306
                   4  |  -.0807573   .0386421    -2.09   0.042    -.1583724   -.0031423
                   5  |   .1600824   .0371808     4.31   0.000     .0854027    .2347622
                   6  |   .0919172   .0389834     2.36   0.022     .0136167    .1702176
                   7  |    .037582   .0403121     0.93   0.356    -.0433873    .1185513
                   8  |  -.0157624   .0414101    -0.38   0.705    -.0989371    .0674123
                   9  |  -.0670849   .0445791    -1.50   0.139    -.1566246    .0224548
                  10  |  -.0797097   .0394576    -2.02   0.049    -.1589626   -.0004568
                  11  |   .0745897   .0411694     1.81   0.076    -.0081014    .1572807
                      |
                 educ |   .0896662   .0023961    37.42   0.000     .0848535    .0944789
                exper |   .0471697   .0021109    22.35   0.000     .0429299    .0514095
               exper2 |   -.001531   .0000963   -15.90   0.000    -.0017244   -.0013375
               exper3 |   .0000232   2.74e-06     8.45   0.000     .0000177    .0000287
               exper4 |  -1.17e-07   2.81e-08    -4.18   0.000    -1.74e-07   -6.09e-08
                 edex |  -.0005003   .0000904    -5.53   0.000    -.0006819   -.0003186
                      |
                ee_cl |
                   2  |   -.126389   .0052462   -24.09   0.000    -.1369262   -.1158518
                   3  |  -.1612427    .008005   -20.14   0.000    -.1773212   -.1451642
                   4  |    -.16159      .0128   -12.62   0.000    -.1872996   -.1358805
                   5  |   -.158123   .0081593   -19.38   0.000    -.1745114   -.1417346
                   6  |  -.1699314   .0087766   -19.36   0.000    -.1875597   -.1523031
                   7  |  -.1736355    .010416   -16.67   0.000    -.1945566   -.1527144
                   8  |  -.1054518   .0134856    -7.82   0.000    -.1325384   -.0783653
                   9  |  -.1585106    .010131   -15.65   0.000    -.1788592    -.138162
                  10  |  -.1749917   .0109793   -15.94   0.000    -.1970444   -.1529391
                  11  |  -.1660627   .0114722   -14.48   0.000    -.1891052   -.1430201
                  12  |  -.1119719   .0122287    -9.16   0.000     -.136534   -.0874099
                  13  |  -.1107028   .0146892    -7.54   0.000     -.140207   -.0811985
                  14  |  -.1537436   .0116697   -13.17   0.000    -.1771829   -.1303044
                  15  |   -.134688   .0121549   -11.08   0.000     -.159102   -.1102741
                  16  |  -.0999967   .0126433    -7.91   0.000    -.1253915   -.0746019
                      |
                 marr |   .0334315   .0021824    15.32   0.000      .029048    .0378149
                partt |  -.1404805   .0033212   -42.30   0.000    -.1471514   -.1338096
               public |   .0600537   .0059745    10.05   0.000     .0480536    .0720537
                 cmsa |   .1527079   .0080561    18.96   0.000     .1365268     .168889
                      |
                nocc2 |
                   2  |  -.1302004   .0030999   -42.00   0.000    -.1364268    -.123974
                   3  |  -.0381301   .0068959    -5.53   0.000    -.0519809   -.0242793
                   4  |  -.2789531   .0065632   -42.50   0.000    -.2921356   -.2657705
                   5  |   .0506863   .0062285     8.14   0.000      .038176    .0631967
                   6  |  -.3244998    .004401   -73.73   0.000    -.3333395   -.3156601
                   7  |  -.3503915    .004293   -81.62   0.000    -.3590142   -.3417688
                   8  |  -.1633899   .0078355   -20.85   0.000     -.179128   -.1476518
                   9  |   -.403657   .0051758   -77.99   0.000    -.4140529    -.393261
                  10  |   -.410331   .0092139   -44.53   0.000    -.4288378   -.3918243
                  11  |  -.1636108   .0085745   -19.08   0.000    -.1808332   -.1463883
                  12  |  -.3817086   .0078086   -48.88   0.000    -.3973927   -.3660245
                      |
                unemp |  -.0022189   .0004959    -4.47   0.000    -.0032149   -.0012229
                      |
              quarter |
                   2  |   .0083556   .0013141     6.36   0.000     .0057162    .0109951
                   3  |   .0173027   .0016003    10.81   0.000     .0140883     .020517
                   4  |   .0201788   .0011496    17.55   0.000     .0178699    .0224878
                      |
                _cons |   .2105242   .0436256     4.83   0.000     .1228995    .2981488
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_fem_all_sltt

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(
> cluster state)
(sum of wgt is 7,596,028,224)

Linear regression                               Number of obs     =    878,856
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5397
                                                Root MSE          =     .42016

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1589542    .005002   -31.78   0.000     -.169001   -.1489074
             treat_st |  -.0268531   .0134426    -2.00   0.051    -.0538533    .0001471
treat_stblackrelwhite |  -.0034301   .0080993    -0.42   0.674    -.0196981    .0128378
                      |
                state |
                  NH  |   .0947744   .0037498    25.27   0.000     .0872428     .102306
                  VT  |   .0390982   .0006006    65.10   0.000     .0378919    .0403045
                  MA  |   .1153573    .008533    13.52   0.000     .0982182    .1324963
                  RI  |   .0235813   .0082208     2.87   0.006     .0070694    .0400932
                  CT  |   .1227508   .0084737    14.49   0.000     .1057309    .1397707
                  NY  |   .0691604   .0079313     8.72   0.000       .05323    .0850908
                  NJ  |   .1503886   .0091123    16.50   0.000      .132086    .1686911
                  PA  |   .0005012   .0065517     0.08   0.939    -.0126583    .0136608
                  OH  |  -.0328801   .0064053    -5.13   0.000    -.0457456   -.0200146
                  IN  |  -.0047471   .0049416    -0.96   0.341    -.0146726    .0051784
                  IL  |   .0571093    .007371     7.75   0.000     .0423042    .0719144
                  MI  |   .0154853    .006372     2.43   0.019     .0026866    .0282839
                  WI  |    .013455   .0047648     2.82   0.007     .0038846    .0230254
                  MN  |   .0556291   .0063241     8.80   0.000     .0429267    .0683315
                  IA  |   .0100215   .0131241     0.76   0.449     -.016339    .0363821
                  MO  |  -.0367514   .0059836    -6.14   0.000    -.0487698   -.0247331
                  ND  |   .0333433   .0138965     2.40   0.020     .0054315    .0612552
                  SD  |  -.0352616   .0132828    -2.65   0.011     -.061941   -.0085823
                  NE  |  -.0256977   .0132611    -1.94   0.058    -.0523333     .000938
                  KS  |  -.0128887   .0132027    -0.98   0.334    -.0394071    .0136298
                  DE  |   .0608875   .0016962    35.90   0.000     .0574806    .0642944
                  MD  |   .1306161   .0089664    14.57   0.000     .1126065    .1486257
                  DC  |   .1855722   .0113891    16.29   0.000     .1626965    .2084479
                  VA  |   .1224447   .0137768     8.89   0.000     .0947731    .1501163
                  WV  |  -.0606966   .0024388   -24.89   0.000     -.065595   -.0557981
                  NC  |   .0145179   .0132278     1.10   0.278    -.0120509    .0410868
                  SC  |  -.0018872     .01304    -0.14   0.886    -.0280788    .0243044
                  GA  |   .0546802   .0136128     4.02   0.000     .0273381    .0820224
                  FL  |  -.0142849    .014039    -1.02   0.314     -.042483    .0139132
                  KY  |  -.0425806   .0039356   -10.82   0.000    -.0504855   -.0346757
                  TN  |  -.0331427   .0132385    -2.50   0.016     -.059733   -.0065525
                  AL  |  -.0114426   .0131452    -0.87   0.388    -.0378455    .0149603
                  MS  |  -.0262925   .0132627    -1.98   0.053    -.0529313    .0003464
                  AR  |  -.0708393     .01318    -5.37   0.000     -.097312   -.0443665
                  LA  |   .0202014   .0135753     1.49   0.143    -.0070654    .0474681
                  OK  |  -.0486104   .0083655    -5.81   0.000    -.0654131   -.0318078
                  TX  |   .0584259    .013838     4.22   0.000     .0306315    .0862203
                  MT  |  -.0383826   .0013282   -28.90   0.000    -.0410502   -.0357149
                  ID  |  -.0036621   .0130051    -0.28   0.779    -.0297837    .0224595
                  WY  |   .1612903   .0146908    10.98   0.000      .131783    .1907975
                  CO  |   .0433214   .0080778     5.36   0.000     .0270967    .0595462
                  NM  |  -.0221058   .0054776    -4.04   0.000    -.0331077   -.0111038
                  AZ  |   .0266655   .0138761     1.92   0.060    -.0012054    .0545364
                  UT  |   .0035433   .0137402     0.26   0.798    -.0240547    .0311413
                  NV  |   .0831986   .0139528     5.96   0.000     .0551735    .1112236
                  WA  |   .0858282   .0075992    11.29   0.000     .0705647    .1010917
                  OR  |   .0160381   .0068232     2.35   0.023     .0023334    .0297428
                  CA  |   .1447761   .0088258    16.40   0.000     .1270489    .1625032
                  AK  |   .2295745   .0047656    48.17   0.000     .2200026    .2391464
                  HI  |   .1147864    .006228    18.43   0.000     .1022771    .1272957
                      |
                 year |
                1990  |  -.0098303   .0029487    -3.33   0.002     -.015753   -.0039075
                1991  |  -.0233411   .0044569    -5.24   0.000     -.032293   -.0143893
                1992  |  -.0234167   .0038242    -6.12   0.000    -.0310979   -.0157355
                1993  |  -.0319061    .003605    -8.85   0.000    -.0391469   -.0246653
                1996  |  -.0356564   .0060983    -5.85   0.000    -.0479051   -.0234077
                1997  |  -.0184167   .0056983    -3.23   0.002     -.029862   -.0069714
                1998  |   .0080904   .0054038     1.50   0.141    -.0027633    .0189442
                1999  |   .0337295   .0065747     5.13   0.000     .0205239    .0469351
                2000  |   .0441553   .0058041     7.61   0.000     .0324974    .0558132
                2001  |   .0614989   .0062007     9.92   0.000     .0490444    .0739534
                2002  |   .0686991    .005025    13.67   0.000     .0586061     .078792
                2003  |   .0569734   .0065946     8.64   0.000     .0437277    .0702191
                2004  |   .0498959   .0056667     8.81   0.000     .0385139    .0612778
                2005  |   .0362732   .0064862     5.59   0.000     .0232453    .0493012
                2006  |   .0331134   .0057012     5.81   0.000     .0216622    .0445647
                2007  |   .0332238   .0068338     4.86   0.000     .0194978    .0469497
                2008  |   .0288876   .0069782     4.14   0.000     .0148714    .0429037
                2009  |   .0425745   .0083061     5.13   0.000     .0258912    .0592578
                2010  |    .030948   .0074484     4.15   0.000     .0159873    .0459086
                2011  |   .0083828   .0072419     1.16   0.253    -.0061629    .0229286
                2012  |   .0088636   .0083246     1.06   0.292    -.0078567     .025584
                2013  |   .0058848   .0084926     0.69   0.492     -.011173    .0229426
                2014  |   .0022725   .0092097     0.25   0.806    -.0162257    .0207707
                2015  |   .0268006   .0070815     3.78   0.000     .0125769    .0410243
                2016  |   .0430571   .0074866     5.75   0.000     .0280198    .0580943
                2017  |   .0461522   .0083242     5.54   0.000     .0294325    .0628719
                2018  |   .0569931    .008375     6.81   0.000     .0401714    .0738149
                2019  |   .0788092   .0084092     9.37   0.000     .0619189    .0956995
                      |
                 nind |
                   2  |   .0471357   .0233119     2.02   0.049     .0003123     .093959
                   3  |   .1004333   .0219417     4.58   0.000     .0563621    .1445046
                   4  |  -.0677619   .0239796    -2.83   0.007    -.1159263   -.0195975
                   5  |    .098585   .0234678     4.20   0.000     .0514485    .1457215
                   6  |   .1015133   .0263741     3.85   0.000     .0485394    .1544872
                   7  |   .0062228   .0252981     0.25   0.807      -.04459    .0570356
                   8  |  -.0453452   .0256603    -1.77   0.083    -.0968853     .006195
                   9  |   -.078069   .0256869    -3.04   0.004    -.1296626   -.0264755
                  10  |  -.0896123   .0255164    -3.51   0.001    -.1408635   -.0383611
                  11  |   .0873743   .0261356     3.34   0.002     .0348795    .1398691
                      |
                 educ |   .0648434   .0017778    36.47   0.000     .0612726    .0684142
                exper |   .0404529    .001779    22.74   0.000     .0368796    .0440261
               exper2 |  -.0007176   .0000877    -8.18   0.000    -.0008937   -.0005414
               exper3 |  -2.62e-06   2.89e-06    -0.91   0.369    -8.42e-06    3.18e-06
               exper4 |   1.17e-07   3.30e-08     3.55   0.001     5.08e-08    1.83e-07
                 edex |  -.0003392   .0000773    -4.39   0.000    -.0004944   -.0001839
                      |
                ee_cl |
                   2  |  -.0636574   .0044496   -14.31   0.000    -.0725947   -.0547202
                   3  |  -.0760083   .0054988   -13.82   0.000     -.087053   -.0649636
                   4  |  -.0268763   .0092965    -2.89   0.006    -.0455489   -.0082037
                   5  |  -.1250721   .0052727   -23.72   0.000    -.1356627   -.1144816
                   6  |  -.0981738   .0056331   -17.43   0.000    -.1094882   -.0868593
                   7  |  -.0791058   .0069267   -11.42   0.000    -.0930186   -.0651931
                   8  |   .0381541   .0099931     3.82   0.000     .0180824    .0582259
                   9  |  -.1498399   .0069765   -21.48   0.000    -.1638526   -.1358272
                  10  |  -.1146748   .0078257   -14.65   0.000    -.1303932   -.0989564
                  11  |  -.0695545   .0080293    -8.66   0.000    -.0856818   -.0534271
                  12  |   .0407499   .0107226     3.80   0.000      .019213    .0622868
                  13  |  -.0902237   .0130333    -6.92   0.000    -.1164019   -.0640455
                  14  |  -.0876105   .0100997    -8.67   0.000    -.1078963   -.0673248
                  15  |  -.0510476   .0096343    -5.30   0.000    -.0703987   -.0316966
                  16  |   .0392168   .0119508     3.28   0.002      .015213    .0632207
                      |
                 marr |   .1293254    .002554    50.64   0.000     .1241955    .1344554
                partt |  -.2077405   .0046822   -44.37   0.000     -.217145   -.1983359
               public |  -.0105054   .0060595    -1.73   0.089    -.0226763    .0016655
                 cmsa |   .1387867   .0081558    17.02   0.000     .1224053     .155168
                      |
                nocc2 |
                   2  |  -.1492486   .0038104   -39.17   0.000     -.156902   -.1415951
                   3  |  -.0391383   .0063111    -6.20   0.000    -.0518144   -.0264621
                   4  |  -.3319298   .0073813   -44.97   0.000    -.3467555   -.3171041
                   5  |  -.0965512   .0083826   -11.52   0.000     -.113388   -.0797143
                   6  |   -.392041   .0065972   -59.43   0.000    -.4052919   -.3787902
                   7  |  -.2480012   .0065073   -38.11   0.000    -.2610715   -.2349309
                   8  |  -.1114374   .0102079   -10.92   0.000    -.1319405   -.0909343
                   9  |   -.434634   .0057297   -75.86   0.000    -.4461424   -.4231256
                  10  |  -.3739277   .0060499   -61.81   0.000    -.3860793   -.3617762
                  11  |  -.2747692    .006337   -43.36   0.000    -.2874974    -.262041
                  12  |  -.4361671   .0086754   -50.28   0.000     -.453592   -.4187421
                      |
              quarter |
                   2  |   .0040196   .0018195     2.21   0.032     .0003651    .0076741
                   3  |   .0048278   .0018296     2.64   0.011     .0011528    .0085027
                   4  |   .0155053   .0017267     8.98   0.000     .0120372    .0189734
                      |
                _cons |   .7009451   .0239358    29.28   0.000     .6528687    .7490215
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0
> , vce(cluster state)
(sum of wgt is 7,596,028,224)

Linear regression                               Number of obs     =    878,856
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5398
                                                Root MSE          =     .42013

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1589808   .0050054   -31.76   0.000    -.1690344   -.1489271
             treat_st |  -.0286339    .014131    -2.03   0.048    -.0570168   -.0002511
treat_stblackrelwhite |  -.0034263   .0081269    -0.42   0.675    -.0197495     .012897
                      |
                state |
                  NH  |   .0872649   .0044709    19.52   0.000     .0782849    .0962449
                  VT  |   .0321397   .0018616    17.26   0.000     .0284006    .0358789
                  MA  |   .1158313   .0085439    13.56   0.000     .0986704    .1329922
                  RI  |   .0306878   .0083293     3.68   0.001     .0139579    .0474178
                  CT  |   .1236752   .0084699    14.60   0.000     .1066629    .1406876
                  NY  |   .0742108   .0080659     9.20   0.000       .05801    .0904116
                  NJ  |   .1542322   .0091113    16.93   0.000     .1359316    .1725327
                  PA  |   .0032331   .0065231     0.50   0.622     -.009869    .0163351
                  OH  |  -.0285697    .006365    -4.49   0.000    -.0413543   -.0157851
                  IN  |  -.0038322   .0050125    -0.76   0.448       -.0139    .0062356
                  IL  |   .0638639   .0074965     8.52   0.000     .0488068     .078921
                  MI  |   .0257483   .0071885     3.58   0.001     .0113098    .0401869
                  WI  |     .01106   .0047502     2.33   0.024     .0015189    .0206011
                  MN  |   .0502905   .0066817     7.53   0.000     .0368699    .0637112
                  IA  |   .0035957   .0127718     0.28   0.779    -.0220573    .0292487
                  MO  |  -.0353216   .0059598    -5.93   0.000    -.0472923   -.0233509
                  ND  |   .0232354   .0133651     1.74   0.088    -.0036092    .0500801
                  SD  |  -.0449066   .0126288    -3.56   0.001    -.0702722    -.019541
                  NE  |  -.0368795   .0124838    -2.95   0.005     -.061954    -.011805
                  KS  |  -.0156546   .0131951    -1.19   0.241    -.0421578    .0108487
                  DE  |   .0567342   .0018628    30.46   0.000     .0529927    .0604756
                  MD  |   .1286487   .0090003    14.29   0.000      .110571    .1467264
                  DC  |   .1972413   .0120507    16.37   0.000     .1730367    .2214458
                  VA  |   .1184131   .0135402     8.75   0.000     .0912167    .1456095
                  WV  |  -.0502092   .0037732   -13.31   0.000    -.0577878   -.0426306
                  NC  |   .0182821   .0141139     1.30   0.201    -.0100665    .0466308
                  SC  |   .0053502    .014524     0.37   0.714    -.0238221    .0345225
                  GA  |   .0595329    .014659     4.06   0.000     .0300894    .0889765
                  FL  |  -.0092018   .0151054    -0.61   0.545    -.0395419    .0211383
                  KY  |  -.0368673   .0043084    -8.56   0.000     -.045521   -.0282136
                  TN  |  -.0285746   .0142611    -2.00   0.051    -.0572188    .0000697
                  AL  |  -.0044674   .0145708    -0.31   0.760    -.0337337    .0247989
                  MS  |  -.0144657   .0156374    -0.93   0.359    -.0458744    .0169429
                  AR  |  -.0659574   .0142702    -4.62   0.000      -.09462   -.0372949
                  LA  |    .028447   .0151442     1.88   0.066    -.0019711    .0588651
                  OK  |  -.0509583   .0082712    -6.16   0.000    -.0675715   -.0343451
                  TX  |     .06295   .0147667     4.26   0.000     .0332901    .0926099
                  MT  |  -.0389697   .0013464   -28.94   0.000    -.0416741   -.0362653
                  ID  |  -.0018271    .013679    -0.13   0.894    -.0293022     .025648
                  WY  |   .1576465   .0148055    10.65   0.000     .1279087    .1873843
                  CO  |   .0408723   .0081593     5.01   0.000     .0244837    .0572608
                  NM  |  -.0169713   .0054643    -3.11   0.003    -.0279466    -.005996
                  AZ  |   .0324245   .0150314     2.16   0.036      .002233     .062616
                  UT  |  -.0005345   .0136036    -0.04   0.969    -.0278582    .0267892
                  NV  |   .0904157   .0154233     5.86   0.000     .0594371    .1213944
                  WA  |   .0915954    .007613    12.03   0.000     .0763042    .1068866
                  OR  |   .0239866   .0069019     3.48   0.001     .0101237    .0378495
                  CA  |   .1552849   .0091831    16.91   0.000     .1368402    .1737297
                  AK  |   .2432362   .0059471    40.90   0.000     .2312911    .2551812
                  HI  |   .1078548     .00652    16.54   0.000      .094759    .1209505
                      |
                 year |
                1990  |  -.0079296   .0030714    -2.58   0.013    -.0140987   -.0017604
                1991  |  -.0138953   .0057408    -2.42   0.019    -.0254261   -.0023645
                1992  |  -.0101874   .0052866    -1.93   0.060    -.0208058     .000431
                1993  |  -.0225119     .00432    -5.21   0.000     -.031189   -.0138349
                1996  |  -.0357193   .0057072    -6.26   0.000    -.0471826    -.024256
                1997  |    -.02135   .0050048    -4.27   0.000    -.0314025   -.0112975
                1998  |    .002451   .0045933     0.53   0.596    -.0067749    .0116768
                1999  |   .0263825   .0060037     4.39   0.000     .0143238    .0384412
                2000  |   .0356429   .0059912     5.95   0.000     .0236092    .0476767
                2001  |   .0577581   .0059389     9.73   0.000     .0458295    .0696867
                2002  |   .0717583    .004825    14.87   0.000      .062067    .0814497
                2003  |   .0613749   .0066671     9.21   0.000     .0479837    .0747661
                2004  |     .05149    .005795     8.89   0.000     .0398504    .0631295
                2005  |   .0353773   .0064263     5.51   0.000     .0224696    .0482849
                2006  |   .0294518   .0055837     5.27   0.000     .0182367    .0406669
                2007  |   .0291115   .0067848     4.29   0.000     .0154838    .0427392
                2008  |   .0319585   .0065373     4.89   0.000     .0188278    .0450891
                2009  |   .0674995   .0112323     6.01   0.000     .0449386    .0900603
                2010  |   .0580543    .009748     5.96   0.000     .0384748    .0776339
                2011  |   .0310003   .0094245     3.29   0.002     .0120705    .0499301
                2012  |   .0258834   .0100709     2.57   0.013     .0056554    .0461114
                2013  |   .0188919   .0092257     2.05   0.046     .0003616    .0374222
                2014  |   .0077168   .0086078     0.90   0.374    -.0095725    .0250062
                2015  |   .0266799   .0065427     4.08   0.000     .0135386    .0398212
                2016  |   .0405543   .0070115     5.78   0.000     .0264712    .0546374
                2017  |   .0404444   .0081662     4.95   0.000     .0240421    .0568467
                2018  |   .0485156    .008336     5.82   0.000     .0317723    .0652589
                2019  |   .0689467   .0087205     7.91   0.000      .051431    .0864623
                      |
                 nind |
                   2  |   .0471911   .0232801     2.03   0.048     .0004317    .0939505
                   3  |   .1004942   .0219189     4.58   0.000     .0564688    .1445197
                   4  |  -.0676224   .0239439    -2.82   0.007    -.1157151   -.0195297
                   5  |   .0987393   .0234064     4.22   0.000     .0517262    .1457524
                   6  |   .1016585   .0263317     3.86   0.000     .0487697    .1545473
                   7  |   .0063434   .0252606     0.25   0.803    -.0443941    .0570809
                   8  |  -.0451945   .0256267    -1.76   0.084    -.0966672    .0062781
                   9  |  -.0779244   .0256541    -3.04   0.004    -.1294521   -.0263967
                  10  |  -.0894223   .0254609    -3.51   0.001    -.1405621   -.0382826
                  11  |    .087496   .0261009     3.35   0.002     .0350708    .1399211
                      |
                 educ |   .0648463   .0017738    36.56   0.000     .0612835     .068409
                exper |   .0404994   .0017757    22.81   0.000     .0369328     .044066
               exper2 |  -.0007206   .0000884    -8.15   0.000    -.0008983    -.000543
               exper3 |  -2.53e-06   2.91e-06    -0.87   0.390    -8.37e-06    3.32e-06
               exper4 |   1.16e-07   3.32e-08     3.49   0.001     4.93e-08    1.83e-07
                 edex |  -.0003396   .0000768    -4.42   0.000    -.0004939   -.0001852
                      |
                ee_cl |
                   2  |  -.0634862   .0044664   -14.21   0.000    -.0724573   -.0545151
                   3  |  -.0758463   .0055218   -13.74   0.000    -.0869372   -.0647554
                   4  |  -.0267207   .0093247    -2.87   0.006    -.0454498   -.0079915
                   5  |  -.1251107   .0052747   -23.72   0.000    -.1357053   -.1145162
                   6  |   -.098092   .0056207   -17.45   0.000    -.1093814   -.0868026
                   7  |  -.0789315   .0069429   -11.37   0.000    -.0928767   -.0649862
                   8  |   .0383937   .0100279     3.83   0.000     .0182521    .0585353
                   9  |   -.149763   .0069799   -21.46   0.000    -.1637825   -.1357435
                  10  |  -.1145956   .0078146   -14.66   0.000    -.1302916   -.0988996
                  11  |  -.0693353   .0080598    -8.60   0.000    -.0855239   -.0531467
                  12  |   .0409881   .0107557     3.81   0.000     .0193846    .0625916
                  13  |  -.0902546    .012994    -6.95   0.000    -.1163539   -.0641554
                  14  |  -.0875344   .0101003    -8.67   0.000    -.1078214   -.0672473
                  15  |    -.05091   .0096403    -5.28   0.000    -.0702732   -.0315469
                  16  |   .0394014   .0119683     3.29   0.002     .0153623    .0634404
                      |
                 marr |   .1293437   .0025545    50.63   0.000     .1242129    .1344745
                partt |  -.2075202   .0047072   -44.09   0.000    -.2169748   -.1980655
               public |  -.0104984   .0060472    -1.74   0.089    -.0226447    .0016478
                 cmsa |   .1386543   .0081626    16.99   0.000     .1222593    .1550492
                      |
                nocc2 |
                   2  |  -.1492318   .0038189   -39.08   0.000    -.1569022   -.1415613
                   3  |  -.0391217   .0063141    -6.20   0.000     -.051804   -.0264394
                   4  |  -.3319105   .0073756   -45.00   0.000    -.3467249   -.3170962
                   5  |  -.0965674   .0083896   -11.51   0.000    -.1134184   -.0797163
                   6  |  -.3919768   .0066195   -59.22   0.000    -.4052725   -.3786811
                   7  |   -.247952   .0065355   -37.94   0.000     -.261079   -.2348251
                   8  |  -.1115606   .0102435   -10.89   0.000    -.1321353    -.090986
                   9  |  -.4345576    .005765   -75.38   0.000    -.4461369   -.4229784
                  10  |  -.3739134   .0060599   -61.70   0.000    -.3860851   -.3617417
                  11  |  -.2747702   .0063393   -43.34   0.000     -.287503   -.2620374
                  12  |  -.4361445   .0086951   -50.16   0.000    -.4536093   -.4186798
                      |
                unemp |  -.0063719   .0018947    -3.36   0.001    -.0101775   -.0025662
                      |
              quarter |
                   2  |   .0040042   .0018116     2.21   0.032     .0003655    .0076429
                   3  |    .004803   .0018378     2.61   0.012     .0011116    .0084944
                   4  |   .0154535    .001724     8.96   0.000     .0119908    .0189163
                      |
                _cons |    .731076   .0292491    24.99   0.000     .6723274    .7898247
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all_unemp 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exp
> er3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & cov
> ered == 0, vce(cluster state)
(sum of wgt is 7,596,028,224)

Linear regression                               Number of obs     =    878,856
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5389
                                                Root MSE          =     .42052

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1593722   .0049485   -32.21   0.000    -.1693115   -.1494328
             treat_st |  -.0194542   .0111154    -1.75   0.086      -.04178    .0028717
treat_stblackrelwhite |  -.0037795   .0081848    -0.46   0.646    -.0202192    .0126602
                      |
                state |
                  NH  |   .2619658   .0088737    29.52   0.000     .2441425    .2797892
                  VT  |   .0971771   .0083726    11.61   0.000     .0803603    .1139939
                  MA  |   .0566987    .013884     4.08   0.000     .0288119    .0845856
                  RI  |   .0363081   .0173543     2.09   0.042      .001451    .0711652
                  CT  |   .1904692   .0164726    11.56   0.000      .157383    .2235553
                  NY  |   .2216223   .0162113    13.67   0.000     .1890608    .2541837
                  NJ  |   .2546566   .0183733    13.86   0.000     .2177527    .2915606
                  PA  |   .0171018   .0139587     1.23   0.226     -.010935    .0451386
                  OH  |   .1158382   .0185374     6.25   0.000     .0786048    .1530716
                  IN  |   .1109261   .0415051     2.67   0.010     .0275607    .1942916
                  IL  |   .1870333   .0144193    12.97   0.000     .1580713    .2159953
                  MI  |   .3924491   .0367681    10.67   0.000     .3185983       .4663
                  WI  |  -.0556307   .0322219    -1.73   0.090    -.1203503    .0090889
                  MN  |  -.1004543   .0142445    -7.05   0.000    -.1290652   -.0718433
                  IA  |  -.1411765   .0124435   -11.35   0.000      -.16617   -.1161829
                  MO  |  -.0181533   .0109857    -1.65   0.105    -.0402187    .0039122
                  ND  |  -1.093493   .0149036   -73.37   0.000    -1.123427   -1.063558
                  SD  |  -.5069286    .018859   -26.88   0.000     -.544808   -.4690491
                  NE  |  -.2697935   .0131927   -20.45   0.000    -.2962918   -.2432951
                  KS  |  -.0874357   .0155315    -5.63   0.000    -.1186317   -.0562397
                  DE  |   .2220798   .0131969    16.83   0.000     .1955731    .2485865
                  MD  |  -.0771632   .0178489    -4.32   0.000    -.1130138   -.0413126
                  DC  |   -.131725   .0173055    -7.61   0.000    -.1664842   -.0969658
                  VA  |  -.0666686   .0135347    -4.93   0.000    -.0938539   -.0394833
                  WV  |    .018978     .01175     1.62   0.113    -.0046225    .0425785
                  NC  |   .1697921   .0113618    14.94   0.000     .1469713     .192613
                  SC  |   .1678482   .0125741    13.35   0.000     .1425924     .193104
                  GA  |   .1264952    .012423    10.18   0.000     .1015429    .1514475
                  FL  |   .1140426    .018845     6.05   0.000     .0761913     .151894
                  KY  |   .1052176   .0192153     5.48   0.000     .0666225    .1438127
                  TN  |   .0676283   .0143212     4.72   0.000     .0388634    .0963932
                  AL  |  -.1117047   .0139901    -7.98   0.000    -.1398046   -.0836048
                  MS  |   -.080829   .0127879    -6.32   0.000    -.1065142   -.0551438
                  AR  |  -.0107764    .012023    -0.90   0.374    -.0349252    .0133725
                  LA  |  -.0938173   .0157894    -5.94   0.000    -.1255312   -.0621034
                  OK  |  -.1805746   .0497243    -3.63   0.001    -.2804488   -.0807005
                  TX  |   -.066643   .0194293    -3.43   0.001    -.1056679    -.027618
                  MT  |  -.4312503   .0116876   -36.90   0.000    -.4547256   -.4077749
                  ID  |   .2463876   .0129094    19.09   0.000     .2204583    .2723169
                  WY  |    -.72632    .014041   -51.73   0.000    -.7545222   -.6981178
                  CO  |  -.0999739   .0126183    -7.92   0.000    -.1253186   -.0746292
                  NM  |  -.2025273   .0119907   -16.89   0.000    -.2266113   -.1784432
                  AZ  |  -.0830121   .0169605    -4.89   0.000    -.1170782    -.048946
                  UT  |  -.1433758   .0171309    -8.37   0.000    -.1777841   -.1089675
                  NV  |   .0307287   .0201182     1.53   0.133    -.0096799    .0711373
                  WA  |  -.3040001   .0115725   -26.27   0.000    -.3272441   -.2807561
                  OR  |   .0521336   .0084558     6.17   0.000     .0351496    .0691176
                  CA  |   .1316056   .0175617     7.49   0.000      .096332    .1668792
                  AK  |   .7089619   .0159068    44.57   0.000     .6770122    .7409116
                  HI  |  -.1498168   .0178326    -8.40   0.000    -.1856346   -.1139991
                      |
        state#c.lyear |
                  ME  |   .0021857   .0001223    17.87   0.000       .00194    .0024314
                  NH  |   .0005476   .0002287     2.40   0.020     .0000884    .0010069
                  VT  |   .0015613   .0000655    23.84   0.000     .0014297    .0016928
                  MA  |   .0027559   .0000865    31.88   0.000     .0025822    .0029295
                  RI  |   .0021374   .0000654    32.70   0.000     .0020061    .0022687
                  CT  |   .0015441   .0000831    18.58   0.000     .0013771     .001711
                  NY  |   .0007518   .0000621    12.11   0.000     .0006271    .0008765
                  NJ  |   .0012262   .0000568    21.57   0.000      .001112    .0013403
                  PA  |   .0020533   .0000599    34.30   0.000     .0019331    .0021736
                  OH  |   .0007996   .0000426    18.75   0.000      .000714    .0008853
                  IN  |   .0010683   .0004296     2.49   0.016     .0002054    .0019313
                  IL  |   .0009885   .0000639    15.47   0.000     .0008602    .0011168
                  MI  |  -.0013924   .0003518    -3.96   0.000     -.002099   -.0006857
                  WI  |   .0028109   .0003177     8.85   0.000     .0021728     .003449
                  MN  |   .0036419   .0000672    54.18   0.000     .0035069    .0037769
                  IA  |   .0035057   .0000823    42.57   0.000     .0033403    .0036711
                  MO  |   .0020221    .000081    24.96   0.000     .0018594    .0021848
                  ND  |   .0128213   .0000899   142.59   0.000     .0126407    .0130019
                  SD  |   .0066402   .0000478   138.91   0.000     .0065442    .0067362
                  NE  |   .0043517   .0001038    41.92   0.000     .0041432    .0045602
                  KS  |   .0028027   .0000715    39.22   0.000     .0026592    .0029463
                  DE  |   .0004801   .0000908     5.29   0.000     .0002978    .0006625
                  MD  |   .0041569    .000084    49.48   0.000     .0039882    .0043256
                  DC  |   .0053223   .0001083    49.17   0.000     .0051049    .0055397
                  VA  |   .0038967   .0001269    30.70   0.000     .0036417    .0041516
                  WV  |   .0014948   .0002008     7.45   0.000     .0010915     .001898
                  NC  |   .0006321   .0001508     4.19   0.000     .0003291    .0009351
                  SC  |    .000525   .0001109     4.73   0.000     .0003023    .0007478
                  GA  |   .0014545   .0001208    12.05   0.000     .0012119     .001697
                  FL  |   .0009286   .0000716    12.97   0.000     .0007848    .0010724
                  KY  |   .0008133   .0002098     3.88   0.000      .000392    .0012346
                  TN  |   .0011737   .0000943    12.45   0.000     .0009843    .0013631
                  AL  |   .0031347    .000099    31.65   0.000     .0029357    .0033336
                  MS  |   .0027342   .0001097    24.93   0.000     .0025139    .0029546
                  AR  |   .0015756   .0001827     8.63   0.000     .0012087    .0019425
                  LA  |   .0032778   .0001229    26.67   0.000     .0030309    .0035247
                  OK  |   .0034132   .0005511     6.19   0.000     .0023062    .0045201
                  TX  |   .0033419   .0000847    39.45   0.000     .0031718    .0035121
                  MT  |   .0059739   .0000707    84.51   0.000     .0058319    .0061159
                  ID  |  -.0002617   .0001941    -1.35   0.184    -.0006516    .0001282
                  WY  |   .0103645   .0000633   163.77   0.000     .0102374    .0104916
                  CO  |   .0035468   .0000858    41.32   0.000     .0033745    .0037192
                  NM  |   .0039694   .0002273    17.47   0.000     .0035129    .0044259
                  AZ  |   .0032228   .0000904    35.67   0.000     .0030413    .0034043
                  UT  |   .0034762    .000089    39.07   0.000     .0032975    .0036549
                  NV  |   .0026882   .0000728    36.92   0.000     .0025419    .0028344
                  WA  |   .0059681   .0000888    67.22   0.000     .0057898    .0061465
                  OR  |   .0019227   .0001153    16.67   0.000     .0016911    .0021544
                  CA  |   .0024162    .000061    39.60   0.000     .0022936    .0025387
                  AK  |  -.0023871   .0000486   -49.13   0.000    -.0024847   -.0022895
                  HI  |   .0047013   .0000723    64.98   0.000      .004556    .0048466
                      |
                 nind |
                   2  |   .0494932   .0232389     2.13   0.038     .0028165    .0961698
                   3  |   .1015379   .0218163     4.65   0.000     .0577186    .1453571
                   4  |  -.0659689   .0239075    -2.76   0.008    -.1139884   -.0179493
                   5  |   .1005571   .0232428     4.33   0.000     .0538727    .1472416
                   6  |   .1034637   .0261981     3.95   0.000     .0508432    .1560841
                   7  |   .0081532   .0251438     0.32   0.747    -.0423495     .058656
                   8  |  -.0434889   .0255717    -1.70   0.095    -.0948513    .0078734
                   9  |  -.0762225    .025565    -2.98   0.004    -.1275713   -.0248737
                  10  |  -.0878499   .0253471    -3.47   0.001    -.1387611   -.0369387
                  11  |    .088643   .0260635     3.40   0.001      .036293     .140993
                      |
                 educ |   .0647265   .0017515    36.96   0.000     .0612086    .0682444
                exper |   .0401786   .0017582    22.85   0.000     .0366472      .04371
               exper2 |  -.0006907   .0000899    -7.68   0.000    -.0008713   -.0005101
               exper3 |  -3.47e-06   2.93e-06    -1.18   0.242    -9.36e-06    2.42e-06
               exper4 |   1.24e-07   3.32e-08     3.75   0.000     5.78e-08    1.91e-07
                 edex |  -.0003334   .0000753    -4.43   0.000    -.0004846   -.0001823
                      |
                ee_cl |
                   2  |  -.0647087   .0045125   -14.34   0.000    -.0737723   -.0556451
                   3  |  -.0765773   .0056405   -13.58   0.000    -.0879065   -.0652481
                   4  |  -.0276047   .0093085    -2.97   0.005    -.0463015    -.008908
                   5  |   -.128452   .0052609   -24.42   0.000    -.1390187   -.1178852
                   6  |  -.1003014   .0055993   -17.91   0.000    -.1115479   -.0890549
                   7  |  -.0802245   .0070147   -11.44   0.000    -.0943139   -.0661351
                   8  |   .0376904   .0100451     3.75   0.000     .0175143    .0578665
                   9  |  -.1514565   .0069012   -21.95   0.000    -.1653179   -.1375952
                  10  |  -.1147223   .0077829   -14.74   0.000    -.1303548   -.0990899
                  11  |  -.0701796   .0080946    -8.67   0.000    -.0864382   -.0539211
                  12  |   .0394886   .0107828     3.66   0.001     .0178308    .0611464
                  13  |   -.090904   .0129072    -7.04   0.000    -.1168288   -.0649792
                  14  |    -.08828   .0100177    -8.81   0.000    -.1084011   -.0681588
                  15  |  -.0511981   .0096072    -5.33   0.000    -.0704947   -.0319015
                  16  |   .0377783    .011879     3.18   0.003     .0139187     .061638
                      |
                 marr |   .1292278   .0025789    50.11   0.000      .124048    .1344077
                partt |   -.207679    .004672   -44.45   0.000     -.217063    -.198295
               public |   -.010573    .006001    -1.76   0.084    -.0226264    .0014803
                 cmsa |    .138062   .0082394    16.76   0.000     .1215126    .1546114
                      |
                nocc2 |
                   2  |  -.1499656   .0037732   -39.74   0.000    -.1575443   -.1423869
                   3  |  -.0396113   .0062998    -6.29   0.000    -.0522648   -.0269578
                   4  |  -.3317944   .0073078   -45.40   0.000    -.3464725   -.3171163
                   5  |  -.0971241   .0084101   -11.55   0.000    -.1140163   -.0802319
                   6  |  -.3924074   .0065986   -59.47   0.000    -.4056611   -.3791537
                   7  |  -.2480908   .0065542   -37.85   0.000    -.2612553   -.2349263
                   8  |  -.1108107   .0101862   -10.88   0.000    -.1312703    -.090351
                   9  |  -.4349049   .0057497   -75.64   0.000    -.4464535   -.4233563
                  10  |   -.374828   .0059745   -62.74   0.000    -.3868281   -.3628279
                  11  |  -.2750247   .0063154   -43.55   0.000    -.2877096   -.2623398
                  12  |   -.436706   .0086441   -50.52   0.000    -.4540682   -.4193438
                      |
                unemp |  -.0060393   .0007247    -8.33   0.000    -.0074948   -.0045838
                      |
              quarter |
                   2  |   .0036671   .0018341     2.00   0.051    -.0000168    .0073511
                   3  |   .0044556   .0018262     2.44   0.018     .0007876    .0081237
                   4  |   .0149175   .0017228     8.66   0.000     .0114571    .0183779
                      |
                _cons |   .5276528   .0261066    20.21   0.000     .4752161    .5800896
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(
> cluster state)
(sum of wgt is 7,731,988,392)

Linear regression                               Number of obs     =    924,307
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5063
                                                Root MSE          =     .39321

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0837563   .0069818   -12.00   0.000    -.0977797   -.0697329
             treat_st |  -.0250299   .0070005    -3.58   0.001    -.0390908   -.0109691
treat_stblackrelwhite |  -.0285184   .0082552    -3.45   0.001    -.0450994   -.0119374
                      |
                state |
                  NH  |   .0593517   .0033736    17.59   0.000     .0525758    .0661277
                  VT  |    .044583   .0006037    73.85   0.000     .0433704    .0457955
                  MA  |    .093837    .008045    11.66   0.000     .0776781    .1099958
                  RI  |  -.0015954   .0078325    -0.20   0.839    -.0173275    .0141367
                  CT  |    .098641   .0079449    12.42   0.000     .0826832    .1145988
                  NY  |   .0406518   .0074722     5.44   0.000     .0256434    .0556602
                  NJ  |   .1076823   .0086017    12.52   0.000     .0904054    .1249593
                  PA  |  -.0438238   .0063379    -6.91   0.000     -.056554   -.0310937
                  OH  |  -.0749507    .005993   -12.51   0.000    -.0869879   -.0629135
                  IN  |  -.0698294   .0045083   -15.49   0.000    -.0788845   -.0607743
                  IL  |  -.0035818   .0068985    -0.52   0.606    -.0174379    .0102742
                  MI  |  -.0441968   .0061413    -7.20   0.000    -.0565319   -.0318617
                  WI  |  -.0208893   .0044413    -4.70   0.000    -.0298099   -.0119687
                  MN  |   .0371093    .005911     6.28   0.000     .0252367     .048982
                  IA  |  -.0385293   .0067874    -5.68   0.000    -.0521622   -.0248964
                  MO  |  -.0821182   .0057271   -14.34   0.000    -.0936214   -.0706151
                  ND  |  -.0580819   .0073018    -7.95   0.000     -.072748   -.0434157
                  SD  |  -.0750385   .0070763   -10.60   0.000    -.0892517   -.0608253
                  NE  |  -.0684633    .007113    -9.63   0.000    -.0827503   -.0541764
                  KS  |  -.0662011   .0073225    -9.04   0.000    -.0809088   -.0514933
                  DE  |   .0377258    .002182    17.29   0.000     .0333431    .0421085
                  MD  |   .0932412   .0088548    10.53   0.000     .0754558    .1110266
                  DC  |   .1571132   .0116098    13.53   0.000     .1337942    .1804321
                  VA  |   .0543671   .0086512     6.28   0.000     .0369907    .0717435
                  WV  |  -.1571284   .0015266  -102.93   0.000    -.1601947   -.1540621
                  NC  |  -.0285896   .0075723    -3.78   0.000     -.043799   -.0133802
                  SC  |  -.0668527   .0075071    -8.91   0.000    -.0819311   -.0517742
                  GA  |  -.0016426   .0083203    -0.20   0.844    -.0183544    .0150691
                  FL  |   -.041054   .0090776    -4.52   0.000    -.0592869   -.0228211
                  KY  |  -.0899382   .0037074   -24.26   0.000    -.0973848   -.0824917
                  TN  |  -.0799022   .0077945   -10.25   0.000    -.0955579   -.0642465
                  AL  |  -.0920736   .0075115   -12.26   0.000    -.1071608   -.0769863
                  MS  |  -.1079076   .0071341   -15.13   0.000    -.1222367   -.0935784
                  AR  |  -.1123571   .0070203   -16.00   0.000    -.1264579   -.0982564
                  LA  |  -.0982416   .0084227   -11.66   0.000     -.115159   -.0813241
                  OK  |  -.1319668   .0060686   -21.75   0.000     -.144156   -.1197777
                  TX  |  -.0042971    .008765    -0.49   0.626     -.021902    .0133079
                  MT  |  -.0752389   .0010366   -72.58   0.000    -.0773209   -.0731569
                  ID  |  -.0447884   .0068392    -6.55   0.000    -.0585254   -.0310513
                  WY  |   .0043037   .0072988     0.59   0.558    -.0103565    .0189639
                  CO  |  -.0009361   .0078186    -0.12   0.905    -.0166402     .014768
                  NM  |  -.0891781   .0048366   -18.44   0.000    -.0988926   -.0794636
                  AZ  |   .0016962   .0089359     0.19   0.850    -.0162521    .0196445
                  UT  |  -.0516187   .0084846    -6.08   0.000    -.0686605   -.0345768
                  NV  |   .0483295   .0090998     5.31   0.000     .0300519     .066607
                  WA  |   .0505795   .0072718     6.96   0.000     .0359736    .0651853
                  OR  |  -.0110846   .0065997    -1.68   0.099    -.0243406    .0021713
                  CA  |   .1092045   .0085637    12.75   0.000     .0920038    .1264052
                  AK  |   .1681512   .0045837    36.68   0.000     .1589446    .1773579
                  HI  |   .0708594   .0060155    11.78   0.000     .0587769    .0829419
                      |
                 year |
                1990  |  -.0069078   .0025026    -2.76   0.008    -.0119344   -.0018811
                1991  |  -.0017808   .0025657    -0.69   0.491    -.0069341    .0033726
                1992  |   .0175981   .0033113     5.31   0.000     .0109472     .024249
                1993  |   .0131073   .0034434     3.81   0.000      .006191    .0200236
                1996  |  -.0002992   .0039039    -0.08   0.939    -.0081404     .007542
                1997  |   .0147685   .0041489     3.56   0.001     .0064352    .0231019
                1998  |   .0461543   .0039576    11.66   0.000     .0382052    .0541035
                1999  |   .0661328   .0047076    14.05   0.000     .0566773    .0755882
                2000  |   .0810663   .0047319    17.13   0.000      .071562    .0905705
                2001  |   .0921206   .0055674    16.55   0.000     .0809382    .1033031
                2002  |   .1055203    .005016    21.04   0.000     .0954453    .1155953
                2003  |   .1151647   .0052153    22.08   0.000     .1046896    .1256399
                2004  |   .1062122   .0055732    19.06   0.000     .0950182    .1174063
                2005  |   .0958946   .0058507    16.39   0.000      .084143    .1076461
                2006  |   .0914189   .0049174    18.59   0.000     .0815421    .1012958
                2007  |   .0929423   .0054499    17.05   0.000     .0819959    .1038888
                2008  |   .0845608    .006736    12.55   0.000     .0710312    .0980904
                2009  |   .1009134   .0057192    17.64   0.000     .0894261    .1124007
                2010  |   .0975032   .0053046    18.38   0.000     .0868486    .1081577
                2011  |   .0795568   .0058507    13.60   0.000     .0678055    .0913082
                2012  |   .0649204   .0066706     9.73   0.000      .051522    .0783187
                2013  |   .0657152   .0068955     9.53   0.000     .0518651    .0795652
                2014  |    .063436   .0069531     9.12   0.000     .0494702    .0774018
                2015  |   .0781964   .0056819    13.76   0.000      .066784    .0896088
                2016  |   .0912073    .007034    12.97   0.000     .0770792    .1053355
                2017  |   .1035913   .0074103    13.98   0.000     .0887073    .1184753
                2018  |   .1088841    .007409    14.70   0.000     .0940027    .1237654
                2019  |   .1204211    .007135    16.88   0.000       .10609    .1347523
                      |
                 nind |
                   2  |   .0517292   .0397137     1.30   0.199    -.0280382    .1314965
                   3  |   .1268776   .0376972     3.37   0.001     .0511604    .2025947
                   4  |  -.0830864   .0378676    -2.19   0.033    -.1591457    -.007027
                   5  |   .1114531   .0373114     2.99   0.004     .0365109    .1863953
                   6  |   .0890144   .0387214     2.30   0.026     .0112403    .1667886
                   7  |   .0377117   .0401678     0.94   0.352    -.0429678    .1183912
                   8  |  -.0136539   .0408967    -0.33   0.740    -.0957973    .0684896
                   9  |  -.0857559   .0425473    -2.02   0.049    -.1712146   -.0002971
                  10  |  -.0771196   .0387479    -1.99   0.052    -.1549471    .0007078
                  11  |   .0891396   .0427861     2.08   0.042     .0032011    .1750781
                      |
                 educ |   .0868435   .0019022    45.65   0.000     .0830227    .0906643
                exper |   .0471455   .0022078    21.35   0.000     .0427109    .0515801
               exper2 |  -.0015138   .0000962   -15.74   0.000     -.001707   -.0013206
               exper3 |   .0000232   2.88e-06     8.04   0.000     .0000174     .000029
               exper4 |  -1.16e-07   3.01e-08    -3.84   0.000    -1.76e-07   -5.52e-08
                 edex |   -.000587   .0000985    -5.96   0.000    -.0007848   -.0003892
                      |
                ee_cl |
                   2  |  -.1201319   .0044827   -26.80   0.000    -.1291357   -.1111282
                   3  |  -.1515563   .0062266   -24.34   0.000    -.1640628   -.1390499
                   4  |   -.143907   .0103096   -13.96   0.000    -.1646145   -.1231995
                   5  |  -.1499797   .0082568   -18.16   0.000    -.1665639   -.1333954
                   6  |  -.1627324    .007819   -20.81   0.000    -.1784374   -.1470274
                   7  |  -.1623482   .0084122   -19.30   0.000    -.1792446   -.1454518
                   8  |  -.0745087     .01021    -7.30   0.000    -.0950162   -.0540013
                   9  |  -.1599859   .0106562   -15.01   0.000    -.1813894   -.1385823
                  10  |  -.1703521   .0100866   -16.89   0.000    -.1906117   -.1500925
                  11  |  -.1531281   .0091825   -16.68   0.000    -.1715717   -.1346846
                  12  |  -.0900423   .0092378    -9.75   0.000    -.1085971   -.0714876
                  13  |  -.1253877   .0157885    -7.94   0.000    -.1570997   -.0936756
                  14  |  -.1515967   .0111697   -13.57   0.000    -.1740317   -.1291618
                  15  |  -.1221598   .0101799   -12.00   0.000    -.1426069   -.1017128
                  16  |  -.0821599   .0109709    -7.49   0.000    -.1041956   -.0601243
                      |
                 marr |    .038683   .0024013    16.11   0.000     .0338598    .0435062
                partt |  -.1384294   .0028812   -48.05   0.000    -.1442164   -.1326423
               public |   .0149884   .0056998     2.63   0.011       .00354    .0264367
                 cmsa |   .1527888    .007856    19.45   0.000     .1370097     .168568
                      |
                nocc2 |
                   2  |   -.138255   .0031966   -43.25   0.000    -.1446755   -.1318345
                   3  |  -.0374669   .0070541    -5.31   0.000    -.0516355   -.0232983
                   4  |  -.3261356      .0045   -72.47   0.000    -.3351742    -.317097
                   5  |   .0305821   .0062812     4.87   0.000     .0179659    .0431984
                   6  |  -.3378395   .0047005   -71.87   0.000    -.3472808   -.3283982
                   7  |  -.3674123   .0046017   -79.84   0.000    -.3766551   -.3581694
                   8  |  -.1762019   .0076466   -23.04   0.000    -.1915605   -.1608434
                   9  |  -.4259514   .0057376   -74.24   0.000    -.4374757   -.4144271
                  10  |  -.4501583   .0086406   -52.10   0.000    -.4675135    -.432803
                  11  |  -.2352171   .0073188   -32.14   0.000    -.2499173   -.2205168
                  12  |  -.4248568   .0094191   -45.11   0.000    -.4437756   -.4059381
                      |
              quarter |
                   2  |   .0094439     .00146     6.47   0.000     .0065115    .0123763
                   3  |   .0181959   .0018284     9.95   0.000     .0145235    .0218683
                   4  |    .021684   .0011665    18.59   0.000     .0193411    .0240269
                      |
                _cons |    .400195   .0398385    10.05   0.000      .320177    .4802129
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0
> , vce(cluster state)
(sum of wgt is 7,731,988,392)

Linear regression                               Number of obs     =    924,307
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5063
                                                Root MSE          =     .39321

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0837517   .0069835   -11.99   0.000    -.0977785    -.069725
             treat_st |   -.025681   .0071917    -3.57   0.001     -.040126   -.0112359
treat_stblackrelwhite |  -.0285357   .0082668    -3.45   0.001      -.04514   -.0119314
                      |
                state |
                  NH  |   .0565331   .0037263    15.17   0.000     .0490486    .0640175
                  VT  |   .0419794   .0018947    22.16   0.000     .0381737    .0457851
                  MA  |   .0939945    .008052    11.67   0.000     .0778216    .1101673
                  RI  |    .001089    .008049     0.14   0.893    -.0150779    .0172558
                  CT  |   .0989518   .0079506    12.45   0.000     .0829824    .1149211
                  NY  |   .0425679   .0075517     5.64   0.000     .0273998     .057736
                  NJ  |   .1091108   .0086322    12.64   0.000     .0917725    .1264492
                  PA  |   -.042802   .0063763    -6.71   0.000    -.0556092   -.0299947
                  OH  |  -.0733325   .0060852   -12.05   0.000     -.085555     -.06111
                  IN  |  -.0694868    .004515   -15.39   0.000    -.0785553   -.0604182
                  IL  |  -.0010687   .0070481    -0.15   0.880    -.0152253    .0130878
                  MI  |  -.0403628   .0066397    -6.08   0.000    -.0536991   -.0270265
                  WI  |  -.0217651   .0044672    -4.87   0.000    -.0307377   -.0127924
                  MN  |   .0351196   .0060692     5.79   0.000     .0229293      .04731
                  IA  |  -.0409541   .0069377    -5.90   0.000     -.054889   -.0270193
                  MO  |  -.0815801   .0057363   -14.22   0.000    -.0931017   -.0700585
                  ND  |  -.0618297   .0076482    -8.08   0.000    -.0771915   -.0464678
                  SD  |  -.0786635   .0074225   -10.60   0.000     -.093572    -.063755
                  NE  |  -.0726432   .0074653    -9.73   0.000    -.0876377   -.0576488
                  KS  |  -.0672154   .0073741    -9.12   0.000    -.0820267   -.0524042
                  DE  |   .0362103   .0025348    14.29   0.000      .031119    .0413017
                  MD  |   .0924595   .0088883    10.40   0.000     .0746069    .1103121
                  DC  |   .1614839   .0117387    13.76   0.000     .1379061    .1850617
                  VA  |   .0528286   .0086899     6.08   0.000     .0353744    .0702829
                  WV  |  -.1535259   .0028697   -53.50   0.000    -.1592899   -.1477619
                  NC  |  -.0271002   .0077897    -3.48   0.001    -.0427464   -.0114541
                  SC  |  -.0641071   .0079609    -8.05   0.000     -.080097   -.0481172
                  GA  |   .0001513   .0085555     0.02   0.986     -.017033    .0173356
                  FL  |  -.0391964   .0093276    -4.20   0.000    -.0579315   -.0204613
                  KY  |  -.0877974   .0040015   -21.94   0.000    -.0958347   -.0797602
                  TN  |  -.0782197   .0080444    -9.72   0.000    -.0943773    -.062062
                  AL  |  -.0894682   .0079427   -11.26   0.000    -.1054216   -.0735148
                  MS  |  -.1034908   .0080209   -12.90   0.000    -.1196012   -.0873804
                  AR  |  -.1105777   .0073223   -15.10   0.000    -.1252849   -.0958704
                  LA  |  -.0952465   .0088816   -10.72   0.000    -.1130857   -.0774073
                  OK  |  -.1328526   .0060792   -21.85   0.000     -.145063   -.1206421
                  TX  |  -.0026272   .0089678    -0.29   0.771    -.0206395    .0153851
                  MT  |  -.0755056   .0011137   -67.80   0.000    -.0777425   -.0732687
                  ID  |  -.0441449    .006999    -6.31   0.000    -.0582027    -.030087
                  WY  |   .0028778   .0074724     0.39   0.702    -.0121309    .0178864
                  CO  |  -.0018442   .0078571    -0.23   0.815    -.0176256    .0139371
                  NM  |  -.0873732   .0048804   -17.90   0.000    -.0971758   -.0775706
                  AZ  |   .0038515   .0092242     0.42   0.678    -.0146759    .0223788
                  UT  |  -.0531594    .008505    -6.25   0.000    -.0702421   -.0360767
                  NV  |   .0510271   .0095146     5.36   0.000     .0319164    .0701378
                  WA  |   .0527313   .0073923     7.13   0.000     .0378835    .0675791
                  OR  |  -.0081147   .0068646    -1.18   0.243    -.0219026    .0056732
                  CA  |   .1131519    .008903    12.71   0.000     .0952698    .1310341
                  AK  |   .1732665   .0053677    32.28   0.000     .1624852    .1840478
                  HI  |    .068285   .0063189    10.81   0.000     .0555931    .0809769
                      |
                 year |
                1990  |  -.0061467   .0025243    -2.44   0.018    -.0112168   -.0010766
                1991  |   .0017923   .0035114     0.51   0.612    -.0052606    .0088452
                1992  |   .0226062   .0047238     4.79   0.000     .0131182    .0320943
                1993  |   .0166821   .0042695     3.91   0.000     .0081065    .0252577
                1996  |  -.0002868   .0040143    -0.07   0.943    -.0083498    .0077762
                1997  |    .013722   .0039992     3.43   0.001     .0056895    .0217545
                1998  |   .0440717   .0042505    10.37   0.000     .0355344     .052609
                1999  |   .0634308   .0045164    14.04   0.000     .0543594    .0725023
                2000  |   .0779329   .0048073    16.21   0.000     .0682772    .0875886
                2001  |   .0907829   .0055416    16.38   0.000     .0796522    .1019136
                2002  |   .1066913   .0051638    20.66   0.000     .0963196    .1170631
                2003  |   .1168482   .0055579    21.02   0.000     .1056849    .1280115
                2004  |   .1068736   .0056326    18.97   0.000     .0955602     .118187
                2005  |   .0956486   .0059879    15.97   0.000     .0836216    .1076757
                2006  |   .0900927   .0050728    17.76   0.000     .0799036    .1002818
                2007  |   .0914909   .0055483    16.49   0.000     .0803468     .102635
                2008  |   .0857848   .0066961    12.81   0.000     .0723352    .0992344
                2009  |   .1103408   .0083054    13.29   0.000     .0936589    .1270227
                2010  |   .1077151   .0073769    14.60   0.000     .0928981    .1225321
                2011  |   .0880583   .0064177    13.72   0.000      .075168    .1009487
                2012  |   .0713572   .0062369    11.44   0.000     .0588301    .0838844
                2013  |   .0706548   .0066382    10.64   0.000     .0573216    .0839879
                2014  |   .0655493   .0065204    10.05   0.000     .0524527    .0786459
                2015  |   .0782376   .0055774    14.03   0.000     .0670351    .0894402
                2016  |   .0903493   .0070454    12.82   0.000     .0761983    .1045004
                2017  |   .1015234   .0077881    13.04   0.000     .0858805    .1171663
                2018  |   .1057706    .008382    12.62   0.000     .0889348    .1226064
                2019  |    .116817   .0081071    14.41   0.000     .1005334    .1331005
                      |
                 nind |
                   2  |   .0516235   .0397208     1.30   0.200    -.0281581     .131405
                   3  |   .1267898   .0377122     3.36   0.001     .0510425     .202537
                   4  |  -.0831277   .0378718    -2.19   0.033    -.1591954     -.00706
                   5  |   .1114277    .037301     2.99   0.004     .0365065    .1863489
                   6  |   .0889697   .0387308     2.30   0.026     .0111765    .1667628
                   7  |   .0376467   .0401722     0.94   0.353    -.0430415    .1183349
                   8  |  -.0137017    .040901    -0.33   0.739    -.0958537    .0684504
                   9  |  -.0858143   .0425636    -2.02   0.049    -.1713058   -.0003227
                  10  |  -.0771633   .0387478    -1.99   0.052    -.1549906     .000664
                  11  |   .0890617   .0428034     2.08   0.043     .0030885     .175035
                      |
                 educ |   .0868434   .0019054    45.58   0.000     .0830163    .0906706
                exper |   .0471589   .0022064    21.37   0.000     .0427272    .0515906
               exper2 |  -.0015148   .0000961   -15.77   0.000    -.0017078   -.0013219
               exper3 |   .0000232   2.88e-06     8.06   0.000     .0000174     .000029
               exper4 |  -1.16e-07   3.01e-08    -3.86   0.000    -1.76e-07   -5.56e-08
                 edex |  -.0005871   .0000985    -5.96   0.000    -.0007849   -.0003893
                      |
                ee_cl |
                   2  |  -.1200983   .0044957   -26.71   0.000    -.1291281   -.1110685
                   3  |  -.1515055   .0062484   -24.25   0.000    -.1640557   -.1389552
                   4  |  -.1438629   .0103387   -13.91   0.000    -.1646288   -.1230969
                   5  |  -.1499975   .0082584   -18.16   0.000    -.1665849     -.13341
                   6  |  -.1627193    .007837   -20.76   0.000    -.1784603   -.1469783
                   7  |  -.1622947    .008436   -19.24   0.000    -.1792389   -.1453504
                   8  |   -.074459    .010243    -7.27   0.000    -.0950327   -.0538854
                   9  |  -.1599745   .0106672   -15.00   0.000    -.1814002   -.1385489
                  10  |  -.1703243   .0100972   -16.87   0.000     -.190605   -.1500435
                  11  |  -.1530517   .0092021   -16.63   0.000    -.1715347   -.1345686
                  12  |  -.0899718   .0092645    -9.71   0.000      -.10858   -.0713635
                  13  |  -.1253579   .0158024    -7.93   0.000    -.1570981   -.0936178
                  14  |  -.1515401   .0111811   -13.55   0.000     -.173998   -.1290822
                  15  |  -.1220768   .0101997   -11.97   0.000    -.1425636   -.1015901
                  16  |  -.0821007   .0109806    -7.48   0.000    -.1041557   -.0600456
                      |
                 marr |   .0386776   .0023983    16.13   0.000     .0338605    .0434947
                partt |  -.1383986    .002886   -47.95   0.000    -.1441953   -.1326018
               public |   .0150013   .0057002     2.63   0.011      .003552    .0264506
                 cmsa |   .1527494    .007862    19.43   0.000     .1369582    .1685406
                      |
                nocc2 |
                   2  |  -.1382736   .0031975   -43.24   0.000    -.1446959   -.1318513
                   3  |  -.0374955    .007046    -5.32   0.000    -.0516479   -.0233431
                   4  |  -.3261325   .0044964   -72.53   0.000    -.3351638   -.3171013
                   5  |   .0305606   .0062806     4.87   0.000     .0179456    .0431755
                   6  |  -.3378407    .004697   -71.93   0.000     -.347275   -.3284064
                   7  |  -.3674284    .004601   -79.86   0.000    -.3766696   -.3581871
                   8  |  -.1761939   .0076555   -23.02   0.000    -.1915703   -.1608174
                   9  |  -.4259561   .0057345   -74.28   0.000    -.4374741    -.414438
                  10  |   -.450253   .0086313   -52.17   0.000    -.4675896   -.4329165
                  11  |  -.2352815   .0073083   -32.19   0.000    -.2499606   -.2206024
                  12  |  -.4249056   .0094048   -45.18   0.000    -.4437957   -.4060154
                      |
                unemp |  -.0023852   .0015599    -1.53   0.133    -.0055183     .000748
                      |
              quarter |
                   2  |   .0094479    .001462     6.46   0.000     .0065114    .0123844
                   3  |   .0181901   .0018282     9.95   0.000     .0145182    .0218621
                   4  |   .0216788   .0011642    18.62   0.000     .0193404    .0240173
                      |
                _cons |   .4115869   .0421977     9.75   0.000     .3268304    .4963435
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exp
> er3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & cov
> ered == 0, vce(cluster state)
(sum of wgt is 7,731,988,392)

Linear regression                               Number of obs     =    924,307
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5049
                                                Root MSE          =     .39379

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0845988   .0067921   -12.46   0.000     -.098241   -.0709565
             treat_st |  -.0565088   .0123059    -4.59   0.000     -.081226   -.0317917
treat_stblackrelwhite |  -.0277521   .0083082    -3.34   0.002    -.0444396   -.0110646
                      |
                state |
                  NH  |   .1643007   .0093122    17.64   0.000     .1455966    .1830048
                  VT  |  -.1113836   .0076587   -14.54   0.000    -.1267664   -.0960007
                  MA  |    -.09854   .0132063    -7.46   0.000    -.1250655   -.0720144
                  RI  |   -.169972   .0155368   -10.94   0.000    -.2011785   -.1387655
                  CT  |   .0506302   .0161414     3.14   0.003     .0182093    .0830512
                  NY  |  -.0139821   .0157087    -0.89   0.378     -.045534    .0175698
                  NJ  |   .0501122   .0177892     2.82   0.007     .0143815    .0858429
                  PA  |  -.0384961   .0140248    -2.74   0.008    -.0666658   -.0103265
                  OH  |   -.117231   .0182202    -6.43   0.000    -.1538273   -.0806347
                  IN  |   -.249525   .0439659    -5.68   0.000    -.3378332   -.1612168
                  IL  |  -.1295762   .0133772    -9.69   0.000     -.156445   -.1027073
                  MI  |  -.1334922   .0386744    -3.45   0.001    -.2111721   -.0558123
                  WI  |  -.4016494   .0346045   -11.61   0.000    -.4711547   -.3321442
                  MN  |  -.1990835   .0135152   -14.73   0.000    -.2262296   -.1719374
                  IA  |  -.1586042   .0133783   -11.86   0.000    -.1854753   -.1317331
                  MO  |  -.0331914   .0105153    -3.16   0.003     -.054312   -.0120707
                  ND  |  -.8773644   .0147147   -59.62   0.000    -.9069197    -.847809
                  SD  |  -.4357984   .0175794   -24.79   0.000    -.4711075   -.4004892
                  NE  |    -.39173   .0140598   -27.86   0.000    -.4199699   -.3634901
                  KS  |  -.1710931   .0173206    -9.88   0.000    -.2058825   -.1363037
                  DE  |   .1474271   .0135782    10.86   0.000     .1201545    .1746997
                  MD  |  -.3382618    .018263   -18.52   0.000    -.3749442   -.3015795
                  DC  |  -.2360415   .0199158   -11.85   0.000    -.2760436   -.1960395
                  VA  |  -.1643326   .0146799   -11.19   0.000     -.193818   -.1348471
                  WV  |  -.0454901   .0134185    -3.39   0.001    -.0724419   -.0185383
                  NC  |   .0857992   .0125405     6.84   0.000     .0606108    .1109876
                  SC  |   .0531085    .013229     4.01   0.000     .0265372    .0796798
                  GA  |    .192025   .0138444    13.87   0.000     .1642177    .2198323
                  FL  |  -.0151839   .0200609    -0.76   0.453    -.0554774    .0251095
                  KY  |  -.2246932   .0219615   -10.23   0.000    -.2688042   -.1805822
                  TN  |   -.160656   .0155538   -10.33   0.000    -.1918967   -.1294153
                  AL  |   -.136774   .0151803    -9.01   0.000    -.1672646   -.1062834
                  MS  |  -.0773025   .0126824    -6.10   0.000    -.1027759   -.0518291
                  AR  |  -.0883037   .0126872    -6.96   0.000    -.1137867   -.0628208
                  LA  |  -.0714253   .0169122    -4.22   0.000    -.1053946   -.0374561
                  OK  |  -.4303275   .0539539    -7.98   0.000    -.5386971   -.3219579
                  TX  |    -.14571   .0197188    -7.39   0.000    -.1853164   -.1061036
                  MT  |  -.5865727     .00806   -72.78   0.000    -.6027617   -.5703838
                  ID  |   .0806947   .0147213     5.48   0.000     .0511261    .1102634
                  WY  |  -.7027401   .0168863   -41.62   0.000    -.7366572    -.668823
                  CO  |  -.2509389   .0129979   -19.31   0.000     -.277046   -.2248318
                  NM  |  -.4939612   .0070525   -70.04   0.000    -.5081267   -.4797958
                  AZ  |  -.1633973   .0184284    -8.87   0.000    -.2004117   -.1263828
                  UT  |  -.2055138   .0194597   -10.56   0.000    -.2445999   -.1664278
                  NV  |   .0317551   .0222882     1.42   0.160     -.013012    .0765222
                  WA  |  -.4301917   .0096603   -44.53   0.000    -.4495951   -.4107883
                  OR  |  -.1940307   .0089474   -21.69   0.000    -.2120021   -.1760593
                  CA  |  -.1125609   .0172314    -6.53   0.000    -.1471712   -.0779507
                  AK  |   .3856882   .0145322    26.54   0.000     .3564993    .4148771
                  HI  |   -.181934   .0188854    -9.63   0.000    -.2198664   -.1440016
                      |
        state#c.lyear |
                  ME  |   .0024961   .0001257    19.85   0.000     .0022436    .0027486
                  NH  |   .0015074    .000231     6.53   0.000     .0010435    .0019714
                  VT  |   .0039831   .0000822    48.48   0.000     .0038181    .0041481
                  MA  |   .0043423   .0000938    46.32   0.000     .0041539    .0045306
                  RI  |   .0041559   .0000872    47.68   0.000     .0039809     .004331
                  CT  |   .0029621   .0000762    38.85   0.000     .0028089    .0031152
                  NY  |   .0030359    .000068    44.66   0.000     .0028993    .0031724
                  NJ  |    .003071   .0000662    46.42   0.000     .0029381    .0032039
                  PA  |    .002456   .0000706    34.80   0.000     .0023142    .0025977
                  OH  |   .0029276   .0000495    59.14   0.000     .0028282     .003027
                  IN  |    .004311   .0004635     9.30   0.000       .00338    .0052419
                  IL  |    .003736   .0000795    46.97   0.000     .0035762    .0038957
                  MI  |   .0034565   .0003896     8.87   0.000      .002674     .004239
                  WI  |   .0061991   .0003567    17.38   0.000     .0054826    .0069156
                  MN  |    .004758   .0000812    58.57   0.000     .0045948    .0049211
                  IA  |   .0039342   .0001049    37.51   0.000     .0037235    .0041448
                  MO  |   .0020344   .0000862    23.60   0.000     .0018612    .0022075
                  ND  |   .0106658    .000105   101.54   0.000     .0104548    .0108768
                  SD  |   .0062998   .0000658    95.79   0.000     .0061677    .0064319
                  NE  |   .0058753   .0001103    53.28   0.000     .0056538    .0060968
                  KS  |   .0038097   .0000749    50.87   0.000     .0036593    .0039602
                  DE  |   .0012871   .0001357     9.49   0.000     .0010146    .0015596
                  MD  |   .0066197   .0000831    79.62   0.000     .0064527    .0067867
                  DC  |   .0063022    .000147    42.86   0.000     .0060069    .0065975
                  VA  |   .0048925   .0001377    35.54   0.000     .0046159     .005169
                  WV  |   .0014791   .0002256     6.56   0.000      .001026    .0019321
                  NC  |   .0017046   .0001404    12.14   0.000     .0014227    .0019866
                  SC  |    .001671   .0001229    13.60   0.000     .0014243    .0019178
                  GA  |   .0009472   .0001275     7.43   0.000     .0006912    .0012032
                  FL  |   .0025777   .0000767    33.61   0.000     .0024236    .0027317
                  KY  |   .0038526   .0002481    15.53   0.000     .0033542    .0043509
                  TN  |   .0035947   .0000994    36.18   0.000     .0033952    .0037943
                  AL  |   .0032607   .0000968    33.68   0.000     .0030662    .0034552
                  MS  |   .0025541   .0001183    21.59   0.000     .0023164    .0027917
                  AR  |   .0026008   .0001796    14.48   0.000     .0022401    .0029614
                  LA  |   .0025565   .0001041    24.56   0.000     .0023474    .0027656
                  OK  |   .0055645    .000612     9.09   0.000     .0043353    .0067937
                  TX  |   .0041656   .0000907    45.94   0.000     .0039834    .0043477
                  MT  |   .0074371   .0000779    95.47   0.000     .0072806    .0075936
                  ID  |   .0016284   .0002105     7.74   0.000     .0012056    .0020512
                  WY  |    .009453   .0000648   145.98   0.000     .0093229    .0095831
                  CO  |    .004894    .000091    53.77   0.000     .0047112    .0050768
                  NM  |   .0064235   .0002038    31.52   0.000     .0060142    .0068328
                  AZ  |   .0044121   .0000875    50.45   0.000     .0042364    .0045878
                  UT  |   .0042702   .0000793    53.83   0.000     .0041109    .0044296
                  NV  |   .0030074   .0000784    38.37   0.000       .00285    .0031648
                  WA  |   .0071383   .0001182    60.38   0.000     .0069008    .0073757
                  OR  |   .0042979   .0001088    39.51   0.000     .0040794    .0045164
                  CA  |   .0046854   .0000682    68.71   0.000     .0045485    .0048224
                  AK  |   .0003918   .0000536     7.30   0.000     .0002841    .0004996
                  HI  |   .0049338   .0000544    90.68   0.000     .0048245    .0050431
                      |
                 nind |
                   2  |   .0543087   .0396362     1.37   0.177     -.025303    .1339204
                   3  |   .1266794   .0376289     3.37   0.001     .0510994    .2022594
                   4  |  -.0815076   .0377637    -2.16   0.036    -.1573582   -.0056569
                   5  |   .1139633   .0370585     3.08   0.003     .0395291    .1883975
                   6  |   .0903806   .0386548     2.34   0.023     .0127402    .1680209
                   7  |   .0393351   .0400599     0.98   0.331    -.0411276    .1197978
                   8  |  -.0120393   .0408357    -0.29   0.769    -.0940604    .0699817
                   9  |  -.0842398   .0424594    -1.98   0.053    -.1695222    .0010425
                  10  |  -.0772549   .0386374    -2.00   0.051    -.1548604    .0003506
                  11  |   .0909741   .0427338     2.13   0.038     .0051408    .1768074
                      |
                 educ |    .085085   .0019427    43.80   0.000      .081183     .088987
                exper |   .0463943    .002194    21.15   0.000     .0419875     .050801
               exper2 |  -.0014709   .0000953   -15.43   0.000    -.0016623   -.0012794
               exper3 |   .0000218   2.87e-06     7.60   0.000      .000016    .0000276
               exper4 |  -1.03e-07   3.00e-08    -3.44   0.001    -1.64e-07   -4.30e-08
                 edex |  -.0005589   .0000996    -5.61   0.000     -.000759   -.0003588
                      |
                ee_cl |
                   2  |  -.1205776   .0045822   -26.31   0.000    -.1297812   -.1113741
                   3  |  -.1487093   .0064026   -23.23   0.000    -.1615693   -.1358492
                   4  |  -.1375446   .0104058   -13.22   0.000    -.1584452    -.116644
                   5  |    -.15518   .0082435   -18.82   0.000    -.1717376   -.1386224
                   6  |   -.164089   .0078311   -20.95   0.000    -.1798183   -.1483596
                   7  |  -.1594853   .0086564   -18.42   0.000    -.1768722   -.1420984
                   8  |  -.0687813   .0104042    -6.61   0.000    -.0896787    -.047884
                   9  |  -.1634926   .0106776   -15.31   0.000    -.1849391    -.142046
                  10  |  -.1689402   .0101674   -16.62   0.000     -.189362   -.1485184
                  11  |  -.1490039   .0093363   -15.96   0.000    -.1677563   -.1302515
                  12  |  -.0844897   .0092786    -9.11   0.000    -.1031263   -.0658531
                  13  |  -.1275451   .0157417    -8.10   0.000    -.1591632    -.095927
                  14  |  -.1491035   .0112323   -13.27   0.000    -.1716642   -.1265428
                  15  |  -.1187864   .0103733   -11.45   0.000    -.1396218   -.0979509
                  16  |  -.0792191   .0109018    -7.27   0.000     -.101116   -.0573223
                      |
                 marr |   .0383437    .002379    16.12   0.000     .0335653     .043122
                partt |    -.13849   .0029132   -47.54   0.000    -.1443414   -.1326387
               public |   .0147022   .0056247     2.61   0.012     .0034046    .0259998
                 cmsa |   .1529663   .0078538    19.48   0.000     .1371914    .1687412
                      |
                nocc2 |
                   2  |   -.137617   .0033031   -41.66   0.000    -.1442514   -.1309826
                   3  |  -.0366465   .0071095    -5.15   0.000    -.0509263   -.0223666
                   4  |   -.324947   .0045602   -71.26   0.000    -.3341065   -.3157875
                   5  |   .0304227   .0063139     4.82   0.000     .0177407    .0431046
                   6  |  -.3379381   .0047693   -70.86   0.000    -.3475176   -.3283587
                   7  |  -.3676173    .004663   -78.84   0.000    -.3769833   -.3582513
                   8  |  -.1748614   .0078003   -22.42   0.000    -.1905287    -.159194
                   9  |   -.425864   .0057884   -73.57   0.000    -.4374904   -.4142377
                  10  |  -.4519688   .0086309   -52.37   0.000    -.4693045   -.4346331
                  11  |  -.2339336   .0072946   -32.07   0.000    -.2485853   -.2192819
                  12  |  -.4255115   .0095219   -44.69   0.000    -.4446368   -.4063862
                      |
                unemp |  -.0025332   .0005471    -4.63   0.000     -.003632   -.0014344
                      |
              quarter |
                   2  |   .0090953   .0014071     6.46   0.000      .006269    .0119216
                   3  |   .0177645   .0017751    10.01   0.000      .014199    .0213299
                   4  |   .0212476   .0011802    18.00   0.000     .0188771    .0236181
                      |
                _cons |   .2394071   .0422167     5.67   0.000     .1546123    .3242018
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(
> cluster state)
(sum of wgt is 1,613,820,660)

Linear regression                               Number of obs     =    189,324
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3404
                                                Root MSE          =     .36129

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1400395   .0122665   -11.42   0.000    -.1646776   -.1154015
             treat_st |   -.056078   .0311913    -1.80   0.078    -.1187276    .0065715
treat_stblackrelwhite |  -.0149864    .014726    -1.02   0.314    -.0445644    .0145916
                      |
                state |
                  NH  |    .040077   .0052948     7.57   0.000     .0294421     .050712
                  VT  |  -.0180129   .0033428    -5.39   0.000    -.0247272   -.0112986
                  MA  |   .0927348   .0098244     9.44   0.000     .0730019    .1124677
                  RI  |   .0314337   .0106878     2.94   0.005     .0099667    .0529008
                  CT  |   .1395112   .0094443    14.77   0.000     .1205417    .1584807
                  NY  |   .1078707    .008277    13.03   0.000     .0912458    .1244956
                  NJ  |   .1784246   .0095792    18.63   0.000     .1591843    .1976649
                  PA  |   .0017759   .0069315     0.26   0.799    -.0121465    .0156983
                  OH  |   .0007343   .0067311     0.11   0.914    -.0127856    .0142542
                  IN  |   .0231546    .005766     4.02   0.000     .0115732    .0347361
                  IL  |   .0847076   .0071456    11.85   0.000     .0703552      .09906
                  MI  |   .0839872   .0066153    12.70   0.000     .0707001    .0972744
                  WI  |   .0240876   .0053858     4.47   0.000     .0132698    .0349053
                  MN  |   .0629123   .0071983     8.74   0.000     .0484541    .0773706
                  IA  |   .0312934   .0308251     1.02   0.315    -.0306206    .0932074
                  MO  |   .0201386   .0069243     2.91   0.005     .0062307    .0340464
                  ND  |   .0447478   .0325081     1.38   0.175    -.0205467    .1100423
                  SD  |  -.0008722   .0312431    -0.03   0.978    -.0636259    .0618815
                  NE  |  -.0080631   .0303272    -0.27   0.791     -.068977    .0528508
                  KS  |    .061313   .0295327     2.08   0.043     .0019947    .1206312
                  DE  |   .0593175   .0042681    13.90   0.000     .0507448    .0678902
                  MD  |   .1215393   .0085879    14.15   0.000     .1042901    .1387885
                  DC  |   .1274728   .0095673    13.32   0.000     .1082563    .1466893
                  VA  |   .1595878   .0300948     5.30   0.000     .0991407     .220035
                  WV  |  -.0066192   .0054113    -1.22   0.227    -.0174881    .0042498
                  NC  |   .0509169   .0306862     1.66   0.103    -.0107181    .1125519
                  SC  |   .0030263    .030656     0.10   0.922    -.0585481    .0646008
                  GA  |   .0949555   .0305542     3.11   0.003     .0335855    .1563255
                  FL  |   .0340703   .0310934     1.10   0.278    -.0283826    .0965233
                  KY  |  -.0269214   .0053666    -5.02   0.000    -.0377005   -.0161422
                  TN  |   .0127655   .0301127     0.42   0.673    -.0477176    .0732486
                  AL  |   .0154071   .0300187     0.51   0.610    -.0448872    .0757014
                  MS  |    -.01141    .030841    -0.37   0.713    -.0733559    .0505359
                  AR  |  -.0120497   .0307986    -0.39   0.697    -.0739105     .049811
                  LA  |   .0584191   .0300522     1.94   0.058    -.0019425    .1187807
                  OK  |  -.0407978   .0141538    -2.88   0.006    -.0692266    -.012369
                  TX  |   .0847001   .0302487     2.80   0.007     .0239439    .1454563
                  MT  |  -.0422677   .0036603   -11.55   0.000    -.0496197   -.0349158
                  ID  |   .0387442   .0313205     1.24   0.222    -.0241648    .1016531
                  WY  |   .1923567   .0333234     5.77   0.000     .1254247    .2592888
                  CO  |   .0079903   .0084801     0.94   0.351    -.0090425    .0250231
                  NM  |  -.0417623   .0074381    -5.61   0.000    -.0567021   -.0268226
                  AZ  |   .0753913   .0309886     2.43   0.019     .0131489    .1376338
                  UT  |   .0139584   .0303199     0.46   0.647     -.046941    .0748578
                  NV  |     .14459   .0322642     4.48   0.000     .0797853    .2093946
                  WA  |   .1005098   .0080244    12.53   0.000     .0843923    .1166274
                  OR  |   .0259493   .0076075     3.41   0.001     .0106692    .0412295
                  CA  |   .1739691    .009944    17.49   0.000     .1539959    .1939423
                  AK  |   .2344765   .0061992    37.82   0.000     .2220251    .2469278
                  HI  |   .0920748   .0082797    11.12   0.000     .0754445     .108705
                      |
                 year |
                1990  |  -.0185557   .0052261    -3.55   0.001    -.0290526   -.0080587
                1991  |  -.0317558    .004989    -6.37   0.000    -.0417765   -.0217352
                1992  |  -.0308074   .0070283    -4.38   0.000    -.0449242   -.0166906
                1993  |  -.0319988   .0059268    -5.40   0.000    -.0439032   -.0200944
                1996  |  -.0147031   .0059648    -2.46   0.017    -.0266837   -.0027225
                1997  |  -.0056824   .0069157    -0.82   0.415     -.019573    .0082081
                1998  |   .0054298   .0061342     0.89   0.380    -.0068911    .0177506
                1999  |   .0164978   .0069515     2.37   0.022     .0025352    .0304604
                2000  |   .0138021   .0065477     2.11   0.040     .0006506    .0269537
                2001  |   .0184087   .0059723     3.08   0.003     .0064129    .0304044
                2002  |   .0266415   .0087418     3.05   0.004     .0090831    .0441999
                2003  |   .0345503   .0081436     4.24   0.000     .0181933    .0509072
                2004  |   .0264893   .0064459     4.11   0.000     .0135423    .0394363
                2005  |   .0231212    .007889     2.93   0.005     .0072756    .0389668
                2006  |   .0200142   .0100329     1.99   0.052    -.0001375    .0401659
                2007  |   .0244745   .0118175     2.07   0.044     .0007383    .0482107
                2008  |   .0079135   .0079218     1.00   0.323     -.007998     .023825
                2009  |   .0186203   .0089974     2.07   0.044     .0005485    .0366921
                2010  |   .0274035   .0100525     2.73   0.009     .0072125    .0475945
                2011  |   .0083314    .011163     0.75   0.459    -.0140901    .0307529
                2012  |  -.0063311   .0120449    -0.53   0.601     -.030524    .0178619
                2013  |   -.003395   .0101974    -0.33   0.741    -.0238771    .0170871
                2014  |   .0060173   .0110451     0.54   0.588    -.0161673     .028202
                2015  |   .0102221   .0095472     1.07   0.289     -.008954    .0293982
                2016  |    .011868   .0098355     1.21   0.233    -.0078873    .0316232
                2017  |   .0293343   .0090069     3.26   0.002     .0112434    .0474251
                2018  |   .0305745   .0097666     3.13   0.003     .0109578    .0501913
                2019  |   .0442866   .0099825     4.44   0.000     .0242361    .0643371
                      |
                 nind |
                   2  |    .069129   .0245881     2.81   0.007     .0197423    .1185156
                   3  |  -.0525317   .0228196    -2.30   0.026    -.0983662   -.0066973
                   4  |  -.2256972   .0266505    -8.47   0.000    -.2792262   -.1721681
                   5  |   .0698832   .0226622     3.08   0.003     .0243648    .1154015
                   6  |  -.0813124   .0255624    -3.18   0.003     -.132656   -.0299689
                   7  |  -.0947998    .023269    -4.07   0.000    -.1415369   -.0480627
                   8  |  -.1939104   .0244171    -7.94   0.000    -.2429536   -.1448672
                   9  |  -.1462787   .0252057    -5.80   0.000    -.1969057   -.0956516
                  10  |  -.1633073   .0424079    -3.85   0.000    -.2484861   -.0781285
                  11  |   .0810181   .0245689     3.30   0.002     .0316699    .1303663
                      |
                 educ |   .0723639   .0040658    17.80   0.000     .0641974    .0805304
                exper |   .0715487   .0024782    28.87   0.000      .066571    .0765263
               exper2 |  -.0025646   .0001687   -15.20   0.000    -.0029035   -.0022258
               exper3 |   .0000514   4.79e-06    10.74   0.000     .0000418     .000061
               exper4 |  -4.18e-07   4.66e-08    -8.96   0.000    -5.11e-07   -3.24e-07
                 edex |  -.0007823   .0001044    -7.49   0.000     -.000992   -.0005726
                      |
                ee_cl |
                   2  |   .0706071   .0168843     4.18   0.000     .0366939    .1045203
                   3  |   .0569084   .0183489     3.10   0.003     .0200535    .0937634
                   4  |   .0129834   .0257384     0.50   0.616    -.0387138    .0646806
                   5  |   .0124572   .0210626     0.59   0.557    -.0298483    .0547627
                   6  |   .0457586   .0160909     2.84   0.006     .0134391    .0780781
                   7  |   .0537409   .0207136     2.59   0.012     .0121364    .0953455
                   8  |   .0139362   .0238147     0.59   0.561    -.0338971    .0617695
                   9  |   .0071893   .0224898     0.32   0.751    -.0379828    .0523613
                  10  |   .0310417   .0188945     1.64   0.107    -.0069091    .0689925
                  11  |   .0436673   .0205426     2.13   0.038     .0024063    .0849284
                  12  |   .0577082   .0236909     2.44   0.018     .0101237    .1052927
                  13  |   .0430419   .0207636     2.07   0.043      .001337    .0847468
                  14  |   .0222404   .0199159     1.12   0.269     -.017762    .0622427
                  15  |   .0386309   .0215976     1.79   0.080    -.0047492     .082011
                  16  |   .0747845   .0220415     3.39   0.001     .0305129    .1190562
                      |
                 marr |   .0638201   .0027496    23.21   0.000     .0582972    .0693429
                partt |  -.0947654   .0176423    -5.37   0.000     -.130201   -.0593298
               public |  -.0523194   .0082546    -6.34   0.000    -.0688993   -.0357396
                 cmsa |   .1107139   .0109358    10.12   0.000     .0887487    .1326792
                      |
                nocc2 |
                   2  |  -.0359561   .0104827    -3.43   0.001    -.0570113    -.014901
                   3  |  -.0199122   .0117823    -1.69   0.097    -.0435777    .0037533
                   4  |  -.0700537   .0137834    -5.08   0.000    -.0977384   -.0423689
                   5  |   .0089471   .0173082     0.52   0.607    -.0258175    .0437118
                   6  |  -.2391371   .0096689   -24.73   0.000    -.2585577   -.2197166
                   7  |  -.1918752   .0105043   -18.27   0.000    -.2129736   -.1707767
                   8  |  -.0853977   .0268997    -3.17   0.003    -.1394272   -.0313681
                   9  |  -.2189549   .0098868   -22.15   0.000    -.2388132   -.1990967
                  10  |  -.1423899   .0064156   -22.19   0.000    -.1552761   -.1295037
                  11  |  -.0669049   .0079438    -8.42   0.000    -.0828605   -.0509492
                  12  |  -.1870405   .0071262   -26.25   0.000    -.2013538   -.1727272
                      |
              quarter |
                   2  |    .001018   .0028487     0.36   0.722    -.0047039    .0067399
                   3  |   .0075814   .0028548     2.66   0.011     .0018473    .0133156
                   4  |   .0109097   .0020455     5.33   0.000     .0068012    .0150181
                      |
                _cons |   .5167314   .0575348     8.98   0.000     .4011693    .6322936
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1
> , vce(cluster state)
(sum of wgt is 1,613,820,660)

Linear regression                               Number of obs     =    189,324
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3404
                                                Root MSE          =     .36128

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1400211   .0122806   -11.40   0.000    -.1646874   -.1153548
             treat_st |   -.056774   .0319742    -1.78   0.082    -.1209961    .0074481
treat_stblackrelwhite |  -.0149683   .0147252    -1.02   0.314    -.0445447    .0146081
                      |
                state |
                  NH  |   .0364746   .0060272     6.05   0.000     .0243685    .0485807
                  VT  |  -.0216229   .0034277    -6.31   0.000    -.0285077    -.014738
                  MA  |   .0928736   .0097964     9.48   0.000      .073197    .1125502
                  RI  |   .0345343   .0102293     3.38   0.001      .013988    .0550805
                  CT  |   .1395994   .0094181    14.82   0.000     .1206825    .1585162
                  NY  |   .1100352   .0079397    13.86   0.000     .0940877    .1259826
                  NJ  |   .1798577   .0092848    19.37   0.000     .1612086    .1985068
                  PA  |   .0028188     .00668     0.42   0.675    -.0105985     .016236
                  OH  |   .0023948   .0062499     0.38   0.703    -.0101584     .014948
                  IN  |   .0228751   .0058048     3.94   0.000     .0112158    .0345344
                  IL  |   .0875789   .0066525    13.16   0.000     .0742168    .1009409
                  MI  |   .0884796   .0067535    13.10   0.000     .0749148    .1020444
                  WI  |   .0223727    .005706     3.92   0.000     .0109118    .0338336
                  MN  |   .0601251   .0080209     7.50   0.000     .0440146    .0762355
                  IA  |   .0278965   .0297902     0.94   0.354    -.0319388    .0877319
                  MO  |   .0206345   .0067972     3.04   0.004     .0069819     .034287
                  ND  |   .0395165    .030614     1.29   0.203    -.0219736    .1010066
                  SD  |  -.0057603    .029598    -0.19   0.846    -.0652095     .053689
                  NE  |  -.0140661   .0283725    -0.50   0.622    -.0710539    .0429217
                  KS  |    .059545   .0292629     2.03   0.047     .0007688    .1183212
                  DE  |   .0569819   .0045773    12.45   0.000     .0477882    .0661756
                  MD  |   .1202785   .0090278    13.32   0.000     .1021457    .1384112
                  DC  |   .1327084   .0087261    15.21   0.000     .1151816    .1502352
                  VA  |   .1573749   .0296457     5.31   0.000     .0978298      .21692
                  WV  |  -.0011241   .0072608    -0.15   0.878    -.0157079    .0134598
                  NC  |   .0516534   .0314528     1.64   0.107    -.0115214    .1148281
                  SC  |   .0062468   .0325724     0.19   0.849    -.0591767    .0716703
                  GA  |   .0965894   .0317329     3.04   0.004      .032852    .1603268
                  FL  |   .0361218   .0324485     1.11   0.271     -.029053    .1012965
                  KY  |  -.0245387   .0056206    -4.37   0.000    -.0358281   -.0132494
                  TN  |   .0142428   .0312234     0.46   0.650    -.0484713    .0769569
                  AL  |   .0186304   .0319308     0.58   0.562    -.0455045    .0827654
                  MS  |   -.006164   .0338111    -0.18   0.856    -.0740757    .0617477
                  AR  |  -.0097312   .0323147    -0.30   0.765    -.0746372    .0551747
                  LA  |   .0619618   .0320786     1.93   0.059    -.0024699    .1263935
                  OK  |  -.0420046   .0139602    -3.01   0.004    -.0700445   -.0139648
                  TX  |    .086603   .0315199     2.75   0.008     .0232936    .1499125
                  MT  |  -.0426495   .0035296   -12.08   0.000    -.0497389   -.0355601
                  ID  |   .0395889   .0321925     1.23   0.225    -.0250715    .1042494
                  WY  |   .1903998   .0329151     5.78   0.000     .1242878    .2565119
                  CO  |   .0064833   .0088614     0.73   0.468    -.0113153     .024282
                  NM  |  -.0397446   .0073654    -5.40   0.000    -.0545385   -.0249507
                  AZ  |   .0776066   .0324134     2.39   0.020     .0125024    .1427108
                  UT  |   .0116066   .0298655     0.39   0.699      -.04838    .0715933
                  NV  |   .1476194   .0341921     4.32   0.000     .0789425    .2162963
                  WA  |   .1029162   .0075935    13.55   0.000     .0876643    .1181681
                  OR  |   .0293037   .0073944     3.96   0.000     .0144516    .0441558
                  CA  |   .1786754   .0096455    18.52   0.000      .159302    .1980489
                  AK  |   .2404409   .0076029    31.62   0.000     .2251701    .2557118
                  HI  |   .0881174   .0088648     9.94   0.000     .0703119    .1059229
                      |
                 year |
                1990  |  -.0174416   .0048968    -3.56   0.001     -.027277   -.0076061
                1991  |  -.0267498   .0061575    -4.34   0.000    -.0391175   -.0143822
                1992  |  -.0237931   .0074484    -3.19   0.002    -.0387537   -.0088325
                1993  |  -.0268118   .0068807    -3.90   0.000    -.0406321   -.0129915
                1996  |  -.0143909   .0059319    -2.43   0.019    -.0263055   -.0024762
                1997  |  -.0066694   .0066274    -1.01   0.319    -.0199809    .0066421
                1998  |   .0030775   .0066184     0.46   0.644    -.0102161     .016371
                1999  |   .0133229   .0066421     2.01   0.050    -.0000181    .0266639
                2000  |    .010057   .0058939     1.71   0.094    -.0017813    .0218953
                2001  |   .0169083    .006708     2.52   0.015     .0034349    .0303817
                2002  |   .0283687   .0086575     3.28   0.002     .0109795    .0457579
                2003  |   .0370166   .0081935     4.52   0.000     .0205596    .0534737
                2004  |   .0276511   .0063245     4.37   0.000      .014948    .0403541
                2005  |   .0228739   .0079438     2.88   0.006     .0069182    .0388295
                2006  |   .0184968   .0105308     1.76   0.085    -.0026549    .0396484
                2007  |   .0229409   .0123694     1.85   0.070    -.0019039    .0477857
                2008  |   .0097749   .0073389     1.33   0.189    -.0049656    .0245155
                2009  |   .0307182   .0117272     2.62   0.012     .0071634     .054273
                2010  |   .0406295   .0116464     3.49   0.001      .017237    .0640221
                2011  |   .0194371   .0119227     1.63   0.109    -.0045102    .0433845
                2012  |   .0023467    .012141     0.19   0.848    -.0220392    .0267326
                2013  |   .0034122   .0104068     0.33   0.744    -.0174904    .0243148
                2014  |   .0090463   .0112949     0.80   0.427    -.0136402    .0317328
                2015  |   .0104501   .0096021     1.09   0.282    -.0088364    .0297365
                2016  |   .0107885   .0104198     1.04   0.305    -.0101402    .0317173
                2017  |   .0268725   .0096357     2.79   0.007     .0075187    .0462263
                2018  |   .0267606   .0097754     2.74   0.009     .0071261    .0463951
                2019  |   .0398742   .0106865     3.73   0.000     .0184098    .0613386
                      |
                 nind |
                   2  |    .068894   .0246847     2.79   0.007     .0193133    .1184747
                   3  |  -.0527909   .0228922    -2.31   0.025    -.0987713   -.0068105
                   4  |   -.225903   .0267521    -8.44   0.000    -.2796361     -.17217
                   5  |   .0696967   .0227671     3.06   0.004     .0239677    .1154257
                   6  |  -.0814237   .0256485    -3.17   0.003    -.1329402   -.0299072
                   7  |  -.0950644    .023395    -4.06   0.000    -.1420545   -.0480742
                   8  |  -.1941352   .0245324    -7.91   0.000    -.2434101   -.1448603
                   9  |   -.146481   .0252824    -5.79   0.000    -.1972622   -.0956999
                  10  |   -.163562   .0425374    -3.85   0.000    -.2490008   -.0781231
                  11  |   .0807792   .0246785     3.27   0.002      .031211    .1303475
                      |
                 educ |   .0723887   .0040704    17.78   0.000      .064213    .0805643
                exper |   .0715936   .0024776    28.90   0.000     .0666173    .0765699
               exper2 |  -.0025658   .0001686   -15.22   0.000    -.0029044   -.0022272
               exper3 |   .0000515   4.79e-06    10.74   0.000     .0000418    .0000611
               exper4 |  -4.18e-07   4.67e-08    -8.95   0.000    -5.12e-07   -3.24e-07
                 edex |  -.0007842    .000105    -7.47   0.000     -.000995   -.0005734
                      |
                ee_cl |
                   2  |   .0706275   .0168768     4.18   0.000     .0367295    .1045256
                   3  |   .0569121    .018333     3.10   0.003     .0200892     .093735
                   4  |   .0129426   .0257353     0.50   0.617    -.0387483    .0646335
                   5  |   .0124314   .0211065     0.59   0.559    -.0299623    .0548252
                   6  |   .0457145   .0160939     2.84   0.006      .013389    .0780401
                   7  |   .0537269    .020709     2.59   0.012     .0121316    .0953222
                   8  |    .013914   .0237826     0.59   0.561    -.0338548    .0616827
                   9  |   .0071243    .022523     0.32   0.753    -.0381144    .0523631
                  10  |   .0308797   .0189041     1.63   0.109    -.0070903    .0688497
                  11  |   .0435976   .0205381     2.12   0.039     .0023456    .0848495
                  12  |   .0577417   .0236636     2.44   0.018      .010212    .1052715
                  13  |   .0428245   .0207996     2.06   0.045     .0010472    .0846018
                  14  |   .0221191   .0199267     1.11   0.272     -.017905    .0621431
                  15  |   .0385741   .0215894     1.79   0.080    -.0047894    .0819377
                  16  |   .0748139   .0220044     3.40   0.001     .0306167    .1190111
                      |
                 marr |    .063838   .0027412    23.29   0.000      .058332     .069344
                partt |    -.09456   .0176364    -5.36   0.000    -.1299837   -.0591362
               public |  -.0522609    .008272    -6.32   0.000    -.0688758    -.035646
                 cmsa |   .1106648   .0109232    10.13   0.000     .0887249    .1326047
                      |
                nocc2 |
                   2  |  -.0359405   .0104652    -3.43   0.001    -.0569604   -.0149205
                   3  |  -.0198941   .0117903    -1.69   0.098    -.0435755    .0037874
                   4  |  -.0700787   .0137678    -5.09   0.000    -.0977322   -.0424252
                   5  |   .0089163   .0173268     0.51   0.609    -.0258857    .0437182
                   6  |  -.2391243   .0096892   -24.68   0.000    -.2585857    -.219663
                   7  |  -.1918359   .0105052   -18.26   0.000    -.2129363   -.1707356
                   8  |  -.0855715   .0268716    -3.18   0.002    -.1395448   -.0315982
                   9  |   -.218898   .0098914   -22.13   0.000    -.2387654   -.1990306
                  10  |  -.1423725   .0064109   -22.21   0.000    -.1552492   -.1294958
                  11  |  -.0668962   .0079457    -8.42   0.000    -.0828557   -.0509367
                  12  |    -.18702   .0071291   -26.23   0.000    -.2013393   -.1727008
                      |
                unemp |  -.0030178   .0023136    -1.30   0.198    -.0076648    .0016292
                      |
              quarter |
                   2  |    .001011    .002849     0.35   0.724    -.0047114    .0067335
                   3  |   .0076121     .00285     2.67   0.010     .0018878    .0133364
                   4  |   .0110208   .0020358     5.41   0.000     .0069319    .0151098
                      |
                _cons |    .530831   .0572343     9.27   0.000     .4158724    .6457895
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exp
> er3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & cov
> ered == 1, vce(cluster state)
(sum of wgt is 1,613,820,660)

Linear regression                               Number of obs     =    189,324
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3406
                                                Root MSE          =     .36125

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1410372   .0122008   -11.56   0.000    -.1655432   -.1165313
             treat_st |  -.0435502   .0195075    -2.23   0.030    -.0827321   -.0043682
treat_stblackrelwhite |  -.0138991   .0144625    -0.96   0.341     -.042948    .0151498
                      |
                state |
                  NH  |  -.2866087   .0101203   -28.32   0.000    -.3069359   -.2662815
                  VT  |   -.384809   .0160884   -23.92   0.000    -.4171234   -.3524946
                  MA  |  -.1895875   .0194056    -9.77   0.000    -.2285649   -.1506101
                  RI  |  -.2732361   .0269473   -10.14   0.000    -.3273614   -.2191107
                  CT  |  -.1331236   .0212767    -6.26   0.000    -.1758592    -.090388
                  NY  |  -.0912892   .0253166    -3.61   0.001    -.1421392   -.0404392
                  NJ  |  -.1500022   .0207265    -7.24   0.000    -.1916326   -.1083718
                  PA  |  -.2146171   .0197628   -10.86   0.000    -.2543119   -.1749223
                  OH  |   .0244906   .0224541     1.09   0.281    -.0206099    .0695911
                  IN  |  -.0955658   .0632121    -1.51   0.137     -.222531    .0313993
                  IL  |   -.018874   .0171138    -1.10   0.275    -.0532481    .0155002
                  MI  |   .4000949    .063683     6.28   0.000     .2721839     .528006
                  WI  |  -.2920243   .0520601    -5.61   0.000    -.3965901   -.1874585
                  MN  |  -.1342816    .021496    -6.25   0.000    -.1774576   -.0911056
                  IA  |   .1199122   .0172137     6.97   0.000     .0853375    .1544869
                  MO  |   .0342084   .0156836     2.18   0.034     .0027071    .0657098
                  ND  |  -.6411456    .032782   -19.56   0.000    -.7069902    -.575301
                  SD  |  -.4485973   .0303379   -14.79   0.000    -.5095327   -.3876619
                  NE  |  -.3348214   .0148018   -22.62   0.000    -.3645517   -.3050911
                  KS  |  -.1030314   .0187361    -5.50   0.000     -.140664   -.0653988
                  DE  |   .3101111   .0223454    13.88   0.000     .2652291    .3549931
                  MD  |  -.3141424   .0262497   -11.97   0.000    -.3668664   -.2614184
                  DC  |  -.2884396   .0265939   -10.85   0.000     -.341855   -.2350243
                  VA  |   .0652798   .0242654     2.69   0.010     .0165413    .1140183
                  WV  |   .0958611   .0204166     4.70   0.000     .0548532    .1368691
                  NC  |    .103547   .0163297     6.34   0.000     .0707478    .1363461
                  SC  |   .1318044   .0130288    10.12   0.000     .1056353    .1579735
                  GA  |   .1063852   .0178869     5.95   0.000     .0704583    .1423121
                  FL  |   .0526506   .0271143     1.94   0.058      -.00181    .1071111
                  KY  |    .127434   .0370977     3.44   0.001     .0529211     .201947
                  TN  |  -.2357429   .0184449   -12.78   0.000    -.2727906   -.1986951
                  AL  |  -.1954718   .0180256   -10.84   0.000    -.2316773   -.1592663
                  MS  |   -.143955   .0207384    -6.94   0.000    -.1856093   -.1023008
                  AR  |  -.2580933   .0197266   -13.08   0.000    -.2977153   -.2184712
                  LA  |   -.161422   .0254624    -6.34   0.000    -.2125648   -.1102792
                  OK  |  -.4960677    .094326    -5.26   0.000    -.6855271   -.3066084
                  TX  |  -.0988705   .0243599    -4.06   0.000    -.1477988   -.0499422
                  MT  |  -.0296868   .0129809    -2.29   0.026    -.0557597   -.0036139
                  ID  |   .0033331   .0237792     0.14   0.889    -.0444287     .051095
                  WY  |    -.90559   .0264491   -34.24   0.000    -.9587147   -.8524654
                  CO  |  -.0411885   .0221081    -1.86   0.068    -.0855941     .003217
                  NM  |  -.4231972   .0246043   -17.20   0.000    -.4726164   -.3737779
                  AZ  |  -.1985922    .022618    -8.78   0.000    -.2440218   -.1531626
                  UT  |  -.3375882   .0368865    -9.15   0.000    -.4116769   -.2634994
                  NV  |   -.293455   .0419525    -6.99   0.000     -.377719    -.209191
                  WA  |  -.0304845   .0171943    -1.77   0.082    -.0650203    .0040512
                  OR  |   .0164231   .0137225     1.20   0.237    -.0111394    .0439855
                  CA  |   .1479507   .0233729     6.33   0.000     .1010049    .1948965
                  AK  |   .6403179   .0210501    30.42   0.000     .5980375    .6825983
                  HI  |   -.100218   .0248984    -4.03   0.000    -.1502279   -.0502081
                      |
        state#c.lyear |
                  ME  |   .0004849   .0002399     2.02   0.049     3.10e-06    .0009667
                  NH  |   .0035691   .0002869    12.44   0.000     .0029929    .0041454
                  VT  |   .0040138    .000205    19.58   0.000     .0036021    .0044255
                  MA  |    .003261   .0001789    18.23   0.000     .0029017    .0036203
                  RI  |   .0035241   .0001333    26.44   0.000     .0032564    .0037919
                  CT  |   .0031662   .0002135    14.83   0.000     .0027374     .003595
                  NY  |   .0024832   .0001021    24.32   0.000     .0022781    .0026882
                  NJ  |   .0037279   .0002053    18.16   0.000     .0033155    .0041403
                  PA  |   .0026339   .0001563    16.85   0.000       .00232    .0029478
                  OH  |   .0002826   .0001877     1.51   0.138    -.0000944    .0006597
                  IN  |   .0016431   .0006098     2.69   0.010     .0004184    .0028678
                  IL  |   .0015562    .000178     8.74   0.000     .0011988    .0019137
                  MI  |  -.0026267   .0005796    -4.53   0.000    -.0037909   -.0014626
                  WI  |   .0035812   .0004351     8.23   0.000     .0027073    .0044551
                  MN  |   .0023872   .0001283    18.61   0.000     .0021295    .0026448
                  IA  |  -.0005687   .0001362    -4.17   0.000    -.0008423    -.000295
                  MO  |   .0003752   .0001482     2.53   0.015     .0000775     .000673
                  ND  |   .0070052   .0000934    75.02   0.000     .0068177    .0071928
                  SD  |   .0047502   .0001417    33.51   0.000     .0044655    .0050349
                  NE  |   .0034898   .0002075    16.82   0.000     .0030731    .0039065
                  KS  |   .0019583   .0001599    12.25   0.000     .0016371    .0022795
                  DE  |  -.0022502   .0002744    -8.20   0.000    -.0028014    -.001699
                  MD  |   .0047155   .0001623    29.06   0.000     .0043896    .0050415
                  DC  |   .0046543    .000222    20.97   0.000     .0042085    .0051001
                  VA  |   .0012455     .00017     7.32   0.000     .0009039     .001587
                  WV  |  -.0004496    .000276    -1.63   0.110     -.001004    .0001047
                  NC  |  -.0001647   .0002318    -0.71   0.481    -.0006303     .000301
                  SC  |  -.0007913   .0002375    -3.33   0.002    -.0012684   -.0003142
                  GA  |    .000268   .0001981     1.35   0.182      -.00013     .000666
                  FL  |   .0002286   .0001658     1.38   0.174    -.0001044    .0005616
                  KY  |   -.000971   .0003433    -2.83   0.007    -.0016606   -.0002814
                  TN  |   .0028324   .0001709    16.57   0.000      .002489    .0031757
                  AL  |   .0024783   .0002636     9.40   0.000     .0019488    .0030078
                  MS  |   .0017404   .0002179     7.99   0.000     .0013027    .0021781
                  AR  |   .0028126   .0002443    11.51   0.000     .0023219    .0033033
                  LA  |   .0025804   .0001874    13.77   0.000      .002204    .0029567
                  OK  |   .0049076   .0009704     5.06   0.000     .0029585    .0068567
                  TX  |   .0021838    .000178    12.27   0.000     .0018262    .0025414
                  MT  |   .0003623   .0001637     2.21   0.031     .0000336     .000691
                  ID  |   .0007308   .0002671     2.74   0.009     .0001943    .0012673
                  WY  |   .0107635   .0000724   148.64   0.000      .010618    .0109089
                  CO  |   .0009644   .0001235     7.81   0.000     .0007164    .0012124
                  NM  |   .0041966   .0003539    11.86   0.000     .0034859    .0049074
                  AZ  |     .00307   .0002105    14.59   0.000     .0026472    .0034927
                  UT  |   .0037763   .0000641    58.90   0.000     .0036475    .0039051
                  NV  |   .0046417   .0001921    24.16   0.000     .0042559    .0050275
                  WA  |   .0018162   .0001364    13.32   0.000     .0015423    .0020902
                  OR  |   .0006449   .0001899     3.40   0.001     .0002634    .0010264
                  CA  |   .0008185   .0001302     6.29   0.000     .0005571    .0010799
                  AK  |  -.0034117   .0001176   -29.02   0.000    -.0036479   -.0031756
                  HI  |    .002315   .0001966    11.78   0.000     .0019201    .0027098
                      |
                 nind |
                   2  |   .0708133   .0245443     2.89   0.006     .0215145     .120112
                   3  |  -.0528562   .0225535    -2.34   0.023    -.0981562   -.0075563
                   4  |  -.2249367   .0266543    -8.44   0.000    -.2784734      -.1714
                   5  |   .0710028   .0226426     3.14   0.003     .0255239    .1164818
                   6  |  -.0806992   .0258021    -3.13   0.003    -.1325243   -.0288742
                   7  |  -.0943841   .0234273    -4.03   0.000    -.1414392   -.0473291
                   8  |  -.1924413   .0244031    -7.89   0.000    -.2414565   -.1434262
                   9  |  -.1443281      .0251    -5.75   0.000    -.1947428   -.0939134
                  10  |  -.1621995     .04229    -3.84   0.000    -.2471414   -.0772576
                  11  |   .0818303   .0246369     3.32   0.002     .0323456     .131315
                      |
                 educ |   .0717177   .0040861    17.55   0.000     .0635105     .079925
                exper |   .0712183   .0023887    29.81   0.000     .0664205    .0760162
               exper2 |  -.0025376   .0001651   -15.37   0.000    -.0028692    -.002206
               exper3 |   .0000505   4.74e-06    10.65   0.000      .000041      .00006
               exper4 |  -4.09e-07   4.64e-08    -8.82   0.000    -5.02e-07   -3.16e-07
                 edex |  -.0007749   .0001063    -7.29   0.000    -.0009883   -.0005615
                      |
                ee_cl |
                   2  |   .0700143    .017118     4.09   0.000     .0356318    .1043969
                   3  |   .0567035   .0186304     3.04   0.004     .0192831    .0941238
                   4  |   .0138749   .0265493     0.52   0.604    -.0394509    .0672007
                   5  |   .0105748   .0213155     0.50   0.622    -.0322387    .0533883
                   6  |   .0438552   .0164421     2.67   0.010     .0108303      .07688
                   7  |   .0530713   .0210709     2.52   0.015     .0107492    .0953934
                   8  |   .0145608   .0244328     0.60   0.554    -.0345138    .0636355
                   9  |   .0043975   .0228076     0.19   0.848     -.041413    .0502079
                  10  |    .029936   .0193855     1.54   0.129    -.0090009    .0688729
                  11  |   .0429629   .0209866     2.05   0.046     .0008101    .0851157
                  12  |   .0581685   .0243645     2.39   0.021     .0092309    .1071061
                  13  |   .0418106   .0213867     1.95   0.056    -.0011458     .084767
                  14  |   .0220249   .0203951     1.08   0.285    -.0189398    .0629896
                  15  |   .0401993   .0221552     1.81   0.076    -.0043008    .0846993
                  16  |   .0763685   .0226521     3.37   0.001     .0308703    .1218666
                      |
                 marr |   .0638543   .0026871    23.76   0.000     .0584572    .0692515
                partt |  -.0941924   .0176279    -5.34   0.000    -.1295991   -.0587858
               public |  -.0522783   .0082887    -6.31   0.000    -.0689268   -.0356299
                 cmsa |   .1103428   .0109371    10.09   0.000      .088375    .1323106
                      |
                nocc2 |
                   2  |  -.0353594   .0104588    -3.38   0.001    -.0563666   -.0143523
                   3  |  -.0196079   .0117996    -1.66   0.103    -.0433081    .0040922
                   4  |  -.0701805   .0138742    -5.06   0.000    -.0980477   -.0423134
                   5  |   .0090972   .0173385     0.52   0.602    -.0257283    .0439227
                   6  |  -.2388837   .0097414   -24.52   0.000    -.2584498   -.2193176
                   7  |  -.1923507   .0105291   -18.27   0.000    -.2134991   -.1712024
                   8  |  -.0848732   .0271481    -3.13   0.003    -.1394018   -.0303446
                   9  |  -.2188292   .0099115   -22.08   0.000    -.2387371   -.1989213
                  10  |  -.1422956   .0064385   -22.10   0.000    -.1552277   -.1293635
                  11  |  -.0669667   .0078713    -8.51   0.000    -.0827767   -.0511567
                  12  |  -.1870105   .0071037   -26.33   0.000    -.2012788   -.1727423
                      |
                unemp |  -.0044473   .0011217    -3.96   0.000    -.0067003   -.0021942
                      |
              quarter |
                   2  |   .0009428   .0028029     0.34   0.738     -.004687    .0065726
                   3  |   .0072023   .0029396     2.45   0.018     .0012979    .0131068
                   4  |    .010756    .002033     5.29   0.000     .0066726    .0148393
                      |
                _cons |   .5028998    .058642     8.58   0.000     .3851138    .6206858
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(
> cluster state)
(sum of wgt is 1,280,694,556)

Linear regression                               Number of obs     =    154,777
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4296
                                                Root MSE          =     .36543

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0554878   .0100008    -5.55   0.000    -.0755751   -.0354006
             treat_st |    -.05935   .0186449    -3.18   0.003    -.0967993   -.0219007
treat_stblackrelwhite |   .0001473   .0156192     0.01   0.993    -.0312248    .0315195
                      |
                state |
                  NH  |   .0484841    .004297    11.28   0.000     .0398534    .0571149
                  VT  |   -.006074   .0016902    -3.59   0.001    -.0094689   -.0026792
                  MA  |   .1315991   .0088375    14.89   0.000     .1138485    .1493498
                  RI  |   .1370294   .0096755    14.16   0.000     .1175956    .1564632
                  CT  |   .1698103   .0090283    18.81   0.000     .1516765    .1879442
                  NY  |   .1230663   .0079277    15.52   0.000     .1071429    .1389896
                  NJ  |   .2128698    .008964    23.75   0.000      .194865    .2308746
                  PA  |   .0367004   .0073885     4.97   0.000     .0218602    .0515406
                  OH  |   .0157942   .0074617     2.12   0.039     .0008071    .0307814
                  IN  |   .0002658   .0070096     0.04   0.970    -.0138135    .0143451
                  IL  |   .0365355   .0075799     4.82   0.000     .0213107    .0517602
                  MI  |   .0856725   .0079707    10.75   0.000     .0696628    .1016822
                  WI  |   .0434843   .0061136     7.11   0.000     .0312048    .0557638
                  MN  |   .0863532   .0071759    12.03   0.000     .0719399    .1007665
                  IA  |     .04298   .0182153     2.36   0.022     .0063935    .0795665
                  MO  |  -.0441097   .0076411    -5.77   0.000    -.0594572   -.0287622
                  ND  |   .0079164   .0189774     0.42   0.678    -.0302009    .0460337
                  SD  |  -.0405191   .0180007    -2.25   0.029    -.0766745   -.0043637
                  NE  |  -.0369058   .0174535    -2.11   0.039    -.0719622   -.0018495
                  KS  |   .0040029   .0171622     0.23   0.817    -.0304683    .0384741
                  DE  |   .1422452    .006263    22.71   0.000     .1296656    .1548249
                  MD  |   .1643027   .0090806    18.09   0.000     .1460637    .1825417
                  DC  |   .1823006   .0113124    16.12   0.000     .1595791    .2050222
                  VA  |   .1443731   .0180298     8.01   0.000     .1081592    .1805869
                  WV  |  -.0625488   .0026947   -23.21   0.000    -.0679612   -.0571363
                  NC  |   .0489597   .0179937     2.72   0.009     .0128182    .0851011
                  SC  |  -.0321849    .018082    -1.78   0.081    -.0685037    .0041339
                  GA  |   .0549382   .0183413     3.00   0.004     .0180986    .0917779
                  FL  |   .0468022   .0183061     2.56   0.014     .0100334    .0835711
                  KY  |  -.0395689   .0062506    -6.33   0.000    -.0521236   -.0270142
                  TN  |   .0233669   .0177204     1.32   0.193    -.0122257    .0589594
                  AL  |  -.0531308   .0175183    -3.03   0.004    -.0883173   -.0179442
                  MS  |  -.0729746   .0181288    -4.03   0.000    -.1093875   -.0365618
                  AR  |  -.0647046   .0179362    -3.61   0.001    -.1007304   -.0286787
                  LA  |  -.0179879   .0182582    -0.99   0.329    -.0546604    .0186847
                  OK  |  -.0981136   .0092515   -10.61   0.000    -.1166957   -.0795315
                  TX  |   .0509797   .0179674     2.84   0.007      .014891    .0870684
                  MT  |   -.080672   .0029502   -27.34   0.000    -.0865976   -.0747464
                  ID  |  -.0059346   .0179331    -0.33   0.742    -.0419544    .0300852
                  WY  |   .0943025   .0191503     4.92   0.000     .0558381    .1327669
                  CO  |   .0054982   .0089399     0.62   0.541     -.012458    .0234545
                  NM  |   -.066924   .0054236   -12.34   0.000    -.0778176   -.0560303
                  AZ  |   .0570444   .0191806     2.97   0.005      .018519    .0955697
                  UT  |   .0028844   .0187634     0.15   0.878     -.034803    .0405719
                  NV  |   .1476399   .0211733     6.97   0.000     .1051122    .1901677
                  WA  |   .0833928      .0086     9.70   0.000     .0661192    .1006665
                  OR  |   .0153441   .0073728     2.08   0.043     .0005354    .0301527
                  CA  |   .1896649   .0085809    22.10   0.000     .1724297    .2069001
                  AK  |   .2234316   .0043084    51.86   0.000     .2147779    .2320854
                  HI  |   .0742366   .0073219    10.14   0.000     .0595303     .088943
                      |
                 year |
                1990  |  -.0016927   .0049528    -0.34   0.734    -.0116406    .0082553
                1991  |   -.009215    .006857    -1.34   0.185    -.0229876    .0045576
                1992  |   .0024647   .0083431     0.30   0.769     -.014293    .0192224
                1993  |   .0114132   .0072038     1.58   0.119    -.0030561    .0258825
                1996  |   .0228196   .0080328     2.84   0.006     .0066853    .0389538
                1997  |   .0243242   .0067926     3.58   0.001     .0106808    .0379675
                1998  |   .0418549   .0068314     6.13   0.000     .0281335    .0555763
                1999  |   .0440629   .0064279     6.85   0.000     .0311521    .0569737
                2000  |   .0388541   .0074938     5.18   0.000     .0238023    .0539059
                2001  |   .0528596   .0075179     7.03   0.000     .0377595    .0679597
                2002  |   .0608228   .0072097     8.44   0.000     .0463416    .0753039
                2003  |   .0502658   .0063004     7.98   0.000      .037611    .0629205
                2004  |   .0458383   .0087872     5.22   0.000     .0281887    .0634878
                2005  |   .0407495   .0088386     4.61   0.000     .0229966    .0585024
                2006  |   .0397663   .0074922     5.31   0.000     .0247177    .0548148
                2007  |   .0331396   .0083684     3.96   0.000     .0163312     .049948
                2008  |   .0275153   .0119895     2.29   0.026     .0034337    .0515968
                2009  |   .0522135   .0106125     4.92   0.000     .0308975    .0735294
                2010  |   .0582446   .0113645     5.13   0.000     .0354184    .0810708
                2011  |   .0357897   .0102359     3.50   0.001     .0152303    .0563492
                2012  |   .0077232   .0097941     0.79   0.434    -.0119489    .0273953
                2013  |   .0204016   .0092438     2.21   0.032     .0018348    .0389684
                2014  |   .0059576   .0174802     0.34   0.735    -.0291523    .0410675
                2015  |    .022471   .0131538     1.71   0.094    -.0039493    .0488912
                2016  |   .0309717   .0087477     3.54   0.001     .0134014    .0485421
                2017  |   .0152846   .0120566     1.27   0.211    -.0089318    .0395011
                2018  |   .0164829   .0110303     1.49   0.141    -.0056721    .0386378
                2019  |   .0234077   .0094217     2.48   0.016     .0044836    .0423318
                      |
                 nind |
                   2  |   .0564857   .0519368     1.09   0.282    -.0478325    .1608039
                   3  |    .045147   .0390208     1.16   0.253    -.0332285    .1235225
                   4  |  -.2341486   .0503933    -4.65   0.000    -.3353665   -.1329307
                   5  |   .1417321   .0428786     3.31   0.002     .0556078    .2278564
                   6  |  -.0431077   .0477546    -0.90   0.371    -.1390257    .0528103
                   7  |  -.0996292   .0459611    -2.17   0.035    -.1919447   -.0073137
                   8  |  -.1347328   .0494964    -2.72   0.009    -.2341492   -.0353165
                   9  |  -.1825758   .0452529    -4.03   0.000     -.273469   -.0916826
                  10  |   -.146402   .0603057    -2.43   0.019    -.2675296   -.0252743
                  11  |   .0042899   .0462901     0.09   0.927    -.0886865    .0972662
                      |
                 educ |   .1047538   .0056777    18.45   0.000     .0933498    .1161578
                exper |   .0503912   .0033911    14.86   0.000       .04358    .0572025
               exper2 |  -.0017492   .0002623    -6.67   0.000    -.0022761   -.0012223
               exper3 |   .0000311   9.08e-06     3.42   0.001     .0000129    .0000493
               exper4 |  -2.13e-07   1.02e-07    -2.10   0.041    -4.17e-07   -8.94e-09
                 edex |  -.0004618   .0001239    -3.73   0.000    -.0007107   -.0002128
                      |
                ee_cl |
                   2  |  -.0586272   .0138078    -4.25   0.000    -.0863609   -.0308934
                   3  |  -.1198414   .0178492    -6.71   0.000    -.1556927   -.0839902
                   4  |  -.1685032   .0333777    -5.05   0.000    -.2355442   -.1014622
                   5  |  -.0716738   .0206642    -3.47   0.001    -.1131791   -.0301685
                   6  |  -.0908129   .0171535    -5.29   0.000    -.1252666   -.0563591
                   7  |  -.1366484   .0220136    -6.21   0.000     -.180864   -.0924329
                   8  |  -.1647422   .0347524    -4.74   0.000    -.2345444   -.0949399
                   9  |  -.0465176   .0164043    -2.84   0.007    -.0794666   -.0135686
                  10  |  -.1110545   .0230054    -4.83   0.000    -.1572622   -.0648467
                  11  |  -.1503634   .0244011    -6.16   0.000    -.1993744   -.1013523
                  12  |  -.1434528    .031319    -4.58   0.000    -.2063589   -.0805467
                  13  |   .0011628   .0208402     0.06   0.956     -.040696    .0430217
                  14  |  -.1021822   .0217925    -4.69   0.000    -.1459538   -.0584106
                  15  |  -.1154832   .0258232    -4.47   0.000    -.1673506   -.0636157
                  16  |  -.1117577    .032072    -3.48   0.001    -.1761762   -.0473391
                      |
                 marr |   .0058775   .0034683     1.69   0.096    -.0010888    .0128439
                partt |  -.0642944   .0070391    -9.13   0.000    -.0784329   -.0501558
               public |   .0232429   .0120746     1.92   0.060    -.0010097    .0474955
                 cmsa |   .1209061   .0095879    12.61   0.000     .1016481    .1401641
                      |
                nocc2 |
                   2  |  -.0392606    .010743    -3.65   0.001    -.0608385   -.0176828
                   3  |  -.0223334   .0136382    -1.64   0.108    -.0497267    .0050598
                   4  |  -.1069576   .0109608    -9.76   0.000     -.128973   -.0849422
                   5  |    .140338   .0162245     8.65   0.000     .1077502    .1729258
                   6  |  -.2347774   .0095638   -24.55   0.000     -.253987   -.2155679
                   7  |  -.2427659   .0234037   -10.37   0.000    -.2897736   -.1957583
                   8  |  -.0912267   .0463163    -1.97   0.054    -.1842557    .0018023
                   9  |  -.2887369    .015274   -18.90   0.000    -.3194156   -.2580581
                  10  |  -.2593466   .0175383   -14.79   0.000    -.2945733   -.2241199
                  11  |   .0065987   .0186633     0.35   0.725    -.0308876     .044085
                  12  |  -.2416532    .013163   -18.36   0.000    -.2680918   -.2152146
                      |
              quarter |
                   2  |   .0046552   .0026907     1.73   0.090    -.0007492    .0100596
                   3  |   .0143097   .0025547     5.60   0.000     .0091784    .0194409
                   4  |   .0182194   .0028565     6.38   0.000     .0124819    .0239568
                      |
                _cons |     .17158   .0577159     2.97   0.005     .0556543    .2875057
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper
> 4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1
> , vce(cluster state)
(sum of wgt is 1,280,694,556)

Linear regression                               Number of obs     =    154,777
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4296
                                                Root MSE          =     .36543

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0555029    .009995    -5.55   0.000    -.0755784   -.0354273
             treat_st |  -.0599583   .0191589    -3.13   0.003      -.09844   -.0214765
treat_stblackrelwhite |   .0001843   .0156019     0.01   0.991     -.031153    .0315215
                      |
                state |
                  NH  |   .0461961   .0050539     9.14   0.000     .0360451    .0563472
                  VT  |  -.0082205   .0024754    -3.32   0.002    -.0131925   -.0032485
                  MA  |   .1316757   .0088239    14.92   0.000     .1139524     .149399
                  RI  |   .1390669   .0095376    14.58   0.000     .1199101    .1582237
                  CT  |   .1701257   .0089519    19.00   0.000     .1521453    .1881061
                  NY  |   .1244646   .0077712    16.02   0.000     .1088558    .1400734
                  NJ  |   .2138993   .0087856    24.35   0.000     .1962529    .2315457
                  PA  |   .0374343   .0073184     5.12   0.000     .0227349    .0521338
                  OH  |   .0169941   .0073693     2.31   0.025     .0021925    .0317957
                  IN  |   .0003345   .0070289     0.05   0.962    -.0137834    .0144525
                  IL  |   .0384738   .0074078     5.19   0.000     .0235947    .0533529
                  MI  |   .0886683    .008383    10.58   0.000     .0718306     .105506
                  WI  |   .0426671   .0061494     6.94   0.000     .0303155    .0550186
                  MN  |   .0847637   .0073251    11.57   0.000     .0700508    .0994766
                  IA  |   .0412156   .0180636     2.28   0.027     .0049339    .0774974
                  MO  |  -.0437075   .0076013    -5.75   0.000    -.0589752   -.0284398
                  ND  |   .0049935   .0185328     0.27   0.789    -.0322308    .0422178
                  SD  |  -.0432328   .0176787    -2.45   0.018    -.0787415    -.007724
                  NE  |  -.0402962   .0171353    -2.35   0.023    -.0747135   -.0058789
                  KS  |   .0032238   .0173449     0.19   0.853    -.0316143     .038062
                  DE  |   .1409917   .0062449    22.58   0.000     .1284484     .153535
                  MD  |   .1637475   .0092357    17.73   0.000     .1451971    .1822979
                  DC  |   .1856435   .0108752    17.07   0.000     .1637999     .207487
                  VA  |   .1432969   .0181887     7.88   0.000     .1067638    .1798299
                  WV  |  -.0595067   .0038008   -15.66   0.000    -.0671408   -.0518726
                  NC  |   .0499298   .0185945     2.69   0.010     .0125817    .0872779
                  SC  |  -.0297395   .0191151    -1.56   0.126    -.0681334    .0086544
                  GA  |   .0563934   .0190508     2.96   0.005     .0181288     .094658
                  FL  |   .0483616   .0190333     2.54   0.014     .0101321    .0865911
                  KY  |  -.0379524   .0063434    -5.98   0.000    -.0506935   -.0252113
                  TN  |   .0246576   .0184287     1.34   0.187    -.0123575    .0616727
                  AL  |  -.0510363   .0184597    -2.76   0.008    -.0881136    -.013959
                  MS  |  -.0694953   .0197027    -3.53   0.001    -.1090694   -.0299212
                  AR  |  -.0629414   .0188417    -3.34   0.002     -.100786   -.0250968
                  LA  |  -.0153519   .0193396    -0.79   0.431    -.0541965    .0234928
                  OK  |  -.0987556   .0093368   -10.58   0.000    -.1175091    -.080002
                  TX  |   .0523926   .0186837     2.80   0.007     .0148654    .0899199
                  MT  |  -.0809134   .0029109   -27.80   0.000    -.0867601   -.0750666
                  ID  |  -.0051996   .0185078    -0.28   0.780    -.0423736    .0319744
                  WY  |   .0935015   .0192845     4.85   0.000     .0547673    .1322356
                  CO  |   .0047222    .009092     0.52   0.606    -.0135396    .0229841
                  NM  |  -.0656382   .0052716   -12.45   0.000    -.0762264   -.0550499
                  AZ  |   .0586742   .0199027     2.95   0.005     .0186984      .09865
                  UT  |    .001742   .0189238     0.09   0.927    -.0362675    .0397515
                  NV  |   .1498014   .0221042     6.78   0.000     .1054039    .1941989
                  WA  |   .0850451   .0085698     9.92   0.000     .0678321     .102258
                  OR  |   .0176124   .0073484     2.40   0.020     .0028528     .032372
                  CA  |   .1927118   .0084228    22.88   0.000     .1757942    .2096294
                  AK  |   .2272175   .0049068    46.31   0.000     .2173619    .2370731
                  HI  |   .0720077   .0075463     9.54   0.000     .0568504    .0871649
                      |
                 year |
                1990  |  -.0009841   .0052673    -0.19   0.853    -.0115638    .0095956
                1991  |  -.0060454   .0081382    -0.74   0.461    -.0223914    .0103006
                1992  |   .0068834   .0108792     0.63   0.530    -.0149682     .028735
                1993  |   .0147638   .0092792     1.59   0.118     -.003874    .0334017
                1996  |   .0232133   .0084357     2.75   0.008     .0062697     .040157
                1997  |   .0239349   .0069684     3.43   0.001     .0099385    .0379313
                1998  |   .0406284   .0068483     5.93   0.000     .0268731    .0543836
                1999  |   .0423008   .0066458     6.37   0.000     .0289522    .0556493
                2000  |    .036711   .0075025     4.89   0.000     .0216419    .0517802
                2001  |    .051981   .0074511     6.98   0.000      .037015     .066947
                2002  |   .0619274   .0072127     8.59   0.000     .0474403    .0764146
                2003  |   .0518541   .0065267     7.94   0.000     .0387448    .0649634
                2004  |   .0466131    .009115     5.11   0.000     .0283051    .0649211
                2005  |   .0406112   .0088342     4.60   0.000     .0228672    .0583552
                2006  |   .0389065   .0076383     5.09   0.000     .0235645    .0542484
                2007  |    .032279   .0084003     3.84   0.000     .0154066    .0491515
                2008  |   .0287807   .0124415     2.31   0.025     .0037912    .0537702
                2009  |   .0597178   .0144814     4.12   0.000      .030631    .0888047
                2010  |   .0663726   .0146093     4.54   0.000     .0370288    .0957163
                2011  |   .0426359   .0133096     3.20   0.002     .0159028     .069369
                2012  |   .0131593    .011979     1.10   0.277    -.0109013    .0372198
                2013  |     .02466   .0113906     2.16   0.035     .0017812    .0475388
                2014  |   .0078932   .0182825     0.43   0.668    -.0288282    .0446146
                2015  |   .0227036   .0133253     1.70   0.095     -.004061    .0494683
                2016  |   .0304142   .0086345     3.52   0.001     .0130712    .0477572
                2017  |   .0138711   .0123062     1.13   0.265    -.0108466    .0385887
                2018  |    .014278   .0105853     1.35   0.183    -.0069833    .0355393
                2019  |   .0207825   .0091167     2.28   0.027     .0024711    .0390939
                      |
                 nind |
                   2  |   .0561274    .051971     1.08   0.285    -.0482594    .1605142
                   3  |   .0448955   .0390526     1.15   0.256    -.0335439    .1233348
                   4  |  -.2343395   .0504374    -4.65   0.000     -.335646    -.133033
                   5  |   .1415213   .0429458     3.30   0.002     .0552622    .2277804
                   6  |  -.0433695   .0477945    -0.91   0.369    -.1393676    .0526287
                   7  |  -.0998985   .0460288    -2.17   0.035      -.19235    -.007447
                   8  |  -.1349485   .0495645    -2.72   0.009    -.2345017   -.0353954
                   9  |  -.1828215   .0453051    -4.04   0.000    -.2738196   -.0918234
                  10  |  -.1466462   .0603773    -2.43   0.019    -.2679176   -.0253749
                  11  |   .0040097   .0463372     0.09   0.931    -.0890613    .0970808
                      |
                 educ |   .1047462   .0056813    18.44   0.000     .0933351    .1161574
                exper |   .0504111   .0033944    14.85   0.000     .0435932     .057229
               exper2 |  -.0017507   .0002624    -6.67   0.000    -.0022777   -.0012237
               exper3 |   .0000311   9.07e-06     3.43   0.001     .0000129    .0000494
               exper4 |  -2.14e-07   1.02e-07    -2.10   0.041    -4.18e-07   -9.55e-09
                 edex |  -.0004617   .0001241    -3.72   0.001     -.000711   -.0002125
                      |
                ee_cl |
                   2  |   -.058621   .0137876    -4.25   0.000    -.0863143   -.0309277
                   3  |  -.1198368   .0178299    -6.72   0.000    -.1556493   -.0840243
                   4  |  -.1684673   .0333524    -5.05   0.000    -.2354576    -.101477
                   5  |  -.0717233   .0206325    -3.48   0.001     -.113165   -.0302816
                   6  |  -.0908219   .0171309    -5.30   0.000    -.1252302   -.0564135
                   7  |  -.1366411   .0219735    -6.22   0.000    -.1807762    -.092506
                   8  |  -.1647172   .0347221    -4.74   0.000    -.2344586   -.0949759
                   9  |  -.0466096   .0164032    -2.84   0.006    -.0795563   -.0136628
                  10  |  -.1111011   .0229834    -4.83   0.000    -.1572647   -.0649375
                  11  |  -.1503972    .024395    -6.17   0.000     -.199396   -.1013983
                  12  |    -.14346   .0312918    -4.58   0.000    -.2063115   -.0806084
                  13  |   .0010907   .0208551     0.05   0.958     -.040798    .0429794
                  14  |  -.1022025    .021778    -4.69   0.000    -.1459449     -.05846
                  15  |  -.1155213   .0258149    -4.47   0.000     -.167372   -.0636707
                  16  |  -.1117858   .0320537    -3.49   0.001    -.1761676    -.047404
                      |
                 marr |   .0058703   .0034699     1.69   0.097    -.0010991    .0128398
                partt |  -.0642403   .0070273    -9.14   0.000    -.0783551   -.0501255
               public |   .0233023   .0120808     1.93   0.059    -.0009627    .0475673
                 cmsa |     .12086   .0095749    12.62   0.000     .1016281    .1400918
                      |
                nocc2 |
                   2  |  -.0392285   .0107504    -3.65   0.001    -.0608214   -.0176356
                   3  |  -.0222639   .0136407    -1.63   0.109    -.0496621    .0051342
                   4  |   -.106938   .0109546    -9.76   0.000    -.1289409    -.084935
                   5  |   .1403592   .0162122     8.66   0.000     .1077961    .1729222
                   6  |  -.2347567   .0095693   -24.53   0.000    -.2539772   -.2155363
                   7  |  -.2427645   .0234073   -10.37   0.000    -.2897794   -.1957496
                   8  |  -.0912428   .0463286    -1.97   0.054    -.1842966    .0018111
                   9  |  -.2887079   .0152761   -18.90   0.000    -.3193909   -.2580249
                  10  |   -.259358   .0175416   -14.79   0.000    -.2945914   -.2241246
                  11  |   .0067167   .0186484     0.36   0.720    -.0307396     .044173
                  12  |  -.2416242   .0131457   -18.38   0.000    -.2680281   -.2152203
                      |
                unemp |  -.0018358   .0014923    -1.23   0.224    -.0048331    .0011615
                      |
              quarter |
                   2  |   .0046853   .0026947     1.74   0.088    -.0007271    .0100977
                   3  |   .0143118   .0025613     5.59   0.000     .0091673    .0194563
                   4  |   .0182638   .0028723     6.36   0.000     .0124947     .024033
                      |
                _cons |   .1802758   .0539931     3.34   0.002     .0718275    .2887241
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exp
> er3 exper4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & cov
> ered == 1, vce(cluster state)
(sum of wgt is 1,280,694,556)

Linear regression                               Number of obs     =    154,777
                                                F(49, 50)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4293
                                                Root MSE          =     .36556

                                          (Std. Err. adjusted for 51 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0564765   .0096926    -5.83   0.000    -.0759446   -.0370083
             treat_st |  -.0511565   .0218468    -2.34   0.023    -.0950371   -.0072759
treat_stblackrelwhite |   .0003094   .0149558     0.02   0.984    -.0297301    .0303489
                      |
                state |
                  NH  |  -.1132813   .0156408    -7.24   0.000    -.1446968   -.0818658
                  VT  |  -.2732206   .0154159   -17.72   0.000    -.3041844   -.2422568
                  MA  |  -.2591869    .015148   -17.11   0.000    -.2896125   -.2287613
                  RI  |  -.3964117   .0192968   -20.54   0.000    -.4351704   -.3576529
                  CT  |   .0534587   .0183174     2.92   0.005     .0166671    .0902503
                  NY  |  -.1605027   .0158018   -10.16   0.000    -.1922415    -.128764
                  NJ  |   -.229305   .0181456   -12.64   0.000    -.2657514   -.1928585
                  PA  |  -.1851135   .0178767   -10.36   0.000    -.2210199   -.1492071
                  OH  |  -.0252009   .0157241    -1.60   0.115    -.0567836    .0063819
                  IN  |  -.2001946   .0776661    -2.58   0.013    -.3561915   -.0441977
                  IL  |   .0161445   .0149011     1.08   0.284    -.0137853    .0460743
                  MI  |   .2112061   .0611733     3.45   0.001      .088336    .3340762
                  WI  |  -.2034812   .0450894    -4.51   0.000     -.294046   -.1129165
                  MN  |   .0000965   .0164412     0.01   0.995    -.0329266    .0331197
                  IA  |  -.0357285   .0208292    -1.72   0.092    -.0775651    .0061081
                  MO  |   .1339025   .0213141     6.28   0.000      .091092    .1767131
                  ND  |  -.7584744   .0298143   -25.44   0.000    -.8183582   -.6985907
                  SD  |  -.4074635   .0237245   -17.17   0.000    -.4551155   -.3598115
                  NE  |  -.2814204   .0264989   -10.62   0.000     -.334645   -.2281958
                  KS  |   .1847234   .0247951     7.45   0.000      .134921    .2345259
                  DE  |   .1182193   .0332116     3.56   0.001     .0515118    .1849268
                  MD  |  -.3427066   .0193016   -17.76   0.000    -.3814751   -.3039382
                  DC  |  -.3733335   .0216783   -17.22   0.000    -.4168755   -.3297914
                  VA  |  -.3381238   .0248252   -13.62   0.000    -.3879868   -.2882608
                  WV  |  -.2060383   .0190724   -10.80   0.000    -.2443464   -.1677302
                  NC  |   .0206316   .0192884     1.07   0.290    -.0181102    .0593735
                  SC  |   .0314044   .0207086     1.52   0.136      -.01019    .0729989
                  GA  |   .0338877   .0257571     1.32   0.194    -.0178469    .0856224
                  FL  |   .2352882   .0297536     7.91   0.000     .1755263      .29505
                  KY  |  -.0057076   .0370649    -0.15   0.878    -.0801547    .0687394
                  TN  |   .0465715    .021917     2.12   0.039     .0025499    .0905931
                  AL  |  -.0281426   .0218786    -1.29   0.204    -.0720871     .015802
                  MS  |  -.1560781   .0198683    -7.86   0.000    -.1959848   -.1161715
                  AR  |  -.4773925   .0208247   -22.92   0.000    -.5192201   -.4355649
                  LA  |  -.0953979   .0300799    -3.17   0.003    -.1558151   -.0349807
                  OK  |   .1505097   .1027494     1.46   0.149    -.0558685    .3568879
                  TX  |  -.2550539   .0286405    -8.91   0.000      -.31258   -.1975278
                  MT  |  -.0976212   .0210103    -4.65   0.000    -.1398216   -.0554207
                  ID  |   .0561363   .0262083     2.14   0.037     .0034954    .1087772
                  WY  |  -.6697324   .0295712   -22.65   0.000     -.729128   -.6103368
                  CO  |    .134892   .0189746     7.11   0.000     .0967804    .1730036
                  NM  |  -.0837323   .0190813    -4.39   0.000    -.1220583   -.0454063
                  AZ  |   .3903227   .0270412    14.43   0.000     .3360088    .4446366
                  UT  |  -.1906179   .0313733    -6.08   0.000    -.2536331   -.1276027
                  NV  |  -.0114106   .0510397    -0.22   0.824    -.1139268    .0911056
                  WA  |   .0295257   .0143034     2.06   0.044     .0007964    .0582549
                  OR  |  -.2280972   .0131708   -17.32   0.000    -.2545515   -.2016429
                  CA  |    .038994    .019421     2.01   0.050    -.0000142    .0780022
                  AK  |   .3300414   .0235951    13.99   0.000     .2826492    .3774336
                  HI  |  -.1391645   .0369115    -3.77   0.000    -.2133035   -.0650255
                      |
        state#c.lyear |
                  ME  |  -.0006404   .0001914    -3.35   0.002    -.0010249   -.0002559
                  NH  |    .000898   .0002961     3.03   0.004     .0003032    .0014928
                  VT  |    .001924   .0001152    16.70   0.000     .0016925    .0021554
                  MA  |   .0031118   .0001494    20.82   0.000     .0028116     .003412
                  RI  |   .0045034   .0001554    28.98   0.000     .0041913    .0048155
                  CT  |   .0004821   .0002228     2.16   0.035     .0000347    .0009296
                  NY  |   .0021116   .0001193    17.70   0.000      .001872    .0023513
                  NJ  |   .0036311   .0002208    16.45   0.000     .0031876    .0040745
                  PA  |   .0015165   .0001979     7.66   0.000      .001119     .001914
                  OH  |  -.0002398   .0001814    -1.32   0.192    -.0006042    .0001246
                  IN  |   .0013167   .0008568     1.54   0.131    -.0004044    .0030377
                  IL  |  -.0004429   .0002066    -2.14   0.037    -.0008579   -.0000279
                  MI  |  -.0018861   .0006489    -2.91   0.005    -.0031895   -.0005826
                  WI  |   .0017697    .000505     3.50   0.001     .0007554     .002784
                  MN  |   .0001907   .0001766     1.08   0.285     -.000164    .0005454
                  IA  |   .0000451   .0001503     0.30   0.765    -.0002568     .000347
                  MO  |  -.0023682   .0002765    -8.57   0.000    -.0029235   -.0018128
                  ND  |   .0067243   .0001161    57.91   0.000     .0064911    .0069575
                  SD  |   .0028744   .0001006    28.58   0.000     .0026724    .0030764
                  NE  |   .0016399   .0002852     5.75   0.000      .001067    .0022127
                  KS  |  -.0024824   .0002311   -10.74   0.000    -.0029467   -.0020182
                  DE  |  -.0005012   .0004422    -1.13   0.262    -.0013893    .0003869
                  MD  |   .0042525   .0001644    25.87   0.000     .0039223    .0045827
                  DC  |    .004774   .0001818    26.25   0.000     .0044088    .0051393
                  VA  |   .0039959   .0001949    20.50   0.000     .0036044    .0043873
                  WV  |   .0007441   .0002762     2.69   0.010     .0001893     .001299
                  NC  |  -.0004679   .0001836    -2.55   0.014    -.0008368   -.0000991
                  SC  |  -.0013041   .0002243    -5.81   0.000    -.0017547   -.0008536
                  GA  |  -.0005121   .0002417    -2.12   0.039    -.0009976   -.0000266
                  FL  |  -.0025328   .0001209   -20.94   0.000    -.0027757   -.0022899
                  KY  |  -.0009618   .0004323    -2.22   0.031    -.0018301   -.0000935
                  TN  |  -.0009631   .0003024    -3.19   0.002    -.0015705   -.0003558
                  AL  |  -.0009522   .0003181    -2.99   0.004    -.0015911   -.0003133
                  MS  |   .0001111   .0002502     0.44   0.659    -.0003914    .0006136
                  AR  |   .0033327   .0002748    12.13   0.000     .0027808    .0038846
                  LA  |   .0000614   .0001588     0.39   0.701    -.0002576    .0003804
                  OK  |  -.0031383   .0011362    -2.76   0.008    -.0054204   -.0008562
                  TX  |   .0022265   .0001768    12.60   0.000     .0018714    .0025815
                  MT  |  -.0004728    .000078    -6.06   0.000    -.0006295   -.0003161
                  ID  |  -.0012933   .0002416    -5.35   0.000    -.0017785   -.0008081
                  WY  |   .0065788   .0001437    45.79   0.000     .0062902    .0068673
                  CO  |  -.0018518   .0001175   -15.75   0.000    -.0020879   -.0016157
                  NM  |  -.0004068   .0001265    -3.22   0.002    -.0006609   -.0001528
                  AZ  |  -.0039232   .0001516   -25.88   0.000    -.0042277   -.0036187
                  UT  |   .0011674   .0001134    10.29   0.000     .0009396    .0013953
                  NV  |   .0008297   .0003625     2.29   0.026     .0001015    .0015579
                  WA  |   -.000116   .0001277    -0.91   0.368    -.0003724    .0001405
                  OR  |   .0017168   .0001259    13.64   0.000      .001464    .0019696
                  CA  |   .0008208   .0000965     8.51   0.000     .0006271    .0010145
                  AK  |  -.0016827   .0000953   -17.65   0.000    -.0018742   -.0014912
                  HI  |   .0014147   .0003577     3.96   0.000     .0006963    .0021331
                      |
                 nind |
                   2  |   .0592076   .0523099     1.13   0.263    -.0458598    .1642751
                   3  |   .0437191   .0387099     1.13   0.264     -.034032    .1214701
                   4  |  -.2330105   .0507811    -4.59   0.000    -.3350073   -.1310137
                   5  |    .141612    .043174     3.28   0.002     .0548944    .2283296
                   6  |  -.0405899    .047635    -0.85   0.398    -.1362676    .0550877
                   7  |  -.0983425   .0462941    -2.12   0.039    -.1913269   -.0053581
                   8  |   -.132985   .0499175    -2.66   0.010    -.2332473   -.0327227
                   9  |  -.1803566   .0454969    -3.96   0.000    -.2717398   -.0889733
                  10  |  -.1445988   .0609699    -2.37   0.022    -.2670603   -.0221372
                  11  |    .005603   .0465934     0.12   0.905    -.0879825    .0991885
                      |
                 educ |   .1032769   .0056276    18.35   0.000     .0919736    .1145803
                exper |   .0495379    .003372    14.69   0.000      .042765    .0563109
               exper2 |  -.0016682   .0002668    -6.25   0.000    -.0022041   -.0011324
               exper3 |   .0000288   9.26e-06     3.11   0.003     .0000102    .0000474
               exper4 |  -1.95e-07   1.04e-07    -1.88   0.066    -4.04e-07    1.34e-08
                 edex |  -.0004616   .0001223    -3.77   0.000    -.0007073   -.0002158
                      |
                ee_cl |
                   2  |  -.0597682   .0145283    -4.11   0.000    -.0889492   -.0305872
                   3  |  -.1176654   .0177173    -6.64   0.000    -.1532517   -.0820792
                   4  |  -.1609392   .0333895    -4.82   0.000    -.2280041   -.0938744
                   5  |    -.07717    .020094    -3.84   0.000    -.1175299     -.03681
                   6  |  -.0945065   .0174606    -5.41   0.000    -.1295772   -.0594359
                   7  |  -.1346451   .0219725    -6.13   0.000    -.1787782   -.0905119
                   8  |  -.1598875   .0346356    -4.62   0.000    -.2294553   -.0903198
                   9  |  -.0526998   .0171689    -3.07   0.003    -.0871846    -.018215
                  10  |  -.1124675   .0230469    -4.88   0.000    -.1587586   -.0661764
                  11  |  -.1475505   .0246883    -5.98   0.000    -.1971384   -.0979626
                  12  |  -.1372421   .0315803    -4.35   0.000    -.2006731   -.0738111
                  13  |  -.0025408   .0209903    -0.12   0.904     -.044701    .0396194
                  14  |   -.101381   .0221213    -4.58   0.000    -.1458129   -.0569492
                  15  |  -.1127232   .0262074    -4.30   0.000    -.1653622   -.0600842
                  16  |  -.1056605   .0324425    -3.26   0.002    -.1708231   -.0404978
                      |
                 marr |   .0054191     .00344     1.58   0.121    -.0014905    .0123286
                partt |  -.0630957   .0069655    -9.06   0.000    -.0770863    -.049105
               public |   .0232885   .0121049     1.92   0.060     -.001025     .047602
                 cmsa |   .1212886   .0095961    12.64   0.000     .1020142     .140563
                      |
                nocc2 |
                   2  |  -.0380643   .0105268    -3.62   0.001    -.0592081   -.0169205
                   3  |  -.0219298   .0133787    -1.64   0.107    -.0488017     .004942
                   4  |  -.1063932   .0109734    -9.70   0.000     -.128434   -.0843524
                   5  |   .1407596   .0158141     8.90   0.000     .1089961     .172523
                   6  |  -.2346945   .0096126   -24.42   0.000    -.2540019   -.2153871
                   7  |  -.2430643   .0232052   -10.47   0.000    -.2896732   -.1964554
                   8  |   -.096037   .0467681    -2.05   0.045    -.1899736   -.0021005
                   9  |  -.2882315   .0150109   -19.20   0.000    -.3183817   -.2580812
                  10  |  -.2590925   .0173785   -14.91   0.000    -.2939982   -.2241868
                  11  |   .0083126   .0184096     0.45   0.654    -.0286641    .0452894
                  12  |  -.2409925   .0127796   -18.86   0.000    -.2666609    -.215324
                      |
                unemp |   -.000439   .0008464    -0.52   0.606    -.0021391    .0012612
                      |
              quarter |
                   2  |   .0050383   .0026374     1.91   0.062     -.000259    .0103357
                   3  |     .01441   .0024997     5.76   0.000     .0093893    .0194308
                   4  |   .0185195   .0029222     6.34   0.000     .0126501    .0243889
                      |
                _cons |   .2835735    .054586     5.19   0.000     .1739343    .3932128
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_fem_all_sltt

. 
. ** RUST BELT ONLY BLACK-WHITE + WV, KY - IA
. ** keep if inrange(state, 31, 35) | inlist(state, 23, 41, 43) | inlist(state, 55, 61)
. 
. ** DROP ALWAYS RTW BLACK-WHITE
. ** drop if alwaysr2w == 1
. 
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 e
> xper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluste
> r state) 
. 
. ** eststo covstagdid_mal_cf 
.         
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 e
> xper4 edex i.ee_cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluste
> r state)
. 
. ** eststo covstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluste
> r state) 
. 
. ** eststo wagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluste
> r state)
. 
. ** eststo wagstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered =
> = 0, vce(cluster state)
. 
. ** eststo nwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered =
> = 0, vce(cluster state)
. 
. ** eststo nwagstagdid_fem_cf
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered =
> = 1, vce(cluster state)
. 
. ** eststo uwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 ex
> per4 edex i.ee_cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered =
> = 1, vce(cluster state)
. 
. ** eststo uwagstagdid_fem_cf 
. 
. label variable blackrelwhite "$ Black $"

. label variable treat_st "$ Treat_{st} $"

. label variable treat_stblackrelwhite "$ Treat_{st} \times Black $"

. 
. ** FIXME ignore rust best stuff, dropping always rtw
. esttab covstagdid_mal_all covstagdid_mal_all_unemp covstagdid_mal_all_sltt covstagdid_fem_all covstagdid_fem
> _all_unemp covstagdid_fem_all_sltt using $tabs/covstagdid.tex, se title(Difference in Differences of Union C
> overage on Right to Work Laws Treatment in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefi
> x(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st treat_s
> tblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) scalars("unemp_level State Monthl
> y Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time Trends")
(output written to /Users/amedeusdsouza/econ499/tabs/covstagdid.tex)

. 
. esttab wagstagdid_mal_all wagstagdid_mal_all_unemp wagstagdid_mal_all_sltt wagstagdid_fem_all wagstagdid_fem
> _all_unemp wagstagdid_fem_all_sltt using $tabs/wagstagdid1.tex, se title(Difference in Differences of Real L
> og Wages on Right to Work Laws Treatment in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) pref
> ix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st treat_
> stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) 
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid1.tex)

. 
. esttab nwagstagdid_mal_all nwagstagdid_mal_all_unemp nwagstagdid_mal_all_sltt nwagstagdid_fem_all nwagstagdi
> d_fem_all_unemp nwagstagdid_fem_all_sltt using $tabs/wagstagdid2.tex, se title(Difference in Differences of 
> Real Log Wages on Right to Work Laws Treatment in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0
> ) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st 
> treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01)
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid2.tex)

. 
. esttab uwagstagdid_mal_all uwagstagdid_mal_all_unemp uwagstagdid_mal_all_sltt uwagstagdid_fem_all uwagstagdi
> d_fem_all_unemp uwagstagdid_fem_all_sltt using $tabs/wagstagdid3.tex, se title(Difference in Differences of 
> Real Log Wages on Right to Work Laws Treatment in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0
> ) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr){@span})) keep(blackrelwhite treat_st 
> treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) scalars("unemp_level State
>  Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time Trends")
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid3.tex)

. 
. panelcombine, use($tabs/wagstagdid1.tex $tabs/wagstagdid2.tex $tabs/wagstagdid3.tex) paneltitles("All (Black
>  and White) People" "People Not Covered by Union - Spillover Effect" "People Covered by Union - Direct Effec
> t") columncount(3) save($tabs/wagstagdid.tex)

. 
. *** esttab wagstagdid_mal_all wagstagdid_fem_all nwagstagdid_mal_all nwagstagdid_fem_all uwagstagdid_mal_all
>  uwagstagdid_fem_all using $tabs/wagstagdid.tex, se title(Difference in Differences of Real Log Wages on Rig
> ht to Work Laws Treatment in State and Time) nonumbers mtitles("men" "women" "men not covered by union" "wom
> en not covered by union" "men covered by union" "women covered by union") keep(blackrelwhite treat_st treat_
> stblackrelwhite) replace
. 
. ** esttab wagstagdid_mal_cf wagstagdid_fem_cf nwagstagdid_mal_cf nwagstagdid_fem_cf uwagstagdid_mal_cf uwags
> tagdid_fem_cf using $tabs/wagstagdid_cf.tex, se title(Difference in Differences of Real Log Wages on Right t
> o Work Laws Treatment in State and Time) nonumbers mtitles("men" "women" "men not covered by union" "women n
> ot covered by union" "men covered by union" "women covered by union") keep(blackrelwhite treat_st treat_stbl
> ackrelwhite) replace
. 
. ** panelcombine, use($tabs/wagstagdid_all.tex $tabs/wagstagdid_cf.tex) paneltitles("All States" "W/O Always 
> RTW States") columncount(3) save($tabs/wagstagdid.tex)
. 
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 closed on:  22 Mar 2021, 12:51:02
--------------------------------------------------------------------------------------------------------------
