--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagsynthwhite.log
  log type:  text
 opened on:   7 Apr 2021, 16:10:48

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt pu
> blic marr hisprace hispracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unem
> p.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effectiv
> e; signed Dec2012) Mar1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72
> , 82) //incl Idaho which changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57
> , 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57
> , 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change t
> o treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. gen lyear = year - 1900

. 
. gen r2wstates = 0 if neverr2w == 1
(1,463,937 missing values generated)

.         replace r2wstates = 1 if alwaysr2w == 1
(1,149,124 real changes made)

.         replace r2wstates = 73 if state == 73
(35,302 real changes made)

.         replace r2wstates = 32 if state == 32
(46,817 real changes made)

.         replace r2wstates = 34 if state == 34
(94,533 real changes made)

.         replace r2wstates = 35 if state == 35
(62,707 real changes made)

.         replace r2wstates = 55 if state == 55
(35,853 real changes made)

.         replace r2wstates = 61 if state == 61
(39,601 real changes made)

. 
. ** gen panel data
. drop if year < 1996 // need without breaks
(787,460 observations deleted)

. 
. drop if alwaysr2w == 1 // keep neverr2w and treatments from policy variation
(864,454 observations deleted)

. 
. ** drop if inlist(state, 55, 81, 11, 12, 13) // wv, mt, me, nh, vt
. drop if state == 55
(27,314 observations deleted)

. 
. ** WHITE MEN - ALL STATES EXCEPT WV
. preserve

. 
. keep if female == 0 & blackrelwhite == 0
(803,889 observations deleted)

. 
. qui tab nind,    gen(dumnind)

. qui tab ee_cl,   gen(dumee_cl)

. qui tab nocc2,   gen(dumnocc2)

. qui tab quarter, gen(dumquarter)

. 
. ds state year nind ee_cl nocc2 quarter, not 
cmonth        exper         finalwt1      treat_sthi~e  dumnind11     dumee_cl13    dumnocc210
eweight       marr          nocc3         lyear         dumee_cl1     dumee_cl14    dumnocc211
hourly        lwage1        state_ind     r2wstates     dumee_cl2     dumee_cl15    dumnocc212
umem          public        edex          dumnind1      dumee_cl3     dumee_cl16    dumquarter1
citizen       exper2        blackrelwh~e  dumnind2      dumee_cl4     dumnocc21     dumquarter2
female        exper3        hisprelwhite  dumnind3      dumee_cl5     dumnocc22     dumquarter3
hisprace      exper4        date          dumnind4      dumee_cl6     dumnocc23     dumquarter4
hispracesex   cmsa          alwaysr2w     dumnind5      dumee_cl7     dumnocc24
nocc          partt         alwr2wcov     dumnind6      dumee_cl8     dumnocc25
covered       lwage3        neverr2w      dumnind7      dumee_cl9     dumnocc26
educ          index         stater2w      dumnind8      dumee_cl10    dumnocc27
alloc1        unemp         treat_st      dumnind9      dumee_cl11    dumnocc28
nwage1        _merge        treat_stbl~e  dumnind10     dumee_cl12    dumnocc29

. 
. collapse (mean) `r(varlist)' [aw = finalwt1], by(state year)

. 
. tsset state year
       panel variable:  state (strongly balanced)
        time variable:  year, 1996 to 2019
                delta:  1 unit

. 
. ** OK
. synth lwage3 dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9 dumnind10 dumn
> ind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2 dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee
> _cl7 dumee_cl8 dumee_cl9 dumee_cl10 dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr p
> artt public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26 dumnocc27 dumnocc28 dumnocc29 d
> umnocc210 dumnocc211 dumnocc212 dumquarter1 dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2000), counit(
> 11(1)16 21(1)23 31 33 41 43 51(1)53 81 84 85 91(1)95) trunit(73) trperiod(2001) nested allopt fig keep($linr
> eg/fin_synth_wm_ok) replace
--------------------------------------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------------------------------------
                Treated Unit: OK
               Control Units: ME, NH, VT, MA, RI, CT, NY, NJ, PA, OH, IL, MN, MO, DE, MD, DC, MT, CO, NM, WA,
                              OR, CA, AK, HI
--------------------------------------------------------------------------------------------------------------
          Dependent Variable: lwage3
  MSPE minimized for periods: 1996 1997 1998 1999 2000
Results obtained for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016 2017 2018 2019
--------------------------------------------------------------------------------------------------------------
                  Predictors: dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9
                              dumnind10 dumnind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2
                              dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee_cl7 dumee_cl8 dumee_cl9 dumee_cl10
                              dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr partt
                              public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26
                              dumnocc27 dumnocc28 dumnocc29 dumnocc210 dumnocc211 dumnocc212 dumquarter1
                              dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2000)
--------------------------------------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------------------------------------
Nested optimization requested
Starting nested optimization module
Optimization done
Allopt requested. This may take a while
Restarting nested optimization module (search method)
done
Restarting nested optimization module (equal method)
done
--------------------------------------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  .0357184 
---------------------
--------------------------------------------------------------------------------------------------------------
Unit Weights:

-----------------------
    Co_No | Unit_Weight
----------+------------
       ME |          .3
       NH |           0
       VT |        .262
       MA |           0
       RI |           0
       CT |           0
       NY |           0
       NJ |           0
       PA |           0
       OH |           0
       IL |           0
       MN |           0
       MO |        .117
       DE |           0
       MD |           0
       DC |           0
       MT |         .14
       CO |           0
       NM |        .181
       WA |           0
       OR |           0
       CA |           0
       AK |           0
       HI |           0
-----------------------
--------------------------------------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                      dumnind1 |  .0428866   .0377651 
                      dumnind2 |  .0869498   .0929148 
                      dumnind3 |  .2045098   .2053963 
                      dumnind4 |  .2216097   .2256051 
                      dumnind5 |  .1124503   .0884694 
                      dumnind6 |  .0328009   .0333211 
                      dumnind7 |  .0911472   .0977591 
                      dumnind8 |  .0416298   .0492706 
                      dumnind9 |  .0685062   .0815681 
                     dumnind10 |  .0264301    .030499 
                     dumnind11 |  .0710796   .0574314 
                          educ |  13.31423   13.43746 
                         exper |  18.39984   18.40658 
                        exper2 |  476.6094   472.5596 
                        exper3 |  14277.21    13981.9 
                        exper4 |  468001.7   453005.4 
                          edex |  245.7489   246.8254 
                     dumee_cl1 |   .043001   .0437083 
                     dumee_cl2 |  .0873896    .080311 
                     dumee_cl3 |  .0878665   .0728057 
                     dumee_cl4 |  .0509997   .0682927 
                     dumee_cl5 |  .0178303   .0127957 
                     dumee_cl6 |   .106331   .1049064 
                     dumee_cl7 |  .0713927   .0716856 
                     dumee_cl8 |  .0792823   .0803917 
                     dumee_cl9 |  .0195446   .0131866 
                    dumee_cl10 |  .0885578   .0995543 
                    dumee_cl11 |  .0749828   .0769334 
                    dumee_cl12 |  .0737106   .0874426 
                    dumee_cl13 |  .0185816   .0217052 
                    dumee_cl14 |  .0749063   .0797221 
                    dumee_cl15 |  .0582217   .0450159 
                    dumee_cl16 |  .0474015   .0415429 
                          marr |   .656944   .6142555 
                         partt |  .0757629   .0984662 
                        public |  .1750267   .1589979 
                          cmsa |  .6571744   .1801158 
                     dumnocc21 |   .105913   .0843282 
                     dumnocc22 |   .052431   .0579096 
                     dumnocc23 |  .0674629   .0826876 
                     dumnocc24 |  .0581459   .0695614 
                     dumnocc25 |  .0156157   .0127584 
                     dumnocc26 |  .0694648   .0609487 
                     dumnocc27 |  .1001046   .0988113 
                     dumnocc28 |  .0066873   .0061733 
                     dumnocc29 |  .0936847   .1008378 
                    dumnocc210 |   .144581   .1376762 
                    dumnocc211 |  .1622626   .1645837 
                    dumnocc212 |  .1236464   .1237239 
                   dumquarter1 |  .2387813   .2442108 
                   dumquarter2 |  .2504806   .2536643 
                   dumquarter3 |  .2695329   .2491205 
                   dumquarter4 |  .2412052   .2530045 
           lwage3(1996(1)2000) |  1.685025   1.698882 
------------------------------------------------------
--------------------------------------------------------------------------------------------------------------

. 
. graph export $figs/fin_synth_wm_ok.png, replace
(file /Users/amedeusdsouza/econ499/figures/fin_synth_wm_ok.png written in PNG format)

. 
. ** IN
. synth lwage3 dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9 dumnind10 dumn
> ind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2 dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee
> _cl7 dumee_cl8 dumee_cl9 dumee_cl10 dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr p
> artt public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26 dumnocc27 dumnocc28 dumnocc29 d
> umnocc210 dumnocc211 dumnocc212 dumquarter1 dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2011), counit(
> 11(1)16 21(1)23 31 33 41 43 51(1)53 81 84 85 91(1)95) trunit(32) trperiod(2012) nested allopt fig keep($linr
> eg/fin_synth_wm_in) replace
--------------------------------------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------------------------------------
                Treated Unit: IN
               Control Units: ME, NH, VT, MA, RI, CT, NY, NJ, PA, OH, IL, MN, MO, DE, MD, DC, MT, CO, NM, WA,
                              OR, CA, AK, HI
--------------------------------------------------------------------------------------------------------------
          Dependent Variable: lwage3
  MSPE minimized for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
Results obtained for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016 2017 2018 2019
--------------------------------------------------------------------------------------------------------------
                  Predictors: dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9
                              dumnind10 dumnind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2
                              dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee_cl7 dumee_cl8 dumee_cl9 dumee_cl10
                              dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr partt
                              public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26
                              dumnocc27 dumnocc28 dumnocc29 dumnocc210 dumnocc211 dumnocc212 dumquarter1
                              dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2011)
--------------------------------------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
--------------------------------------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------------------------------------
Nested optimization requested
Starting nested optimization module
Optimization done
Allopt requested. This may take a while
Restarting nested optimization module (search method)
done
Restarting nested optimization module (equal method)
done
--------------------------------------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  .0202005 
---------------------
--------------------------------------------------------------------------------------------------------------
Unit Weights:

-----------------------
    Co_No | Unit_Weight
----------+------------
       ME |           0
       NH |           0
       VT |           0
       MA |           0
       RI |           0
       CT |           0
       NY |           0
       NJ |           0
       PA |         .24
       OH |        .559
       IL |           0
       MN |           0
       MO |        .107
       DE |           0
       MD |           0
       DC |           0
       MT |        .093
       CO |           0
       NM |           0
       WA |           0
       OR |           0
       CA |           0
       AK |           0
       HI |           0
-----------------------
--------------------------------------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                      dumnind1 |  .0142907    .019327 
                      dumnind2 |  .0951093   .0910312 
                      dumnind3 |  .3100803   .2467846 
                      dumnind4 |  .2028077   .2091023 
                      dumnind5 |  .0937078   .0973149 
                      dumnind6 |  .0358984   .0443243 
                      dumnind7 |  .0977336     .11134 
                      dumnind8 |  .0391126   .0461522 
                      dumnind9 |  .0588636   .0621556 
                     dumnind10 |  .0159044   .0222521 
                     dumnind11 |  .0364917    .049216 
                          educ |  13.30749   13.48489 
                         exper |  19.61373   19.23085 
                        exper2 |   527.422   517.8973 
                        exper3 |  16180.35   15927.42 
                        exper4 |  537608.4   529812.4 
                          edex |  261.0826   258.8419 
                     dumee_cl1 |  .0400458   .0385108 
                     dumee_cl2 |  .0769794   .0788347 
                     dumee_cl3 |  .0764486   .0760259 
                     dumee_cl4 |  .0496494   .0722471 
                     dumee_cl5 |  .0143816   .0103275 
                     dumee_cl6 |  .0968312   .0861731 
                     dumee_cl7 |  .0727215   .0645959 
                     dumee_cl8 |  .0754542   .0825177 
                     dumee_cl9 |  .0153157    .012455 
                    dumee_cl10 |  .1103382   .1012785 
                    dumee_cl11 |  .0678211   .0637566 
                    dumee_cl12 |    .06872   .0774254 
                    dumee_cl13 |  .0203247   .0171794 
                    dumee_cl14 |  .1075148   .1063083 
                    dumee_cl15 |  .0602105   .0598989 
                    dumee_cl16 |  .0472433   .0514654 
                          marr |  .6417735   .6141858 
                         partt |  .0871646   .1010566 
                        public |  .1073985   .1298011 
                          cmsa |  .6037928   .7018281 
                     dumnocc21 |  .0893981   .0977033 
                     dumnocc22 |  .0469512   .0557044 
                     dumnocc23 |  .0661864   .0807888 
                     dumnocc24 |  .0566316   .0612928 
                     dumnocc25 |  .0125886   .0154337 
                     dumnocc26 |  .0556084   .0637261 
                     dumnocc27 |  .0781248   .0785459 
                     dumnocc28 |  .0076346   .0061778 
                     dumnocc29 |  .1068248   .1212287 
                    dumnocc210 |  .1795555   .1450304 
                    dumnocc211 |  .1791709   .1558469 
                    dumnocc212 |  .1213251   .1175214 
                   dumquarter1 |  .2606549   .2560708 
                   dumquarter2 |   .249956   .2483376 
                   dumquarter3 |  .2473339   .2514591 
                   dumquarter4 |  .2420552   .2431325 
           lwage3(1996(1)2011) |  1.810124   1.807405 
------------------------------------------------------
--------------------------------------------------------------------------------------------------------------

. 
. graph export $figs/fin_synth_wm_in.png, replace
(file /Users/amedeusdsouza/econ499/figures/fin_synth_wm_in.png written in PNG format)

. 
. ** MI
. synth lwage3 dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9 dumnind10 dumn
> ind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2 dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee
> _cl7 dumee_cl8 dumee_cl9 dumee_cl10 dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr p
> artt public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26 dumnocc27 dumnocc28 dumnocc29 d
> umnocc210 dumnocc211 dumnocc212 dumquarter1 dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2012), counit(
> 11(1)16 21(1)23 31 33 41 43 51(1)53 81 84 85 91(1)95) trunit(34) trperiod(2013) nested allopt fig keep($linr
> eg/fin_synth_wm_mi) replace
--------------------------------------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------------------------------------
                Treated Unit: MI
               Control Units: ME, NH, VT, MA, RI, CT, NY, NJ, PA, OH, IL, MN, MO, DE, MD, DC, MT, CO, NM, WA,
                              OR, CA, AK, HI
--------------------------------------------------------------------------------------------------------------
          Dependent Variable: lwage3
  MSPE minimized for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012
Results obtained for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016 2017 2018 2019
--------------------------------------------------------------------------------------------------------------
                  Predictors: dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9
                              dumnind10 dumnind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2
                              dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee_cl7 dumee_cl8 dumee_cl9 dumee_cl10
                              dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr partt
                              public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26
                              dumnocc27 dumnocc28 dumnocc29 dumnocc210 dumnocc211 dumnocc212 dumquarter1
                              dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2012)
--------------------------------------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012
--------------------------------------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------------------------------------
Nested optimization requested
Starting nested optimization module
Optimization done
Allopt requested. This may take a while
Restarting nested optimization module (search method)
done
Restarting nested optimization module (equal method)
done
--------------------------------------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  .0314778 
---------------------
--------------------------------------------------------------------------------------------------------------
Unit Weights:

-----------------------
    Co_No | Unit_Weight
----------+------------
       ME |           0
       NH |           0
       VT |           0
       MA |           0
       RI |           0
       CT |           0
       NY |           0
       NJ |           0
       PA |           0
       OH |        .887
       IL |           0
       MN |           0
       MO |           0
       DE |           0
       MD |           0
       DC |        .113
       MT |           0
       CO |           0
       NM |           0
       WA |           0
       OR |           0
       CA |           0
       AK |           0
       HI |           0
-----------------------
--------------------------------------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                      dumnind1 |  .0132357   .0127249 
                      dumnind2 |  .0784259   .0748142 
                      dumnind3 |  .3231584    .254288 
                      dumnind4 |  .2087526   .1877491 
                      dumnind5 |  .0694185   .0895302 
                      dumnind6 |  .0333977    .046891 
                      dumnind7 |  .1127375   .1405144 
                      dumnind8 |  .0404813   .0455313 
                      dumnind9 |   .063039   .0606399 
                     dumnind10 |  .0195664   .0219098 
                     dumnind11 |  .0377872   .0654071 
                          educ |  13.64361   13.82117 
                         exper |   18.8413   18.83443 
                        exper2 |  500.5426   503.0618 
                        exper3 |  15160.82    15425.5 
                        exper4 |    496681   512349.1 
                          edex |  257.5261   258.1153 
                     dumee_cl1 |  .0395544   .0333636 
                     dumee_cl2 |  .0679576   .0712089 
                     dumee_cl3 |  .0962803   .0706138 
                     dumee_cl4 |  .0689236   .1057372 
                     dumee_cl5 |  .0079364   .0090175 
                     dumee_cl6 |  .0722969   .0787539 
                     dumee_cl7 |  .0765647   .0593502 
                     dumee_cl8 |  .0866319   .0996544 
                     dumee_cl9 |       .01   .0110375 
                    dumee_cl10 |   .086361   .0903986 
                    dumee_cl11 |  .0782669   .0597622 
                    dumee_cl12 |  .0846318   .0837735 
                    dumee_cl13 |  .0161934   .0158221 
                    dumee_cl14 |  .0798592   .0989944 
                    dumee_cl15 |   .071996   .0559445 
                    dumee_cl16 |  .0565459   .0565676 
                          marr |  .6239471    .585086 
                         partt |  .1153521   .0981447 
                        public |  .1051285   .1418741 
                          cmsa |  .8141587    .811483 
                     dumnocc21 |  .0963023   .1224776 
                     dumnocc22 |  .0549281   .0658297 
                     dumnocc23 |  .1041484   .0927484 
                     dumnocc24 |  .0609851    .075203 
                     dumnocc25 |  .0148909   .0143099 
                     dumnocc26 |  .0567342   .0631669 
                     dumnocc27 |  .0791327   .0702801 
                     dumnocc28 |  .0063005   .0063336 
                     dumnocc29 |  .1159511   .1119166 
                    dumnocc210 |  .1650771   .1444525 
                    dumnocc211 |  .1448677   .1307261 
                    dumnocc212 |  .1006818   .1025556 
                   dumquarter1 |   .256995   .2548241 
                   dumquarter2 |  .2519012   .2506595 
                   dumquarter3 |  .2495105   .2526033 
                   dumquarter4 |  .2415933   .2419131 
           lwage3(1996(1)2012) |  1.879599   1.877927 
------------------------------------------------------
--------------------------------------------------------------------------------------------------------------

. 
. graph export $figs/fin_synth_wm_mi.png, replace
(file /Users/amedeusdsouza/econ499/figures/fin_synth_wm_mi.png written in PNG format)

. 
. ** WI
. synth lwage3 dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9 dumnind10 dumn
> ind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2 dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee
> _cl7 dumee_cl8 dumee_cl9 dumee_cl10 dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr p
> artt public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26 dumnocc27 dumnocc28 dumnocc29 d
> umnocc210 dumnocc211 dumnocc212 dumquarter1 dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2014), counit(
> 11(1)16 21(1)23 31 33 41 43 51(1)53 81 84 85 91(1)95) trunit(35) trperiod(2015) nested allopt fig keep($linr
> eg/fin_synth_wm_wi) replace
--------------------------------------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------------------------------------
                Treated Unit: WI
               Control Units: ME, NH, VT, MA, RI, CT, NY, NJ, PA, OH, IL, MN, MO, DE, MD, DC, MT, CO, NM, WA,
                              OR, CA, AK, HI
--------------------------------------------------------------------------------------------------------------
          Dependent Variable: lwage3
  MSPE minimized for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014
Results obtained for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016 2017 2018 2019
--------------------------------------------------------------------------------------------------------------
                  Predictors: dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9
                              dumnind10 dumnind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2
                              dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee_cl7 dumee_cl8 dumee_cl9 dumee_cl10
                              dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr partt
                              public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26
                              dumnocc27 dumnocc28 dumnocc29 dumnocc210 dumnocc211 dumnocc212 dumquarter1
                              dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2014)
--------------------------------------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014
--------------------------------------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------------------------------------
Nested optimization requested
Starting nested optimization module
Optimization done
Allopt requested. This may take a while
Restarting nested optimization module (search method)
done
Restarting nested optimization module (equal method)
done
--------------------------------------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  .0186633 
---------------------
--------------------------------------------------------------------------------------------------------------
Unit Weights:

-----------------------
    Co_No | Unit_Weight
----------+------------
       ME |        .179
       NH |           0
       VT |           0
       MA |           0
       RI |           0
       CT |           0
       NY |           0
       NJ |           0
       PA |           0
       OH |          .6
       IL |           0
       MN |        .197
       MO |           0
       DE |           0
       MD |           0
       DC |        .024
       MT |           0
       CO |           0
       NM |           0
       WA |           0
       OR |           0
       CA |           0
       AK |           0
       HI |           0
-----------------------
--------------------------------------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                      dumnind1 |  .0159594   .0156388 
                      dumnind2 |  .0887511   .0856537 
                      dumnind3 |  .2969104   .2485001 
                      dumnind4 |  .2105276   .2109692 
                      dumnind5 |  .0829231   .0888206 
                      dumnind6 |  .0402611   .0470943 
                      dumnind7 |  .0990889   .1185907 
                      dumnind8 |  .0431365   .0508087 
                      dumnind9 |  .0613656   .0627658 
                     dumnind10 |  .0193288   .0220029 
                     dumnind11 |  .0417475    .049155 
                          educ |  13.63276   13.65851 
                         exper |  19.15998   19.31734 
                        exper2 |  518.6814   523.2565 
                        exper3 |  16037.36   16182.89 
                        exper4 |  535957.8     540791 
                          edex |  261.8111   263.1362 
                     dumee_cl1 |   .040428   .0357196 
                     dumee_cl2 |  .0724301   .0740863 
                     dumee_cl3 |  .0902209   .0788743 
                     dumee_cl4 |  .0693495   .0793098 
                     dumee_cl5 |  .0071777   .0083588 
                     dumee_cl6 |  .0733047   .0785584 
                     dumee_cl7 |  .0793753   .0665251 
                     dumee_cl8 |   .082713   .0879113 
                     dumee_cl9 |  .0083418    .009885 
                    dumee_cl10 |  .0869054   .0903887 
                    dumee_cl11 |  .0770722   .0696291 
                    dumee_cl12 |  .0745266   .0806382 
                    dumee_cl13 |  .0117573   .0149199 
                    dumee_cl14 |  .0993328   .1021944 
                    dumee_cl15 |  .0685485   .0658601 
                    dumee_cl16 |  .0585162   .0571411 
                          marr |  .5881019   .5988142 
                         partt |  .1105053   .1059258 
                        public |  .1222963   .1303197 
                          cmsa |  .6047733   .6315821 
                     dumnocc21 |  .0961017   .1028959 
                     dumnocc22 |  .0555506   .0612821 
                     dumnocc23 |  .0820464   .0864789 
                     dumnocc24 |  .0616106   .0666329 
                     dumnocc25 |  .0127309   .0149845 
                     dumnocc26 |  .0622293   .0675541 
                     dumnocc27 |  .0748613   .0753401 
                     dumnocc28 |  .0062408   .0063081 
                     dumnocc29 |  .1140743   .1218366 
                    dumnocc210 |  .1763782   .1422773 
                    dumnocc211 |  .1474987   .1473465 
                    dumnocc212 |  .1106773   .1070631 
                   dumquarter1 |  .2501434   .2544894 
                   dumquarter2 |  .2522336   .2484921 
                   dumquarter3 |  .2485279    .252667 
                   dumquarter4 |  .2490952   .2443515 
           lwage3(1996(1)2014) |  1.833171   1.833316 
------------------------------------------------------
--------------------------------------------------------------------------------------------------------------

. 
. graph export $figs/fin_synth_wm_wi.png, replace
(file /Users/amedeusdsouza/econ499/figures/fin_synth_wm_wi.png written in PNG format)

. 
. ** KY
. synth lwage3 dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9 dumnind10 dumn
> ind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2 dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee
> _cl7 dumee_cl8 dumee_cl9 dumee_cl10 dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr p
> artt public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26 dumnocc27 dumnocc28 dumnocc29 d
> umnocc210 dumnocc211 dumnocc212 dumquarter1 dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2016), counit(
> 11(1)16 21(1)23 31 33 41 43 51(1)53 81 84 85 91(1)95) trunit(61) trperiod(2017) nested allopt fig keep($linr
> eg/fin_synth_wm_ky) replace
--------------------------------------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------------------------------------
control units: for 1 of out 24 units missing obs for predictor cmsa in period 2016 -ignored for averaging
--------------------------------------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------------------------------------
                Treated Unit: KY
               Control Units: ME, NH, VT, MA, RI, CT, NY, NJ, PA, OH, IL, MN, MO, DE, MD, DC, MT, CO, NM, WA,
                              OR, CA, AK, HI
--------------------------------------------------------------------------------------------------------------
          Dependent Variable: lwage3
  MSPE minimized for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016
Results obtained for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016 2017 2018 2019
--------------------------------------------------------------------------------------------------------------
                  Predictors: dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9
                              dumnind10 dumnind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2
                              dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee_cl7 dumee_cl8 dumee_cl9 dumee_cl10
                              dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr partt
                              public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26
                              dumnocc27 dumnocc28 dumnocc29 dumnocc210 dumnocc211 dumnocc212 dumquarter1
                              dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2016)
--------------------------------------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016
--------------------------------------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------------------------------------
Nested optimization requested
Starting nested optimization module
Optimization done
Allopt requested. This may take a while
Restarting nested optimization module (search method)
done
Restarting nested optimization module (equal method)
done
--------------------------------------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  .0322012 
---------------------
--------------------------------------------------------------------------------------------------------------
Unit Weights:

-----------------------
    Co_No | Unit_Weight
----------+------------
       ME |           0
       NH |           0
       VT |           0
       MA |           0
       RI |           0
       CT |           0
       NY |           0
       NJ |           0
       PA |           0
       OH |         .24
       IL |           0
       MN |           0
       MO |        .223
       DE |           0
       MD |           0
       DC |           0
       MT |        .536
       CO |           0
       NM |           0
       WA |           0
       OR |           0
       CA |           0
       AK |           0
       HI |           0
-----------------------
--------------------------------------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                      dumnind1 |  .0337327     .04152 
                      dumnind2 |  .0986102   .1088288 
                      dumnind3 |  .2211493   .1608258 
                      dumnind4 |  .2088276   .2358067 
                      dumnind5 |  .1140329   .0996156 
                      dumnind6 |  .0352908   .0385398 
                      dumnind7 |  .1025744   .1106625 
                      dumnind8 |  .0509168   .0487257 
                      dumnind9 |  .0651505   .0699379 
                     dumnind10 |  .0202913   .0246693 
                     dumnind11 |  .0494236   .0598679 
                          educ |  13.31941   13.53431 
                         exper |  18.97954   18.97348 
                        exper2 |  506.8118   511.4337 
                        exper3 |  15581.94    15808.6 
                        exper4 |  520312.2   528221.9 
                          edex |  250.3014   257.8446 
                     dumee_cl1 |   .030366   .0382873 
                     dumee_cl2 |  .0877833   .0843429 
                     dumee_cl3 |  .0856726   .0898063 
                     dumee_cl4 |  .0709278   .0715436 
                     dumee_cl5 |  .0177414   .0099013 
                     dumee_cl6 |   .089736   .0791918 
                     dumee_cl7 |  .0712815   .0729575 
                     dumee_cl8 |  .0737917     .07563 
                     dumee_cl9 |  .0214158   .0102909 
                    dumee_cl10 |  .0962294   .0850616 
                    dumee_cl11 |  .0609653    .068391 
                    dumee_cl12 |  .0650455   .0771542 
                    dumee_cl13 |  .0314125   .0132226 
                    dumee_cl14 |  .0953496   .0939574 
                    dumee_cl15 |  .0567814   .0691156 
                    dumee_cl16 |  .0455002   .0601462 
                          marr |  .6226575   .5872442 
                         partt |  .0932633   .1112813 
                        public |  .1387866    .160955 
                          cmsa |  .5320324   .3499676 
                     dumnocc21 |  .0813405   .0816197 
                     dumnocc22 |  .0536582   .0592488 
                     dumnocc23 |  .0670778   .0729993 
                     dumnocc24 |  .0659364   .0667367 
                     dumnocc25 |  .0191167   .0170783 
                     dumnocc26 |   .068709   .0602619 
                     dumnocc27 |  .0714183   .0814048 
                     dumnocc28 |    .00621   .0055445 
                     dumnocc29 |  .1219022   .1424412 
                    dumnocc210 |  .1434774   .1202699 
                    dumnocc211 |  .1653983   .1760148 
                    dumnocc212 |  .1357551   .1153802 
                   dumquarter1 |  .2664081   .2536979 
                   dumquarter2 |  .2489153   .2500763 
                   dumquarter3 |  .2498102   .2506926 
                   dumquarter4 |  .2348664   .2445332 
           lwage3(1996(1)2016) |  1.719503   1.724214 
------------------------------------------------------
--------------------------------------------------------------------------------------------------------------

. 
. graph export $figs/fin_synth_wm_ky.png, replace
(file /Users/amedeusdsouza/econ499/figures/fin_synth_wm_ky.png written in PNG format)

. 
. restore

. 
. ** WHITE WOMEN - ALL STATES EXCEPT WV
. preserve

. 
. keep if female == 1 & blackrelwhite == 0
(797,247 observations deleted)

. 
. qui tab nind,    gen(dumnind)

. qui tab ee_cl,   gen(dumee_cl)

. qui tab nocc2,   gen(dumnocc2)

. qui tab quarter, gen(dumquarter)

. 
. ds state year nind ee_cl nocc2 quarter, not 
cmonth        exper         finalwt1      treat_sthi~e  dumnind11     dumee_cl13    dumnocc210
eweight       marr          nocc3         lyear         dumee_cl1     dumee_cl14    dumnocc211
hourly        lwage1        state_ind     r2wstates     dumee_cl2     dumee_cl15    dumnocc212
umem          public        edex          dumnind1      dumee_cl3     dumee_cl16    dumquarter1
citizen       exper2        blackrelwh~e  dumnind2      dumee_cl4     dumnocc21     dumquarter2
female        exper3        hisprelwhite  dumnind3      dumee_cl5     dumnocc22     dumquarter3
hisprace      exper4        date          dumnind4      dumee_cl6     dumnocc23     dumquarter4
hispracesex   cmsa          alwaysr2w     dumnind5      dumee_cl7     dumnocc24
nocc          partt         alwr2wcov     dumnind6      dumee_cl8     dumnocc25
covered       lwage3        neverr2w      dumnind7      dumee_cl9     dumnocc26
educ          index         stater2w      dumnind8      dumee_cl10    dumnocc27
alloc1        unemp         treat_st      dumnind9      dumee_cl11    dumnocc28
nwage1        _merge        treat_stbl~e  dumnind10     dumee_cl12    dumnocc29

. 
. collapse (mean) `r(varlist)' [aw = finalwt1], by(state year)

. 
. tsset state year
       panel variable:  state (strongly balanced)
        time variable:  year, 1996 to 2019
                delta:  1 unit

. 
. ** OK
. synth lwage3 dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9 dumnind10 dumn
> ind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2 dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee
> _cl7 dumee_cl8 dumee_cl9 dumee_cl10 dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr p
> artt public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26 dumnocc27 dumnocc28 dumnocc29 d
> umnocc210 dumnocc211 dumnocc212 dumquarter1 dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2000), counit(
> 11(1)16 21(1)23 31 33 41 43 51(1)53 81 84 85 91(1)95) trunit(73) trperiod(2001) nested allopt fig keep($linr
> eg/fin_synth_wf_ok) replace
--------------------------------------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------------------------------------
                Treated Unit: OK
               Control Units: ME, NH, VT, MA, RI, CT, NY, NJ, PA, OH, IL, MN, MO, DE, MD, DC, MT, CO, NM, WA,
                              OR, CA, AK, HI
--------------------------------------------------------------------------------------------------------------
          Dependent Variable: lwage3
  MSPE minimized for periods: 1996 1997 1998 1999 2000
Results obtained for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016 2017 2018 2019
--------------------------------------------------------------------------------------------------------------
                  Predictors: dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9
                              dumnind10 dumnind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2
                              dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee_cl7 dumee_cl8 dumee_cl9 dumee_cl10
                              dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr partt
                              public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26
                              dumnocc27 dumnocc28 dumnocc29 dumnocc210 dumnocc211 dumnocc212 dumquarter1
                              dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2000)
--------------------------------------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1996 1997 1998 1999 2000
--------------------------------------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------------------------------------
Nested optimization requested
Starting nested optimization module
Optimization done
Allopt requested. This may take a while
Restarting nested optimization module (search method)
done
Restarting nested optimization module (equal method)
done
--------------------------------------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  .0180359 
---------------------
--------------------------------------------------------------------------------------------------------------
Unit Weights:

-----------------------
    Co_No | Unit_Weight
----------+------------
       ME |        .244
       NH |           0
       VT |           0
       MA |           0
       RI |           0
       CT |           0
       NY |           0
       NJ |           0
       PA |        .069
       OH |           0
       IL |           0
       MN |           0
       MO |         .06
       DE |           0
       MD |           0
       DC |           0
       MT |        .627
       CO |           0
       NM |           0
       WA |           0
       OR |           0
       CA |           0
       AK |           0
       HI |           0
-----------------------
--------------------------------------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                      dumnind1 |  .0162349   .0161479 
                      dumnind2 |  .0077126   .0093179 
                      dumnind3 |  .0888728   .0704599 
                      dumnind4 |  .2075088   .2313549 
                      dumnind5 |  .0494673   .0354306 
                      dumnind6 |  .0784892   .0730332 
                      dumnind7 |  .0861035   .0750185 
                      dumnind8 |  .2056281   .2262602 
                      dumnind9 |  .1559295   .1561711 
                     dumnind10 |  .0414905   .0558699 
                     dumnind11 |  .0625628   .0509358 
                          educ |  13.36791   13.50723 
                         exper |  18.43496   18.24463 
                        exper2 |  486.3647   471.0493 
                        exper3 |   14737.6   13897.22 
                        exper4 |  486283.2   446346.3 
                          edex |  245.2388   245.2246 
                     dumee_cl1 |  .0414333   .0352643 
                     dumee_cl2 |  .0754068    .075069 
                     dumee_cl3 |  .0957768   .0988161 
                     dumee_cl4 |  .0661091   .0716626 
                     dumee_cl5 |  .0138502   .0071101 
                     dumee_cl6 |   .091709   .0765104 
                     dumee_cl7 |  .0767147   .0781327 
                     dumee_cl8 |  .0700235   .0837752 
                     dumee_cl9 |  .0137573   .0078102 
                    dumee_cl10 |  .0918916   .0982338 
                    dumee_cl11 |  .0777158   .0951121 
                    dumee_cl12 |  .0783897    .087199 
                    dumee_cl13 |  .0236545   .0170602 
                    dumee_cl14 |  .0942315   .0853975 
                    dumee_cl15 |  .0565639   .0540544 
                    dumee_cl16 |  .0327721   .0287924 
                          marr |  .6102015   .5893053 
                         partt |  .2236261   .2897273 
                        public |  .2281585    .212933 
                          cmsa |   .641977   .0943878 
                     dumnocc21 |  .0524719   .0492467 
                     dumnocc22 |  .0826987   .0828242 
                     dumnocc23 |  .0274895   .0263343 
                     dumnocc24 |  .1358781   .1211005 
                     dumnocc25 |  .0730454   .0724254 
                     dumnocc26 |   .270274   .2565234 
                     dumnocc27 |  .1170268   .1119386 
                     dumnocc28 |  .0050871   .0072209 
                     dumnocc29 |  .1543201   .1943521 
                    dumnocc210 |  .0544053    .052692 
                    dumnocc211 |  .0045074    .004982 
                    dumnocc212 |  .0227956     .02036 
                   dumquarter1 |  .2531413   .2534916 
                   dumquarter2 |  .2465544   .2506123 
                   dumquarter3 |  .2508122   .2459445 
                   dumquarter4 |  .2494921   .2499516 
           lwage3(1996(1)2000) |  1.408733   1.418853 
------------------------------------------------------
--------------------------------------------------------------------------------------------------------------

. 
. graph export $figs/fin_synth_wf_ok.png, replace
(file /Users/amedeusdsouza/econ499/figures/fin_synth_wf_ok.png written in PNG format)

. 
. ** IN - nested leads to unstable/asymmetric Hessian
. synth lwage3 dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9 dumnind10 dumn
> ind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2 dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee
> _cl7 dumee_cl8 dumee_cl9 dumee_cl10 dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr p
> artt public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26 dumnocc27 dumnocc28 dumnocc29 d
> umnocc210 dumnocc211 dumnocc212 dumquarter1 dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2011), counit(
> 11(1)16 21(1)23 31 33 41 43 51(1)53 81 84 85 91(1)95) trunit(32) trperiod(2012) /*nested*/ allopt fig keep($
> linreg/fin_synth_wf_in) replace
--------------------------------------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------------------------------------
                Treated Unit: IN
               Control Units: ME, NH, VT, MA, RI, CT, NY, NJ, PA, OH, IL, MN, MO, DE, MD, DC, MT, CO, NM, WA,
                              OR, CA, AK, HI
--------------------------------------------------------------------------------------------------------------
          Dependent Variable: lwage3
  MSPE minimized for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
Results obtained for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016 2017 2018 2019
--------------------------------------------------------------------------------------------------------------
                  Predictors: dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9
                              dumnind10 dumnind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2
                              dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee_cl7 dumee_cl8 dumee_cl9 dumee_cl10
                              dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr partt
                              public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26
                              dumnocc27 dumnocc28 dumnocc29 dumnocc210 dumnocc211 dumnocc212 dumquarter1
                              dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2011)
--------------------------------------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
--------------------------------------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  .0560839 
---------------------
--------------------------------------------------------------------------------------------------------------
Unit Weights:

-----------------------
    Co_No | Unit_Weight
----------+------------
       ME |           0
       NH |        .177
       VT |           0
       MA |           0
       RI |           0
       CT |           0
       NY |           0
       NJ |           0
       PA |           0
       OH |        .823
       IL |           0
       MN |           0
       MO |           0
       DE |           0
       MD |           0
       DC |           0
       MT |           0
       CO |           0
       NM |           0
       WA |           0
       OR |           0
       CA |           0
       AK |           0
       HI |           0
-----------------------
--------------------------------------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                      dumnind1 |  .0061334   .0045347 
                      dumnind2 |   .012185   .0112092 
                      dumnind3 |  .1502529   .1141378 
                      dumnind4 |  .2201703   .2324573 
                      dumnind5 |  .0403785   .0372275 
                      dumnind6 |  .0693193   .0745484 
                      dumnind7 |  .0786596   .0882115 
                      dumnind8 |  .2132694   .2274396 
                      dumnind9 |  .1437495   .1388791 
                     dumnind10 |  .0326748   .0357013 
                     dumnind11 |  .0332073   .0356536 
                          educ |  13.47589   13.62925 
                         exper |  19.76637   19.37495 
                        exper2 |  544.4594   530.5391 
                        exper3 |  17005.54   16503.45 
                        exper4 |  572689.6   554177.7 
                          edex |  264.3965    261.903 
                     dumee_cl1 |  .0373259   .0362349 
                     dumee_cl2 |  .0644635   .0589277 
                     dumee_cl3 |  .0849474   .0910396 
                     dumee_cl4 |  .0704498   .0834504 
                     dumee_cl5 |   .009376   .0067818 
                     dumee_cl6 |  .0719462   .0678289 
                     dumee_cl7 |   .073177   .0695808 
                     dumee_cl8 |   .071355   .0794457 
                     dumee_cl9 |  .0121335   .0080542 
                    dumee_cl10 |  .1004183   .0964276 
                    dumee_cl11 |  .0796744   .0814967 
                    dumee_cl12 |  .0730506    .077407 
                    dumee_cl13 |  .0202806   .0162101 
                    dumee_cl14 |  .1224133   .1118146 
                    dumee_cl15 |  .0681485    .067676 
                    dumee_cl16 |  .0408402   .0476239 
                          marr |  .6034984   .5751767 
                         partt |  .2601378   .2823536 
                        public |  .1624643   .1696027 
                          cmsa |  .5990765   .7173534 
                     dumnocc21 |  .0500675   .0596264 
                     dumnocc22 |  .0710827   .0805762 
                     dumnocc23 |  .0231614   .0252574 
                     dumnocc24 |  .1296557   .1331832 
                     dumnocc25 |  .0885594    .095512 
                     dumnocc26 |  .2331733    .229782 
                     dumnocc27 |  .1010654   .0953234 
                     dumnocc28 |  .0073773   .0077127 
                     dumnocc29 |  .1695627   .1842883 
                    dumnocc210 |  .0911894   .0591703 
                    dumnocc211 |  .0058551    .005372 
                    dumnocc212 |    .02925   .0241961 
                   dumquarter1 |  .2658754   .2565543 
                   dumquarter2 |  .2447931   .2469283 
                   dumquarter3 |  .2431034   .2526412 
                   dumquarter4 |  .2462281   .2438762 
           lwage3(1996(1)2011) |  1.548418   1.599761 
------------------------------------------------------
--------------------------------------------------------------------------------------------------------------

. 
. graph export $figs/fin_synth_wf_in.png, replace
(file /Users/amedeusdsouza/econ499/figures/fin_synth_wf_in.png written in PNG format)

. 
. ** MI
. synth lwage3 dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9 dumnind10 dumn
> ind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2 dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee
> _cl7 dumee_cl8 dumee_cl9 dumee_cl10 dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr p
> artt public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26 dumnocc27 dumnocc28 dumnocc29 d
> umnocc210 dumnocc211 dumnocc212 dumquarter1 dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2012), counit(
> 11(1)16 21(1)23 31 33 41 43 51(1)53 81 84 85 91(1)95) trunit(34) trperiod(2013) nested allopt fig keep($linr
> eg/fin_synth_wf_mi) replace
--------------------------------------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------------------------------------
                Treated Unit: MI
               Control Units: ME, NH, VT, MA, RI, CT, NY, NJ, PA, OH, IL, MN, MO, DE, MD, DC, MT, CO, NM, WA,
                              OR, CA, AK, HI
--------------------------------------------------------------------------------------------------------------
          Dependent Variable: lwage3
  MSPE minimized for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012
Results obtained for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016 2017 2018 2019
--------------------------------------------------------------------------------------------------------------
                  Predictors: dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9
                              dumnind10 dumnind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2
                              dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee_cl7 dumee_cl8 dumee_cl9 dumee_cl10
                              dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr partt
                              public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26
                              dumnocc27 dumnocc28 dumnocc29 dumnocc210 dumnocc211 dumnocc212 dumquarter1
                              dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2012)
--------------------------------------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012
--------------------------------------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------------------------------------
Nested optimization requested
Starting nested optimization module
Optimization done
Allopt requested. This may take a while
Restarting nested optimization module (search method)
done
Restarting nested optimization module (equal method)
done
--------------------------------------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  .0269866 
---------------------
--------------------------------------------------------------------------------------------------------------
Unit Weights:

-----------------------
    Co_No | Unit_Weight
----------+------------
       ME |           0
       NH |           0
       VT |           0
       MA |           0
       RI |           0
       CT |           0
       NY |           0
       NJ |           0
       PA |           0
       OH |        .811
       IL |           0
       MN |           0
       MO |           0
       DE |           0
       MD |           0
       DC |           0
       MT |           0
       CO |           0
       NM |           0
       WA |           0
       OR |           0
       CA |           0
       AK |        .189
       HI |           0
-----------------------
--------------------------------------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                      dumnind1 |  .0059425   .0064178 
                      dumnind2 |  .0114141   .0124985 
                      dumnind3 |  .1186927   .0944222 
                      dumnind4 |  .2244139   .2284835 
                      dumnind5 |   .036893    .042829 
                      dumnind6 |  .0679411   .0706201 
                      dumnind7 |  .0916848   .0889704 
                      dumnind8 |  .2195546   .2265709 
                      dumnind9 |  .1483919    .141813 
                     dumnind10 |  .0397477   .0375794 
                     dumnind11 |  .0353236   .0497949 
                          educ |  13.72972   13.66454 
                         exper |   19.0095   19.32366 
                        exper2 |  515.3947   527.4569 
                        exper3 |  15829.03   16342.22 
                        exper4 |  523229.8   546016.8 
                          edex |  259.6063   262.4424 
                     dumee_cl1 |  .0351163   .0346337 
                     dumee_cl2 |  .0565297   .0608323 
                     dumee_cl3 |  .1069993    .094655 
                     dumee_cl4 |  .0811625   .0825999 
                     dumee_cl5 |  .0047479   .0061355 
                     dumee_cl6 |  .0556464   .0655721 
                     dumee_cl7 |  .0755079    .070678 
                     dumee_cl8 |   .085248   .0785292 
                     dumee_cl9 |  .0071151   .0073454 
                    dumee_cl10 |  .0816031   .0927078 
                    dumee_cl11 |  .0911408   .0834928 
                    dumee_cl12 |  .0793711    .080417 
                    dumee_cl13 |  .0102845   .0142387 
                    dumee_cl14 |  .1023122    .105892 
                    dumee_cl15 |  .0802666   .0721968 
                    dumee_cl16 |  .0469484   .0500739 
                          marr |  .5763046   .5803918 
                         partt |  .3136503   .2733707 
                        public |  .1769939   .1960524 
                          cmsa |  .8124904   .6877052 
                     dumnocc21 |  .0583414   .0598343 
                     dumnocc22 |    .07575   .0818432 
                     dumnocc23 |  .0311735   .0254246 
                     dumnocc24 |  .1295002   .1366241 
                     dumnocc25 |  .0904656   .0949675 
                     dumnocc26 |  .2324605   .2357004 
                     dumnocc27 |  .0973962    .092059 
                     dumnocc28 |  .0067086   .0073015 
                     dumnocc29 |  .1864079   .1869701 
                    dumnocc210 |  .0621362   .0503326 
                    dumnocc211 |  .0062167    .005903 
                    dumnocc212 |  .0234432   .0230396 
                   dumquarter1 |  .2584982   .2576236 
                   dumquarter2 |  .2456344   .2468309 
                   dumquarter3 |  .2482383   .2544996 
                   dumquarter4 |  .2476291   .2410458 
           lwage3(1996(1)2012) |  1.624264   1.624584 
------------------------------------------------------
--------------------------------------------------------------------------------------------------------------

. 
. graph export $figs/fin_synth_wf_mi.png, replace
(file /Users/amedeusdsouza/econ499/figures/fin_synth_wf_mi.png written in PNG format)

. 
. ** WI
. synth lwage3 dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9 dumnind10 dumn
> ind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2 dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee
> _cl7 dumee_cl8 dumee_cl9 dumee_cl10 dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr p
> artt public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26 dumnocc27 dumnocc28 dumnocc29 d
> umnocc210 dumnocc211 dumnocc212 dumquarter1 dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2014), counit(
> 11(1)16 21(1)23 31 33 41 43 51(1)53 81 84 85 91(1)95) trunit(35) trperiod(2015) nested allopt fig keep($linr
> eg/fin_synth_wf_wi) replace
--------------------------------------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------------------------------------
                Treated Unit: WI
               Control Units: ME, NH, VT, MA, RI, CT, NY, NJ, PA, OH, IL, MN, MO, DE, MD, DC, MT, CO, NM, WA,
                              OR, CA, AK, HI
--------------------------------------------------------------------------------------------------------------
          Dependent Variable: lwage3
  MSPE minimized for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014
Results obtained for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016 2017 2018 2019
--------------------------------------------------------------------------------------------------------------
                  Predictors: dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9
                              dumnind10 dumnind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2
                              dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee_cl7 dumee_cl8 dumee_cl9 dumee_cl10
                              dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr partt
                              public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26
                              dumnocc27 dumnocc28 dumnocc29 dumnocc210 dumnocc211 dumnocc212 dumquarter1
                              dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2014)
--------------------------------------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014
--------------------------------------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------------------------------------
Nested optimization requested
Starting nested optimization module
Optimization done
Allopt requested. This may take a while
Restarting nested optimization module (search method)
done
Restarting nested optimization module (equal method)
done
--------------------------------------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  .0104013 
---------------------
--------------------------------------------------------------------------------------------------------------
Unit Weights:

-----------------------
    Co_No | Unit_Weight
----------+------------
       ME |           0
       NH |           0
       VT |           0
       MA |           0
       RI |           0
       CT |           0
       NY |           0
       NJ |           0
       PA |        .565
       OH |        .231
       IL |           0
       MN |           0
       MO |           0
       DE |           0
       MD |           0
       DC |           0
       MT |           0
       CO |           0
       NM |           0
       WA |           0
       OR |        .204
       CA |           0
       AK |           0
       HI |           0
-----------------------
--------------------------------------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                      dumnind1 |  .0060772   .0056612 
                      dumnind2 |  .0108798   .0112616 
                      dumnind3 |  .1329206   .0962297 
                      dumnind4 |  .2059219   .2160038 
                      dumnind5 |  .0383456   .0392388 
                      dumnind6 |  .0887359   .0768656 
                      dumnind7 |  .0880696   .0976151 
                      dumnind8 |  .2338585   .2401057 
                      dumnind9 |  .1256084   .1411723 
                     dumnind10 |  .0362398   .0365498 
                     dumnind11 |  .0333426   .0392964 
                          educ |  13.79016   13.78777 
                         exper |  19.15505   19.77534 
                        exper2 |  524.7687   549.6664 
                        exper3 |  16342.12   17297.97 
                        exper4 |  548297.1   585333.2 
                          edex |  263.1235   269.5915 
                     dumee_cl1 |   .039315    .029823 
                     dumee_cl2 |  .0587263    .057119 
                     dumee_cl3 |  .0979656   .0843957 
                     dumee_cl4 |  .0859575   .0958352 
                     dumee_cl5 |  .0040022   .0052715 
                     dumee_cl6 |  .0563956   .0619192 
                     dumee_cl7 |  .0746294   .0613793 
                     dumee_cl8 |  .0879653   .0863288 
                     dumee_cl9 |  .0037682   .0066191 
                    dumee_cl10 |  .0800685   .0902894 
                    dumee_cl11 |  .0853081   .0759534 
                    dumee_cl12 |  .0823023   .0833966 
                    dumee_cl13 |  .0083367   .0139748 
                    dumee_cl14 |  .1037633   .1198356 
                    dumee_cl15 |  .0829239   .0740368 
                    dumee_cl16 |   .048572   .0538224 
                          marr |  .5835019   .5706956 
                         partt |  .2890215   .2789738 
                        public |  .1686927   .1642776 
                          cmsa |  .6000242   .7696117 
                     dumnocc21 |   .055085   .0625683 
                     dumnocc22 |  .0840445   .0822371 
                     dumnocc23 |  .0314255   .0291706 
                     dumnocc24 |  .1292404   .1391378 
                     dumnocc25 |  .0878286   .0961975 
                     dumnocc26 |  .2414374   .2345141 
                     dumnocc27 |  .0859602    .088247 
                     dumnocc28 |  .0068593   .0069855 
                     dumnocc29 |  .1793875   .1861003 
                    dumnocc210 |  .0690464   .0457139 
                    dumnocc211 |  .0049993   .0046697 
                    dumnocc212 |  .0246859   .0244582 
                   dumquarter1 |  .2586458   .2585154 
                   dumquarter2 |  .2469724   .2475421 
                   dumquarter3 |  .2441157   .2457105 
                   dumquarter4 |   .250266    .248232 
           lwage3(1996(1)2014) |  1.621651   1.621186 
------------------------------------------------------
--------------------------------------------------------------------------------------------------------------

. 
. graph export $figs/fin_synth_wf_wi.png, replace
(file /Users/amedeusdsouza/econ499/figures/fin_synth_wf_wi.png written in PNG format)

. 
. ** KY
. synth lwage3 dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9 dumnind10 dumn
> ind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2 dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee
> _cl7 dumee_cl8 dumee_cl9 dumee_cl10 dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr p
> artt public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26 dumnocc27 dumnocc28 dumnocc29 d
> umnocc210 dumnocc211 dumnocc212 dumquarter1 dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2016), counit(
> 11(1)16 21(1)23 31 33 41 43 51(1)53 81 84 85 91(1)95) trunit(61) trperiod(2017) nested allopt fig keep($linr
> eg/fin_synth_wf_ky) replace
--------------------------------------------------------------------------------------------------------------
Synthetic Control Method for Comparative Case Studies
--------------------------------------------------------------------------------------------------------------

First Step: Data Setup
--------------------------------------------------------------------------------------------------------------
control units: for 1 of out 24 units missing obs for predictor cmsa in period 2016 -ignored for averaging
--------------------------------------------------------------------------------------------------------------
Data Setup successful
--------------------------------------------------------------------------------------------------------------
                Treated Unit: KY
               Control Units: ME, NH, VT, MA, RI, CT, NY, NJ, PA, OH, IL, MN, MO, DE, MD, DC, MT, CO, NM, WA,
                              OR, CA, AK, HI
--------------------------------------------------------------------------------------------------------------
          Dependent Variable: lwage3
  MSPE minimized for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016
Results obtained for periods: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016 2017 2018 2019
--------------------------------------------------------------------------------------------------------------
                  Predictors: dumnind1 dumnind2 dumnind3 dumnind4 dumnind5 dumnind6 dumnind7 dumnind8 dumnind9
                              dumnind10 dumnind11 educ exper exper2 exper3 exper4 edex dumee_cl1 dumee_cl2
                              dumee_cl3 dumee_cl4 dumee_cl5 dumee_cl6 dumee_cl7 dumee_cl8 dumee_cl9 dumee_cl10
                              dumee_cl11 dumee_cl12 dumee_cl13 dumee_cl14 dumee_cl15 dumee_cl16 marr partt
                              public cmsa dumnocc21 dumnocc22 dumnocc23 dumnocc24 dumnocc25 dumnocc26
                              dumnocc27 dumnocc28 dumnocc29 dumnocc210 dumnocc211 dumnocc212 dumquarter1
                              dumquarter2 dumquarter3 dumquarter4 lwage3(1996(1)2016)
--------------------------------------------------------------------------------------------------------------
Unless period is specified
predictors are averaged over: 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011
                              2012 2013 2014 2015 2016
--------------------------------------------------------------------------------------------------------------

Second Step: Run Optimization
--------------------------------------------------------------------------------------------------------------
Nested optimization requested
Starting nested optimization module
Optimization done
Allopt requested. This may take a while
Restarting nested optimization module (search method)
done
Restarting nested optimization module (equal method)
done
--------------------------------------------------------------------------------------------------------------
Optimization done
--------------------------------------------------------------------------------------------------------------

Third Step: Obtain Results
--------------------------------------------------------------------------------------------------------------
Loss: Root Mean Squared Prediction Error

---------------------
   RMSPE |  .0227774 
---------------------
--------------------------------------------------------------------------------------------------------------
Unit Weights:

-----------------------
    Co_No | Unit_Weight
----------+------------
       ME |           0
       NH |           0
       VT |           0
       MA |           0
       RI |           0
       CT |           0
       NY |           0
       NJ |           0
       PA |           0
       OH |        .453
       IL |           0
       MN |           0
       MO |        .012
       DE |           0
       MD |           0
       DC |           0
       MT |        .528
       CO |           0
       NM |           0
       WA |           0
       OR |           0
       CA |           0
       AK |        .007
       HI |           0
-----------------------
--------------------------------------------------------------------------------------------------------------
Predictor Balance:

------------------------------------------------------
                               |   Treated  Synthetic 
-------------------------------+----------------------
                      dumnind1 |  .0054981   .0120262 
                      dumnind2 |  .0101231   .0118452 
                      dumnind3 |  .0926363    .067927 
                      dumnind4 |  .2285241   .2402267 
                      dumnind5 |  .0440757   .0391922 
                      dumnind6 |  .0745571   .0729048 
                      dumnind7 |  .0845037   .0865528 
                      dumnind8 |  .2189231   .2372371 
                      dumnind9 |  .1633159   .1434775 
                     dumnind10 |  .0313401   .0401216 
                     dumnind11 |  .0465028   .0484888 
                          educ |  13.63522    13.7307 
                         exper |   18.9254   19.35209 
                        exper2 |  512.8368   535.8636 
                        exper3 |  15948.87   16854.94 
                        exper4 |  537245.7   570444.7 
                          edex |  254.5991   264.5577 
                     dumee_cl1 |  .0297678   .0332767 
                     dumee_cl2 |  .0636657    .062918 
                     dumee_cl3 |  .1057886   .1019647 
                     dumee_cl4 |  .0838418   .0852288 
                     dumee_cl5 |  .0092707   .0060403 
                     dumee_cl6 |  .0649121    .056869 
                     dumee_cl7 |  .0785385   .0691611 
                     dumee_cl8 |   .088346   .0822708 
                     dumee_cl9 |  .0130003   .0062119 
                    dumee_cl10 |  .0828419   .0788025 
                    dumee_cl11 |  .0737579   .0822648 
                    dumee_cl12 |  .0692142   .0806859 
                    dumee_cl13 |  .0206293   .0119042 
                    dumee_cl14 |  .1043587   .1036648 
                    dumee_cl15 |  .0721467   .0826422 
                    dumee_cl16 |  .0399197   .0560943 
                          marr |  .5819176   .5682625 
                         partt |  .2289174   .2820767 
                        public |  .2097709   .2062995 
                          cmsa |  .5337466   .3610201 
                     dumnocc21 |  .0517617   .0528716 
                     dumnocc22 |  .0796271   .0824667 
                     dumnocc23 |  .0190407   .0255663 
                     dumnocc24 |  .1419263   .1370744 
                     dumnocc25 |  .0963908   .0934941 
                     dumnocc26 |  .2344855   .2306463 
                     dumnocc27 |  .0955332   .0875452 
                     dumnocc28 |  .0072299   .0069098 
                     dumnocc29 |  .1819208   .2160831 
                    dumnocc210 |  .0603691   .0410277 
                    dumnocc211 |  .0041645   .0058062 
                    dumnocc212 |  .0275505   .0205087 
                   dumquarter1 |  .2598973   .2546328 
                   dumquarter2 |  .2553943   .2486743 
                   dumquarter3 |  .2436632   .2508756 
                   dumquarter4 |  .2410453   .2458173 
           lwage3(1996(1)2016) |  1.513835   1.515147 
------------------------------------------------------
--------------------------------------------------------------------------------------------------------------

. 
. graph export $figs/fin_synth_wf_ky.png, replace
(file /Users/amedeusdsouza/econ499/figures/fin_synth_wf_ky.png written in PNG format)

. 
. restore

. 
.                         
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagsynthwhite.log
  log type:  text
 closed on:   7 Apr 2021, 18:45:54
--------------------------------------------------------------------------------------------------------------
