-----------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 opened on:  31 Mar 2021, 17:49:49

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. ** keep if inrange(year, 2000, 2019)
. 
. keep if inrange(year, 1989, 2019)
(1,450,785 observations deleted)

. 
. rename twage nwage1

. 
. keep state year cmonth quarter nwage1 lwage1 lwage3 hourly exper* educ ee_cl female nind2 nocc cmsa partt public marr hisprace hi
> spracesex citizen eweight alloc1 covered umem

. 
. merge m:1 state year cmonth using "/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output/unemp.dta"
(note: variable year was int, now long to accommodate using data's values)
(note: variable cmonth was byte, now long to accommodate using data's values)
(note: variable state was byte, now long to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,344
        from master                         0  (_merge==1)
        from using                      7,344  (_merge==2)

    matched                         3,236,632  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 2 // <2000
(7,344 observations deleted)

. 
. drop if hispracesex ==.
(208,501 observations deleted)

. 
. gen finalwt1 = round(eweight)

. 
. rename nind2 nind // nind now is 11 ind categories

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(2472445 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(2786572 differences between nocc2 and nocc3)

. 
. egen state_ind = group(state nind)
(2,155 missing values generated)

. 
. gen edex = educ*exper

. 
. gen blackrelwhite = hisprace - 1

.         replace blackrelwhite =. if hisprace > 2
(324,138 real changes made, 324,138 to missing)

. 
. gen hisprelwhite = hisprace - 1

.         replace hisprelwhite =. if hisprace == 2
(266,736 real changes made, 266,736 to missing)

.         replace hisprelwhite = 1 if hisprace == 3
(324,138 real changes made)

. 
. gen date = ym(year, cmonth)

. ** tab date year
. 
. ** construct variables lags and leads
. local newr2wstates "73 32 34 35 55 61"

. 
. ** local date "500 625 638 662 673 684" // Sep1,2001(Sep28,2001) Feb1,2012(Mar14,2012) Mar1,2013(28 effective; signed Dec2012) Ma
> r1,2015(Mar11,2015) Feb1,2016(effectiveJuly1,2016) Jan1,2017(7)
. local newr2wdate "500 625 638 662 678 684"

. 
. gen alwaysr2w = 0

.         replace alwaysr2w = 1 if /// 
>                 inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82) //incl Idaho wh
> ich changed in 1985 and Texas which had since 47 but bolstered in 93
(1,149,124 real changes made)

. 
. gen alwr2wcov = alwaysr2w*covered
(4,216 missing values generated)

. 
. gen neverr2w = 1

.         replace neverr2w = 0 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace neverr2w = 0 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

. 
. gen stater2w = 0

.         replace stater2w = 1 if inlist(state, 71, 59, 86, 46, 54, 62, 56, 58, 42, 45, 74, 44, 88, 63, 64, 57, 87, 47, 83, 72, 82)
(1,149,124 real changes made)

.         replace stater2w = 2 if inlist(state, 73, 32, 34, 35, 55, 61)
(314,813 real changes made)

.         lab def str2w 0 "no r2w" 1 "r2w before 2000" 2 "r2w after 2000"

.         lab val stater2w str2w

. 
. gen treat_st = 0 if stater2w == 0 | stater2w == 2
(1,149,124 missing values generated)

.         replace treat_st = 1 if stater2w == 1
(1,149,124 real changes made)

.         replace treat_st = 1 if state == 73 & date >= 500
(19,108 real changes made)

.         replace treat_st = 1 if state == 32 & date >= 625
(10,893 real changes made)

.         replace treat_st = 1 if state == 34 & date >= 638
(12,321 real changes made)

.         replace treat_st = 1 if state == 35 & date >= 662
(7,563 real changes made)

.         replace treat_st = 1 if state == 55 & date >= 678
(4,902 real changes made)

.         replace treat_st = 1 if state == 61 & date >= 684
(3,150 real changes made)

. **      replace treat_st = 1 if public == 1 & date >= 701 // Janus v AFSCME June 2018 would need to change to treat_jst
.         
. gen treat_stblackrelwhite = treat_st*blackrelwhite
(324,138 missing values generated)

. 
. gen treat_sthisprelwhite = treat_st*hisprelwhite
(266,736 missing values generated)

. 
. gen lyear = year - 1900

. 
. ** pta WV drop, common support MT
. drop if state == 55 | state == 81
(76,583 observations deleted)

. 
. eststo clear

. 
. ** BLACK-WHITE
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 9,139,454,230)

Linear regression                               Number of obs     =  1,045,006
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2237
                                                Root MSE          =     .33487

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0594656   .0076855     7.74   0.000     .0440129    .0749183
             treat_st |  -.0298945   .0105434    -2.84   0.007    -.0510934   -.0086956
treat_stblackrelwhite |  -.0609987   .0081078    -7.52   0.000    -.0773005    -.044697
                      |
                state |
                  NH  |  -.0435122   .0034188   -12.73   0.000    -.0503861   -.0366383
                  VT  |   -.045416   .0011035   -41.16   0.000    -.0476347   -.0431973
                  MA  |  -.0018863   .0050678    -0.37   0.711    -.0120759    .0083033
                  RI  |   .0055748   .0045486     1.23   0.226    -.0035708    .0147203
                  CT  |   .0000918   .0048444     0.02   0.985    -.0096484    .0098321
                  NY  |   .0880459   .0041371    21.28   0.000     .0797276    .0963641
                  NJ  |   .0353139   .0051992     6.79   0.000     .0248602    .0457675
                  PA  |   .0151597   .0037017     4.10   0.000     .0077169    .0226024
                  OH  |   .0047251    .003692     1.28   0.207    -.0026981    .0121483
                  IN  |  -.0111882   .0039508    -2.83   0.007    -.0191319   -.0032445
                  IL  |   .0332944   .0043161     7.71   0.000     .0246163    .0419724
                  MI  |    .048115   .0045217    10.64   0.000     .0390236    .0572065
                  WI  |  -.0037875   .0033541    -1.13   0.264    -.0105314    .0029564
                  MN  |   .0154051   .0041768     3.69   0.001      .007007    .0238031
                  IA  |   .0061955   .0107244     0.58   0.566    -.0153673    .0277584
                  MO  |  -.0171007   .0037106    -4.61   0.000    -.0245613   -.0096401
                  ND  |  -.0533502   .0106556    -5.01   0.000    -.0747747   -.0319257
                  SD  |  -.0756833   .0106393    -7.11   0.000    -.0970749   -.0542916
                  NE  |  -.0298868    .011012    -2.71   0.009    -.0520279   -.0077457
                  KS  |  -.0361325   .0110297    -3.28   0.002    -.0583093   -.0139557
                  DE  |   -.057591   .0018047   -31.91   0.000    -.0612195   -.0539624
                  MD  |  -.0557345   .0055382   -10.06   0.000    -.0668697   -.0445993
                  DC  |    -.06094   .0067672    -9.01   0.000    -.0745463   -.0473337
                  VA  |  -.0861074   .0112032    -7.69   0.000    -.1086329   -.0635819
                  NC  |  -.1168836   .0110789   -10.55   0.000    -.1391592   -.0946081
                  SC  |  -.1271463   .0110547   -11.50   0.000    -.1493733   -.1049192
                  GA  |  -.0811397   .0114016    -7.12   0.000    -.1040641   -.0582153
                  FL  |  -.0638757   .0115732    -5.52   0.000    -.0871452   -.0406061
                  KY  |  -.0501703   .0027023   -18.57   0.000    -.0556037   -.0447369
                  TN  |  -.0651633   .0111533    -5.84   0.000    -.0875886   -.0427381
                  AL  |   -.042259   .0110261    -3.83   0.000    -.0644285   -.0200895
                  MS  |  -.0977855   .0107661    -9.08   0.000    -.1194322   -.0761388
                  AR  |  -.0944793   .0109257    -8.65   0.000    -.1164469   -.0725116
                  LA  |  -.0753194    .011265    -6.69   0.000    -.0979692   -.0526695
                  OK  |    -.08712   .0067547   -12.90   0.000    -.1007011   -.0735388
                  TX  |  -.0733456   .0115933    -6.33   0.000    -.0966555   -.0500357
                  ID  |  -.0624799   .0108321    -5.77   0.000    -.0842593   -.0407004
                  WY  |  -.0566914   .0110836    -5.11   0.000    -.0789765   -.0344063
                  CO  |  -.0636054   .0053222   -11.95   0.000    -.0743063   -.0529044
                  NM  |  -.1095184   .0037684   -29.06   0.000    -.1170952   -.1019415
                  AZ  |  -.0704302   .0116035    -6.07   0.000    -.0937607   -.0470997
                  UT  |  -.0687988   .0117505    -5.85   0.000    -.0924248   -.0451728
                  NV  |   .0366201   .0115084     3.18   0.003     .0134809    .0597593
                  WA  |   .0436251   .0041817    10.43   0.000     .0352172     .052033
                  OR  |   .0067971   .0038014     1.79   0.080    -.0008461    .0144402
                  CA  |   .0218558   .0049385     4.43   0.000     .0119262    .0317854
                  AK  |   .0317447   .0044575     7.12   0.000     .0227823    .0407072
                  HI  |   .0191639   .0039003     4.91   0.000     .0113217     .027006
                      |
                 year |
                1990  |  -.0062195   .0024844    -2.50   0.016    -.0112147   -.0012242
                1991  |  -.0088411   .0030599    -2.89   0.006    -.0149935   -.0026888
                1992  |  -.0142549   .0026467    -5.39   0.000    -.0195765   -.0089333
                1993  |  -.0155067   .0036451    -4.25   0.000    -.0228357   -.0081776
                1996  |  -.0273242   .0037118    -7.36   0.000    -.0347873   -.0198612
                1997  |  -.0285039   .0042434    -6.72   0.000    -.0370357   -.0199721
                1998  |  -.0330517    .004178    -7.91   0.000    -.0414521   -.0246514
                1999  |  -.0333226   .0036992    -9.01   0.000    -.0407603   -.0258848
                2000  |  -.0378245   .0042988    -8.80   0.000    -.0464677   -.0291812
                2001  |  -.0407778   .0046782    -8.72   0.000    -.0501838   -.0313717
                2002  |  -.0415529   .0055328    -7.51   0.000    -.0526773   -.0304284
                2003  |  -.0486267   .0047193   -10.30   0.000    -.0581155   -.0391379
                2004  |  -.0520928   .0051243   -10.17   0.000    -.0623959   -.0417897
                2005  |  -.0598503   .0054417   -11.00   0.000    -.0707916   -.0489089
                2006  |   -.062492   .0061262   -10.20   0.000    -.0748095   -.0501744
                2007  |  -.0613418   .0057688   -10.63   0.000    -.0729408   -.0497429
                2008  |  -.0528696   .0059196    -8.93   0.000    -.0647717   -.0409675
                2009  |  -.0553897   .0055075   -10.06   0.000    -.0664633   -.0443162
                2010  |  -.0589404   .0069416    -8.49   0.000    -.0728973   -.0449834
                2011  |  -.0629941   .0055565   -11.34   0.000    -.0741661   -.0518221
                2012  |  -.0606001   .0063677    -9.52   0.000    -.0734032   -.0477971
                2013  |  -.0608599   .0054459   -11.18   0.000    -.0718096   -.0499102
                2014  |  -.0616649   .0055113   -11.19   0.000    -.0727461   -.0505836
                2015  |  -.0628478   .0057151   -11.00   0.000    -.0743388   -.0513569
                2016  |  -.0628408   .0056796   -11.06   0.000    -.0742603   -.0514212
                2017  |  -.0558854   .0050622   -11.04   0.000    -.0660637   -.0457071
                2018  |  -.0575641   .0038308   -15.03   0.000    -.0652664   -.0498619
                2019  |  -.0618051   .0052314   -11.81   0.000    -.0723235   -.0512867
                      |
                 nind |
                   2  |   .0989464   .0160963     6.15   0.000     .0665826    .1313101
                   3  |   .0930398    .010619     8.76   0.000     .0716888    .1143908
                   4  |   .0137359   .0075539     1.82   0.075    -.0014522     .028924
                   5  |   .1798802   .0078387    22.95   0.000     .1641194    .1956409
                   6  |   .0034504   .0071435     0.48   0.631    -.0109125    .0178132
                   7  |   .0008858    .005888     0.15   0.881    -.0109527    .0127243
                   8  |   .0154865   .0121271     1.28   0.208    -.0088966    .0398697
                   9  |   .1204119   .0142072     8.48   0.000     .0918465    .1489774
                  10  |   .0068015   .0132563     0.51   0.610     -.019852     .033455
                  11  |   .0809412   .0161475     5.01   0.000     .0484746    .1134079
                      |
                 educ |   .0068242     .00138     4.95   0.000     .0040495    .0095989
                exper |   .0069428   .0011553     6.01   0.000     .0046199    .0092656
               exper2 |  -.0000713   .0000622    -1.15   0.257    -.0001963    .0000537
               exper3 |   2.09e-06   2.04e-06     1.02   0.312    -2.02e-06    6.20e-06
               exper4 |  -4.89e-08   2.31e-08    -2.12   0.039    -9.53e-08   -2.58e-09
                 edex |  -.0001799   .0000419    -4.29   0.000    -.0002641   -.0000957
                      |
                ee_cl |
                   2  |  -.0159253   .0048046    -3.31   0.002    -.0255855   -.0062651
                   3  |  -.0070348   .0053361    -1.32   0.194    -.0177638    .0036941
                   4  |  -.0184241   .0082443    -2.23   0.030    -.0350005   -.0018477
                   5  |  -.0695674    .008254    -8.43   0.000    -.0861632   -.0529715
                   6  |  -.0029339   .0041874    -0.70   0.487    -.0113534    .0054855
                   7  |   .0160171   .0060674     2.64   0.011     .0038178    .0282164
                   8  |  -.0284196   .0101878    -2.79   0.008    -.0489034   -.0079357
                   9  |  -.0609187   .0068415    -8.90   0.000    -.0746745   -.0471629
                  10  |   .0129916    .005993     2.17   0.035     .0009418    .0250414
                  11  |   .0156417   .0075717     2.07   0.044     .0004178    .0308655
                  12  |  -.0399705   .0121358    -3.29   0.002    -.0643712   -.0155698
                  13  |   .0011302   .0076201     0.15   0.883     -.014191    .0164515
                  14  |   .0270766   .0066651     4.06   0.000     .0136755    .0404778
                  15  |   .0076105   .0083445     0.91   0.366    -.0091672    .0243882
                  16  |  -.0479364   .0131396    -3.65   0.001    -.0743553   -.0215174
                      |
                 marr |   .0172519   .0016082    10.73   0.000     .0140185    .0204853
                partt |  -.0584427   .0061359    -9.52   0.000    -.0707798   -.0461057
               public |    .267774   .0255651    10.47   0.000     .2163718    .3191761
                 cmsa |   .0435594   .0049623     8.78   0.000     .0335821    .0535368
                      |
                nocc2 |
                   2  |   .0519406   .0030389    17.09   0.000     .0458306    .0580506
                   3  |   .0326809    .004861     6.72   0.000     .0229073    .0424546
                   4  |   .1654846   .0108701    15.22   0.000     .1436288    .1873403
                   5  |   .1501583   .0166302     9.03   0.000      .116721    .1835957
                   6  |   .1366193   .0067112    20.36   0.000     .1231254    .1501131
                   7  |    .070835   .0047575    14.89   0.000     .0612693    .0804007
                   8  |   .0689444   .0070607     9.76   0.000     .0547479    .0831409
                   9  |   .1661006   .0107918    15.39   0.000     .1444023    .1877989
                  10  |    .194889   .0137381    14.19   0.000     .1672666    .2225114
                  11  |   .2095499   .0148883    14.07   0.000     .1796149    .2394849
                  12  |    .207887   .0164475    12.64   0.000     .1748171    .2409568
                      |
              quarter |
                   2  |  -.0028759   .0014957    -1.92   0.060    -.0058832    .0001313
                   3  |  -.0033065   .0013262    -2.49   0.016     -.005973   -.0006399
                   4  |  -.0041066   .0009582    -4.29   0.000    -.0060333     -.00218
                      |
                _cons |  -.1680606   .0332799    -5.05   0.000    -.2349743   -.1011468
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 9,139,454,230)

Linear regression                               Number of obs     =  1,045,006
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2237
                                                Root MSE          =     .33486

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0594585   .0076904     7.73   0.000     .0439959    .0749211
             treat_st |  -.0304047   .0104328    -2.91   0.005    -.0513813   -.0094281
treat_stblackrelwhite |  -.0609957    .008114    -7.52   0.000    -.0773099   -.0446814
                      |
                state |
                  NH  |  -.0457116   .0036611   -12.49   0.000    -.0530728   -.0383505
                  VT  |  -.0474659   .0017556   -27.04   0.000    -.0509959   -.0439359
                  MA  |  -.0017756   .0050825    -0.35   0.728    -.0119947    .0084435
                  RI  |    .007583   .0048717     1.56   0.126    -.0022122    .0173782
                  CT  |   .0003015    .004856     0.06   0.951    -.0094622    .0100653
                  NY  |   .0894708   .0043249    20.69   0.000      .080775    .0981665
                  NJ  |    .036358   .0053168     6.84   0.000     .0256679    .0470481
                  PA  |   .0159076   .0037671     4.22   0.000     .0083334    .0234817
                  OH  |   .0059114   .0037832     1.56   0.125    -.0016952    .0135181
                  IN  |  -.0110173   .0039365    -2.80   0.007    -.0189321   -.0031026
                  IL  |   .0351957   .0045817     7.68   0.000     .0259835    .0444078
                  MI  |   .0510263   .0050522    10.10   0.000     .0408681    .0611844
                  WI  |  -.0045591   .0033714    -1.35   0.183    -.0113378    .0022196
                  MN  |   .0138162   .0042934     3.22   0.002     .0051837    .0224487
                  IA  |   .0042999   .0104476     0.41   0.682    -.0167064    .0253061
                  MO  |   -.016723   .0037398    -4.47   0.000    -.0242424   -.0092036
                  ND  |  -.0563158   .0103433    -5.44   0.000    -.0771124   -.0355192
                  SD  |  -.0785055   .0103764    -7.57   0.000    -.0993686   -.0576424
                  NE  |  -.0331927   .0107134    -3.10   0.003    -.0547333    -.011652
                  KS  |  -.0369851    .010788    -3.43   0.001    -.0586759   -.0152944
                  DE  |   -.058827    .002205   -26.68   0.000    -.0632605   -.0543936
                  MD  |  -.0563616   .0055555   -10.15   0.000    -.0675317   -.0451915
                  DC  |  -.0576153   .0071315    -8.08   0.000    -.0719543   -.0432764
                  VA  |  -.0873178   .0109443    -7.98   0.000    -.1093228   -.0653128
                  NC  |  -.1158651   .0110679   -10.47   0.000    -.1381186   -.0936116
                  SC  |  -.1250958   .0112277   -11.14   0.000    -.1476706   -.1025209
                  GA  |  -.0798003   .0114744    -6.95   0.000    -.1028711   -.0567294
                  FL  |  -.0624562   .0117034    -5.34   0.000    -.0859874    -.038925
                  KY  |  -.0485656   .0030579   -15.88   0.000     -.054714   -.0424172
                  TN  |  -.0639105    .011189    -5.71   0.000    -.0864075   -.0414134
                  AL  |  -.0402594   .0111925    -3.60   0.001    -.0627634   -.0177554
                  MS  |  -.0944058   .0112729    -8.37   0.000    -.1170714   -.0717402
                  AR  |  -.0930939   .0109833    -8.48   0.000    -.1151774   -.0710105
                  LA  |  -.0729824   .0115663    -6.31   0.000     -.096238   -.0497269
                  OK  |  -.0878311   .0066142   -13.28   0.000    -.1011299   -.0745322
                  TX  |  -.0720806   .0116664    -6.18   0.000    -.0955375   -.0486237
                  ID  |  -.0619697   .0107548    -5.76   0.000    -.0835936   -.0403458
                  WY  |  -.0577782   .0108063    -5.35   0.000    -.0795057   -.0360507
                  CO  |  -.0643688   .0052997   -12.15   0.000    -.0750247    -.053713
                  NM  |   -.108087    .004066   -26.58   0.000    -.1162623   -.0999118
                  AZ  |  -.0688235   .0117654    -5.85   0.000    -.0924793   -.0451676
                  UT  |  -.0700339    .011488    -6.10   0.000     -.093132   -.0469358
                  NV  |   .0386561   .0118195     3.27   0.002     .0148913    .0624208
                  WA  |   .0452363   .0044558    10.15   0.000     .0362773    .0541954
                  OR  |   .0090306   .0042863     2.11   0.040     .0004124    .0176489
                  CA  |    .024848   .0056101     4.43   0.000     .0135682    .0361278
                  AK  |   .0356204   .0055819     6.38   0.000     .0243972    .0468435
                  HI  |    .017059   .0040362     4.23   0.000     .0089437    .0251744
                      |
                 year |
                1990  |  -.0056334   .0025571    -2.20   0.032    -.0107747    -.000492
                1991  |  -.0060397   .0033527    -1.80   0.078    -.0127808    .0007014
                1992  |  -.0103245    .003894    -2.65   0.011    -.0181538   -.0024951
                1993  |  -.0126873   .0040214    -3.15   0.003    -.0207728   -.0046019
                1996  |  -.0272774   .0036597    -7.45   0.000    -.0346357   -.0199191
                1997  |  -.0292815   .0041722    -7.02   0.000    -.0376702   -.0208927
                1998  |  -.0346266   .0043615    -7.94   0.000     -.043396   -.0258572
                1999  |   -.035394   .0039872    -8.88   0.000    -.0434108   -.0273772
                2000  |  -.0402288   .0044599    -9.02   0.000     -.049196   -.0312617
                2001  |  -.0417875    .004805    -8.70   0.000    -.0514487   -.0321263
                2002  |  -.0405851   .0056059    -7.24   0.000    -.0518564   -.0293137
                2003  |  -.0472601   .0046291   -10.21   0.000    -.0565676   -.0379527
                2004  |  -.0515355   .0050526   -10.20   0.000    -.0616945   -.0413766
                2005  |  -.0600345   .0053825   -11.15   0.000    -.0708567   -.0492123
                2006  |  -.0634718    .006131   -10.35   0.000    -.0757991   -.0511445
                2007  |  -.0624292   .0059897   -10.42   0.000    -.0744724   -.0503861
                2008  |  -.0518677   .0058113    -8.93   0.000    -.0635521   -.0401833
                2009  |  -.0480651   .0074483    -6.45   0.000    -.0630409   -.0330893
                2010  |  -.0509852   .0082498    -6.18   0.000    -.0675725    -.034398
                2011  |   -.056342   .0069501    -8.11   0.000    -.0703162   -.0423678
                2012  |  -.0555469   .0072966    -7.61   0.000    -.0702177    -.040876
                2013  |  -.0569634   .0057406    -9.92   0.000    -.0685057   -.0454211
                2014  |  -.0599906   .0055923   -10.73   0.000    -.0712346   -.0487466
                2015  |  -.0628083   .0057407   -10.94   0.000    -.0743507   -.0512659
                2016  |  -.0635063      .0058   -10.95   0.000     -.075168   -.0518446
                2017  |   -.057467   .0051723   -11.11   0.000    -.0678666   -.0470674
                2018  |  -.0599537   .0045343   -13.22   0.000    -.0690706   -.0508369
                2019  |    -.06459   .0058237   -11.09   0.000    -.0762993   -.0528807
                      |
                 nind |
                   2  |   .0989466   .0160915     6.15   0.000     .0665924    .1313008
                   3  |   .0930425   .0106184     8.76   0.000     .0716929    .1143922
                   4  |   .0137622   .0075459     1.82   0.074    -.0014099    .0289343
                   5  |   .1799115   .0078281    22.98   0.000     .1641721    .1956509
                   6  |   .0034797   .0071355     0.49   0.628    -.0108673    .0178266
                   7  |   .0009055   .0058803     0.15   0.878    -.0109177    .0127288
                   8  |   .0155148   .0121218     1.28   0.207    -.0088577    .0398872
                   9  |   .1204318   .0142048     8.48   0.000     .0918712    .1489924
                  10  |   .0068361   .0132408     0.52   0.608    -.0197863    .0334585
                  11  |   .0809582   .0161408     5.02   0.000     .0485049    .1134114
                      |
                 educ |   .0068285   .0013848     4.93   0.000     .0040441    .0096129
                exper |   .0069593   .0011569     6.02   0.000     .0046332    .0092854
               exper2 |  -.0000722    .000062    -1.16   0.250     -.000197    .0000525
               exper3 |   2.12e-06   2.04e-06     1.04   0.305    -1.99e-06    6.22e-06
               exper4 |  -4.92e-08   2.31e-08    -2.13   0.038    -9.56e-08   -2.85e-09
                 edex |  -.0001802   .0000421    -4.28   0.000    -.0002647   -.0000956
                      |
                ee_cl |
                   2  |  -.0158853   .0048014    -3.31   0.002    -.0255392   -.0062314
                   3  |  -.0070009   .0053346    -1.31   0.196    -.0177267    .0037249
                   4  |  -.0184006   .0082517    -2.23   0.030    -.0349919   -.0018094
                   5  |  -.0695834    .008254    -8.43   0.000    -.0861792   -.0529876
                   6  |  -.0029213   .0041868    -0.70   0.489    -.0113394    .0054968
                   7  |   .0160538   .0060677     2.65   0.011     .0038539    .0282538
                   8  |  -.0283718   .0101945    -2.78   0.008    -.0488693   -.0078743
                   9  |   -.060913   .0068389    -8.91   0.000    -.0746635   -.0471626
                  10  |   .0129873   .0059915     2.17   0.035     .0009406     .025034
                  11  |   .0156808   .0075735     2.07   0.044     .0004532    .0309084
                  12  |  -.0399199   .0121349    -3.29   0.002    -.0643187   -.0155211
                  13  |   .0010885   .0076089     0.14   0.887    -.0142102    .0163872
                  14  |   .0270786   .0066637     4.06   0.000     .0136803    .0404768
                  15  |   .0076287   .0083453     0.91   0.365    -.0091506     .024408
                  16  |  -.0479003   .0131375    -3.65   0.001    -.0743149   -.0214857
                      |
                 marr |   .0172566    .001608    10.73   0.000     .0140236    .0204896
                partt |  -.0583761    .006135    -9.52   0.000    -.0707113   -.0460409
               public |    .267785   .0255695    10.47   0.000     .2163741    .3191958
                 cmsa |   .0435398   .0049688     8.76   0.000     .0335493    .0535303
                      |
                nocc2 |
                   2  |   .0519449   .0030391    17.09   0.000     .0458344    .0580555
                   3  |   .0326859   .0048582     6.73   0.000     .0229179    .0424539
                   4  |   .1654814   .0108705    15.22   0.000     .1436247     .187338
                   5  |    .150149   .0166281     9.03   0.000     .1167159    .1835821
                   6  |   .1366342   .0067114    20.36   0.000       .12314    .1501284
                   7  |   .0708497   .0047537    14.90   0.000     .0612918    .0804076
                   8  |    .068909   .0070594     9.76   0.000     .0547152    .0831029
                   9  |   .1661231   .0107897    15.40   0.000     .1444289    .1878173
                  10  |   .1948899   .0137343    14.19   0.000     .1672752    .2225047
                  11  |   .2095489   .0148858    14.08   0.000      .179619    .2394788
                  12  |   .2078888   .0164452    12.64   0.000     .1748235    .2409541
                      |
                unemp |  -.0018433   .0014314    -1.29   0.204    -.0047215    .0010348
                      |
              quarter |
                   2  |  -.0028805   .0014994    -1.92   0.061    -.0058953    .0001343
                   3  |  -.0033088   .0013279    -2.49   0.016    -.0059786    -.000639
                   4  |  -.0041062    .000959    -4.28   0.000    -.0060344   -.0021781
                      |
                _cons |  -.1594153   .0335227    -4.76   0.000    -.2268173   -.0920133
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_mal_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee
> _cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state)
(sum of wgt is 9,139,454,230)

Linear regression                               Number of obs     =  1,045,006
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2244
                                                Root MSE          =     .33472

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0597691   .0076713     7.79   0.000     .0443449    .0751933
             treat_st |   .0217181   .0089354     2.43   0.019     .0037522    .0396839
treat_stblackrelwhite |  -.0613018   .0080567    -7.61   0.000    -.0775009   -.0451026
                      |
                state |
                  NH  |  -.1752955   .0054338   -32.26   0.000    -.1862209   -.1643702
                  VT  |  -.2499972   .0059926   -41.72   0.000    -.2620462   -.2379482
                  MA  |  -.0725303   .0078541    -9.23   0.000     -.088322   -.0567386
                  RI  |  -.0520246   .0094495    -5.51   0.000    -.0710242   -.0330251
                  CT  |  -.0829792   .0091138    -9.10   0.000    -.1013038   -.0646546
                  NY  |   .0577177   .0099944     5.78   0.000     .0376226    .0778128
                  NJ  |   .0559496   .0094652     5.91   0.000     .0369185    .0749808
                  PA  |   .1067534   .0074971    14.24   0.000     .0916795    .1218272
                  OH  |   .2187286   .0095443    22.92   0.000     .1995386    .2379186
                  IN  |   .3878419   .0290541    13.35   0.000     .3294246    .4462591
                  IL  |   .1172644   .0072574    16.16   0.000     .1026724    .1318565
                  MI  |   .3708241   .0262346    14.13   0.000     .3180758    .4235723
                  WI  |   .2850772   .0226842    12.57   0.000     .2394676    .3306867
                  MN  |   .0470445   .0079238     5.94   0.000     .0311126    .0629764
                  IA  |    .061328   .0094483     6.49   0.000     .0423309    .0803251
                  MO  |  -.0064835   .0067519    -0.96   0.342    -.0200592    .0070922
                  ND  |  -.1791196   .0136177   -13.15   0.000    -.2064997   -.1517395
                  SD  |   -.065707   .0141085    -4.66   0.000    -.0940739     -.03734
                  NE  |  -.0453524   .0097363    -4.66   0.000    -.0649285   -.0257763
                  KS  |  -.0073381   .0103146    -0.71   0.480    -.0280771    .0134008
                  DE  |   .0373788   .0121074     3.09   0.003     .0130352    .0617224
                  MD  |  -.1381267   .0112694   -12.26   0.000    -.1607854   -.1154681
                  DC  |  -.1964917   .0213441    -9.21   0.000    -.2394069   -.1535764
                  VA  |  -.2236788   .0105035   -21.30   0.000    -.2447975     -.20256
                  NC  |  -.3460357   .0110744   -31.25   0.000    -.3683022   -.3237692
                  SC  |  -.4122182   .0118068   -34.91   0.000    -.4359574   -.3884789
                  GA  |   -.253553   .0096875   -26.17   0.000     -.273031   -.2340751
                  FL  |  -.2451836   .0119056   -20.59   0.000    -.2691214   -.2212459
                  KY  |  -.1403439   .0159121    -8.82   0.000    -.1723373   -.1083506
                  TN  |  -.0711272    .010526    -6.76   0.000    -.0922911   -.0499633
                  AL  |   .0519189   .0100458     5.17   0.000     .0317204    .0721174
                  MS  |  -.1087461   .0123577    -8.80   0.000    -.1335929   -.0838993
                  AR  |  -.0981781   .0093661   -10.48   0.000    -.1170099   -.0793463
                  LA  |  -.2091097   .0099977   -20.92   0.000    -.2292115   -.1890079
                  OK  |  -.0655108   .0402635    -1.63   0.110     -.146466    .0154444
                  TX  |  -.2908194   .0117264   -24.80   0.000     -.314397   -.2672419
                  ID  |    -.03627   .0094825    -3.82   0.000    -.0553358   -.0172043
                  WY  |   -.082951   .0097094    -8.54   0.000     -.102473    -.063429
                  CO  |  -.3253671   .0079225   -41.07   0.000    -.3412964   -.3094378
                  NM  |  -.3508799   .0101384   -34.61   0.000    -.3712644   -.3304953
                  AZ  |  -.3525303   .0107306   -32.85   0.000    -.3741057   -.3309549
                  UT  |  -.1348672   .0121193   -11.13   0.000    -.1592347   -.1104998
                  NV  |  -.0754359   .0149381    -5.05   0.000    -.1054709   -.0454008
                  WA  |   .1296283   .0065425    19.81   0.000     .1164738    .1427828
                  OR  |   .0083631   .0045167     1.85   0.070    -.0007183    .0174444
                  CA  |   -.083697   .0094476    -8.86   0.000    -.1026927   -.0647013
                  AK  |  -.1384505   .0106582   -12.99   0.000    -.1598802   -.1170208
                  HI  |    .169547   .0098191    17.27   0.000     .1498043    .1892897
                      |
        state#c.lyear |
                  ME  |  -.0022788   .0000845   -26.97   0.000    -.0024487   -.0021089
                  NH  |   -.001038   .0001303    -7.97   0.000    -.0012999   -.0007761
                  VT  |   -.000307   .0000521    -5.89   0.000    -.0004118   -.0002022
                  MA  |   -.001585    .000075   -21.13   0.000    -.0017359   -.0014342
                  RI  |  -.0017144   .0000703   -24.39   0.000    -.0018557   -.0015731
                  CT  |  -.0014697   .0000857   -17.15   0.000     -.001642   -.0012974
                  NY  |  -.0019755   .0000952   -20.75   0.000    -.0021669    -.001784
                  NJ  |  -.0024729   .0000788   -31.38   0.000    -.0026313   -.0023145
                  PA  |  -.0031629   .0000808   -39.15   0.000    -.0033254   -.0030005
                  OH  |   -.004345   .0000586   -74.09   0.000    -.0044629   -.0042271
                  IN  |  -.0062632   .0002968   -21.10   0.000      -.00686   -.0056665
                  IL  |  -.0030902   .0000875   -35.31   0.000    -.0032661   -.0029142
                  MI  |   -.005519   .0002593   -21.28   0.000    -.0060404   -.0049976
                  WI  |  -.0051546   .0002277   -22.64   0.000    -.0056124   -.0046967
                  MN  |  -.0025846   .0000794   -32.57   0.000    -.0027441    -.002425
                  IA  |  -.0033206   .0000836   -39.70   0.000    -.0034888   -.0031524
                  MO  |  -.0023775     .00006   -39.66   0.000     -.002498   -.0022569
                  ND  |  -.0015716   .0001103   -14.24   0.000    -.0017935   -.0013498
                  SD  |  -.0028955   .0000654   -44.26   0.000     -.003027    -.002764
                  NE  |  -.0026335   .0000701   -37.56   0.000    -.0027745   -.0024925
                  KS  |  -.0030634   .0000684   -44.80   0.000    -.0032009   -.0029259
                  DE  |  -.0032572   .0001486   -21.93   0.000    -.0035559   -.0029585
                  MD  |   -.001493   .0001072   -13.92   0.000    -.0017086   -.0012773
                  DC  |  -.0009622   .0002184    -4.41   0.000    -.0014013   -.0005232
                  VA  |  -.0014428   .0001107   -13.03   0.000    -.0016655   -.0012202
                  NC  |  -.0005554   .0001243    -4.47   0.000    -.0008054   -.0003054
                  SC  |  -.0000229   .0000815    -0.28   0.780    -.0001868    .0001409
                  GA  |  -.0011091   .0001006   -11.02   0.000    -.0013114   -.0009068
                  FL  |  -.0010312   .0000619   -16.66   0.000    -.0011556   -.0009067
                  KY  |  -.0014545    .000158    -9.20   0.000    -.0017722   -.0011367
                  TN  |  -.0027166   .0000941   -28.87   0.000    -.0029058   -.0025274
                  AL  |  -.0036878   .0000673   -54.77   0.000    -.0038232   -.0035524
                  MS  |   -.002667   .0000685   -38.96   0.000    -.0028047   -.0025294
                  AR  |  -.0027452   .0001025   -26.79   0.000    -.0029513   -.0025392
                  LA  |  -.0014727   .0000729   -20.19   0.000    -.0016193    -.001326
                  OK  |  -.0027715    .000422    -6.57   0.000    -.0036201   -.0019229
                  TX  |  -.0006747   .0000769    -8.78   0.000    -.0008292   -.0005201
                  ID  |  -.0030312   .0001184   -25.61   0.000    -.0032692   -.0027932
                  WY  |  -.0025372   .0000531   -47.82   0.000    -.0026439   -.0024305
                  CO  |    .000228   .0000622     3.67   0.001      .000103     .000353
                  NM  |   .0000191   .0001197     0.16   0.874    -.0002216    .0002599
                  AZ  |  -.0000602   .0000912    -0.66   0.513    -.0002437    .0001233
                  UT  |  -.0021406   .0001101   -19.45   0.000    -.0023618   -.0019193
                  NV  |  -.0016947   .0000694   -24.43   0.000    -.0018342   -.0015552
                  WA  |  -.0030958   .0000974   -31.79   0.000    -.0032917      -.0029
                  OR  |  -.0022919   .0000975   -23.50   0.000     -.002488   -.0020958
                  CA  |  -.0012414   .0000647   -19.19   0.000    -.0013715   -.0011113
                  AK  |  -.0005927   .0000229   -25.85   0.000    -.0006388   -.0005466
                  HI  |  -.0037593   .0000525   -71.61   0.000    -.0038648   -.0036537
                      |
                 nind |
                   2  |   .0976978   .0161236     6.06   0.000     .0652792    .1301164
                   3  |   .0920066   .0105632     8.71   0.000     .0707678    .1132453
                   4  |   .0124582   .0075532     1.65   0.106    -.0027286     .027645
                   5  |     .17868   .0077951    22.92   0.000     .1630069    .1943531
                   6  |    .002312   .0071401     0.32   0.747    -.0120441    .0166681
                   7  |  -.0006132   .0058188    -0.11   0.917    -.0123127    .0110863
                   8  |   .0144971   .0120986     1.20   0.237    -.0098288     .038823
                   9  |   .1192701   .0141535     8.43   0.000     .0908127    .1477276
                  10  |   .0064914   .0131557     0.49   0.624    -.0199599    .0329426
                  11  |   .0801346   .0161169     4.97   0.000     .0477295    .1125398
                      |
                 educ |   .0074137   .0013471     5.50   0.000     .0047052    .0101223
                exper |   .0073612   .0011579     6.36   0.000     .0050332    .0096893
               exper2 |   -.000097   .0000615    -1.58   0.121    -.0002206    .0000267
               exper3 |   2.89e-06   2.03e-06     1.42   0.161    -1.19e-06    6.98e-06
               exper4 |  -5.65e-08   2.30e-08    -2.46   0.018    -1.03e-07   -1.02e-08
                 edex |  -.0001935   .0000417    -4.64   0.000    -.0002774   -.0001097
                      |
                ee_cl |
                   2  |   -.016619   .0048172    -3.45   0.001    -.0263047   -.0069333
                   3  |  -.0085544   .0052276    -1.64   0.108    -.0190653    .0019564
                   4  |  -.0211795   .0081799    -2.59   0.013    -.0376263   -.0047327
                   5  |  -.0681405   .0082476    -8.26   0.000    -.0847235   -.0515575
                   6  |  -.0034845   .0042312    -0.82   0.414    -.0119918    .0050228
                   7  |   .0152065    .006009     2.53   0.015     .0031245    .0272885
                   8  |   -.030503   .0100535    -3.03   0.004    -.0507169    -.010289
                   9  |  -.0599481    .006889    -8.70   0.000    -.0737994   -.0460969
                  10  |    .011812   .0059847     1.97   0.054     -.000221    .0238451
                  11  |   .0145253   .0075037     1.94   0.059    -.0005619    .0296124
                  12  |  -.0416659   .0119416    -3.49   0.001    -.0656761   -.0176557
                  13  |   .0006158   .0075443     0.08   0.935    -.0145531    .0157846
                  14  |   .0260737   .0066734     3.91   0.000     .0126558    .0394915
                  15  |   .0060918   .0082693     0.74   0.465    -.0105347    .0227183
                  16  |   -.049737    .012997    -3.83   0.000    -.0758692   -.0236048
                      |
                 marr |   .0171104   .0015816    10.82   0.000     .0139305    .0202903
                partt |  -.0582645   .0061669    -9.45   0.000    -.0706639   -.0458651
               public |   .2676846   .0256112    10.45   0.000     .2161898    .3191794
                 cmsa |   .0428968   .0053358     8.04   0.000     .0321684    .0536252
                      |
                nocc2 |
                   2  |    .051735    .003018    17.14   0.000      .045667    .0578031
                   3  |    .032742   .0048763     6.71   0.000     .0229375    .0425465
                   4  |   .1649845   .0108324    15.23   0.000     .1432045    .1867646
                   5  |   .1498816   .0166942     8.98   0.000     .1163156    .1834476
                   6  |   .1367576   .0067046    20.40   0.000      .123277    .1502382
                   7  |   .0711491   .0047259    15.06   0.000      .061647    .0806512
                   8  |   .0688437   .0070689     9.74   0.000     .0546308    .0830566
                   9  |   .1659266   .0108007    15.36   0.000     .1442103     .187643
                  10  |   .1947899   .0136947    14.22   0.000     .1672549    .2223248
                  11  |   .2096253   .0148678    14.10   0.000     .1797316     .239519
                  12  |   .2081235   .0164456    12.66   0.000     .1750575    .2411895
                      |
                unemp |  -.0003205    .000365    -0.88   0.384    -.0010545    .0004134
                      |
              quarter |
                   2  |   -.002824   .0015068    -1.87   0.067    -.0058537    .0002057
                   3  |  -.0033779   .0013458    -2.51   0.016    -.0060839    -.000672
                   4  |  -.0041689   .0009805    -4.25   0.000    -.0061403   -.0021975
                      |
                _cons |   .0225435    .041424     0.54   0.589    -.0607451     .105832
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_mal_all_sltt 

.         
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,947,620,399)

Linear regression                               Number of obs     =  1,056,697
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2723
                                                Root MSE          =     .29782

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0795794   .0115656     6.88   0.000     .0563251    .1028336
             treat_st |  -.0220582   .0115758    -1.91   0.063     -.045333    .0012165
treat_stblackrelwhite |  -.0647207   .0123093    -5.26   0.000    -.0894701   -.0399712
                      |
                state |
                  NH  |  -.0143702   .0013354   -10.76   0.000    -.0170551   -.0116853
                  VT  |  -.0053521   .0004869   -10.99   0.000    -.0063311   -.0043732
                  MA  |   .0150487    .003094     4.86   0.000     .0088278    .0212695
                  RI  |   .0331329   .0026773    12.38   0.000     .0277498    .0385161
                  CT  |   .0251371   .0029008     8.67   0.000     .0193047    .0309696
                  NY  |   .0947958   .0032529    29.14   0.000     .0882553    .1013363
                  NJ  |   .0330298   .0030984    10.66   0.000     .0268002    .0392595
                  PA  |   .0084487   .0027388     3.08   0.003     .0029419    .0139555
                  OH  |  -.0053206   .0024242    -2.19   0.033    -.0101947   -.0004464
                  IN  |  -.0431314    .003371   -12.79   0.000    -.0499094   -.0363535
                  IL  |  -.0005119   .0030756    -0.17   0.869    -.0066958    .0056719
                  MI  |   .0438596   .0031865    13.76   0.000     .0374527    .0502665
                  WI  |  -.0022814   .0026576    -0.86   0.395    -.0076248    .0030619
                  MN  |   .0369151   .0022345    16.52   0.000     .0324223     .041408
                  IA  |  -.0018461   .0114945    -0.16   0.873    -.0249574    .0212652
                  MO  |  -.0523233   .0025807   -20.27   0.000    -.0575121   -.0471345
                  ND  |  -.0409536   .0114303    -3.58   0.001    -.0639357   -.0179715
                  SD  |   -.053059   .0115194    -4.61   0.000    -.0762204   -.0298976
                  NE  |  -.0203997   .0114174    -1.79   0.080    -.0433558    .0025565
                  KS  |   -.055982   .0114357    -4.90   0.000     -.078975   -.0329889
                  DE  |   -.030344   .0026217   -11.57   0.000    -.0356153   -.0250727
                  MD  |  -.0426183   .0056587    -7.53   0.000    -.0539958   -.0312407
                  DC  |  -.0655255   .0071925    -9.11   0.000     -.079987    -.051064
                  VA  |  -.0766085   .0114461    -6.69   0.000    -.0996225   -.0535945
                  NC  |  -.1019904   .0117669    -8.67   0.000    -.1256494   -.0783315
                  SC  |  -.1092658   .0117387    -9.31   0.000     -.132868   -.0856637
                  GA  |  -.0868971   .0117655    -7.39   0.000    -.1105533    -.063241
                  FL  |   -.037899   .0115792    -3.27   0.002    -.0611807   -.0146174
                  KY  |  -.0588233   .0020554   -28.62   0.000    -.0629559   -.0546907
                  TN  |  -.0671429   .0117036    -5.74   0.000    -.0906745   -.0436113
                  AL  |  -.0360854    .011692    -3.09   0.003    -.0595937    -.012577
                  MS  |  -.0960381   .0118259    -8.12   0.000    -.1198155   -.0722606
                  AR  |  -.0813417   .0116214    -7.00   0.000    -.1047081   -.0579753
                  LA  |  -.0672429   .0115743    -5.81   0.000    -.0905146   -.0439713
                  OK  |  -.0684962   .0064821   -10.57   0.000    -.0815294    -.055463
                  TX  |  -.0730432   .0115592    -6.32   0.000    -.0962846   -.0498019
                  ID  |  -.0519878   .0113728    -4.57   0.000    -.0748544   -.0291212
                  WY  |  -.0894182   .0119072    -7.51   0.000    -.1133592   -.0654773
                  CO  |   -.046884   .0028548   -16.42   0.000    -.0526239   -.0411441
                  NM  |  -.0777829    .003097   -25.12   0.000    -.0840098    -.071556
                  AZ  |  -.0534067   .0115359    -4.63   0.000    -.0766012   -.0302121
                  UT  |  -.0531682   .0113931    -4.67   0.000    -.0760756   -.0302608
                  NV  |    .045938   .0115698     3.97   0.000     .0226754    .0692006
                  WA  |   .0604186   .0023038    26.23   0.000     .0557865    .0650507
                  OR  |   .0440821   .0020604    21.39   0.000     .0399393    .0482248
                  CA  |   .0433465   .0027358    15.84   0.000     .0378458    .0488472
                  AK  |   .0644194   .0035725    18.03   0.000     .0572365    .0716023
                  HI  |   .0511478   .0017669    28.95   0.000     .0475953    .0547004
                      |
                 year |
                1990  |  -.0022253   .0015985    -1.39   0.170    -.0054393    .0009888
                1991  |  -.0039041   .0019323    -2.02   0.049    -.0077892    -.000019
                1992  |  -.0004702   .0020965    -0.22   0.823    -.0046856    .0037451
                1993  |  -.0006147   .0023973    -0.26   0.799    -.0054348    .0042055
                1996  |  -.0019542   .0026054    -0.75   0.457    -.0071927    .0032844
                1997  |  -.0058176   .0024432    -2.38   0.021      -.01073   -.0009051
                1998  |  -.0085203   .0029672    -2.87   0.006    -.0144862   -.0025544
                1999  |  -.0113544   .0027454    -4.14   0.000    -.0168744   -.0058344
                2000  |  -.0087264   .0025844    -3.38   0.001    -.0139227   -.0035301
                2001  |  -.0086132   .0024625    -3.50   0.001    -.0135644   -.0036619
                2002  |   -.009592   .0035045    -2.74   0.009    -.0166382   -.0025458
                2003  |  -.0159658   .0029095    -5.49   0.000    -.0218156   -.0101159
                2004  |  -.0188825   .0032048    -5.89   0.000    -.0253261   -.0124388
                2005  |   -.020254   .0033917    -5.97   0.000    -.0270734   -.0134346
                2006  |  -.0223669   .0031897    -7.01   0.000    -.0287804   -.0159535
                2007  |  -.0218849    .004383    -4.99   0.000    -.0306975   -.0130723
                2008  |  -.0205018   .0043338    -4.73   0.000    -.0292155   -.0117882
                2009  |    -.01943   .0040786    -4.76   0.000    -.0276306   -.0112294
                2010  |  -.0226049   .0040029    -5.65   0.000    -.0306533   -.0145566
                2011  |   -.020978   .0041105    -5.10   0.000    -.0292427   -.0127133
                2012  |   -.025618   .0043479    -5.89   0.000    -.0343601   -.0168759
                2013  |  -.0218292   .0046036    -4.74   0.000    -.0310854   -.0125731
                2014  |  -.0251728   .0045058    -5.59   0.000    -.0342324   -.0161132
                2015  |  -.0241922   .0049358    -4.90   0.000    -.0341163   -.0142681
                2016  |  -.0214265   .0045218    -4.74   0.000    -.0305182   -.0123347
                2017  |  -.0268814   .0049329    -5.45   0.000    -.0367995   -.0169632
                2018  |  -.0292247   .0036005    -8.12   0.000     -.036464   -.0219854
                2019  |   -.028469   .0050554    -5.63   0.000    -.0386336   -.0183045
                      |
                 nind |
                   2  |   .0341491   .0105351     3.24   0.002     .0129668    .0553314
                   3  |   .0503367   .0110126     4.57   0.000     .0281945    .0724789
                   4  |   .0405468   .0098672     4.11   0.000     .0207075     .060386
                   5  |   .1717158    .009982    17.20   0.000     .1516457    .1917859
                   6  |    .013789   .0091676     1.50   0.139    -.0046438    .0322217
                   7  |   .0048847   .0090258     0.54   0.591     -.013263    .0230323
                   8  |   .0216523   .0116489     1.86   0.069    -.0017695     .045074
                   9  |   .1403466   .0171899     8.16   0.000      .105784    .1749093
                  10  |   .0078054   .0100274     0.78   0.440     -.012356    .0279669
                  11  |   .0070238   .0158953     0.44   0.661    -.0249359    .0389836
                      |
                 educ |   .0146686   .0020578     7.13   0.000     .0105312     .018806
                exper |   .0083811   .0013748     6.10   0.000     .0056169    .0111453
               exper2 |  -.0003077    .000071    -4.34   0.000    -.0004504    -.000165
               exper3 |   6.99e-06   2.33e-06     3.00   0.004     2.31e-06    .0000117
               exper4 |  -6.49e-08   2.52e-08    -2.58   0.013    -1.15e-07   -1.43e-08
                 edex |  -.0001236   .0000477    -2.59   0.013    -.0002195   -.0000276
                      |
                ee_cl |
                   2  |  -.0355569   .0043678    -8.14   0.000    -.0443389    -.026775
                   3  |  -.0631813   .0066123    -9.56   0.000    -.0764762   -.0498864
                   4  |  -.0939717   .0131405    -7.15   0.000    -.1203923    -.067551
                   5  |  -.0379562   .0059695    -6.36   0.000    -.0499588   -.0259536
                   6  |   -.042613   .0053687    -7.94   0.000    -.0534076   -.0318184
                   7  |  -.0630198   .0075495    -8.35   0.000    -.0781992   -.0478404
                   8  |  -.0864356   .0127841    -6.76   0.000    -.1121398   -.0607314
                   9  |  -.0261975   .0059435    -4.41   0.000    -.0381477   -.0142473
                  10  |  -.0447978   .0065912    -6.80   0.000    -.0580503   -.0315453
                  11  |  -.0630966    .008435    -7.48   0.000    -.0800564   -.0461369
                  12  |  -.0780719   .0122732    -6.36   0.000    -.1027489    -.053395
                  13  |  -.0032665    .006941    -0.47   0.640    -.0172223    .0106894
                  14  |  -.0372367     .00732    -5.09   0.000    -.0519546   -.0225188
                  15  |  -.0573827    .009418    -6.09   0.000    -.0763187   -.0384466
                  16  |  -.0712758   .0129945    -5.49   0.000     -.097403   -.0451485
                      |
                 marr |  -.0006978   .0010193    -0.68   0.497    -.0027472    .0013517
                partt |  -.0557223   .0050148   -11.11   0.000    -.0658053   -.0456393
               public |   .2855013   .0284519    10.03   0.000     .2282949    .3427077
                 cmsa |   .0233625   .0028765     8.12   0.000     .0175789    .0291461
                      |
                nocc2 |
                   2  |   .0225385   .0020766    10.85   0.000     .0183632    .0267138
                   3  |   .0315882   .0067251     4.70   0.000     .0180665      .04511
                   4  |   .1520026   .0073235    20.76   0.000     .1372777    .1667276
                   5  |   .1364365   .0158859     8.59   0.000     .1044958    .1683773
                   6  |   .0642318   .0053823    11.93   0.000     .0534099    .0750537
                   7  |   .0836229   .0080427    10.40   0.000     .0674519    .0997939
                   8  |    .056655   .0032726    17.31   0.000      .050075     .063235
                   9  |   .0972171   .0091982    10.57   0.000     .0787228    .1157114
                  10  |   .1813681   .0151728    11.95   0.000     .1508612     .211875
                  11  |    .210843   .0158722    13.28   0.000     .1789297    .2427562
                  12  |   .1707046   .0180709     9.45   0.000     .1343706    .2070386
                      |
              quarter |
                   2  |  -.0010575   .0010176    -1.04   0.304    -.0031035    .0009885
                   3  |   .0001991   .0008291     0.24   0.811    -.0014678     .001866
                   4  |  -.0032728   .0011177    -2.93   0.005      -.00552   -.0010256
                      |
                _cons |  -.2173842   .0370912    -5.86   0.000    -.2919612   -.1428073
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr 
> partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,947,620,399)

Linear regression                               Number of obs     =  1,056,697
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2723
                                                Root MSE          =     .29782

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0795759   .0115631     6.88   0.000     .0563267    .1028251
             treat_st |  -.0223162   .0115217    -1.94   0.059    -.0454821    .0008496
treat_stblackrelwhite |  -.0647215   .0123087    -5.26   0.000    -.0894698   -.0399732
                      |
                state |
                  NH  |  -.0154448   .0015533    -9.94   0.000     -.018568   -.0123217
                  VT  |  -.0063431   .0010703    -5.93   0.000     -.008495   -.0041911
                  MA  |   .0150984   .0030999     4.87   0.000     .0088657    .0213312
                  RI  |   .0341338   .0028413    12.01   0.000     .0284209    .0398466
                  CT  |   .0252544   .0028929     8.73   0.000     .0194378    .0310709
                  NY  |   .0955021   .0030233    31.59   0.000     .0894234    .1015807
                  NJ  |   .0335529   .0030432    11.03   0.000     .0274342    .0396717
                  PA  |   .0088236    .002766     3.19   0.003     .0032622     .014385
                  OH  |  -.0047202   .0023924    -1.97   0.054    -.0095305    .0000902
                  IN  |  -.0430153   .0033637   -12.79   0.000    -.0497785   -.0362522
                  IL  |   .0004297   .0031044     0.14   0.890    -.0058122    .0066716
                  MI  |   .0453041   .0034953    12.96   0.000     .0382763     .052332
                  WI  |  -.0026234   .0026298    -1.00   0.323    -.0079109    .0026642
                  MN  |   .0361556   .0022982    15.73   0.000     .0315348    .0407764
                  IA  |  -.0027494   .0113175    -0.24   0.809    -.0255047    .0200059
                  MO  |  -.0521273   .0025613   -20.35   0.000     -.057277   -.0469775
                  ND  |  -.0423599    .011304    -3.75   0.000    -.0650881   -.0196318
                  SD  |  -.0544135   .0113416    -4.80   0.000    -.0772173   -.0316096
                  NE  |  -.0219808   .0112205    -1.96   0.056    -.0445411    .0005795
                  KS  |   -.056361      .0113    -4.99   0.000    -.0790812   -.0336408
                  DE  |  -.0309166   .0029817   -10.37   0.000    -.0369117   -.0249215
                  MD  |  -.0429159   .0058088    -7.39   0.000    -.0545953   -.0312366
                  DC  |  -.0638861    .006559    -9.74   0.000     -.077074   -.0506983
                  VA  |  -.0771811   .0112974    -6.83   0.000     -.099896   -.0544662
                  NC  |  -.1014293   .0117627    -8.62   0.000    -.1250797   -.0777789
                  SC  |  -.1082198   .0117986    -9.17   0.000    -.1319423   -.0844972
                  GA  |  -.0862164   .0117991    -7.31   0.000    -.1099401   -.0624927
                  FL  |  -.0371932   .0116239    -3.20   0.002    -.0605646   -.0138217
                  KY  |  -.0580227   .0020127   -28.83   0.000    -.0620696   -.0539758
                  TN  |  -.0665063   .0117168    -5.68   0.000    -.0900645   -.0429482
                  AL  |  -.0350974   .0117743    -2.98   0.005    -.0587713   -.0114236
                  MS  |  -.0943665   .0119998    -7.86   0.000    -.1184936   -.0702394
                  AR  |  -.0806551   .0116102    -6.95   0.000     -.103999   -.0573113
                  LA  |  -.0660988   .0116753    -5.66   0.000    -.0895737    -.042624
                  OK  |  -.0688292   .0064222   -10.72   0.000    -.0817419   -.0559166
                  TX  |   -.072408   .0115782    -6.25   0.000    -.0956876   -.0491284
                  ID  |  -.0517311   .0113157    -4.57   0.000    -.0744828   -.0289794
                  WY  |  -.0899397   .0118181    -7.61   0.000    -.1137016   -.0661777
                  CO  |  -.0472376   .0028522   -16.56   0.000    -.0529723   -.0415029
                  NM  |  -.0771147   .0029392   -26.24   0.000    -.0830244   -.0712051
                  AZ  |  -.0525952   .0116224    -4.53   0.000    -.0759635   -.0292269
                  UT  |  -.0537466   .0112216    -4.79   0.000    -.0763092   -.0311841
                  NV  |   .0469584    .011716     4.01   0.000     .0234018    .0705149
                  WA  |   .0612233   .0024604    24.88   0.000     .0562762    .0661703
                  OR  |    .045193   .0024163    18.70   0.000     .0403346    .0500514
                  CA  |   .0448284   .0028802    15.56   0.000     .0390374    .0506194
                  AK  |   .0663271   .0034704    19.11   0.000     .0593494    .0733049
                  HI  |   .0501503   .0021624    23.19   0.000     .0458026    .0544981
                      |
                 year |
                1990  |  -.0019264   .0017267    -1.12   0.270    -.0053982    .0015454
                1991  |  -.0025273   .0026373    -0.96   0.343      -.00783    .0027753
                1992  |   .0014592   .0023886     0.61   0.544    -.0033434    .0062619
                1993  |   .0007778   .0026359     0.30   0.769     -.004522    .0060777
                1996  |  -.0019139   .0025878    -0.74   0.463    -.0071171    .0032894
                1997  |  -.0061752   .0024364    -2.53   0.015    -.0110738   -.0012765
                1998  |   -.009273   .0029934    -3.10   0.003    -.0152917   -.0032544
                1999  |  -.0123448   .0028074    -4.40   0.000    -.0179894   -.0067001
                2000  |  -.0098804    .002478    -3.99   0.000    -.0148628   -.0048981
                2001  |  -.0090921   .0024182    -3.76   0.000    -.0139542   -.0042301
                2002  |  -.0091179   .0036298    -2.51   0.015    -.0164161   -.0018196
                2003  |  -.0152925   .0030591    -5.00   0.000    -.0214433   -.0091418
                2004  |   -.018596   .0033041    -5.63   0.000    -.0252394   -.0119527
                2005  |  -.0203231   .0033919    -5.99   0.000     -.027143   -.0135032
                2006  |   -.022835   .0032303    -7.07   0.000    -.0293298   -.0163401
                2007  |  -.0223921   .0044859    -4.99   0.000    -.0314117   -.0133725
                2008  |  -.0199913   .0045516    -4.39   0.000    -.0291428   -.0108398
                2009  |  -.0158297   .0059209    -2.67   0.010    -.0277346   -.0039249
                2010  |  -.0187123   .0059245    -3.16   0.003    -.0306244   -.0068003
                2011  |  -.0177288   .0056475    -3.14   0.003    -.0290839   -.0063737
                2012  |  -.0231347   .0052369    -4.42   0.000    -.0336641   -.0126053
                2013  |  -.0199118     .00517    -3.85   0.000    -.0303068   -.0095168
                2014  |  -.0243366   .0046695    -5.21   0.000    -.0337251    -.014948
                2015  |  -.0241479   .0049692    -4.86   0.000    -.0341392   -.0141566
                2016  |  -.0217279    .004478    -4.85   0.000    -.0307315   -.0127243
                2017  |  -.0276331    .004901    -5.64   0.000    -.0374872    -.017779
                2018  |  -.0303704   .0038057    -7.98   0.000    -.0380223   -.0227185
                2019  |  -.0298024   .0053664    -5.55   0.000    -.0405924   -.0190125
                      |
                 nind |
                   2  |    .034104   .0105297     3.24   0.002     .0129327    .0552753
                   3  |   .0503022   .0110133     4.57   0.000     .0281584     .072446
                   4  |   .0405286   .0098687     4.11   0.000     .0206864    .0603709
                   5  |   .1717019   .0099824    17.20   0.000     .1516309    .1917729
                   6  |   .0137683   .0091708     1.50   0.140    -.0046708    .0322075
                   7  |   .0048575   .0090277     0.54   0.593    -.0132939    .0230089
                   8  |   .0216322   .0116457     1.86   0.069    -.0017829    .0450474
                   9  |   .1403174   .0171899     8.16   0.000     .1057548    .1748799
                  10  |   .0077834   .0100314     0.78   0.442     -.012386    .0279528
                  11  |    .006986   .0158966     0.44   0.662    -.0249762    .0389483
                      |
                 educ |   .0146673   .0020583     7.13   0.000     .0105287    .0188058
                exper |   .0083861   .0013757     6.10   0.000     .0056201     .011152
               exper2 |  -.0003081    .000071    -4.34   0.000    -.0004508   -.0001654
               exper3 |   7.00e-06   2.33e-06     3.01   0.004     2.32e-06    .0000117
               exper4 |  -6.50e-08   2.52e-08    -2.58   0.013    -1.16e-07   -1.44e-08
                 edex |  -.0001236   .0000477    -2.59   0.013    -.0002195   -.0000276
                      |
                ee_cl |
                   2  |  -.0355429   .0043604    -8.15   0.000      -.04431   -.0267757
                   3  |  -.0631589   .0065959    -9.58   0.000    -.0764208    -.049897
                   4  |  -.0939497   .0131269    -7.16   0.000     -.120343   -.0675564
                   5  |  -.0379656   .0059646    -6.37   0.000    -.0499581    -.025973
                   6  |  -.0426061   .0053613    -7.95   0.000    -.0533858   -.0318265
                   7  |  -.0629959   .0075312    -8.36   0.000    -.0781384   -.0478535
                   8  |  -.0864129   .0127669    -6.77   0.000    -.1120825   -.0607432
                   9  |  -.0261976   .0059402    -4.41   0.000    -.0381411   -.0142541
                  10  |  -.0447884   .0065813    -6.81   0.000     -.058021   -.0315559
                  11  |  -.0630694   .0084152    -7.49   0.000    -.0799893   -.0461496
                  12  |  -.0780462   .0122524    -6.37   0.000    -.1026813   -.0534112
                  13  |  -.0032577   .0069368    -0.47   0.641    -.0172051    .0106898
                  14  |  -.0372139   .0073042    -5.09   0.000    -.0518999   -.0225279
                  15  |   -.057353   .0093956    -6.10   0.000    -.0762441   -.0384619
                  16  |  -.0712542   .0129782    -5.49   0.000    -.0973486   -.0451599
                      |
                 marr |  -.0006999   .0010184    -0.69   0.495    -.0027476    .0013478
                partt |  -.0557093   .0050072   -11.13   0.000    -.0657769   -.0456417
               public |   .2855108   .0284562    10.03   0.000     .2282958    .3427258
                 cmsa |    .023355   .0028767     8.12   0.000      .017571    .0291389
                      |
                nocc2 |
                   2  |   .0225326   .0020739    10.86   0.000     .0183627    .0267025
                   3  |   .0315812   .0067225     4.70   0.000     .0180646    .0450978
                   4  |   .1520007   .0073219    20.76   0.000      .137279    .1667224
                   5  |   .1364286   .0158849     8.59   0.000     .1044898    .1683674
                   6  |   .0642313   .0053824    11.93   0.000     .0534093    .0750533
                   7  |   .0836163   .0080395    10.40   0.000     .0674518    .0997808
                   8  |   .0566589   .0032753    17.30   0.000     .0500734    .0632444
                   9  |   .0972163   .0091972    10.57   0.000     .0787241    .1157085
                  10  |   .1813339   .0151683    11.95   0.000     .1508361    .2118317
                  11  |   .2108323   .0158705    13.28   0.000     .1789225    .2427422
                  12  |   .1706912   .0180711     9.45   0.000     .1343568    .2070256
                      |
                unemp |  -.0008984   .0009298    -0.97   0.339    -.0027679    .0009712
                      |
              quarter |
                   2  |  -.0010542   .0010167    -1.04   0.305    -.0030983      .00099
                   3  |   .0001977   .0008281     0.24   0.812    -.0014674    .0018628
                   4  |  -.0032708   .0011132    -2.94   0.005    -.0055091   -.0010325
                      |
                _cons |   -.213112   .0355477    -6.00   0.000    -.2845854   -.1416385
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo covstagdid_fem_all_unemp 

. 
. reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee
> _cl marr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,947,620,399)

Linear regression                               Number of obs     =  1,056,697
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2728
                                                Root MSE          =     .29772

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
              covered |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   .0796284   .0115518     6.89   0.000      .056402    .1028549
             treat_st |  -.0054263   .0113184    -0.48   0.634    -.0281834    .0173307
treat_stblackrelwhite |  -.0648162   .0122608    -5.29   0.000    -.0894682   -.0401642
                      |
                state |
                  NH  |  -.1399897   .0030723   -45.56   0.000     -.146167   -.1338124
                  VT  |   -.151137   .0036534   -41.37   0.000    -.1584826   -.1437913
                  MA  |  -.0207314   .0068156    -3.04   0.004    -.0344352   -.0070277
                  RI  |  -.0528596   .0061979    -8.53   0.000    -.0653213   -.0403979
                  CT  |    -.11018    .010156   -10.85   0.000       -.1306   -.0897601
                  NY  |   .0053411   .0080867     0.66   0.512    -.0109183    .0216005
                  NJ  |   .1219638   .0086768    14.06   0.000     .1045179    .1394097
                  PA  |   .1246074   .0081469    15.30   0.000      .108227    .1409879
                  OH  |    .113497   .0070955    16.00   0.000     .0992306    .1277634
                  IN  |   .1226618   .0379688     3.23   0.002     .0463205    .1990031
                  IL  |   .0194586   .0070466     2.76   0.008     .0052903    .0336268
                  MI  |   .1190864   .0350352     3.40   0.001     .0486434    .1895294
                  WI  |   .3113374   .0294252    10.58   0.000      .252174    .3705009
                  MN  |   .1634641   .0073382    22.28   0.000     .1487097    .1782184
                  IA  |    .054667   .0123645     4.42   0.000     .0298064    .0795275
                  MO  |   .0296475   .0050499     5.87   0.000     .0194939    .0398011
                  ND  |   .0207371   .0156995     1.32   0.193     -.010829    .0523031
                  SD  |   .0072236   .0123485     0.58   0.561    -.0176047    .0320519
                  NE  |   .1077214   .0116496     9.25   0.000     .0842984    .1311445
                  KS  |  -.0313121   .0120061    -2.61   0.012    -.0554519   -.0071723
                  DE  |   .0284098   .0168672     1.68   0.099     -.005504    .0623236
                  MD  |   .1057846   .0106544     9.93   0.000     .0843626    .1272066
                  DC  |  -.0494283   .0367394    -1.35   0.185    -.1232979    .0244413
                  VA  |   .0244532   .0131009     1.87   0.068    -.0018879    .0507942
                  NC  |  -.1206299   .0140053    -8.61   0.000    -.1487895   -.0924704
                  SC  |   -.174274   .0131545   -13.25   0.000    -.2007229   -.1478251
                  GA  |   -.089149   .0120023    -7.43   0.000    -.1132812   -.0650167
                  FL  |  -.0086337   .0122698    -0.70   0.485    -.0333037    .0160363
                  KY  |  -.0884541   .0202359    -4.37   0.000    -.1291411   -.0477671
                  TN  |   .0341279   .0125113     2.73   0.009     .0089723    .0592836
                  AL  |  -.0234941   .0118596    -1.98   0.053    -.0473395    .0003513
                  MS  |  -.0352669   .0121325    -2.91   0.006     -.059661   -.0108729
                  AR  |   .1208831    .012695     9.52   0.000     .0953581     .146408
                  LA  |  -.0412384   .0166237    -2.48   0.017    -.0746625   -.0078142
                  OK  |  -.0279194   .0509135    -0.55   0.586    -.1302878     .074449
                  TX  |  -.1026619   .0127535    -8.05   0.000    -.1283046   -.0770192
                  ID  |   .0522558   .0135911     3.84   0.000     .0249291    .0795826
                  WY  |   .1207437   .0122914     9.82   0.000     .0960302    .1454573
                  CO  |  -.1890073   .0087791   -21.53   0.000    -.2066588   -.1713557
                  NM  |  -.1428855   .0045672   -31.29   0.000    -.1520685   -.1337025
                  AZ  |  -.0442887   .0128632    -3.44   0.001    -.0701519   -.0184255
                  UT  |   .1510474   .0130903    11.54   0.000     .1247276    .1773673
                  NV  |   .2329352   .0140061    16.63   0.000      .204774    .2610964
                  WA  |   .1277224   .0069483    18.38   0.000     .1137519    .1416929
                  OR  |  -.0158603    .004868    -3.26   0.002    -.0256481   -.0060724
                  CA  |  -.0552134   .0080242    -6.88   0.000     -.071347   -.0390797
                  AK  |  -.0405179   .0069839    -5.80   0.000      -.05456   -.0264759
                  HI  |   .1494521   .0127098    11.76   0.000     .1238973     .175007
                      |
        state#c.lyear |
                  ME  |  -.0007022   .0000701   -10.02   0.000    -.0008432   -.0005613
                  NH  |   .0004645   .0000846     5.49   0.000     .0002945    .0006345
                  VT  |    .000705   .0000453    15.57   0.000     .0006139     .000796
                  MA  |  -.0003576   .0000548    -6.52   0.000    -.0004679   -.0002474
                  RI  |   .0001255   .0000586     2.14   0.037     7.78e-06    .0002433
                  CT  |    .000604   .0000917     6.58   0.000     .0004195    .0007885
                  NY  |   .0001694   .0000356     4.76   0.000     .0000979    .0002408
                  NJ  |  -.0015604   .0000475   -32.83   0.000    -.0016559   -.0014648
                  PA  |  -.0018252   .0000408   -44.72   0.000    -.0019072   -.0017431
                  OH  |  -.0018506   .0000324   -57.10   0.000    -.0019158   -.0017855
                  IN  |  -.0023441   .0003829    -6.12   0.000    -.0031139   -.0015742
                  IL  |  -.0008964   .0000308   -29.09   0.000    -.0009584   -.0008345
                  MI  |  -.0014635   .0003395    -4.31   0.000    -.0021461   -.0007808
                  WI  |  -.0037597   .0002914   -12.90   0.000    -.0043456   -.0031739
                  MN  |  -.0019226   .0000355   -54.13   0.000     -.001994   -.0018512
                  IA  |    -.00141   .0000348   -40.56   0.000    -.0014799   -.0013401
                  MO  |   -.001494   .0000449   -33.26   0.000    -.0015843   -.0014036
                  ND  |  -.0014577   .0000535   -27.26   0.000    -.0015652   -.0013502
                  SD  |   -.001449    .000025   -57.86   0.000    -.0014994   -.0013987
                  NE  |   -.002099   .0000422   -49.69   0.000     -.002184   -.0020141
                  KS  |  -.0011026   .0000339   -32.54   0.000    -.0011707   -.0010345
                  DE  |  -.0012848   .0001243   -10.33   0.000    -.0015348   -.0010348
                  MD  |  -.0021216   .0000501   -42.34   0.000    -.0022223   -.0020208
                  DC  |  -.0008607   .0002549    -3.38   0.001    -.0013731   -.0003483
                  VA  |  -.0018431   .0000452   -40.80   0.000    -.0019339   -.0017522
                  NC  |   -.000685   .0000984    -6.96   0.000    -.0008828   -.0004871
                  SC  |  -.0002407   .0000874    -2.76   0.008    -.0004164    -.000065
                  GA  |  -.0008434   .0000507   -16.64   0.000    -.0009453   -.0007415
                  FL  |  -.0011472   .0000296   -38.73   0.000    -.0012067   -.0010876
                  KY  |  -.0004366   .0001871    -2.33   0.024    -.0008128   -.0000604
                  TN  |  -.0018429   .0000629   -29.28   0.000    -.0019695   -.0017164
                  AL  |  -.0009873   .0000538   -18.34   0.000    -.0010955   -.0008791
                  MS  |   -.001449   .0000737   -19.65   0.000    -.0015973   -.0013008
                  AR  |  -.0028134   .0000987   -28.50   0.000    -.0030118   -.0026149
                  LA  |  -.0011155   .0000865   -12.90   0.000    -.0012894   -.0009417
                  OK  |  -.0011871   .0005427    -2.19   0.034    -.0022784   -.0000959
                  TX  |  -.0005805   .0000333   -17.45   0.000    -.0006474   -.0005136
                  ID  |  -.0018642   .0000738   -25.25   0.000    -.0020126   -.0017158
                  WY  |   -.002834   .0000725   -39.09   0.000    -.0029797   -.0026882
                  CO  |   .0006528   .0000727     8.98   0.000     .0005068    .0007989
                  NM  |  -.0000877   .0000737    -1.19   0.240    -.0002359    .0000605
                  AZ  |  -.0009544   .0000405   -23.56   0.000    -.0010358   -.0008729
                  UT  |  -.0028137   .0000359   -78.48   0.000    -.0028858   -.0027416
                  NV  |  -.0026541   .0000593   -44.76   0.000    -.0027733   -.0025348
                  WA  |  -.0013522   .0000312   -43.38   0.000    -.0014149   -.0012896
                  OR  |    -.00013   .0000462    -2.81   0.007    -.0002229   -.0000371
                  CA  |   .0002563   .0000596     4.30   0.000     .0001365    .0003762
                  AK  |   .0003349   .0000843     3.97   0.000     .0001654    .0005044
                  HI  |  -.0016669   .0001311   -12.72   0.000    -.0019304   -.0014034
                      |
                 nind |
                   2  |   .0334177   .0105658     3.16   0.003     .0121736    .0546617
                   3  |   .0500677   .0109784     4.56   0.000     .0279942    .0721412
                   4  |   .0399545   .0098477     4.06   0.000     .0201545    .0597545
                   5  |   .1709703    .009954    17.18   0.000     .1509566    .1909841
                   6  |   .0133849   .0091576     1.46   0.150    -.0050277    .0317975
                   7  |   .0043154   .0090144     0.48   0.634    -.0138093      .02244
                   8  |   .0211408    .011659     1.81   0.076    -.0023011    .0445828
                   9  |   .1397961   .0172095     8.12   0.000      .105194    .1743982
                  10  |   .0073279   .0099334     0.74   0.464    -.0126446    .0273004
                  11  |   .0063102    .015914     0.40   0.693    -.0256871    .0383075
                      |
                 educ |   .0145787    .001979     7.37   0.000     .0105996    .0185578
                exper |   .0084375   .0013756     6.13   0.000     .0056716    .0112034
               exper2 |  -.0003116   .0000702    -4.44   0.000    -.0004529   -.0001704
               exper3 |   7.08e-06   2.31e-06     3.07   0.004     2.44e-06    .0000117
               exper4 |  -6.54e-08   2.50e-08    -2.62   0.012    -1.16e-07   -1.52e-08
                 edex |  -.0001238   .0000478    -2.59   0.013      -.00022   -.0000276
                      |
                ee_cl |
                   2  |  -.0357984   .0043312    -8.27   0.000    -.0445069   -.0270898
                   3  |   -.063009   .0064908    -9.71   0.000    -.0760597   -.0499583
                   4  |  -.0937651   .0128795    -7.28   0.000    -.1196612   -.0678691
                   5  |  -.0385009   .0061805    -6.23   0.000    -.0509276   -.0260743
                   6  |  -.0430298   .0054568    -7.89   0.000    -.0540014   -.0320583
                   7  |  -.0626301    .007464    -8.39   0.000    -.0776375   -.0476227
                   8  |  -.0860771   .0125803    -6.84   0.000    -.1113715   -.0607827
                   9  |  -.0267201   .0061732    -4.33   0.000    -.0391323    -.014308
                  10  |  -.0450389   .0065981    -6.83   0.000    -.0583052   -.0317725
                  11  |  -.0628091   .0083434    -7.53   0.000    -.0795845   -.0460336
                  12  |  -.0776856   .0120362    -6.45   0.000    -.1018861   -.0534852
                  13  |  -.0037855   .0071366    -0.53   0.598    -.0181346    .0105636
                  14  |  -.0372298   .0072877    -5.11   0.000    -.0518828   -.0225768
                  15  |  -.0572781   .0092949    -6.16   0.000    -.0759669   -.0385894
                  16  |  -.0712889   .0127319    -5.60   0.000     -.096888   -.0456897
                      |
                 marr |  -.0007123   .0010131    -0.70   0.485    -.0027493    .0013248
                partt |   -.055721   .0049806   -11.19   0.000    -.0657352   -.0457067
               public |   .2855224   .0284634    10.03   0.000      .228293    .3427518
                 cmsa |    .023445   .0030519     7.68   0.000     .0173088    .0295812
                      |
                nocc2 |
                   2  |   .0226702   .0020679    10.96   0.000     .0185124    .0268279
                   3  |   .0315976   .0067169     4.70   0.000     .0180924    .0451027
                   4  |   .1518367   .0073366    20.70   0.000     .1370855    .1665879
                   5  |    .136428   .0158998     8.58   0.000     .1044593    .1683968
                   6  |   .0642155   .0054007    11.89   0.000     .0533568    .0750743
                   7  |   .0836836   .0080112    10.45   0.000     .0675759    .0997913
                   8  |   .0566149   .0032694    17.32   0.000     .0500413    .0631885
                   9  |   .0970405   .0091814    10.57   0.000     .0785801    .1155009
                  10  |   .1808894   .0150674    12.01   0.000     .1505944    .2111844
                  11  |   .2108178   .0159345    13.23   0.000     .1787793    .2428563
                  12  |   .1707356    .018081     9.44   0.000     .1343814    .2070899
                      |
                unemp |   .0000658   .0003253     0.20   0.841    -.0005882    .0007197
                      |
              quarter |
                   2  |  -.0011168    .001024    -1.09   0.281    -.0031757    .0009421
                   3  |   .0001452   .0008554     0.17   0.866    -.0015748    .0018652
                   4  |  -.0033038   .0011282    -2.93   0.005    -.0055722   -.0010354
                      |
                _cons |  -.1575189   .0351185    -4.49   0.000    -.2281295   -.0869084
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo covstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 9,150,336,952)

Linear regression                               Number of obs     =  1,046,468
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5105
                                                Root MSE          =     .41756

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1440618   .0064596   -22.30   0.000    -.1570497   -.1310739
             treat_st |   -.037766    .018192    -2.08   0.043    -.0743436   -.0011885
treat_stblackrelwhite |  -.0220623   .0088339    -2.50   0.016     -.039824   -.0043006
                      |
                state |
                  NH  |    .086977   .0039653    21.93   0.000     .0790043    .0949496
                  VT  |   .0258042   .0007252    35.58   0.000     .0243461    .0272623
                  MA  |   .1160638    .008725    13.30   0.000      .098521    .1336065
                  RI  |   .0284584   .0087464     3.25   0.002     .0108726    .0460442
                  CT  |   .1294783   .0086643    14.94   0.000     .1120575    .1468991
                  NY  |   .0965504   .0080651    11.97   0.000     .0803345    .1127664
                  NJ  |   .1675442   .0092903    18.03   0.000     .1488649    .1862235
                  PA  |   .0088425   .0067931     1.30   0.199     -.004816     .022501
                  OH  |  -.0196473   .0066442    -2.96   0.005    -.0330064   -.0062881
                  IN  |   .0054352   .0053783     1.01   0.317    -.0053787    .0162491
                  IL  |   .0782291   .0074219    10.54   0.000     .0633064    .0931518
                  MI  |    .044223   .0065732     6.73   0.000     .0310067    .0574393
                  WI  |   .0202909   .0050764     4.00   0.000     .0100841    .0304977
                  MN  |   .0656697   .0065201    10.07   0.000     .0525603    .0787792
                  IA  |   .0214505   .0179135     1.20   0.237     -.014567     .057468
                  MO  |  -.0222673    .006357    -3.50   0.001    -.0350489   -.0094858
                  ND  |   .0321277   .0190352     1.69   0.098    -.0061452    .0704006
                  SD  |  -.0371138   .0182432    -2.03   0.047    -.0737943   -.0004333
                  NE  |  -.0226367   .0181198    -1.25   0.218     -.059069    .0137957
                  KS  |  -.0025294   .0179222    -0.14   0.888    -.0385645    .0335057
                  DE  |   .0545697   .0020022    27.26   0.000      .050544    .0585953
                  MD  |   .1230504   .0091996    13.38   0.000     .1045534    .1415475
                  DC  |   .1688246   .0110959    15.22   0.000     .1465148    .1911343
                  VA  |   .1197702   .0184106     6.51   0.000     .0827532    .1567872
                  NC  |    .005633   .0178868     0.31   0.754    -.0303308    .0415968
                  SC  |  -.0156954   .0177137    -0.89   0.380    -.0513111    .0199203
                  GA  |   .0536904   .0182544     2.94   0.005     .0169874    .0903934
                  FL  |    -.01429   .0187671    -0.76   0.450    -.0520238    .0234438
                  KY  |   -.044048   .0043589   -10.11   0.000    -.0528122   -.0352839
                  TN  |  -.0319081   .0178282    -1.79   0.080    -.0677542    .0039379
                  AL  |  -.0090891   .0178055    -0.51   0.612    -.0448894    .0267112
                  MS  |  -.0357406   .0180147    -1.98   0.053    -.0719616    .0004803
                  AR  |  -.0755533   .0180369    -4.19   0.000     -.111819   -.0392877
                  LA  |   .0182183   .0183117     0.99   0.325    -.0185999    .0550364
                  OK  |  -.0570536   .0107032    -5.33   0.000    -.0785738   -.0355334
                  TX  |   .0575708   .0185104     3.11   0.003     .0203532    .0947884
                  ID  |  -.0020131   .0180787    -0.11   0.912    -.0383627    .0343365
                  WY  |   .1643928   .0199229     8.25   0.000      .124335    .2044505
                  CO  |   .0316382   .0085145     3.72   0.001     .0145187    .0487578
                  NM  |  -.0374045   .0058602    -6.38   0.000    -.0491872   -.0256219
                  AZ  |   .0281985   .0185652     1.52   0.135    -.0091294    .0655263
                  UT  |   .0026641   .0185621     0.14   0.886    -.0346574    .0399857
                  NV  |   .1077971   .0187488     5.75   0.000     .0701002     .145494
                  WA  |   .0955513   .0078081    12.24   0.000      .079852    .1112506
                  OR  |   .0225034   .0071001     3.17   0.003     .0082276    .0367791
                  CA  |   .1561785   .0090868    17.19   0.000     .1379082    .1744488
                  AK  |   .2371868   .0049473    47.94   0.000     .2272397     .247134
                  HI  |   .1136657   .0065737    17.29   0.000     .1004485     .126883
                      |
                 year |
                1990  |  -.0128025   .0026752    -4.79   0.000    -.0181813   -.0074236
                1991  |  -.0275246   .0034774    -7.92   0.000    -.0345163   -.0205328
                1992  |  -.0281125   .0032236    -8.72   0.000    -.0345941    -.021631
                1993  |  -.0357884   .0034281   -10.44   0.000    -.0426811   -.0288957
                1996  |  -.0373434   .0052571    -7.10   0.000    -.0479135   -.0267732
                1997  |  -.0216083   .0052818    -4.09   0.000     -.032228   -.0109885
                1998  |   .0013251   .0045656     0.29   0.773    -.0078546    .0105048
                1999  |   .0237887   .0059486     4.00   0.000     .0118282    .0357491
                2000  |   .0317195   .0053235     5.96   0.000      .021016     .042423
                2001  |   .0465511   .0055384     8.41   0.000     .0354154    .0576868
                2002  |   .0533861   .0055754     9.58   0.000     .0421759    .0645963
                2003  |   .0434636   .0058705     7.40   0.000     .0316601    .0552671
                2004  |   .0355543   .0053436     6.65   0.000     .0248102    .0462984
                2005  |   .0218811   .0058757     3.72   0.001     .0100671    .0336951
                2006  |   .0181133   .0061485     2.95   0.005     .0057509    .0304758
                2007  |   .0188429   .0071654     2.63   0.011     .0044358    .0332499
                2008  |   .0138433   .0075445     1.83   0.073    -.0013259    .0290126
                2009  |    .026125   .0080158     3.26   0.002     .0100082    .0422419
                2010  |   .0174529   .0078688     2.22   0.031     .0016317    .0332742
                2011  |    -.00515   .0074117    -0.69   0.490    -.0200521    .0097521
                2012  |  -.0071467   .0086943    -0.82   0.415    -.0246279    .0103344
                2013  |  -.0091161   .0086965    -1.05   0.300    -.0266015    .0083693
                2014  |  -.0108831    .008958    -1.21   0.230    -.0288945    .0071282
                2015  |   .0099569   .0070704     1.41   0.166    -.0042591     .024173
                2016  |   .0242823   .0074058     3.28   0.002     .0093919    .0391727
                2017  |   .0306437   .0080424     3.81   0.000     .0144733     .046814
                2018  |   .0400533   .0078439     5.11   0.000      .024282    .0558245
                2019  |   .0602493   .0077652     7.76   0.000     .0446364    .0758622
                      |
                 nind |
                   2  |   .0923224   .0264963     3.48   0.001      .039048    .1455968
                   3  |   .1122971   .0218698     5.13   0.000     .0683249    .1562693
                   4  |   -.071366   .0237026    -3.01   0.004    -.1190233   -.0237087
                   5  |   .1509194   .0232069     6.50   0.000     .1042587    .1975801
                   6  |   .1063097   .0259151     4.10   0.000     .0542039    .1584155
                   7  |   .0100114    .025091     0.40   0.692    -.0404375    .0604603
                   8  |  -.0489106   .0251496    -1.94   0.058    -.0994772     .001656
                   9  |  -.0556414   .0280529    -1.98   0.053    -.1120456    .0007627
                  10  |  -.0873325   .0260892    -3.35   0.002    -.1397884   -.0348766
                  11  |   .1254155   .0261027     4.80   0.000     .0729325    .1778984
                      |
                 educ |   .0679036   .0016992    39.96   0.000     .0644871      .07132
                exper |   .0458961   .0017841    25.73   0.000      .042309    .0494832
               exper2 |   -.000968   .0000953   -10.16   0.000    -.0011595   -.0007764
               exper3 |   5.24e-06   2.79e-06     1.88   0.066    -3.65e-07    .0000108
               exper4 |   2.96e-08   2.97e-08     1.00   0.323    -3.00e-08    8.93e-08
                 edex |  -.0004543   .0000626    -7.25   0.000    -.0005803   -.0003284
                      |
                ee_cl |
                   2  |  -.0593103    .004565   -12.99   0.000    -.0684888   -.0501318
                   3  |  -.0681116   .0060823   -11.20   0.000    -.0803409   -.0558823
                   4  |  -.0265084   .0107629    -2.46   0.017    -.0481486   -.0048682
                   5  |  -.1335422    .005751   -23.22   0.000    -.1451055    -.121979
                   6  |  -.0853256   .0055203   -15.46   0.000     -.096425   -.0742263
                   7  |   -.061374   .0068067    -9.02   0.000    -.0750598   -.0476883
                   8  |   .0278881   .0116048     2.40   0.020     .0045551    .0512211
                   9  |  -.1532442   .0073392   -20.88   0.000    -.1680006   -.1384878
                  10  |  -.0965774   .0078358   -12.33   0.000    -.1123323   -.0808224
                  11  |  -.0580182   .0082295    -7.05   0.000    -.0745646   -.0414717
                  12  |   .0306921    .011701     2.62   0.012     .0071656    .0542185
                  13  |  -.0773642   .0126038    -6.14   0.000    -.1027059   -.0520226
                  14  |   -.075482   .0095868    -7.87   0.000    -.0947576   -.0562063
                  15  |  -.0476432   .0094689    -5.03   0.000    -.0666817   -.0286047
                  16  |   .0297484   .0127562     2.33   0.024     .0041003    .0553964
                      |
                 marr |   .1233642   .0023432    52.65   0.000     .1186528    .1280755
                partt |  -.2094474   .0061723   -33.93   0.000    -.2218575   -.1970372
               public |   .0165087   .0074297     2.22   0.031     .0015702    .0314472
                 cmsa |   .1453655   .0089768    16.19   0.000     .1273166    .1634145
                      |
                nocc2 |
                   2  |  -.1396386   .0035758   -39.05   0.000    -.1468282   -.1324491
                   3  |  -.0388603   .0059804    -6.50   0.000    -.0508848   -.0268359
                   4  |  -.2914103   .0094352   -30.89   0.000    -.3103811   -.2724396
                   5  |  -.0779118   .0069582   -11.20   0.000    -.0919023   -.0639213
                   6  |  -.3674745   .0062302   -58.98   0.000    -.3800011   -.3549479
                   7  |  -.2295591   .0052655   -43.60   0.000     -.240146   -.2189721
                   8  |  -.0999193   .0107422    -9.30   0.000     -.121518   -.0783206
                   9  |  -.3880065   .0035763  -108.49   0.000    -.3951972   -.3808158
                  10  |  -.3261144   .0049895   -65.36   0.000    -.3361464   -.3160824
                  11  |  -.2238451   .0054651   -40.96   0.000    -.2348333   -.2128568
                  12  |  -.3769279   .0055022   -68.50   0.000    -.3879908    -.365865
                      |
              quarter |
                   2  |   .0033531   .0019078     1.76   0.085    -.0004828    .0071889
                   3  |   .0049275   .0018801     2.62   0.012     .0011473    .0087077
                   4  |    .014148   .0015169     9.33   0.000      .011098     .017198
                      |
                _cons |   .6191685   .0276639    22.38   0.000     .5635465    .6747905
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 9,150,336,952)

Linear regression                               Number of obs     =  1,046,468
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5106
                                                Root MSE          =     .41754

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1440858   .0064718   -22.26   0.000    -.1570982   -.1310734
             treat_st |  -.0395089   .0189715    -2.08   0.043    -.0776536   -.0013642
treat_stblackrelwhite |  -.0220508   .0088584    -2.49   0.016    -.0398619   -.0042398
                      |
                state |
                  NH  |   .0794758   .0048672    16.33   0.000     .0696896     .089262
                  VT  |   .0188108   .0018961     9.92   0.000     .0149985    .0226232
                  MA  |    .116451   .0087264    13.34   0.000     .0989054    .1339966
                  RI  |   .0353105    .008786     4.02   0.000      .017645     .052976
                  CT  |   .1301911   .0086391    15.07   0.000     .1128209    .1475612
                  NY  |   .1014158   .0081175    12.49   0.000     .0850944    .1177372
                  NJ  |   .1711067   .0092065    18.59   0.000     .1525958    .1896175
                  PA  |   .0113964    .006704     1.70   0.096    -.0020829    .0248757
                  OH  |  -.0156004   .0064812    -2.41   0.020    -.0286318    -.002569
                  IN  |   .0060186   .0054456     1.11   0.275    -.0049304    .0169677
                  IL  |   .0847193   .0073376    11.55   0.000     .0699661    .0994725
                  MI  |   .0541632   .0072133     7.51   0.000       .03966    .0686665
                  WI  |   .0176562   .0051173     3.45   0.001     .0073672    .0279451
                  MN  |   .0602475   .0070476     8.55   0.000     .0460774    .0744176
                  IA  |   .0149853   .0175701     0.85   0.398    -.0203418    .0503123
                  MO  |  -.0209776   .0062979    -3.33   0.002    -.0336405   -.0083148
                  ND  |   .0220176   .0183798     1.20   0.237    -.0149375    .0589726
                  SD  |  -.0467437   .0175626    -2.66   0.011    -.0820557   -.0114317
                  NE  |   -.033917   .0172871    -1.96   0.056    -.0686751    .0008411
                  KS  |  -.0054393   .0179834    -0.30   0.764    -.0415973    .0307188
                  DE  |   .0503476   .0023622    21.31   0.000     .0455981    .0550972
                  MD  |   .1209109   .0092837    13.02   0.000     .1022448     .139577
                  DC  |   .1801646    .011464    15.72   0.000     .1571147    .2032145
                  VA  |   .1156448   .0182443     6.34   0.000     .0789621    .1523275
                  NC  |   .0091035    .018871     0.48   0.632    -.0288391    .0470462
                  SC  |  -.0086981   .0193295    -0.45   0.655    -.0475626    .0301664
                  GA  |   .0582595   .0194142     3.00   0.004     .0192247    .0972943
                  FL  |  -.0094404   .0199868    -0.47   0.639    -.0496266    .0307457
                  KY  |  -.0385719   .0046538    -8.29   0.000    -.0479289   -.0292148
                  TN  |  -.0276333   .0189616    -1.46   0.152    -.0657582    .0104916
                  AL  |    -.00226   .0193672    -0.12   0.908    -.0412003    .0366802
                  MS  |  -.0242031   .0205322    -1.18   0.244    -.0654858    .0170795
                  AR  |  -.0708164   .0192518    -3.68   0.001    -.1095246   -.0321081
                  LA  |    .026198   .0200421     1.31   0.197    -.0140994    .0664953
                  OK  |  -.0594744   .0106372    -5.59   0.000     -.080862   -.0380867
                  TX  |   .0618937   .0195671     3.16   0.003     .0225513    .1012361
                  ID  |  -.0002699   .0188574    -0.01   0.989    -.0381852    .0376454
                  WY  |   .1606877   .0200412     8.02   0.000     .1203921    .2009833
                  CO  |   .0290322   .0086648     3.35   0.002     .0116105     .046454
                  NM  |  -.0325171   .0058144    -5.59   0.000    -.0442078   -.0208264
                  AZ  |   .0336835   .0198556     1.70   0.096    -.0062388    .0736059
                  UT  |  -.0015491   .0184888    -0.08   0.934    -.0387233     .035625
                  NV  |   .1147431   .0204213     5.62   0.000     .0736834    .1558028
                  WA  |    .101048   .0077132    13.10   0.000     .0855395    .1165565
                  OR  |   .0301207   .0070776     4.26   0.000     .0158901    .0443512
                  CA  |   .1663922   .0092746    17.94   0.000     .1477444    .1850401
                  AK  |   .2504106   .0065229    38.39   0.000     .2372955    .2635257
                  HI  |   .1064668   .0068024    15.65   0.000     .0927897    .1201439
                      |
                 year |
                1990  |  -.0108013   .0027429    -3.94   0.000    -.0163162   -.0052864
                1991  |  -.0179595     .00465    -3.86   0.000     -.027309     -.00861
                1992  |  -.0146915   .0053362    -2.75   0.008    -.0254206   -.0039624
                1993  |  -.0261568   .0042465    -6.16   0.000    -.0346948   -.0176187
                1996  |    -.03718   .0049482    -7.51   0.000    -.0471291    -.027231
                1997  |  -.0242582    .004685    -5.18   0.000     -.033678   -.0148384
                1998  |  -.0040456   .0040248    -1.01   0.320    -.0121379    .0040468
                1999  |   .0167239   .0052528     3.18   0.003     .0061625    .0272853
                2000  |   .0235186     .00543     4.33   0.000      .012601    .0344363
                2001  |   .0431089   .0054624     7.89   0.000      .032126    .0540918
                2002  |    .056692    .005554    10.21   0.000     .0455249    .0678591
                2003  |   .0481301   .0059492     8.09   0.000     .0361684    .0600917
                2004  |   .0374593     .00531     7.05   0.000     .0267829    .0481357
                2005  |   .0212559   .0057947     3.67   0.001     .0096049     .032907
                2006  |   .0147734   .0060142     2.46   0.018      .002681    .0268657
                2007  |   .0151358   .0072226     2.10   0.041     .0006137    .0296578
                2008  |   .0172655   .0071044     2.43   0.019     .0029811    .0315499
                2009  |   .0511218   .0108104     4.73   0.000      .029386    .0728575
                2010  |   .0446011   .0091973     4.85   0.000     .0261087    .0630935
                2011  |   .0175519   .0090738     1.93   0.059    -.0006923    .0357961
                2012  |   .0100996   .0101876     0.99   0.326     -.010384    .0305832
                2013  |   .0041831   .0095723     0.44   0.664    -.0150633    .0234295
                2014  |  -.0051665   .0086388    -0.60   0.553     -.022536     .012203
                2015  |   .0100953   .0067123     1.50   0.139    -.0034006    .0235913
                2016  |   .0220149   .0071359     3.09   0.003     .0076672    .0363626
                2017  |   .0252504   .0079852     3.16   0.003     .0091951    .0413057
                2018  |    .031903   .0079115     4.03   0.000     .0159959    .0478101
                2019  |   .0507503   .0081171     6.25   0.000     .0344298    .0670707
                      |
                 nind |
                   2  |   .0923242   .0264723     3.49   0.001      .039098    .1455503
                   3  |   .1123058   .0218516     5.14   0.000     .0683703    .1562413
                   4  |  -.0712774   .0236699    -3.01   0.004    -.1188689   -.0236859
                   5  |   .1510252   .0231574     6.52   0.000      .104464    .1975863
                   6  |   .1064095   .0258799     4.11   0.000     .0543744    .1584445
                   7  |    .010078   .0250592     0.40   0.689    -.0403069    .0604629
                   8  |  -.0488133   .0251192    -1.94   0.058    -.0993189    .0016923
                   9  |  -.0555746   .0280275    -1.98   0.053    -.1119277    .0007784
                  10  |  -.0872151   .0260371    -3.35   0.002    -.1395662    -.034864
                  11  |   .1254724   .0260572     4.82   0.000     .0730808     .177864
                      |
                 educ |   .0679176    .001699    39.98   0.000     .0645016    .0713336
                exper |   .0459522   .0017814    25.80   0.000     .0423705     .049534
               exper2 |  -.0009711   .0000958   -10.14   0.000    -.0011636   -.0007785
               exper3 |   5.33e-06   2.81e-06     1.90   0.063    -3.07e-07     .000011
               exper4 |   2.86e-08   2.99e-08     0.96   0.343    -3.15e-08    8.87e-08
                 edex |  -.0004553   .0000623    -7.31   0.000    -.0005806     -.00033
                      |
                ee_cl |
                   2  |   -.059171   .0045697   -12.95   0.000    -.0683589    -.049983
                   3  |  -.0679922   .0060896   -11.17   0.000    -.0802362   -.0557482
                   4  |  -.0264243   .0107809    -2.45   0.018    -.0481007   -.0047478
                   5  |  -.1335959   .0057435   -23.26   0.000     -.145144   -.1220478
                   6  |  -.0852789   .0054878   -15.54   0.000    -.0963129   -.0742449
                   7  |  -.0612461   .0068087    -9.00   0.000    -.0749358   -.0475564
                   8  |   .0280552   .0116259     2.41   0.020     .0046798    .0514307
                   9  |  -.1532246   .0073275   -20.91   0.000    -.1679575   -.1384918
                  10  |  -.0965907   .0078082   -12.37   0.000    -.1122902   -.0808912
                  11  |   -.057882   .0082429    -7.02   0.000    -.0744555   -.0413085
                  12  |   .0308668   .0117172     2.63   0.011     .0073078    .0544258
                  13  |  -.0775051   .0125706    -6.17   0.000      -.10278   -.0522303
                  14  |  -.0754748   .0095718    -7.89   0.000    -.0947203   -.0562294
                  15  |  -.0475789   .0094708    -5.02   0.000    -.0666213   -.0285365
                  16  |   .0298738   .0127553     2.34   0.023     .0042276    .0555201
                      |
                 marr |   .1233803   .0023416    52.69   0.000     .1186723    .1280883
                partt |  -.2092207   .0061987   -33.75   0.000     -.221684   -.1967573
               public |   .0165465   .0074326     2.23   0.031     .0016022    .0314908
                 cmsa |   .1452983   .0089854    16.17   0.000      .127232    .1633646
                      |
                nocc2 |
                   2  |  -.1396239   .0035822   -38.98   0.000    -.1468263   -.1324215
                   3  |  -.0388433   .0059848    -6.49   0.000    -.0508766   -.0268099
                   4  |  -.2914221   .0094228   -30.93   0.000    -.3103679   -.2724763
                   5  |  -.0779458   .0069627   -11.19   0.000    -.0919452   -.0639464
                   6  |  -.3674243   .0062552   -58.74   0.000    -.3800012   -.3548475
                   7  |  -.2295094   .0052936   -43.36   0.000    -.2401528    -.218866
                   8  |  -.1000397   .0107726    -9.29   0.000    -.1216995   -.0783798
                   9  |  -.3879308   .0035717  -108.61   0.000    -.3951122   -.3807494
                  10  |  -.3261122   .0049898   -65.36   0.000    -.3361448   -.3160795
                  11  |  -.2238499   .0054609   -40.99   0.000    -.2348298   -.2128699
                  12  |  -.3769214   .0055143   -68.35   0.000    -.3880086   -.3658342
                      |
                unemp |  -.0062899    .001996    -3.15   0.003    -.0103032   -.0022766
                      |
              quarter |
                   2  |   .0033384   .0019024     1.75   0.086    -.0004866    .0071633
                   3  |   .0049211   .0018918     2.60   0.012     .0011173    .0087249
                   4  |   .0141511   .0015058     9.40   0.000     .0111235    .0171786
                      |
                _cons |   .6486672    .034014    19.07   0.000     .5802775    .7170569
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_mal_all_unemp

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
(sum of wgt is 9,150,336,952)

Linear regression                               Number of obs     =  1,046,468
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5099
                                                Root MSE          =      .4178

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1448161   .0063642   -22.75   0.000    -.1576122     -.13202
             treat_st |  -.0198811   .0105998    -1.88   0.067    -.0411935    .0014313
treat_stblackrelwhite |  -.0219598   .0087554    -2.51   0.016    -.0395636   -.0043559
                      |
                state |
                  NH  |   .1394053   .0095146    14.65   0.000      .120275    .1585357
                  VT  |  -.0344434   .0089941    -3.83   0.000    -.0525271   -.0163596
                  MA  |  -.0107231   .0141023    -0.76   0.451    -.0390776    .0176314
                  RI  |  -.0370099   .0181455    -2.04   0.047    -.0734939   -.0005258
                  CT  |   .1063112   .0166874     6.37   0.000     .0727589    .1398634
                  NY  |   .1779571   .0166606    10.68   0.000     .1444586    .2114555
                  NJ  |   .1830306   .0181252    10.10   0.000     .1465874    .2194738
                  PA  |  -.0226129   .0144799    -1.56   0.125    -.0517267     .006501
                  OH  |   .1465357   .0182306     8.04   0.000     .1098806    .1831908
                  IN  |   .1468188   .0390485     3.76   0.000     .0683065    .2253312
                  IL  |   .1828287   .0139472    13.11   0.000      .154786    .2108715
                  MI  |   .4880275   .0357142    13.66   0.000     .4162194    .5598357
                  WI  |  -.0598936   .0310408    -1.93   0.060    -.1223053    .0025181
                  MN  |  -.0976224   .0145627    -6.70   0.000    -.1269027    -.068342
                  IA  |  -.0989829   .0116402    -8.50   0.000    -.1223872   -.0755787
                  MO  |   .0090554   .0115373     0.78   0.436    -.0141419    .0322528
                  ND  |   -1.08934   .0161595   -67.41   0.000    -1.121831   -1.056849
                  SD  |   -.513616   .0197208   -26.04   0.000    -.5532674   -.4739646
                  NE  |  -.3138785   .0124678   -25.18   0.000    -.3389468   -.2888102
                  KS  |  -.0896705   .0152077    -5.90   0.000    -.1202476   -.0590933
                  DE  |   .2352282   .0136326    17.25   0.000      .207818    .2626384
                  MD  |  -.1690626   .0189922    -8.90   0.000     -.207249   -.1308761
                  DC  |  -.2133754   .0183848   -11.61   0.000    -.2503405   -.1764104
                  VA  |  -.1165931   .0134223    -8.69   0.000    -.1435805   -.0896058
                  NC  |   .0676081   .0105965     6.38   0.000     .0463024    .0889137
                  SC  |   .0661394   .0119193     5.55   0.000     .0421741    .0901047
                  GA  |   .0632433   .0117288     5.39   0.000     .0396609    .0868257
                  FL  |   .0457417   .0191252     2.39   0.021     .0072879    .0841954
                  KY  |   .0830989    .018491     4.49   0.000     .0459203    .1202776
                  TN  |   .0028747   .0136445     0.21   0.834    -.0245594    .0303089
                  AL  |  -.1193265   .0127532    -9.36   0.000    -.1449686   -.0936843
                  MS  |  -.1232931   .0132485    -9.31   0.000     -.149931   -.0966553
                  AR  |  -.0677192   .0118089    -5.73   0.000    -.0914627   -.0439757
                  LA  |  -.1470609   .0158369    -9.29   0.000    -.1789032   -.1152186
                  OK  |  -.2511692   .0479335    -5.24   0.000     -.347546   -.1547925
                  TX  |  -.1416442   .0197014    -7.19   0.000    -.1812565   -.1020318
                  ID  |   .1992957   .0135768    14.68   0.000     .1719976    .2265937
                  WY  |  -.7719627   .0137634   -56.09   0.000    -.7996359   -.7442895
                  CO  |   -.147936   .0126798   -11.67   0.000    -.1734303   -.1224416
                  NM  |  -.3155881   .0132082   -23.89   0.000    -.3421449   -.2890313
                  AZ  |  -.1866475   .0167027   -11.17   0.000    -.2202304   -.1530645
                  UT  |  -.2254274   .0174939   -12.89   0.000    -.2606013   -.1902534
                  NV  |  -.0395577   .0208334    -1.90   0.064    -.0814462    .0023307
                  WA  |  -.2190473   .0115206   -19.01   0.000     -.242211   -.1958835
                  OR  |   .0581591   .0081617     7.13   0.000     .0417489    .0745693
                  CA  |   .1253347    .017981     6.97   0.000     .0891815    .1614878
                  AK  |   .6793408    .015969    42.54   0.000     .6472331    .7114485
                  HI  |  -.0771589   .0165754    -4.66   0.000    -.1104859   -.0438318
                      |
        state#c.lyear |
                  ME  |   .0013513   .0001223    11.05   0.000     .0011054    .0015971
                  NH  |   .0008005   .0002324     3.44   0.001     .0003332    .0012678
                  VT  |   .0018718   .0000622    30.09   0.000     .0017467    .0019968
                  MA  |    .002588    .000084    30.80   0.000      .002419    .0027569
                  RI  |    .002062   .0000722    28.57   0.000     .0019169    .0022071
                  CT  |    .001591   .0000957    16.62   0.000     .0013985    .0017834
                  NY  |    .000606   .0000599    10.12   0.000     .0004856    .0007263
                  NJ  |   .0012477   .0000726    17.18   0.000     .0011017    .0013937
                  PA  |   .0016853   .0000617    27.31   0.000     .0015612    .0018094
                  OH  |  -.0002091   .0000495    -4.22   0.000    -.0003087   -.0001096
                  IN  |   -.000044   .0004081    -0.11   0.915    -.0008644    .0007765
                  IL  |   .0003975   .0000787     5.05   0.000     .0002393    .0005557
                  MI  |  -.0029251   .0003375    -8.67   0.000    -.0036036   -.0022466
                  WI  |   .0020751   .0003008     6.90   0.000     .0014703    .0026798
                  MN  |   .0028858   .0000637    45.33   0.000     .0027578    .0030138
                  IA  |   .0022781   .0000847    26.89   0.000     .0021077    .0024484
                  MO  |   .0010699   .0000796    13.44   0.000     .0009098    .0012299
                  ND  |   .0118623   .0000806   147.22   0.000     .0117003    .0120243
                  SD  |   .0057564    .000049   117.57   0.000      .005658    .0058549
                  NE  |   .0038811   .0001037    37.42   0.000     .0036726    .0040896
                  KS  |   .0019924   .0000742    26.85   0.000     .0018432    .0021416
                  DE  |  -.0005728   .0001105    -5.18   0.000     -.000795   -.0003506
                  MD  |   .0041409     .00009    46.03   0.000       .00396    .0043218
                  DC  |   .0051322   .0001367    37.53   0.000     .0048573    .0054072
                  VA  |   .0034256    .000128    26.76   0.000     .0031682    .0036829
                  NC  |   .0005992   .0001685     3.56   0.001     .0002605     .000938
                  SC  |   .0004426   .0001235     3.58   0.001     .0001943    .0006909
                  GA  |     .00112   .0001313     8.53   0.000      .000856    .0013839
                  FL  |   .0006511     .00007     9.30   0.000     .0005103    .0007918
                  KY  |   .0001674   .0002031     0.82   0.414    -.0002408    .0005757
                  TN  |   .0008745   .0000997     8.77   0.000      .000674     .001075
                  AL  |   .0022993   .0001125    20.43   0.000      .002073    .0025255
                  MS  |   .0021211   .0001211    17.52   0.000     .0018777    .0023646
                  AR  |   .0011426   .0001855     6.16   0.000     .0007696    .0015156
                  LA  |   .0028444   .0001225    23.22   0.000     .0025982    .0030907
                  OK  |   .0031304   .0005303     5.90   0.000     .0020642    .0041966
                  TX  |   .0031265   .0000735    42.55   0.000     .0029787    .0032743
                  ID  |  -.0007331   .0002036    -3.60   0.001    -.0011424   -.0003237
                  WY  |   .0099061    .000063   157.33   0.000     .0097795    .0100327
                  CO  |   .0030636   .0000868    35.30   0.000     .0028891    .0032381
                  NM  |   .0040718   .0002346    17.35   0.000        .0036    .0045436
                  AZ  |   .0033018   .0000917    36.02   0.000     .0031175    .0034861
                  UT  |   .0033254   .0000732    45.40   0.000     .0031781    .0034726
                  NV  |   .0026609   .0000772    34.45   0.000     .0025056    .0028162
                  WA  |   .0044329   .0000906    48.91   0.000     .0042507    .0046151
                  OR  |   .0010915   .0001243     8.78   0.000     .0008415    .0013416
                  CA  |   .0017542   .0000637    27.55   0.000     .0016261    .0018822
                  AK  |  -.0028612   .0000473   -60.44   0.000    -.0029563    -.002766
                  HI  |   .0031484   .0000795    39.61   0.000     .0029885    .0033082
                      |
                 nind |
                   2  |    .094509   .0263615     3.59   0.001     .0415057    .1475123
                   3  |   .1130953   .0217016     5.21   0.000     .0694613    .1567293
                   4  |  -.0697961   .0236238    -2.95   0.005     -.117295   -.0222972
                   5  |   .1526644   .0229965     6.64   0.000     .1064268     .198902
                   6  |   .1079312   .0257276     4.20   0.000     .0562023    .1596601
                   7  |   .0115737   .0248965     0.46   0.644     -.038484    .0616315
                   8  |  -.0473029   .0250344    -1.89   0.065    -.0976379    .0030321
                   9  |  -.0539236   .0279337    -1.93   0.059     -.110088    .0022407
                  10  |  -.0856576   .0258974    -3.31   0.002    -.1377277   -.0335874
                  11  |   .1266106   .0259712     4.88   0.000      .074392    .1788293
                      |
                 educ |   .0678611   .0016908    40.14   0.000     .0644616    .0712606
                exper |    .045754   .0017489    26.16   0.000     .0422376    .0492704
               exper2 |  -.0009476   .0000957    -9.90   0.000    -.0011401   -.0007551
               exper3 |   4.59e-06   2.81e-06     1.63   0.110    -1.07e-06    .0000102
               exper4 |   3.51e-08   2.99e-08     1.17   0.246    -2.50e-08    9.53e-08
                 edex |  -.0004539   .0000611    -7.43   0.000    -.0005767   -.0003311
                      |
                ee_cl |
                   2  |  -.0604359   .0046719   -12.94   0.000    -.0698295   -.0510423
                   3  |  -.0689737   .0062209   -11.09   0.000    -.0814816   -.0564658
                   4  |  -.0275295    .010864    -2.53   0.015    -.0493732   -.0056859
                   5  |  -.1366396   .0057077   -23.94   0.000    -.1481156   -.1251635
                   6  |  -.0876391   .0054411   -16.11   0.000    -.0985793    -.076699
                   7  |  -.0626535   .0068798    -9.11   0.000    -.0764864   -.0488207
                   8  |    .027204   .0117179     2.32   0.025     .0036437    .0507643
                   9  |  -.1550665   .0072667   -21.34   0.000    -.1696773   -.1404557
                  10  |  -.0974256   .0077315   -12.60   0.000    -.1129708   -.0818803
                  11  |  -.0589813    .008281    -7.12   0.000    -.0756314   -.0423313
                  12  |    .029367   .0117834     2.49   0.016      .005675     .053059
                  13  |  -.0790086   .0124633    -6.34   0.000    -.1040677   -.0539495
                  14  |  -.0765057   .0095632    -8.00   0.000    -.0957338   -.0572775
                  15  |  -.0477298   .0095549    -5.00   0.000    -.0669412   -.0285184
                  16  |    .028522   .0127231     2.24   0.030     .0029406    .0541035
                      |
                 marr |   .1232148   .0023384    52.69   0.000     .1185131    .1279165
                partt |  -.2092655   .0061488   -34.03   0.000    -.2216284   -.1969025
               public |   .0164052   .0073826     2.22   0.031     .0015615    .0312489
                 cmsa |   .1443521   .0090801    15.90   0.000     .1260954    .1626088
                      |
                nocc2 |
                   2  |   -.140417   .0035195   -39.90   0.000    -.1474935   -.1333405
                   3  |  -.0393206   .0059833    -6.57   0.000    -.0513508   -.0272903
                   4  |  -.2914872   .0093432   -31.20   0.000    -.3102729   -.2727016
                   5  |  -.0785187   .0069671   -11.27   0.000     -.092527   -.0645103
                   6  |  -.3678562   .0061944   -59.39   0.000    -.3803109   -.3554016
                   7  |  -.2296057   .0053136   -43.21   0.000    -.2402893    -.218922
                   8  |  -.0993711   .0107373    -9.25   0.000    -.1209599   -.0777824
                   9  |  -.3884037   .0035393  -109.74   0.000    -.3955199   -.3812875
                  10  |  -.3272138   .0048173   -67.92   0.000    -.3368996    -.317528
                  11  |  -.2242087   .0053639   -41.80   0.000    -.2349936   -.2134238
                  12  |  -.3776314   .0054361   -69.47   0.000    -.3885613   -.3667015
                      |
                unemp |  -.0059723   .0007073    -8.44   0.000    -.0073944   -.0045502
                      |
              quarter |
                   2  |   .0030649   .0019178     1.60   0.117    -.0007911    .0069209
                   3  |   .0045417   .0018948     2.40   0.020      .000732    .0083515
                   4  |   .0136754   .0015186     9.01   0.000      .010622    .0167288
                      |
                _cons |   .5202662   .0293368    17.73   0.000     .4612807    .5792517
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_mal_all_sltt  

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,958,851,152)

Linear regression                               Number of obs     =  1,058,304
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5032
                                                Root MSE          =       .393

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.066281   .0065713   -10.09   0.000    -.0794934   -.0530686
             treat_st |  -.0317362   .0083337    -3.81   0.000    -.0484923   -.0149801
treat_stblackrelwhite |  -.0396672   .0080039    -4.96   0.000      -.05576   -.0235743
                      |
                state |
                  NH  |   .0568683   .0033953    16.75   0.000     .0500416     .063695
                  VT  |   .0361224   .0007205    50.13   0.000     .0346737    .0375711
                  MA  |   .0993145   .0080051    12.41   0.000     .0832192    .1154099
                  RI  |   .0234937   .0078643     2.99   0.004     .0076815     .039306
                  CT  |   .1105136   .0079565    13.89   0.000      .094516    .1265112
                  NY  |   .0640458   .0074149     8.64   0.000     .0491371    .0789545
                  NJ  |   .1272838   .0085352    14.91   0.000     .1101226    .1444451
                  PA  |  -.0312394   .0063604    -4.91   0.000    -.0440279   -.0184508
                  OH  |  -.0630194   .0060957   -10.34   0.000    -.0752756   -.0507632
                  IN  |  -.0653357   .0045191   -14.46   0.000    -.0744219   -.0562494
                  IL  |   .0013694   .0069446     0.20   0.845    -.0125937    .0153324
                  MI  |  -.0169075   .0061023    -2.77   0.008    -.0291771   -.0046379
                  WI  |  -.0124503   .0044523    -2.80   0.007    -.0214023   -.0034984
                  MN  |   .0470152   .0057566     8.17   0.000     .0354408    .0585897
                  IA  |  -.0281223    .007988    -3.52   0.001    -.0441832   -.0120614
                  MO  |  -.0829618   .0059008   -14.06   0.000    -.0948262   -.0710974
                  ND  |  -.0543446    .008635    -6.29   0.000    -.0717064   -.0369828
                  SD  |  -.0753631   .0083023    -9.08   0.000     -.092056   -.0586703
                  NE  |  -.0653902   .0081581    -8.02   0.000    -.0817932   -.0489872
                  KS  |  -.0638685   .0082326    -7.76   0.000    -.0804213   -.0473157
                  DE  |    .049658   .0023439    21.19   0.000     .0449452    .0543707
                  MD  |   .0949022   .0089891    10.56   0.000     .0768284     .112976
                  DC  |   .1477912   .0116926    12.64   0.000     .1242816    .1713008
                  VA  |   .0547934   .0092583     5.92   0.000     .0361784    .0734084
                  NC  |  -.0335317   .0083334    -4.02   0.000    -.0502871   -.0167763
                  SC  |  -.0751082    .008304    -9.04   0.000    -.0918045   -.0584118
                  GA  |  -.0052465   .0090355    -0.58   0.564    -.0234135    .0129205
                  FL  |  -.0344758   .0097951    -3.52   0.001    -.0541702   -.0147814
                  KY  |  -.0912179   .0037971   -24.02   0.000    -.0988525   -.0835834
                  TN  |  -.0765294   .0085459    -8.96   0.000    -.0937122   -.0593466
                  AL  |  -.0901542   .0083403   -10.81   0.000    -.1069234    -.073385
                  MS  |  -.1147387   .0080528   -14.25   0.000      -.13093   -.0985474
                  AR  |  -.1153653    .008003   -14.42   0.000    -.1314565   -.0992742
                  LA  |  -.0964237   .0092094   -10.47   0.000    -.1149404    -.077907
                  OK  |  -.1354969   .0062528   -21.67   0.000     -.148069   -.1229248
                  TX  |  -.0058941   .0094312    -0.62   0.535    -.0248569    .0130686
                  ID  |  -.0438449   .0080224    -5.47   0.000    -.0599751   -.0277148
                  WY  |   .0024534   .0084907     0.29   0.774    -.0146184    .0195252
                  CO  |   -.006686   .0078763    -0.85   0.400    -.0225225    .0091504
                  NM  |  -.0977857   .0049408   -19.79   0.000    -.1077199   -.0878515
                  AZ  |   .0035109   .0096409     0.36   0.717    -.0158735    .0228953
                  UT  |  -.0500121   .0093498    -5.35   0.000    -.0688112    -.031213
                  NV  |   .0665224   .0099064     6.72   0.000     .0466042    .0864406
                  WA  |   .0571781   .0070958     8.06   0.000      .042911    .0714452
                  OR  |  -.0061041   .0064712    -0.94   0.350    -.0191153     .006907
                  CA  |   .1241083   .0084627    14.67   0.000      .107093    .1411237
                  AK  |   .1807394   .0044997    40.17   0.000     .1716921    .1897867
                  HI  |   .0714766   .0057325    12.47   0.000     .0599506    .0830027
                      |
                 year |
                1990  |   -.006194   .0027617    -2.24   0.030    -.0117469   -.0006412
                1991  |  -.0034173   .0024624    -1.39   0.172    -.0083682    .0015336
                1992  |   .0151858   .0030724     4.94   0.000     .0090084    .0213633
                1993  |   .0127626   .0034598     3.69   0.001     .0058062    .0197189
                1996  |   .0027986   .0039808     0.70   0.485    -.0052053    .0108026
                1997  |   .0156152   .0036733     4.25   0.000     .0082295     .023001
                1998  |   .0441839   .0033651    13.13   0.000     .0374178    .0509499
                1999  |   .0611307   .0039286    15.56   0.000     .0532318    .0690296
                2000  |   .0742298   .0041673    17.81   0.000     .0658508    .0826088
                2001  |   .0854794   .0044723    19.11   0.000     .0764872    .0944716
                2002  |   .0981659    .004634    21.18   0.000     .0888487    .1074831
                2003  |   .1041836   .0043564    23.92   0.000     .0954244    .1129427
                2004  |   .0955754   .0046521    20.54   0.000     .0862218    .1049291
                2005  |    .085845   .0049043    17.50   0.000     .0759843    .0957057
                2006  |   .0813444     .00437    18.61   0.000     .0725579    .0901309
                2007  |   .0810138    .005292    15.31   0.000     .0703734    .0916542
                2008  |      .0736    .006265    11.75   0.000     .0610033    .0861966
                2009  |   .0907341   .0049524    18.32   0.000     .0807766    .1006916
                2010  |   .0884188   .0051965    17.02   0.000     .0779705    .0988671
                2011  |   .0699645   .0053391    13.10   0.000     .0592295    .0806995
                2012  |   .0526417   .0062166     8.47   0.000     .0401425     .065141
                2013  |   .0554008    .006409     8.64   0.000     .0425146     .068287
                2014  |   .0508861   .0060289     8.44   0.000     .0387643    .0630079
                2015  |   .0659159   .0053132    12.41   0.000     .0552331    .0765988
                2016  |    .078108   .0063443    12.31   0.000      .065352    .0908641
                2017  |   .0866631    .007083    12.24   0.000     .0724219    .1009044
                2018  |   .0910988   .0065724    13.86   0.000      .077884    .1043136
                2019  |   .1021826     .00615    16.62   0.000     .0898172    .1145479
                      |
                 nind |
                   2  |   .0625384   .0417198     1.50   0.140     -.021345    .1464217
                   3  |   .1364224   .0391143     3.49   0.001     .0577778     .215067
                   4  |  -.0805382    .039626    -2.03   0.048    -.1602117   -.0008648
                   5  |   .1595676   .0383103     4.17   0.000     .0825395    .2365957
                   6  |   .0923905   .0399505     2.31   0.025     .0120645    .1727164
                   7  |   .0377376   .0413261     0.91   0.366    -.0453541    .1208293
                   8  |  -.0157867   .0423884    -0.37   0.711    -.1010143    .0694408
                   9  |  -.0679494   .0455929    -1.49   0.143    -.1596199    .0237212
                  10  |  -.0777787   .0404651    -1.92   0.061    -.1591393    .0035818
                  11  |   .0745499   .0421724     1.77   0.083    -.0102434    .1593433
                      |
                 educ |   .0913923   .0023507    38.88   0.000      .086666    .0961187
                exper |   .0479354   .0021447    22.35   0.000     .0436233    .0522476
               exper2 |  -.0015759   .0000976   -16.14   0.000    -.0017721   -.0013796
               exper3 |   .0000245   2.74e-06     8.92   0.000      .000019      .00003
               exper4 |  -1.28e-07   2.79e-08    -4.60   0.000    -1.84e-07   -7.21e-08
                 edex |  -.0005238   .0000905    -5.79   0.000    -.0007057   -.0003419
                      |
                ee_cl |
                   2  |  -.1254701   .0051339   -24.44   0.000    -.1357924   -.1151478
                   3  |  -.1635291   .0078287   -20.89   0.000    -.1792697   -.1477885
                   4  |  -.1675094   .0125567   -13.34   0.000    -.1927563   -.1422624
                   5  |   -.152691   .0082569   -18.49   0.000    -.1692927   -.1360894
                   6  |  -.1679094   .0088282   -19.02   0.000    -.1856596   -.1501592
                   7  |  -.1757294   .0102228   -17.19   0.000    -.1962838    -.155175
                   8  |  -.1103409   .0131916    -8.36   0.000    -.1368644   -.0838175
                   9  |  -.1540159   .0101173   -15.22   0.000     -.174358   -.1336738
                  10  |  -.1753121    .010976   -15.97   0.000    -.1973809   -.1532434
                  11  |  -.1695014   .0113093   -14.99   0.000    -.1922402   -.1467626
                  12  |  -.1169491    .011944    -9.79   0.000    -.1409641   -.0929342
                  13  |  -.1078064   .0147775    -7.30   0.000    -.1375186   -.0780943
                  14  |  -.1552573   .0116391   -13.34   0.000    -.1786593   -.1318554
                  15  |  -.1370926   .0119616   -11.46   0.000    -.1611431   -.1130421
                  16  |  -.1029047   .0123939    -8.30   0.000    -.1278244    -.077985
                      |
                 marr |   .0337613   .0022142    15.25   0.000     .0293094    .0382133
                partt |  -.1406901   .0033328   -42.21   0.000    -.1473911    -.133989
               public |   .0604259   .0060572     9.98   0.000     .0482471    .0726048
                 cmsa |   .1531607   .0080539    19.02   0.000     .1369672    .1693542
                      |
                nocc2 |
                   2  |  -.1309388   .0030441   -43.01   0.000    -.1370593   -.1248182
                   3  |  -.0391451   .0068743    -5.69   0.000    -.0529668   -.0253234
                   4  |  -.2798689   .0066558   -42.05   0.000    -.2932513   -.2664864
                   5  |   .0506506   .0062463     8.11   0.000     .0380916    .0632095
                   6  |   -.324395   .0043529   -74.52   0.000    -.3331472   -.3156428
                   7  |  -.3499707   .0042697   -81.97   0.000    -.3585556   -.3413859
                   8  |  -.1644876   .0077893   -21.12   0.000    -.1801491   -.1488261
                   9  |  -.4037794   .0051664   -78.15   0.000    -.4141672   -.3933917
                  10  |    -.40867   .0091123   -44.85   0.000    -.4269914   -.3903486
                  11  |  -.1654367   .0088039   -18.79   0.000     -.183138   -.1477354
                  12  |  -.3813837   .0077694   -49.09   0.000     -.397005   -.3657623
                      |
              quarter |
                   2  |   .0086525   .0013437     6.44   0.000     .0059507    .0113542
                   3  |   .0176829   .0016646    10.62   0.000      .014336    .0210299
                   4  |   .0205111   .0011408    17.98   0.000     .0182173    .0228049
                      |
                _cons |   .3284659   .0440614     7.45   0.000     .2398745    .4170572
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,958,851,152)

Linear regression                               Number of obs     =  1,058,304
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5032
                                                Root MSE          =       .393

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0662911   .0065693   -10.09   0.000    -.0794997   -.0530826
             treat_st |   -.032471    .008711    -3.73   0.001    -.0499858   -.0149563
treat_stblackrelwhite |   -.039669   .0080073    -4.95   0.000    -.0557688   -.0235693
                      |
                state |
                  NH  |   .0538105   .0037279    14.43   0.000     .0463151     .061306
                  VT  |   .0333029   .0015868    20.99   0.000     .0301124    .0364933
                  MA  |   .0994611   .0080049    12.43   0.000     .0833662     .115556
                  RI  |    .026343   .0079524     3.31   0.002     .0103537    .0423323
                  CT  |   .1108464   .0079502    13.94   0.000     .0948613    .1268314
                  NY  |   .0660565   .0074298     8.89   0.000     .0511179    .0809951
                  NJ  |   .1287728   .0085165    15.12   0.000     .1116492    .1458964
                  PA  |  -.0301721   .0063475    -4.75   0.000    -.0429347   -.0174095
                  OH  |  -.0613115   .0061027   -10.05   0.000    -.0735817   -.0490412
                  IN  |  -.0650063   .0045371   -14.33   0.000    -.0741289   -.0558838
                  IL  |   .0040495   .0069513     0.58   0.563    -.0099269     .018026
                  MI  |  -.0127939   .0064096    -2.00   0.052    -.0256812    .0000935
                  WI  |  -.0134256   .0044967    -2.99   0.004    -.0224669   -.0043844
                  MN  |   .0448527   .0059369     7.55   0.000     .0329158    .0567896
                  IA  |   -.030694    .008111    -3.78   0.000    -.0470023   -.0143856
                  MO  |  -.0824028   .0058852   -14.00   0.000    -.0942358   -.0705697
                  ND  |  -.0583457   .0087174    -6.69   0.000    -.0758731   -.0408183
                  SD  |  -.0792186   .0084185    -9.41   0.000    -.0961451   -.0622922
                  NE  |  -.0698929   .0082752    -8.45   0.000    -.0865314   -.0532545
                  KS  |  -.0649488   .0083964    -7.74   0.000    -.0818309   -.0480667
                  DE  |   .0480287   .0026045    18.44   0.000      .042792    .0532653
                  MD  |   .0940535   .0090314    10.41   0.000     .0758946    .1122125
                  DC  |   .1524538   .0115805    13.16   0.000     .1291696     .175738
                  VA  |   .0531639   .0093613     5.68   0.000     .0343417    .0719861
                  NC  |   -.031938   .0087791    -3.64   0.001    -.0495897   -.0142864
                  SC  |  -.0721331   .0090182    -8.00   0.000    -.0902656   -.0540007
                  GA  |  -.0033094   .0094946    -0.35   0.729    -.0223995    .0157807
                  FL  |  -.0324653   .0102382    -3.17   0.003    -.0530505   -.0118801
                  KY  |  -.0889396   .0039962   -22.26   0.000    -.0969745   -.0809046
                  TN  |  -.0747182   .0090173    -8.29   0.000    -.0928487   -.0565877
                  AL  |  -.0873412   .0090048    -9.70   0.000    -.1054466   -.0692358
                  MS  |  -.1099807   .0092069   -11.95   0.000    -.1284924   -.0914691
                  AR  |  -.1134088   .0085523   -13.26   0.000    -.1306044   -.0962133
                  LA  |  -.0931652   .0099146    -9.40   0.000    -.1130998   -.0732307
                  OK  |   -.136444   .0062944   -21.68   0.000    -.1490997   -.1237882
                  TX  |  -.0040843   .0098471    -0.41   0.680    -.0238833    .0157146
                  ID  |  -.0431142   .0083998    -5.13   0.000    -.0600032   -.0262252
                  WY  |   .0009694   .0086815     0.11   0.912    -.0164859    .0184246
                  CO  |  -.0076931   .0079314    -0.97   0.337    -.0236403    .0082541
                  NM  |   -.095884   .0049909   -19.21   0.000    -.1059189   -.0858492
                  AZ  |   .0058198   .0101182     0.58   0.568    -.0145242    .0261638
                  UT  |  -.0516591   .0094673    -5.46   0.000    -.0706943   -.0326239
                  NV  |   .0694236   .0104919     6.62   0.000     .0483283    .0905189
                  WA  |   .0594676   .0071219     8.35   0.000     .0451481    .0737872
                  OR  |  -.0029453   .0065889    -0.45   0.657    -.0161933    .0103026
                  CA  |   .1283263   .0086117    14.90   0.000     .1110112    .1456413
                  AK  |   .1861678   .0050366    36.96   0.000     .1760411    .1962945
                  HI  |   .0686337   .0059881    11.46   0.000     .0565939    .0806735
                      |
                 year |
                1990  |  -.0053421   .0027674    -1.93   0.059    -.0109064    .0002222
                1991  |   .0005058   .0031346     0.16   0.872    -.0057966    .0068082
                1992  |    .020683    .004052     5.10   0.000     .0125359    .0288301
                1993  |   .0167298   .0039213     4.27   0.000     .0088455    .0246142
                1996  |    .002916   .0041785     0.70   0.489    -.0054855    .0113176
                1997  |      .0146   .0036847     3.96   0.000     .0071913    .0220087
                1998  |   .0420439   .0038517    10.92   0.000     .0342996    .0497883
                1999  |   .0583142   .0037586    15.51   0.000      .050757    .0658714
                2000  |   .0709476   .0042166    16.83   0.000     .0624696    .0794256
                2001  |   .0841188   .0044864    18.75   0.000     .0750982    .0931394
                2002  |   .0995181   .0047447    20.97   0.000     .0899783    .1090579
                2003  |   .1061026    .004666    22.74   0.000     .0967209    .1154843
                2004  |   .0963935   .0047124    20.46   0.000     .0869185    .1058685
                2005  |    .085651   .0050364    17.01   0.000     .0755247    .0957774
                2006  |   .0800149   .0044759    17.88   0.000     .0710155    .0890143
                2007  |   .0795728   .0053634    14.84   0.000     .0687889    .0903567
                2008  |   .0750557   .0062553    12.00   0.000     .0624785     .087633
                2009  |   .1009847   .0071823    14.06   0.000     .0865436    .1154257
                2010  |   .0995016   .0063807    15.59   0.000     .0866724    .1123307
                2011  |   .0792159   .0053791    14.73   0.000     .0684005    .0900313
                2012  |   .0597128   .0059037    10.11   0.000     .0478426    .0715831
                2013  |   .0608614   .0062868     9.68   0.000     .0482209     .073502
                2014  |   .0532691    .005734     9.29   0.000     .0417401    .0647982
                2015  |   .0660447   .0052259    12.64   0.000     .0555373    .0765521
                2016  |   .0772528   .0062458    12.37   0.000     .0646947     .089811
                2017  |   .0845261    .007303    11.57   0.000     .0698423    .0992098
                2018  |   .0878403    .007243    12.13   0.000     .0732772    .1024035
                2019  |   .0983899   .0067908    14.49   0.000     .0847361    .1120436
                      |
                 nind |
                   2  |   .0624101   .0417346     1.50   0.141    -.0215028    .1463231
                   3  |   .1363254   .0391318     3.48   0.001     .0576456    .2150052
                   4  |  -.0805888   .0396345    -2.03   0.048    -.1602792   -.0008983
                   5  |   .1595286   .0383071     4.16   0.000      .082507    .2365502
                   6  |   .0923325   .0399639     2.31   0.025     .0119797    .1726853
                   7  |   .0376609   .0413353     0.91   0.367    -.0454494    .1207712
                   8  |  -.0158429   .0423974    -0.37   0.710    -.1010886    .0694027
                   9  |  -.0680315   .0456139    -1.49   0.142    -.1597444    .0236813
                  10  |  -.0778402   .0404689    -1.92   0.060    -.1592084     .003528
                  11  |   .0744437   .0421909     1.76   0.084    -.0103867    .1592741
                      |
                 educ |   .0913885   .0023548    38.81   0.000      .086654    .0961231
                exper |   .0479496   .0021431    22.37   0.000     .0436406    .0522586
               exper2 |   -.001577   .0000975   -16.18   0.000    -.0017731    -.001381
               exper3 |   .0000245   2.74e-06     8.94   0.000      .000019      .00003
               exper4 |  -1.29e-07   2.79e-08    -4.61   0.000    -1.85e-07   -7.25e-08
                 edex |  -.0005238   .0000905    -5.79   0.000    -.0007057   -.0003419
                      |
                ee_cl |
                   2  |    -.12543   .0051455   -24.38   0.000    -.1357758   -.1150842
                   3  |  -.1634658   .0078423   -20.84   0.000    -.1792337   -.1476978
                   4  |  -.1674475   .0125813   -13.31   0.000     -.192744   -.1421511
                   5  |   -.152718   .0082525   -18.51   0.000    -.1693107   -.1361253
                   6  |  -.1678905   .0088396   -18.99   0.000    -.1856638   -.1501172
                   7  |  -.1756619   .0102345   -17.16   0.000    -.1962397    -.155084
                   8  |  -.1102763   .0132166    -8.34   0.000    -.1368501   -.0837025
                   9  |  -.1540156   .0101288   -15.21   0.000    -.1743809   -.1336503
                  10  |  -.1752856   .0109777   -15.97   0.000    -.1973577   -.1532135
                  11  |  -.1694236     .01132   -14.97   0.000    -.1921841   -.1466632
                  12  |   -.116876   .0119631    -9.77   0.000    -.1409293   -.0928226
                  13  |  -.1077816   .0147894    -7.29   0.000    -.1375178   -.0780455
                  14  |   -.155192   .0116405   -13.33   0.000    -.1785968   -.1317873
                  15  |  -.1370078   .0119695   -11.45   0.000    -.1610741   -.1129414
                  16  |  -.1028425   .0124066    -8.29   0.000    -.1277877   -.0778973
                      |
                 marr |   .0337554   .0022116    15.26   0.000     .0293087    .0382021
                partt |  -.1406535   .0033357   -42.17   0.000    -.1473604   -.1339466
               public |   .0604528   .0060511     9.99   0.000     .0482862    .0726194
                 cmsa |   .1531393   .0080564    19.01   0.000     .1369407    .1693379
                      |
                nocc2 |
                   2  |  -.1309553   .0030462   -42.99   0.000    -.1370802   -.1248305
                   3  |  -.0391649   .0068709    -5.70   0.000    -.0529797   -.0253502
                   4  |  -.2798742   .0066511   -42.08   0.000    -.2932472   -.2665012
                   5  |   .0506281    .006249     8.10   0.000     .0380637    .0631926
                   6  |  -.3243964   .0043498   -74.58   0.000    -.3331423   -.3156505
                   7  |  -.3499891   .0042701   -81.96   0.000    -.3585747   -.3414034
                   8  |  -.1644762   .0078001   -21.09   0.000    -.1801592   -.1487931
                   9  |  -.4037819   .0051633   -78.20   0.000    -.4141633   -.3934004
                  10  |  -.4087679   .0091169   -44.84   0.000    -.4270986   -.3904372
                  11  |  -.1654668    .008806   -18.79   0.000    -.1831724   -.1477612
                  12  |  -.3814219   .0077624   -49.14   0.000    -.3970292   -.3658146
                      |
                unemp |  -.0025571   .0012997    -1.97   0.055    -.0051704    .0000562
                      |
              quarter |
                   2  |   .0086624   .0013464     6.43   0.000     .0059553    .0113695
                   3  |   .0176794   .0016657    10.61   0.000     .0143302    .0210286
                   4  |   .0205179   .0011395    18.01   0.000     .0182267     .022809
                      |
                _cons |   .3406227    .046499     7.33   0.000     .2471302    .4341151
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo wagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
(sum of wgt is 8,958,851,152)

Linear regression                               Number of obs     =  1,058,304
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5019
                                                Root MSE          =     .39353

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |   -.067248   .0065121   -10.33   0.000    -.0803414   -.0541546
             treat_st |  -.0571889   .0116938    -4.89   0.000    -.0807008   -.0336769
treat_stblackrelwhite |  -.0389236   .0080671    -4.82   0.000    -.0551435   -.0227036
                      |
                state |
                  NH  |   .1096898   .0090965    12.06   0.000     .0914001    .1279794
                  VT  |  -.1307139   .0079622   -16.42   0.000    -.1467229   -.1147049
                  MA  |  -.1163431   .0135392    -8.59   0.000    -.1435654   -.0891208
                  RI  |  -.2216249   .0160292   -13.83   0.000    -.2538538   -.1893959
                  CT  |   .0514218   .0164983     3.12   0.003     .0182497     .084594
                  NY  |  -.0176757   .0156358    -1.13   0.264    -.0491135    .0137621
                  NJ  |   .0277525   .0176188     1.58   0.122    -.0076724    .0631774
                  PA  |  -.0274113   .0144498    -1.90   0.064    -.0564646     .001642
                  OH  |  -.0684789   .0178355    -3.84   0.000    -.1043397   -.0326182
                  IN  |   -.224206   .0414885    -5.40   0.000    -.3076242   -.1407878
                  IL  |  -.0971711   .0137106    -7.09   0.000    -.1247381    -.069604
                  MI  |  -.0221125   .0368675    -0.60   0.551    -.0962395    .0520145
                  WI  |  -.3350444   .0321897   -10.41   0.000    -.3997661   -.2703227
                  MN  |  -.1242479   .0134149    -9.26   0.000    -.1512204   -.0972753
                  IA  |  -.1369193   .0128041   -10.69   0.000    -.1626638   -.1111749
                  MO  |  -.0095348   .0109655    -0.87   0.389    -.0315823    .0125127
                  ND  |  -.8611285   .0148719   -57.90   0.000    -.8910305   -.8312266
                  SD  |  -.4379032   .0171578   -25.52   0.000    -.4724012   -.4034052
                  NE  |  -.3752657   .0137489   -27.29   0.000    -.4029098   -.3476216
                  KS  |  -.1414818   .0169125    -8.37   0.000    -.1754866    -.107477
                  DE  |   .1667665    .013619    12.25   0.000     .1393838    .1941493
                  MD  |  -.3154805   .0182513   -17.29   0.000    -.3521771   -.2787839
                  DC  |  -.2649227    .019128   -13.85   0.000    -.3033822   -.2264632
                  VA  |  -.1749564   .0142263   -12.30   0.000    -.2035603   -.1463526
                  NC  |   .0455562   .0115571     3.94   0.000      .022319    .0687934
                  SC  |   .0076898   .0119598     0.64   0.523    -.0163571    .0317367
                  GA  |    .160901   .0132291    12.16   0.000     .1343021    .1874998
                  FL  |   .0119903   .0198139     0.61   0.548    -.0278483    .0518288
                  KY  |  -.2104966   .0207418   -10.15   0.000    -.2522007   -.1687925
                  TN  |  -.1403786   .0144886    -9.69   0.000      -.16951   -.1112472
                  AL  |  -.1204242   .0136466    -8.82   0.000    -.1478625   -.0929859
                  MS  |  -.1003396   .0116271    -8.63   0.000    -.1237175   -.0769616
                  AR  |  -.1205073   .0118426   -10.18   0.000    -.1443185   -.0966961
                  LA  |  -.0907777   .0164267    -5.53   0.000    -.1238057   -.0577497
                  OK  |  -.3923681   .0516792    -7.59   0.000    -.4962761   -.2884601
                  TX  |   -.174201   .0193792    -8.99   0.000    -.2131655   -.1352364
                  ID  |   .0680936   .0139607     4.88   0.000     .0400238    .0961635
                  WY  |  -.6847883   .0164771   -41.56   0.000    -.7179177   -.6516588
                  CO  |   -.207948   .0134821   -15.42   0.000    -.2350557   -.1808404
                  NM  |  -.4817117    .006953   -69.28   0.000    -.4956918   -.4677317
                  AZ  |  -.1438497   .0177417    -8.11   0.000    -.1795217   -.1081776
                  UT  |  -.2037171   .0192582   -10.58   0.000    -.2424383    -.164996
                  NV  |   .0699562   .0217901     3.21   0.002     .0261443    .1137682
                  WA  |  -.2950339   .0101024   -29.20   0.000    -.3153461   -.2747217
                  OR  |  -.1879017   .0087824   -21.40   0.000    -.2055599   -.1702435
                  CA  |  -.0684649   .0178973    -3.83   0.000    -.1044499     -.03248
                  AK  |   .3926971   .0152047    25.83   0.000      .362126    .4232681
                  HI  |  -.1323335   .0172549    -7.67   0.000    -.1670269   -.0976401
                      |
        state#c.lyear |
                  ME  |   .0020086   .0001289    15.58   0.000     .0017493    .0022678
                  NH  |   .0015112   .0002312     6.54   0.000     .0010464     .001976
                  VT  |   .0036022   .0000842    42.77   0.000     .0034329    .0037716
                  MA  |   .0040822   .0000938    43.53   0.000     .0038936    .0042708
                  RI  |   .0044088   .0000957    46.07   0.000     .0042164    .0046012
                  CT  |   .0025846   .0000968    26.70   0.000       .00239    .0027792
                  NY  |   .0028157   .0000725    38.83   0.000     .0026699    .0029615
                  NJ  |    .002989   .0000795    37.61   0.000     .0028292    .0031487
                  PA  |   .0019835   .0000695    28.53   0.000     .0018437    .0021232
                  OH  |   .0020851   .0000514    40.53   0.000     .0019817    .0021885
                  IN  |   .0036116    .000442     8.17   0.000     .0027228    .0045003
                  IL  |   .0029833   .0000832    35.86   0.000     .0028161    .0031506
                  MI  |    .002139   .0003672     5.82   0.000     .0014006    .0028774
                  WI  |   .0051514   .0003302    15.60   0.000     .0044874    .0058154
                  MN  |   .0036506   .0000849    42.98   0.000     .0034798    .0038214
                  IA  |   .0032849   .0000997    32.94   0.000     .0030844    .0034854
                  MO  |   .0013114   .0000844    15.53   0.000     .0011416    .0014812
                  ND  |   .0100119   .0000919   108.98   0.000     .0098271    .0101966
                  SD  |   .0057773   .0000608    94.97   0.000      .005655    .0058997
                  NE  |   .0052085   .0001126    46.24   0.000      .004982     .005435
                  KS  |   .0030033   .0000804    37.36   0.000     .0028416    .0031649
                  DE  |   .0007261   .0001576     4.61   0.000     .0004093    .0010429
                  MD  |   .0059396   .0000772    76.93   0.000     .0057844    .0060948
                  DC  |   .0060104   .0001441    41.70   0.000     .0057205    .0063002
                  VA  |   .0044612    .000137    32.57   0.000     .0041858    .0047366
                  NC  |   .0014994   .0001601     9.36   0.000     .0011774    .0018214
                  SC  |   .0014835   .0001344    11.04   0.000     .0012133    .0017537
                  GA  |   .0006664   .0001333     5.00   0.000     .0003984    .0009344
                  FL  |   .0018346   .0000781    23.50   0.000     .0016776    .0019915
                  KY  |   .0032089   .0002365    13.57   0.000     .0027333    .0036845
                  TN  |   .0028875   .0001098    26.30   0.000     .0026667    .0031082
                  AL  |   .0025757   .0001128    22.84   0.000     .0023489    .0028024
                  MS  |   .0021621   .0001252    17.26   0.000     .0019102    .0024139
                  AR  |   .0023342   .0001817    12.85   0.000     .0019689    .0026996
                  LA  |   .0022189   .0001057    20.99   0.000     .0020064    .0024315
                  OK  |   .0046446   .0005842     7.95   0.000       .00347    .0058192
                  TX  |   .0038802   .0000892    43.51   0.000     .0037009    .0040595
                  ID  |   .0012126   .0002076     5.84   0.000     .0007952    .0016301
                  WY  |   .0087289   .0000828   105.41   0.000     .0085624    .0088954
                  CO  |   .0039391   .0000985    40.00   0.000     .0037411    .0041371
                  NM  |   .0057367   .0001977    29.02   0.000     .0053392    .0061341
                  AZ  |   .0036996   .0000889    41.63   0.000      .003521    .0038783
                  UT  |    .003729   .0000833    44.78   0.000     .0035616    .0038965
                  NV  |   .0022663   .0000825    27.47   0.000     .0021004    .0024322
                  WA  |    .005419   .0001156    46.87   0.000     .0051865    .0056514
                  OR  |   .0037976   .0001097    34.61   0.000     .0035769    .0040182
                  CA  |   .0039129   .0000706    55.43   0.000      .003771    .0040548
                  AK  |  -.0000387   .0000542    -0.71   0.478    -.0001477    .0000702
                  HI  |   .0039681   .0000806    49.24   0.000     .0038061    .0041302
                      |
                 nind |
                   2  |   .0651195   .0416552     1.56   0.125     -.018634     .148873
                   3  |   .1363769   .0390815     3.49   0.001     .0577983    .2149555
                   4  |  -.0789613   .0395621    -2.00   0.052    -.1585062    .0005835
                   5  |   .1616154    .038094     4.24   0.000     .0850224    .2382085
                   6  |   .0938118   .0399127     2.35   0.023     .0135619    .1740618
                   7  |   .0393742   .0412418     0.95   0.345     -.043548    .1222964
                   8  |  -.0141184   .0423642    -0.33   0.740    -.0992973    .0710605
                   9  |  -.0660278   .0455595    -1.45   0.154    -.1576313    .0255758
                  10  |  -.0777687   .0403795    -1.93   0.060    -.1589571    .0034197
                  11  |    .076296   .0421095     1.81   0.076    -.0083708    .1609628
                      |
                 educ |    .089667   .0024107    37.20   0.000       .08482    .0945141
                exper |   .0472753   .0021213    22.29   0.000     .0430101    .0515406
               exper2 |  -.0015352   .0000967   -15.88   0.000    -.0017296   -.0013409
               exper3 |   .0000232   2.76e-06     8.42   0.000     .0000177    .0000288
               exper4 |  -1.17e-07   2.83e-08    -4.15   0.000    -1.74e-07   -6.05e-08
                 edex |  -.0005008   .0000911    -5.50   0.000    -.0006838   -.0003177
                      |
                ee_cl |
                   2  |  -.1261773   .0052906   -23.85   0.000    -.1368147   -.1155399
                   3  |  -.1609108   .0080636   -19.96   0.000    -.1771237   -.1446979
                   4  |  -.1610395   .0128711   -12.51   0.000    -.1869186   -.1351604
                   5  |  -.1580309   .0082268   -19.21   0.000     -.174572   -.1414898
                   6  |  -.1696859   .0088437   -19.19   0.000    -.1874674   -.1519044
                   7  |  -.1731491   .0104825   -16.52   0.000    -.1942255   -.1520726
                   8  |  -.1049928   .0135661    -7.74   0.000    -.1322693   -.0777163
                   9  |   -.158166   .0102102   -15.49   0.000    -.1786948   -.1376371
                  10  |   -.174478   .0110598   -15.78   0.000    -.1967152   -.1522408
                  11  |  -.1656193   .0115504   -14.34   0.000     -.188843   -.1423956
                  12  |  -.1114839    .012304    -9.06   0.000    -.1362226   -.0867451
                  13  |   -.110625   .0147915    -7.48   0.000    -.1403652   -.0808848
                  14  |  -.1531773   .0117554   -13.03   0.000    -.1768131   -.1295415
                  15  |  -.1339176   .0122351   -10.95   0.000    -.1585178   -.1093173
                  16  |  -.0993932    .012723    -7.81   0.000    -.1249745   -.0738119
                      |
                 marr |   .0334003   .0021951    15.22   0.000     .0289867    .0378139
                partt |  -.1406254   .0033412   -42.09   0.000    -.1473434   -.1339074
               public |    .060198   .0060234     9.99   0.000     .0480871    .0723089
                 cmsa |   .1529957   .0080828    18.93   0.000     .1367442    .1692471
                      |
                nocc2 |
                   2  |  -.1301857   .0031152   -41.79   0.000    -.1364493   -.1239222
                   3  |  -.0383029   .0069184    -5.54   0.000    -.0522133   -.0243925
                   4  |  -.2787406   .0065984   -42.24   0.000    -.2920075   -.2654737
                   5  |   .0504702   .0062666     8.05   0.000     .0378704      .06307
                   6  |  -.3245871   .0044154   -73.51   0.000    -.3334649   -.3157092
                   7  |  -.3501694   .0043122   -81.20   0.000    -.3588397   -.3414991
                   8  |  -.1633763   .0078742   -20.75   0.000    -.1792083   -.1475442
                   9  |  -.4037816   .0052075   -77.54   0.000     -.414252   -.3933111
                  10  |  -.4103443   .0092583   -44.32   0.000    -.4289593   -.3917292
                  11  |  -.1642311   .0086273   -19.04   0.000    -.1815774   -.1468848
                  12  |  -.3819354   .0078514   -48.65   0.000    -.3977216   -.3661491
                      |
                unemp |  -.0022661   .0004998    -4.53   0.000    -.0032711   -.0012611
                      |
              quarter |
                   2  |   .0083641   .0013241     6.32   0.000     .0057018    .0110263
                   3  |   .0173222   .0016127    10.74   0.000     .0140797    .0205647
                   4  |   .0201888   .0011577    17.44   0.000     .0178611    .0225165
                      |
                _cons |   .2088119   .0444612     4.70   0.000     .1194166    .2982072
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo wagstagdid_fem_all_sltt

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 7,539,358,569)

Linear regression                               Number of obs     =    860,332
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5399
                                                Root MSE          =     .42009

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1591688   .0050186   -31.72   0.000    -.1692594   -.1490782
             treat_st |  -.0265728   .0135839    -1.96   0.056    -.0538849    .0007394
treat_stblackrelwhite |  -.0031658   .0081096    -0.39   0.698    -.0194712    .0131397
                      |
                state |
                  NH  |   .0946823   .0037627    25.16   0.000     .0871169    .1022477
                  VT  |   .0390814   .0006028    64.83   0.000     .0378694    .0402934
                  MA  |   .1151866   .0085621    13.45   0.000     .0979714    .1324018
                  RI  |   .0234195   .0082513     2.84   0.007     .0068291    .0400098
                  CT  |   .1225749   .0085033    14.42   0.000     .1054779    .1396718
                  NY  |   .0689874    .007957     8.67   0.000     .0529887    .0849861
                  NJ  |   .1502095   .0091449    16.43   0.000     .1318225    .1685965
                  PA  |   .0004434     .00658     0.07   0.947    -.0127865    .0136733
                  OH  |  -.0329763   .0064312    -5.13   0.000    -.0459071   -.0200455
                  IN  |  -.0049057   .0049527    -0.99   0.327    -.0148637    .0050523
                  IL  |   .0569465   .0073961     7.70   0.000     .0420756    .0718174
                  MI  |   .0152938   .0063826     2.40   0.021     .0024607    .0281268
                  WI  |     .01334   .0047754     2.79   0.007     .0037383    .0229417
                  MN  |   .0555003   .0063496     8.74   0.000     .0427336    .0682671
                  IA  |   .0097913   .0132481     0.74   0.463    -.0168457    .0364283
                  MO  |  -.0368229   .0060085    -6.13   0.000    -.0489038    -.024742
                  ND  |   .0336233    .014028     2.40   0.020     .0054181    .0618285
                  SD  |  -.0354862    .013414    -2.65   0.011    -.0624569   -.0085154
                  NE  |   -.025932    .013372    -1.94   0.058    -.0528181    .0009542
                  KS  |  -.0132031   .0133068    -0.99   0.326    -.0399583     .013552
                  DE  |   .0609064   .0017105    35.61   0.000     .0574672    .0643456
                  MD  |   .1304637    .009004    14.49   0.000       .11236    .1485674
                  DC  |    .185242   .0114304    16.21   0.000     .1622596    .2082245
                  VA  |   .1219844   .0138646     8.80   0.000     .0941078     .149861
                  NC  |   .0141355   .0133308     1.06   0.294    -.0126679    .0409389
                  SC  |  -.0022357    .013147    -0.17   0.866    -.0286695    .0241981
                  GA  |   .0542814   .0137089     3.96   0.000     .0267177    .0818451
                  FL  |  -.0146909   .0141291    -1.04   0.304    -.0430994    .0137177
                  KY  |  -.0425131   .0039566   -10.74   0.000    -.0504683    -.034558
                  TN  |  -.0335517   .0133402    -2.52   0.015    -.0603741   -.0067294
                  AL  |  -.0117469   .0132549    -0.89   0.380    -.0383976    .0149039
                  MS  |  -.0264496   .0133853    -1.98   0.054    -.0533625    .0004633
                  AR  |  -.0710537   .0132974    -5.34   0.000    -.0977898   -.0443175
                  LA  |    .020112   .0136744     1.47   0.148    -.0073821    .0476062
                  OK  |  -.0486301   .0084129    -5.78   0.000    -.0655453   -.0317149
                  TX  |   .0581956   .0139287     4.18   0.000       .03019    .0862012
                  ID  |  -.0038519   .0131234    -0.29   0.770    -.0302384    .0225346
                  WY  |   .1622714   .0148204    10.95   0.000      .132473    .1920699
                  CO  |   .0432117    .008113     5.33   0.000     .0268994     .059524
                  NM  |  -.0219467   .0055212    -3.97   0.000    -.0330478   -.0108455
                  AZ  |   .0262222   .0139614     1.88   0.066    -.0018491    .0542935
                  UT  |   .0032325   .0138296     0.23   0.816    -.0245738    .0310388
                  NV  |   .0827999   .0140462     5.89   0.000      .054558    .1110417
                  WA  |   .0857384   .0076337    11.23   0.000     .0703897    .1010871
                  OR  |   .0159395   .0068562     2.32   0.024     .0021542    .0297249
                  CA  |   .1445931    .008858    16.32   0.000      .126783    .1624033
                  AK  |   .2298387   .0047944    47.94   0.000      .220199    .2394785
                  HI  |   .1146286   .0062501    18.34   0.000      .102062    .1271953
                      |
                 year |
                1990  |  -.0097148   .0029694    -3.27   0.002    -.0156852   -.0037445
                1991  |  -.0236682   .0044783    -5.29   0.000    -.0326726   -.0146639
                1992  |  -.0238965   .0038269    -6.24   0.000    -.0315911    -.016202
                1993  |  -.0323262   .0036109    -8.95   0.000    -.0395864   -.0250661
                1996  |  -.0357831   .0061417    -5.83   0.000    -.0481318   -.0234345
                1997  |  -.0185856    .005737    -3.24   0.002    -.0301206   -.0070507
                1998  |   .0081683   .0054473     1.50   0.140    -.0027842    .0191208
                1999  |   .0339082   .0066272     5.12   0.000     .0205834     .047233
                2000  |    .044429   .0058454     7.60   0.000     .0326761    .0561819
                2001  |   .0618642   .0062443     9.91   0.000     .0493092    .0744192
                2002  |   .0691359   .0050643    13.65   0.000     .0589534    .0793183
                2003  |   .0572047   .0066536     8.60   0.000     .0438267    .0705827
                2004  |   .0501204    .005715     8.77   0.000     .0386297    .0616111
                2005  |   .0365592   .0065443     5.59   0.000      .023401    .0497174
                2006  |   .0329924   .0057324     5.76   0.000     .0214666    .0445183
                2007  |   .0328216   .0068738     4.77   0.000     .0190009    .0466423
                2008  |   .0285048   .0070286     4.06   0.000     .0143728    .0426367
                2009  |   .0422049   .0083708     5.04   0.000     .0253742    .0590356
                2010  |   .0305734   .0075064     4.07   0.000     .0154807    .0456661
                2011  |   .0080243   .0072967     1.10   0.277    -.0066468    .0226953
                2012  |   .0080963   .0083743     0.97   0.338    -.0087414    .0249339
                2013  |    .005206   .0085673     0.61   0.546    -.0120196    .0224317
                2014  |   .0016526   .0092836     0.18   0.859    -.0170134    .0203186
                2015  |   .0261907   .0071164     3.68   0.001     .0118821    .0404992
                2016  |   .0422707   .0074983     5.64   0.000     .0271944    .0573471
                2017  |   .0455155   .0083413     5.46   0.000     .0287442    .0622868
                2018  |   .0564512   .0083997     6.72   0.000     .0395626    .0733399
                2019  |   .0783602   .0084459     9.28   0.000     .0613785    .0953419
                      |
                 nind |
                   2  |   .0524873   .0237237     2.21   0.032     .0047875     .100187
                   3  |   .1056921   .0222992     4.74   0.000     .0608564    .1505277
                   4  |  -.0620209   .0244124    -2.54   0.014    -.1111053   -.0129364
                   5  |   .1039469   .0239619     4.34   0.000     .0557683    .1521256
                   6  |   .1069532   .0268672     3.98   0.000      .052933    .1609734
                   7  |   .0119732   .0257972     0.46   0.645    -.0398955    .0638419
                   8  |   -.040112   .0262698    -1.53   0.133    -.0929308    .0127069
                   9  |  -.0735676   .0264585    -2.78   0.008    -.1267659   -.0203692
                  10  |  -.0838198   .0260336    -3.22   0.002    -.1361639   -.0314756
                  11  |   .0926763    .026825     3.45   0.001      .038741    .1466116
                      |
                 educ |   .0648589   .0017906    36.22   0.000     .0612588    .0684591
                exper |   .0405671   .0017899    22.66   0.000     .0369682     .044166
               exper2 |  -.0007238    .000088    -8.23   0.000    -.0009007   -.0005469
               exper3 |  -2.50e-06   2.91e-06    -0.86   0.394    -8.35e-06    3.35e-06
               exper4 |   1.16e-07   3.33e-08     3.49   0.001     4.94e-08    1.83e-07
                 edex |  -.0003385    .000078    -4.34   0.000    -.0004953   -.0001817
                      |
                ee_cl |
                   2  |  -.0636452   .0044797   -14.21   0.000    -.0726522   -.0546381
                   3  |  -.0760405   .0055321   -13.75   0.000    -.0871635   -.0649174
                   4  |  -.0266357   .0093662    -2.84   0.007    -.0454677   -.0078038
                   5  |  -.1246111   .0053152   -23.44   0.000     -.135298   -.1139242
                   6  |  -.0983095   .0056892   -17.28   0.000    -.1097484   -.0868705
                   7  |  -.0793179   .0069798   -11.36   0.000    -.0933518   -.0652839
                   8  |   .0382157   .0100631     3.80   0.000     .0179825     .058449
                   9  |  -.1501203   .0070379   -21.33   0.000    -.1642708   -.1359697
                  10  |  -.1146358   .0079135   -14.49   0.000     -.130547   -.0987246
                  11  |  -.0696263   .0081018    -8.59   0.000    -.0859161   -.0533364
                  12  |   .0408042   .0107892     3.78   0.000     .0191112    .0624973
                  13  |  -.0899921   .0131578    -6.84   0.000    -.1164476   -.0635366
                  14  |  -.0876848   .0101995    -8.60   0.000    -.1081922   -.0671774
                  15  |  -.0508413    .009707    -5.24   0.000    -.0703586    -.031324
                  16  |   .0394429   .0120172     3.28   0.002     .0152807    .0636052
                      |
                 marr |   .1292285   .0025701    50.28   0.000      .124061    .1343961
                partt |   -.207713   .0047188   -44.02   0.000    -.2172008   -.1982252
               public |   -.010154   .0061084    -1.66   0.103    -.0224357    .0021278
                 cmsa |   .1386819   .0082013    16.91   0.000      .122192    .1551718
                      |
                nocc2 |
                   2  |  -.1488606   .0038182   -38.99   0.000    -.1565376   -.1411836
                   3  |   -.039045   .0063385    -6.16   0.000    -.0517894   -.0263007
                   4  |  -.3312771   .0073977   -44.78   0.000    -.3461511   -.3164031
                   5  |  -.0965412   .0084328   -11.45   0.000    -.1134965   -.0795858
                   6  |   -.392035   .0066326   -59.11   0.000    -.4053707   -.3786993
                   7  |  -.2476016   .0065517   -37.79   0.000    -.2607747   -.2344285
                   8  |  -.1108996   .0102154   -10.86   0.000     -.131439   -.0903601
                   9  |  -.4346031   .0057583   -75.47   0.000     -.446181   -.4230252
                  10  |  -.3730502   .0060585   -61.57   0.000    -.3852316   -.3608688
                  11  |   -.275678   .0062977   -43.77   0.000    -.2883405   -.2630156
                  12  |  -.4366213   .0087314   -50.01   0.000     -.454177   -.4190657
                      |
              quarter |
                   2  |    .004039   .0018321     2.20   0.032     .0003554    .0077226
                   3  |   .0048407   .0018415     2.63   0.011     .0011381    .0085434
                   4  |   .0156318   .0017382     8.99   0.000     .0121368    .0191267
                      |
                _cons |   .6950321   .0238432    29.15   0.000     .6470922     .742972
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 7,539,358,569)

Linear regression                               Number of obs     =    860,332
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5400
                                                Root MSE          =     .42006

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1592085   .0050205   -31.71   0.000    -.1693029   -.1491142
             treat_st |  -.0284881   .0143038    -1.99   0.052    -.0572477    .0002716
treat_stblackrelwhite |  -.0031551   .0081377    -0.39   0.700     -.019517    .0132068
                      |
                state |
                  NH  |   .0868265   .0045035    19.28   0.000     .0777716    .0958815
                  VT  |    .031837   .0018723    17.00   0.000     .0280724    .0356015
                  MA  |   .1156361   .0085719    13.49   0.000     .0984012     .132871
                  RI  |   .0307658   .0083534     3.68   0.001       .01397    .0475615
                  CT  |   .1234908   .0084977    14.53   0.000     .1064051    .1405765
                  NY  |   .0742087   .0080925     9.17   0.000     .0579375    .0904798
                  NJ  |   .1541572   .0091373    16.87   0.000     .1357855    .1725289
                  PA  |   .0032469   .0065443     0.50   0.622    -.0099113     .016405
                  OH  |  -.0285306   .0063817    -4.47   0.000    -.0413619   -.0156992
                  IN  |  -.0039741    .005021    -0.79   0.433    -.0140696    .0061213
                  IL  |   .0639421   .0075187     8.50   0.000     .0488248    .0790595
                  MI  |   .0259543   .0072007     3.60   0.001     .0114764    .0404323
                  WI  |   .0108285   .0047639     2.27   0.028     .0012501    .0204069
                  MN  |   .0499005   .0067218     7.42   0.000     .0363854    .0634156
                  IA  |   .0031476    .012924     0.24   0.809    -.0228378    .0291329
                  MO  |  -.0353733   .0059807    -5.91   0.000    -.0473984   -.0233482
                  ND  |   .0231572    .013569     1.71   0.094    -.0041251    .0504394
                  SD  |  -.0454673    .012792    -3.55   0.001    -.0711874   -.0197472
                  NE  |  -.0375423    .012628    -2.97   0.005    -.0629325   -.0121521
                  KS  |  -.0160552   .0133193    -1.21   0.234    -.0428355    .0107252
                  DE  |   .0566159   .0018527    30.56   0.000     .0528909     .060341
                  MD  |   .1283585   .0090399    14.20   0.000     .1101826    .1465344
                  DC  |   .1973414    .012111    16.29   0.000     .1729907    .2216922
                  VA  |   .1178093   .0136395     8.64   0.000     .0903853    .1452333
                  NC  |   .0180816   .0142425     1.27   0.210    -.0105548    .0467181
                  SC  |    .005327   .0146633     0.36   0.718    -.0241556    .0348096
                  GA  |   .0593548    .014781     4.02   0.000     .0296355     .089074
                  FL  |  -.0093917   .0152184    -0.62   0.540    -.0399903    .0212069
                  KY  |  -.0365892   .0043029    -8.50   0.000    -.0452408   -.0279376
                  TN  |  -.0287717   .0143897    -2.00   0.051    -.0577041    .0001607
                  AL  |  -.0044575   .0147081    -0.30   0.763    -.0340302    .0251152
                  MS  |  -.0140916   .0157959    -0.89   0.377    -.0458514    .0176683
                  AR  |  -.0659454   .0144102    -4.58   0.000     -.094919   -.0369718
                  LA  |   .0287196   .0152583     1.88   0.066    -.0019592    .0593984
                  OK  |  -.0510799   .0083321    -6.13   0.000    -.0678327   -.0343271
                  TX  |   .0629208   .0148736     4.23   0.000     .0330154    .0928262
                  ID  |  -.0019066   .0138221    -0.14   0.891    -.0296978    .0258846
                  WY  |   .1585031   .0149939    10.57   0.000     .1283558    .1886504
                  CO  |   .0406128    .008201     4.95   0.000     .0241236    .0571021
                  NM  |  -.0166368   .0054673    -3.04   0.004    -.0276295    -.005644
                  AZ  |   .0322277   .0151415     2.13   0.038     .0017837    .0626718
                  UT  |  -.0010105   .0137112    -0.07   0.942    -.0285787    .0265576
                  NV  |   .0903237   .0155435     5.81   0.000     .0590714     .121576
                  WA  |   .0916956   .0076335    12.01   0.000     .0763475    .1070437
                  OR  |   .0241689   .0069151     3.50   0.001     .0102652    .0380726
                  CA  |   .1554923   .0092132    16.88   0.000      .136968    .1740166
                  AK  |   .2440589   .0059005    41.36   0.000     .2321952    .2559227
                  HI  |   .1073874   .0065489    16.40   0.000       .09422    .1205548
                      |
                 year |
                1990  |  -.0077215   .0030909    -2.50   0.016    -.0139361   -.0015068
                1991  |  -.0138604   .0058254    -2.38   0.021    -.0255732   -.0021477
                1992  |  -.0101286   .0053582    -1.89   0.065    -.0209021    .0006448
                1993  |  -.0225539   .0043891    -5.14   0.000    -.0313788   -.0137289
                1996  |   -.035803   .0057416    -6.24   0.000    -.0473472   -.0242588
                1997  |  -.0215969   .0050153    -4.31   0.000    -.0316808   -.0115131
                1998  |   .0023214   .0045982     0.50   0.616    -.0069239    .0115667
                1999  |   .0262797   .0060167     4.37   0.000     .0141823    .0383771
                2000  |   .0356104   .0060326     5.90   0.000     .0234809    .0477398
                2001  |   .0580679   .0059565     9.75   0.000     .0460916    .0700442
                2002  |   .0724531   .0048623    14.90   0.000     .0626769    .0822294
                2003  |   .0619174   .0067586     9.16   0.000     .0483282    .0755065
                2004  |   .0519106   .0058563     8.86   0.000     .0401357    .0636855
                2005  |   .0357606    .006482     5.52   0.000     .0227277    .0487935
                2006  |   .0293113   .0055907     5.24   0.000     .0180705    .0405522
                2007  |   .0286846   .0067902     4.22   0.000      .015032    .0423372
                2008  |   .0318961   .0065967     4.84   0.000     .0186325    .0451598
                2009  |   .0683842    .011521     5.94   0.000     .0452197    .0915487
                2010  |   .0589907   .0099899     5.91   0.000     .0389048    .0790767
                2011  |   .0317569   .0096622     3.29   0.002     .0123298    .0511841
                2012  |   .0259975   .0103141     2.52   0.015     .0052596    .0467353
                2013  |   .0189378   .0094314     2.01   0.050    -.0000253    .0379009
                2014  |   .0074516   .0087032     0.86   0.396    -.0100472    .0249505
                2015  |   .0261591     .00656     3.99   0.000     .0129694    .0393489
                2016  |   .0397574   .0069904     5.69   0.000     .0257022    .0538126
                2017  |   .0396643   .0081462     4.87   0.000     .0232852    .0560434
                2018  |   .0477066   .0082993     5.75   0.000     .0310198    .0643935
                2019  |   .0681722   .0087165     7.82   0.000     .0506466    .0856978
                      |
                 nind |
                   2  |   .0525202   .0236968     2.22   0.031     .0048746    .1001657
                   3  |   .1057397   .0222775     4.75   0.000     .0609478    .1505316
                   4  |  -.0619002   .0243792    -2.54   0.014    -.1109179   -.0128825
                   5  |   .1040791   .0239011     4.35   0.000     .0560226    .1521356
                   6  |   .1070738   .0268297     3.99   0.000      .053129    .1610186
                   7  |   .0120711    .025763     0.47   0.642    -.0397288    .0638711
                   8  |  -.0399789   .0262378    -1.52   0.134    -.0927336    .0127759
                   9  |  -.0734456   .0264279    -2.78   0.008    -.1265825   -.0203087
                  10  |  -.0836506   .0259798    -3.22   0.002    -.1358865   -.0314148
                  11  |   .0927988   .0267859     3.46   0.001     .0389423    .1466554
                      |
                 educ |   .0648674   .0017858    36.32   0.000     .0612768    .0684581
                exper |   .0406202   .0017857    22.75   0.000     .0370299    .0442106
               exper2 |  -.0007273   .0000887    -8.20   0.000    -.0009057   -.0005489
               exper3 |  -2.39e-06   2.93e-06    -0.82   0.418    -8.29e-06    3.50e-06
               exper4 |   1.15e-07   3.35e-08     3.44   0.001     4.78e-08    1.83e-07
                 edex |   -.000339   .0000775    -4.37   0.000    -.0004948   -.0001832
                      |
                ee_cl |
                   2  |  -.0634882   .0044945   -14.13   0.000    -.0725251   -.0544514
                   3  |  -.0758975   .0055522   -13.67   0.000    -.0870609   -.0647342
                   4  |  -.0265175   .0093916    -2.82   0.007    -.0454006   -.0076345
                   5  |  -.1246653   .0053176   -23.44   0.000     -.135357   -.1139736
                   6  |  -.0982458   .0056726   -17.32   0.000    -.1096514   -.0868402
                   7  |  -.0791579   .0069934   -11.32   0.000    -.0932191   -.0650967
                   8  |   .0384217   .0100937     3.81   0.000      .018127    .0587165
                   9  |  -.1500558   .0070391   -21.32   0.000    -.1642088   -.1359028
                  10  |  -.1145719   .0079007   -14.50   0.000    -.1304572   -.0986866
                  11  |  -.0694253   .0081293    -8.54   0.000    -.0857704   -.0530802
                  12  |   .0410013   .0108168     3.79   0.000     .0192527    .0627499
                  13  |  -.0900702   .0131143    -6.87   0.000    -.1164383    -.063702
                  14  |  -.0876324   .0101976    -8.59   0.000    -.1081361   -.0671287
                  15  |  -.0507409   .0097087    -5.23   0.000    -.0702616   -.0312202
                  16  |   .0395812   .0120295     3.29   0.002     .0153943    .0637682
                      |
                 marr |   .1292419   .0025699    50.29   0.000     .1240747     .134409
                partt |  -.2074903   .0047448   -43.73   0.000    -.2170304   -.1979503
               public |  -.0101485   .0060954    -1.66   0.102    -.0224041    .0021071
                 cmsa |   .1386007   .0082092    16.88   0.000     .1220949    .1551065
                      |
                nocc2 |
                   2  |   -.148838   .0038277   -38.88   0.000    -.1565341   -.1411418
                   3  |  -.0390244   .0063422    -6.15   0.000    -.0517762   -.0262726
                   4  |  -.3312539   .0073908   -44.82   0.000     -.346114   -.3163938
                   5  |  -.0965475   .0084413   -11.44   0.000    -.1135198   -.0795752
                   6  |  -.3919618   .0066572   -58.88   0.000    -.4053469   -.3785767
                   7  |  -.2475429   .0065823   -37.61   0.000    -.2607776   -.2343083
                   8  |  -.1110077   .0102503   -10.83   0.000    -.1316173   -.0903982
                   9  |  -.4345107   .0057974   -74.95   0.000    -.4461671   -.4228542
                  10  |  -.3730245   .0060695   -61.46   0.000    -.3852281    -.360821
                  11  |   -.275663   .0063051   -43.72   0.000    -.2883401   -.2629858
                  12  |  -.4365951   .0087533   -49.88   0.000    -.4541947   -.4189955
                      |
                unemp |  -.0066346   .0019202    -3.46   0.001    -.0104955   -.0027738
                      |
              quarter |
                   2  |   .0040229   .0018237     2.21   0.032     .0003561    .0076897
                   3  |   .0048172     .00185     2.60   0.012     .0010974     .008537
                   4  |   .0155823   .0017347     8.98   0.000     .0120944    .0190703
                      |
                _cons |   .7262754   .0299171    24.28   0.000     .6661232    .7864277
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_mal_all_unemp 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
(sum of wgt is 7,539,358,569)

Linear regression                               Number of obs     =    860,332
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5391
                                                Root MSE          =     .42046

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1596011    .004967   -32.13   0.000    -.1695879   -.1496142
             treat_st |  -.0199044   .0113531    -1.75   0.086    -.0427313    .0029225
treat_stblackrelwhite |  -.0035185   .0081986    -0.43   0.670    -.0200029    .0129659
                      |
                state |
                  NH  |    .262047   .0088929    29.47   0.000     .2441666    .2799273
                  VT  |   .0972941   .0084141    11.56   0.000     .0803764    .1142119
                  MA  |   .0565656   .0139471     4.06   0.000     .0285231    .0846082
                  RI  |   .0356722   .0174076     2.05   0.046     .0006719    .0706725
                  CT  |   .1899228   .0165456    11.48   0.000     .1566556      .22319
                  NY  |   .2215398    .016282    13.61   0.000     .1888026     .254277
                  NJ  |   .2541592   .0184479    13.78   0.000     .2170672    .2912513
                  PA  |    .016549   .0139932     1.18   0.243    -.0115862    .0446843
                  OH  |   .1152703   .0185991     6.20   0.000     .0778744    .1526662
                  IN  |   .1088791   .0423622     2.57   0.013     .0237042     .194054
                  IL  |    .186423   .0144578    12.89   0.000     .1573536    .2154924
                  MI  |   .3908482   .0375992    10.40   0.000     .3152499    .4664465
                  WI  |  -.0574497   .0328906    -1.75   0.087    -.1235806    .0086812
                  MN  |  -.1006941   .0143286    -7.03   0.000    -.1295036   -.0718846
                  IA  |   -.141213   .0126157   -11.19   0.000    -.1665786   -.1158474
                  MO  |  -.0186017    .011024    -1.69   0.098     -.040767    .0035637
                  ND  |  -1.094196   .0150208   -72.85   0.000    -1.124398   -1.063995
                  SD  |    -.50711   .0189634   -26.74   0.000    -.5452384   -.4689816
                  NE  |  -.2694818   .0134147   -20.09   0.000     -.296454   -.2425097
                  KS  |  -.0875387   .0156363    -5.60   0.000    -.1189776   -.0560999
                  DE  |    .221306   .0132772    16.67   0.000     .1946105    .2480015
                  MD  |   -.077252   .0179207    -4.31   0.000    -.1132839     -.04122
                  DC  |  -.1315856   .0173902    -7.57   0.000     -.166551   -.0966202
                  VA  |  -.0661542   .0136945    -4.83   0.000     -.093689   -.0386195
                  NC  |   .1693888    .011532    14.69   0.000     .1462021    .1925755
                  SC  |   .1679982   .0127417    13.18   0.000     .1423793    .1936171
                  GA  |   .1264289   .0125785    10.05   0.000     .1011382    .1517197
                  FL  |   .1146112   .0189711     6.04   0.000     .0764673     .152755
                  KY  |   .1051223   .0196647     5.35   0.000     .0655839    .1446607
                  TN  |   .0676801   .0144545     4.68   0.000     .0386172    .0967429
                  AL  |  -.1112325    .014155    -7.86   0.000     -.139693    -.082772
                  MS  |  -.0801139   .0130181    -6.15   0.000    -.1062887   -.0539392
                  AR  |  -.0102029    .012304    -0.83   0.411    -.0349418     .014536
                  LA  |  -.0926952   .0159725    -5.80   0.000      -.12481   -.0605805
                  OK  |  -.1829021   .0508359    -3.60   0.001    -.2851145   -.0806898
                  TX  |  -.0657274   .0195678    -3.36   0.002     -.105071   -.0263838
                  ID  |   .2472793   .0131727    18.77   0.000     .2207939    .2737648
                  WY  |  -.7264124   .0141724   -51.26   0.000     -.754908   -.6979169
                  CO  |  -.1001183   .0126915    -7.89   0.000    -.1256363   -.0746003
                  NM  |  -.1995699   .0120743   -16.53   0.000    -.2238469   -.1752929
                  AZ  |  -.0828683   .0170783    -4.85   0.000    -.1172065     -.04853
                  UT  |  -.1429663   .0172523    -8.29   0.000    -.1776543   -.1082782
                  NV  |   .0304406   .0201965     1.51   0.138    -.0101672    .0710484
                  WA  |  -.3039393   .0116444   -26.10   0.000    -.3273518   -.2805267
                  OR  |   .0518108   .0084925     6.10   0.000     .0347354    .0688861
                  CA  |   .1313674   .0176298     7.45   0.000     .0959204    .1668145
                  AK  |   .7096023   .0160357    44.25   0.000     .6773603    .7418443
                  HI  |  -.1503197    .017888    -8.40   0.000     -.186286   -.1143535
                      |
        state#c.lyear |
                  ME  |   .0021782   .0001226    17.77   0.000     .0019318    .0024247
                  NH  |   .0005371   .0002291     2.34   0.023     .0000765    .0009976
                  VT  |   .0015517   .0000652    23.79   0.000     .0014205    .0016828
                  MA  |    .002748   .0000865    31.77   0.000     .0025741    .0029219
                  RI  |   .0021356   .0000657    32.53   0.000     .0020036    .0022676
                  CT  |   .0015403   .0000834    18.47   0.000     .0013726    .0017081
                  NY  |   .0007443   .0000619    12.02   0.000     .0006197    .0008688
                  NJ  |   .0012223    .000057    21.44   0.000     .0011076    .0013369
                  PA  |    .002051     .00006    34.16   0.000     .0019303    .0021718
                  OH  |   .0007973   .0000429    18.58   0.000      .000711    .0008836
                  IN  |    .001081   .0004369     2.47   0.017     .0002025    .0019595
                  IL  |   .0009864   .0000641    15.40   0.000     .0008576    .0011151
                  MI  |  -.0013832   .0003591    -3.85   0.000    -.0021052   -.0006612
                  WI  |   .0028206   .0003233     8.72   0.000     .0021705    .0034708
                  MN  |   .0036349   .0000672    54.07   0.000     .0034997      .00377
                  IA  |   .0035024   .0000825    42.43   0.000     .0033365    .0036684
                  MO  |   .0020184   .0000812    24.85   0.000     .0018551    .0021817
                  ND  |   .0128287   .0000918   139.69   0.000     .0126441    .0130134
                  SD  |   .0066384   .0000481   137.99   0.000     .0065417    .0067352
                  NE  |   .0043443    .000104    41.76   0.000     .0041352    .0045535
                  KS  |   .0027999   .0000717    39.03   0.000     .0026557    .0029441
                  DE  |   .0004806   .0000916     5.25   0.000     .0002964    .0006647
                  MD  |   .0041486   .0000839    49.45   0.000       .00398    .0043173
                  DC  |   .0053118   .0001076    49.35   0.000     .0050954    .0055282
                  VA  |   .0038861   .0001268    30.64   0.000     .0036312    .0041411
                  NC  |   .0006323   .0001514     4.18   0.000     .0003279    .0009368
                  SC  |   .0005206   .0001112     4.68   0.000      .000297    .0007441
                  GA  |   .0014513   .0001211    11.99   0.000     .0012079    .0016947
                  FL  |   .0009193   .0000714    12.88   0.000     .0007758    .0010628
                  KY  |   .0008089   .0002123     3.81   0.000     .0003822    .0012357
                  TN  |   .0011693   .0000945    12.38   0.000     .0009794    .0013593
                  AL  |   .0031276   .0000991    31.55   0.000     .0029283    .0033269
                  MS  |   .0027269   .0001098    24.83   0.000     .0025061    .0029478
                  AR  |   .0015682   .0001831     8.57   0.000     .0012001    .0019363
                  LA  |   .0032666   .0001227    26.63   0.000       .00302    .0035132
                  OK  |    .003432   .0005615     6.11   0.000      .002303    .0045611
                  TX  |   .0033308   .0000844    39.48   0.000     .0031611    .0035004
                  ID  |  -.0002723   .0001943    -1.40   0.168     -.000663    .0001184
                  WY  |   .0103736    .000064   161.98   0.000     .0102448    .0105023
                  CO  |   .0035394   .0000858    41.26   0.000      .003367    .0037119
                  NM  |   .0039362   .0002264    17.39   0.000      .003481    .0043914
                  AZ  |   .0032174   .0000906    35.52   0.000     .0030353    .0033995
                  UT  |   .0034681   .0000889    39.03   0.000     .0032894    .0036467
                  NV  |   .0026874   .0000733    36.66   0.000       .00254    .0028348
                  WA  |   .0059599   .0000886    67.30   0.000     .0057819     .006138
                  OR  |   .0019187   .0001156    16.59   0.000     .0016862    .0021512
                  CA  |   .0024108    .000061    39.51   0.000     .0022881    .0025335
                  AK  |  -.0023961   .0000486   -49.31   0.000    -.0024938   -.0022984
                  HI  |   .0046963   .0000725    64.75   0.000     .0045505    .0048422
                      |
                 nind |
                   2  |   .0549887   .0236386     2.33   0.024       .00746    .1025173
                   3  |   .1069217   .0221592     4.83   0.000     .0623675    .1514758
                   4  |  -.0601006   .0243279    -2.47   0.017    -.1090152   -.0111861
                   5  |   .1060449   .0237139     4.47   0.000      .058365    .1537248
                   6  |   .1090188   .0266783     4.09   0.000     .0553786     .162659
                   7  |   .0140191   .0256279     0.55   0.587    -.0375093    .0655474
                   8  |  -.0381286   .0261745    -1.46   0.152     -.090756    .0144988
                   9  |  -.0716155   .0263283    -2.72   0.009     -.124552   -.0186789
                  10  |  -.0819392   .0258498    -3.17   0.003    -.1339136   -.0299648
                  11  |   .0940827   .0267506     3.52   0.001     .0402971    .1478683
                      |
                 educ |   .0647348   .0017633    36.71   0.000     .0611894    .0682801
                exper |   .0402936   .0017682    22.79   0.000     .0367385    .0438488
               exper2 |  -.0006968   .0000903    -7.72   0.000    -.0008783   -.0005154
               exper3 |  -3.36e-06   2.95e-06    -1.14   0.261    -9.29e-06    2.58e-06
               exper4 |   1.24e-07   3.34e-08     3.70   0.001     5.65e-08    1.91e-07
                 edex |  -.0003327   .0000759    -4.38   0.000    -.0004853     -.00018
                      |
                ee_cl |
                   2  |  -.0647309   .0045419   -14.25   0.000     -.073863   -.0555989
                   3  |  -.0766256   .0056752   -13.50   0.000    -.0880364   -.0652148
                   4  |   -.027383   .0093827    -2.92   0.005    -.0462482   -.0085177
                   5  |  -.1281221   .0053118   -24.12   0.000    -.1388022   -.1174419
                   6  |  -.1005146   .0056575   -17.77   0.000    -.1118897   -.0891394
                   7  |  -.0804787   .0070701   -11.38   0.000    -.0946941   -.0662632
                   8  |   .0377286   .0101189     3.73   0.001     .0173833    .0580739
                   9  |  -.1517982   .0069585   -21.81   0.000    -.1657893   -.1378071
                  10  |  -.1147115   .0078753   -14.57   0.000    -.1305457   -.0988772
                  11  |  -.0702865   .0081701    -8.60   0.000    -.0867135   -.0538595
                  12  |   .0394763   .0108541     3.64   0.001     .0176527       .0613
                  13  |  -.0907822   .0130273    -6.97   0.000    -.1169752   -.0645891
                  14  |  -.0884225   .0101197    -8.74   0.000    -.1087695   -.0680754
                  15  |   -.051042   .0096859    -5.27   0.000    -.0705169   -.0315672
                  16  |   .0379223   .0119533     3.17   0.003     .0138886     .061956
                      |
                 marr |   .1291256   .0025955    49.75   0.000      .123907    .1343443
                partt |   -.207658   .0047083   -44.10   0.000    -.2171247   -.1981913
               public |  -.0102432   .0060477    -1.69   0.097    -.0224028    .0019165
                 cmsa |   .1379567   .0082755    16.67   0.000     .1213177    .1545957
                      |
                nocc2 |
                   2  |  -.1495802   .0037806   -39.56   0.000    -.1571817   -.1419788
                   3  |  -.0395217   .0063276    -6.25   0.000    -.0522442   -.0267992
                   4  |  -.3311378   .0073216   -45.23   0.000    -.3458589   -.3164166
                   5  |  -.0971137   .0084592   -11.48   0.000    -.1141221   -.0801052
                   6  |  -.3923968   .0066335   -59.15   0.000    -.4057344   -.3790592
                   7  |  -.2476914   .0065975   -37.54   0.000    -.2609564   -.2344263
                   8  |  -.1102397   .0101931   -10.82   0.000    -.1307343   -.0897451
                   9  |  -.4348795    .005778   -75.26   0.000     -.446497    -.423262
                  10  |  -.3739742   .0059827   -62.51   0.000    -.3860032   -.3619452
                  11  |  -.2759229   .0062782   -43.95   0.000    -.2885461   -.2632997
                  12  |  -.4371979   .0086975   -50.27   0.000    -.4546853   -.4197104
                      |
                unemp |  -.0061302   .0007254    -8.45   0.000    -.0075887   -.0046717
                      |
              quarter |
                   2  |   .0036864   .0018472     2.00   0.052    -.0000276    .0074004
                   3  |   .0044732   .0018376     2.43   0.019     .0007784    .0081679
                   4  |   .0150427   .0017346     8.67   0.000      .011555    .0185303
                      |
                _cons |   .5227728   .0264434    19.77   0.000     .4696048    .5759408
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,676,554,568)

Linear regression                               Number of obs     =    905,405
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5059
                                                Root MSE          =     .39337

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0839603   .0069945   -12.00   0.000    -.0980237   -.0698969
             treat_st |  -.0252654   .0070471    -3.59   0.001    -.0394345   -.0110963
treat_stblackrelwhite |   -.028302   .0082607    -3.43   0.001    -.0449112   -.0116928
                      |
                state |
                  NH  |   .0592459   .0033893    17.48   0.000     .0524313    .0660605
                  VT  |   .0446053   .0006054    73.67   0.000      .043388    .0458226
                  MA  |   .0935319   .0080733    11.59   0.000     .0772994    .1097643
                  RI  |  -.0019362   .0078587    -0.25   0.806    -.0177372    .0138648
                  CT  |   .0982854   .0079704    12.33   0.000     .0822599    .1143109
                  NY  |   .0403539   .0074974     5.38   0.000     .0252793    .0554285
                  NJ  |   .1073179   .0086317    12.43   0.000     .0899626    .1246732
                  PA  |  -.0440826   .0063598    -6.93   0.000    -.0568698   -.0312954
                  OH  |  -.0751938   .0060132   -12.50   0.000    -.0872842   -.0631035
                  IN  |  -.0699726   .0045057   -15.53   0.000     -.079032   -.0609132
                  IL  |  -.0038542   .0069221    -0.56   0.580    -.0177721    .0100637
                  MI  |  -.0444151   .0061449    -7.23   0.000    -.0567704   -.0320599
                  WI  |  -.0210044   .0044421    -4.73   0.000    -.0299359    -.012073
                  MN  |   .0368446   .0059299     6.21   0.000     .0249217    .0487675
                  IA  |  -.0383692   .0068065    -5.64   0.000    -.0520546   -.0246837
                  MO  |  -.0823265   .0057488   -14.32   0.000    -.0938852   -.0707678
                  ND  |  -.0577687   .0073542    -7.86   0.000    -.0725554    -.042982
                  SD  |  -.0748084   .0071185   -10.51   0.000    -.0891211   -.0604956
                  NE  |  -.0683799   .0071095    -9.62   0.000    -.0826746   -.0540852
                  KS  |  -.0661283   .0073108    -9.05   0.000    -.0808276    -.051429
                  DE  |   .0377778   .0021902    17.25   0.000     .0333742    .0421814
                  MD  |   .0929526   .0088952    10.45   0.000     .0750676    .1108375
                  DC  |   .1568405   .0116695    13.44   0.000     .1333775    .1803035
                  VA  |   .0543332   .0086194     6.30   0.000     .0370027    .0716637
                  NC  |  -.0285786   .0075525    -3.78   0.000     -.043764   -.0133933
                  SC  |  -.0668129   .0074931    -8.92   0.000    -.0818787   -.0517471
                  GA  |  -.0016604   .0082933    -0.20   0.842    -.0183351    .0150143
                  FL  |  -.0411678   .0090456    -4.55   0.000    -.0593553   -.0229804
                  KY  |  -.0900417   .0037145   -24.24   0.000    -.0975101   -.0825732
                  TN  |  -.0799066   .0077768   -10.27   0.000    -.0955429   -.0642703
                  AL  |  -.0920673   .0075003   -12.28   0.000    -.1071478   -.0769869
                  MS  |  -.1077625   .0071455   -15.08   0.000    -.1221295   -.0933955
                  AR  |  -.1122667   .0070258   -15.98   0.000    -.1263931   -.0981403
                  LA  |  -.0982302   .0083974   -11.70   0.000    -.1151142   -.0813462
                  OK  |  -.1320423   .0060511   -21.82   0.000    -.1442088   -.1198758
                  TX  |  -.0043212   .0087322    -0.49   0.623    -.0218785    .0132361
                  ID  |  -.0446339   .0068478    -6.52   0.000    -.0584023   -.0308654
                  WY  |   .0046693   .0073447     0.64   0.528    -.0100983    .0194369
                  CO  |  -.0012376   .0078485    -0.16   0.875     -.017018    .0145429
                  NM  |  -.0893313   .0048624   -18.37   0.000    -.0991078   -.0795549
                  AZ  |   .0016032   .0089026     0.18   0.858    -.0162967    .0195031
                  UT  |  -.0516082   .0084647    -6.10   0.000    -.0686276   -.0345888
                  NV  |   .0481856   .0090692     5.31   0.000     .0299507    .0664205
                  WA  |   .0502846   .0072984     6.89   0.000     .0356103    .0649589
                  OR  |  -.0113762   .0066236    -1.72   0.092    -.0246938    .0019414
                  CA  |   .1088527   .0085941    12.67   0.000      .091573    .1261323
                  AK  |   .1680454   .0046059    36.49   0.000     .1587846    .1773061
                  HI  |    .070626   .0060392    11.69   0.000     .0584833    .0827687
                      |
                 year |
                1990  |  -.0068749   .0025183    -2.73   0.009    -.0119382   -.0018115
                1991  |  -.0018874   .0025807    -0.73   0.468    -.0070764    .0033015
                1992  |    .017396   .0033312     5.22   0.000     .0106983    .0240938
                1993  |   .0129812   .0034682     3.74   0.000      .006008    .0199544
                1996  |   -.000323   .0039298    -0.08   0.935    -.0082243    .0075783
                1997  |   .0150124    .004177     3.59   0.001     .0066139    .0234109
                1998  |   .0462654    .003985    11.61   0.000     .0382531    .0542777
                1999  |   .0664291   .0047388    14.02   0.000     .0569011    .0759571
                2000  |   .0815252   .0047649    17.11   0.000     .0719447    .0911057
                2001  |   .0924551   .0055993    16.51   0.000     .0811969    .1037132
                2002  |    .106003   .0050369    21.05   0.000     .0958756    .1161305
                2003  |   .1155974   .0052447    22.04   0.000     .1050522    .1261426
                2004  |   .1068028   .0056009    19.07   0.000     .0955415    .1180641
                2005  |   .0962874   .0058916    16.34   0.000     .0844415    .1081332
                2006  |   .0917799   .0049475    18.55   0.000     .0818323    .1017274
                2007  |   .0929888   .0054871    16.95   0.000     .0819563    .1040214
                2008  |   .0847009   .0067762    12.50   0.000     .0710764    .0983255
                2009  |   .1007842    .005747    17.54   0.000     .0892291    .1123394
                2010  |   .0978715   .0053152    18.41   0.000     .0871846    .1085583
                2011  |   .0796897   .0058889    13.53   0.000     .0678492    .0915302
                2012  |   .0649519   .0067174     9.67   0.000     .0514457    .0784581
                2013  |     .06591   .0069322     9.51   0.000     .0519718    .0798482
                2014  |   .0636088   .0069847     9.11   0.000     .0495652    .0776524
                2015  |   .0777575   .0056924    13.66   0.000     .0663122    .0892028
                2016  |   .0908337   .0070385    12.91   0.000     .0766818    .1049856
                2017  |   .1032976   .0074235    13.92   0.000     .0883718    .1182235
                2018  |   .1085797   .0074277    14.62   0.000     .0936454     .123514
                2019  |   .1203074   .0071525    16.82   0.000     .1059262    .1346885
                      |
                 nind |
                   2  |   .0530214   .0405855     1.31   0.198    -.0285812    .1346239
                   3  |   .1285805   .0385502     3.34   0.002     .0510701     .206091
                   4  |  -.0814713   .0387253    -2.10   0.041    -.1593337   -.0036088
                   5  |   .1128879   .0381681     2.96   0.005     .0361458      .18963
                   6  |   .0907333   .0395894     2.29   0.026     .0111334    .1703333
                   7  |   .0393466    .041037     0.96   0.342    -.0431638    .1218571
                   8  |  -.0121539    .041791    -0.29   0.772    -.0961803    .0718726
                   9  |  -.0848315   .0434462    -1.95   0.057     -.172186     .002523
                  10  |   -.075313   .0396116    -1.90   0.063    -.1549573    .0043314
                  11  |   .0907002   .0437089     2.08   0.043     .0028176    .1785828
                      |
                 educ |   .0868578   .0019132    45.40   0.000     .0830109    .0907046
                exper |   .0472448   .0022211    21.27   0.000     .0427789    .0517107
               exper2 |  -.0015168   .0000967   -15.69   0.000    -.0017113   -.0013224
               exper3 |   .0000232   2.90e-06     7.98   0.000     .0000173     .000029
               exper4 |  -1.15e-07   3.04e-08    -3.79   0.000    -1.76e-07   -5.40e-08
                 edex |  -.0005874   .0000991    -5.92   0.000    -.0007867    -.000388
                      |
                ee_cl |
                   2  |  -.1199043   .0045149   -26.56   0.000    -.1289822   -.1108264
                   3  |  -.1512309   .0062678   -24.13   0.000    -.1638332   -.1386287
                   4  |  -.1433719   .0103498   -13.85   0.000    -.1641817   -.1225622
                   5  |  -.1500041   .0083196   -18.03   0.000    -.1667317   -.1332765
                   6  |  -.1624879   .0078777   -20.63   0.000    -.1783272   -.1466487
                   7  |  -.1619026    .008462   -19.13   0.000    -.1789166   -.1448887
                   8  |  -.0741406   .0102591    -7.23   0.000     -.094768   -.0535132
                   9  |  -.1598648   .0107364   -14.89   0.000    -.1814518   -.1382778
                  10  |  -.1699405   .0101587   -16.73   0.000     -.190366    -.149515
                  11  |  -.1527764   .0092444   -16.53   0.000    -.1713636   -.1341893
                  12  |  -.0896863   .0092942    -9.65   0.000    -.1083736    -.070999
                  13  |  -.1253371   .0159004    -7.88   0.000    -.1573069   -.0933673
                  14  |  -.1510756   .0112452   -13.43   0.000    -.1736855   -.1284656
                  15  |     -.1215   .0102426   -11.86   0.000     -.142094   -.1009059
                  16  |  -.0816261   .0110326    -7.40   0.000    -.1038087   -.0594435
                      |
                 marr |   .0386357   .0024144    16.00   0.000     .0337813    .0434902
                partt |  -.1385702   .0028941   -47.88   0.000    -.1443893   -.1327512
               public |   .0148275   .0057549     2.58   0.013     .0032564    .0263986
                 cmsa |   .1531276   .0078832    19.42   0.000     .1372773    .1689778
                      |
                nocc2 |
                   2  |  -.1382617   .0032108   -43.06   0.000    -.1447175    -.131806
                   3  |  -.0376636   .0070785    -5.32   0.000    -.0518957   -.0234314
                   4  |  -.3259506   .0045286   -71.98   0.000     -.335056   -.3168452
                   5  |   .0304117   .0063104     4.82   0.000     .0177239    .0430996
                   6  |  -.3379375   .0047118   -71.72   0.000    -.3474112   -.3284638
                   7  |  -.3671638   .0046241   -79.40   0.000    -.3764613   -.3578663
                   8  |  -.1762092   .0076825   -22.94   0.000    -.1916559   -.1607624
                   9  |   -.426065   .0057708   -73.83   0.000     -.437668    -.414462
                  10  |  -.4502119   .0086719   -51.92   0.000    -.4676479    -.432776
                  11  |   -.235884   .0073676   -32.02   0.000    -.2506975   -.2210704
                  12  |  -.4249565   .0094685   -44.88   0.000    -.4439943   -.4059187
                      |
              quarter |
                   2  |   .0094477   .0014707     6.42   0.000     .0064906    .0124048
                   3  |   .0181945    .001843     9.87   0.000      .014489       .0219
                   4  |   .0216949   .0011741    18.48   0.000     .0193342    .0240557
                      |
                _cons |    .397536   .0406484     9.78   0.000      .315807     .479265
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "No"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all 

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,676,554,568)

Linear regression                               Number of obs     =    905,405
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5059
                                                Root MSE          =     .39337

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0839642   .0069949   -12.00   0.000    -.0980283      -.0699
             treat_st |  -.0260414   .0072568    -3.59   0.001    -.0406321   -.0114506
treat_stblackrelwhite |  -.0283166   .0082734    -3.42   0.001    -.0449514   -.0116817
                      |
                state |
                  NH  |   .0559911   .0037055    15.11   0.000     .0485408    .0634415
                  VT  |   .0416129   .0018709    22.24   0.000     .0378513    .0453746
                  MA  |   .0936947   .0080807    11.59   0.000     .0774473     .109942
                  RI  |   .0011273   .0080789     0.14   0.890    -.0151165    .0173711
                  CT  |   .0986232    .007977    12.36   0.000     .0825843    .1146621
                  NY  |   .0425412   .0075822     5.61   0.000     .0272962    .0577861
                  NJ  |   .1089373   .0086652    12.57   0.000     .0915147    .1263599
                  PA  |  -.0429256   .0064004    -6.71   0.000    -.0557945   -.0300567
                  OH  |  -.0733515    .006107   -12.01   0.000    -.0856304   -.0610727
                  IN  |  -.0695865   .0045104   -15.43   0.000    -.0786554   -.0605177
                  IL  |  -.0009804   .0070744    -0.14   0.890    -.0152044    .0132436
                  MI  |  -.0400182   .0066291    -6.04   0.000    -.0533469   -.0266895
                  WI  |  -.0220184   .0044648    -4.93   0.000    -.0309955   -.0130413
                  MN  |     .03454   .0060691     5.69   0.000     .0223374    .0467427
                  IA  |  -.0411354   .0070024    -5.87   0.000    -.0552147    -.027056
                  MO  |   -.081724   .0057581   -14.19   0.000    -.0933015   -.0701465
                  ND  |  -.0620492    .007758    -8.00   0.000    -.0776477   -.0464506
                  SD  |  -.0789478   .0075174   -10.50   0.000    -.0940625   -.0638331
                  NE  |  -.0731694   .0075022    -9.75   0.000    -.0882535   -.0580852
                  KS  |  -.0672801   .0073902    -9.10   0.000     -.082139   -.0524212
                  DE  |    .036048   .0025376    14.21   0.000     .0309458    .0411503
                  MD  |   .0920312   .0089246    10.31   0.000     .0740871    .1099753
                  DC  |   .1618471   .0117796    13.74   0.000     .1381626    .1855316
                  VA  |   .0525761   .0086798     6.06   0.000     .0351242    .0700281
                  NC  |  -.0268539   .0077711    -3.46   0.001    -.0424787   -.0112292
                  SC  |  -.0636433   .0079296    -8.03   0.000    -.0795869   -.0476998
                  GA  |   .0004134   .0085267     0.05   0.962    -.0167306    .0175574
                  FL  |  -.0390272   .0092957    -4.20   0.000    -.0577175   -.0203369
                  KY  |  -.0875908   .0039945   -21.93   0.000    -.0956222   -.0795594
                  TN  |  -.0779602   .0080266    -9.71   0.000    -.0940988   -.0618216
                  AL  |  -.0890595   .0079195   -11.25   0.000    -.1049827   -.0731363
                  MS  |  -.1026658   .0079772   -12.87   0.000     -.118705   -.0866266
                  AR  |  -.1102084    .007323   -15.05   0.000    -.1249323   -.0954845
                  LA  |  -.0947767   .0088388   -10.72   0.000    -.1125483   -.0770052
                  OK  |  -.1330607   .0060677   -21.93   0.000    -.1452607   -.1208608
                  TX  |   -.002393   .0089337    -0.27   0.790    -.0203554    .0155693
                  ID  |  -.0438775   .0070228    -6.25   0.000    -.0579979   -.0297572
                  WY  |   .0030466   .0075719     0.40   0.689    -.0121778     .018271
                  CO  |  -.0023009   .0078812    -0.29   0.772    -.0181471    .0135452
                  NM  |  -.0872714   .0048968   -17.82   0.000    -.0971171   -.0774258
                  AZ  |   .0040868   .0091876     0.44   0.658     -.014386    .0225597
                  UT  |  -.0533759   .0085086    -6.27   0.000    -.0704835   -.0362682
                  NV  |   .0512931   .0094811     5.41   0.000     .0322301    .0703562
                  WA  |   .0527396   .0074213     7.11   0.000     .0378181    .0676612
                  OR  |  -.0079811   .0068881    -1.16   0.252    -.0218306    .0058684
                  CA  |   .1133729   .0089355    12.69   0.000     .0954069    .1313389
                  AK  |   .1739241   .0053449    32.54   0.000     .1631774    .1846708
                  HI  |   .0676591   .0063233    10.70   0.000     .0549453    .0803729
                      |
                 year |
                1990  |  -.0059927   .0025317    -2.37   0.022     -.011083   -.0009024
                1991  |   .0022164   .0034785     0.64   0.527    -.0047775    .0092103
                1992  |   .0231527   .0047074     4.92   0.000     .0136879    .0326175
                1993  |   .0170902   .0042836     3.99   0.000     .0084775    .0257029
                1996  |    -.00029   .0040629    -0.07   0.943    -.0084589     .007879
                1997  |   .0138253   .0040166     3.44   0.001     .0057494    .0219011
                1998  |   .0438813   .0042809    10.25   0.000     .0352739    .0524886
                1999  |   .0633326   .0045081    14.05   0.000     .0542684    .0723968
                2000  |   .0779391   .0048174    16.18   0.000     .0682532     .087625
                2001  |   .0909555   .0055607    16.36   0.000      .079775    .1021359
                2002  |   .1074002   .0051859    20.71   0.000     .0969732    .1178272
                2003  |   .1175829   .0055957    21.01   0.000     .1063319    .1288338
                2004  |   .1076139    .005659    19.02   0.000     .0962359     .118992
                2005  |   .0960583   .0060422    15.90   0.000     .0839098    .1082069
                2006  |   .0903095   .0051176    17.65   0.000     .0800198    .1005992
                2007  |   .0913794   .0055784    16.38   0.000     .0801633    .1025954
                2008  |   .0861852   .0067245    12.82   0.000     .0726647    .0997057
                2009  |   .1117123   .0083027    13.46   0.000     .0950187    .1284059
                2010  |   .1096865   .0071397    15.36   0.000     .0953312    .1240418
                2011  |   .0895349   .0063232    14.16   0.000     .0768213    .1022485
                2012  |   .0724239   .0061786    11.72   0.000      .060001    .0848469
                2013  |   .0716605   .0065667    10.91   0.000     .0584573    .0848637
                2014  |   .0660887   .0064957    10.17   0.000     .0530282    .0791492
                2015  |   .0778426   .0055732    13.97   0.000     .0666369    .0890484
                2016  |   .0898843   .0070266    12.79   0.000     .0757563    .1040123
                2017  |   .1009569   .0077937    12.95   0.000     .0852867    .1166272
                2018  |   .1050332    .008395    12.51   0.000     .0881539    .1219125
                2019  |   .1161966   .0081302    14.29   0.000     .0998497    .1325435
                      |
                 nind |
                   2  |   .0528975   .0405918     1.30   0.199    -.0287179    .1345129
                   3  |   .1284819   .0385664     3.33   0.002     .0509389    .2060249
                   4  |  -.0815214     .03873    -2.10   0.041    -.1593932   -.0036496
                   5  |   .1128533   .0381562     2.96   0.005     .0361351    .1895715
                   6  |   .0906782   .0396004     2.29   0.026     .0110562    .1703002
                   7  |   .0392696   .0410414     0.96   0.343    -.0432498    .1217889
                   8  |  -.0122096   .0417955    -0.29   0.771    -.0962452     .071826
                   9  |  -.0849049   .0434649    -1.95   0.057     -.172297    .0024872
                  10  |  -.0753694   .0396117    -1.90   0.063    -.1550141    .0042753
                  11  |   .0906092   .0437281     2.07   0.044      .002688    .1785304
                      |
                 educ |   .0868578   .0019168    45.31   0.000     .0830037    .0907118
                exper |   .0472605   .0022196    21.29   0.000     .0427978    .0517233
               exper2 |  -.0015181   .0000966   -15.72   0.000    -.0017123   -.0013239
               exper3 |   .0000232   2.90e-06     8.00   0.000     .0000174     .000029
               exper4 |  -1.15e-07   3.03e-08    -3.80   0.000    -1.76e-07   -5.44e-08
                 edex |  -.0005874   .0000991    -5.93   0.000    -.0007868   -.0003881
                      |
                ee_cl |
                   2  |  -.1198672   .0045295   -26.46   0.000    -.1289743   -.1107601
                   3  |   -.151172   .0062916   -24.03   0.000    -.1638221   -.1385219
                   4  |  -.1433251   .0103816   -13.81   0.000    -.1641987   -.1224514
                   5  |  -.1500279   .0083214   -18.03   0.000    -.1667593   -.1332965
                   6  |   -.162471   .0078981   -20.57   0.000    -.1783513   -.1465907
                   7  |  -.1618367   .0084884   -19.07   0.000    -.1789037   -.1447697
                   8  |  -.0740868   .0102954    -7.20   0.000    -.0947872   -.0533865
                   9  |  -.1598467   .0107491   -14.87   0.000    -.1814592   -.1382342
                  10  |  -.1699058   .0101705   -16.71   0.000    -.1903549   -.1494566
                  11  |  -.1526866   .0092659   -16.48   0.000     -.171317   -.1340561
                  12  |  -.0896098   .0093218    -9.61   0.000    -.1083525   -.0708672
                  13  |  -.1252946   .0159161    -7.87   0.000    -.1572961   -.0932931
                  14  |  -.1510029   .0112575   -13.41   0.000    -.1736377   -.1283681
                  15  |  -.1213996    .010264   -11.83   0.000    -.1420368   -.1007623
                  16  |  -.0815605   .0110413    -7.39   0.000    -.1037607   -.0593604
                      |
                 marr |   .0386295    .002411    16.02   0.000     .0337818    .0434772
                partt |  -.1385367   .0028992   -47.78   0.000     -.144366   -.1327075
               public |   .0148448   .0057558     2.58   0.013      .003272    .0264175
                 cmsa |   .1531058   .0078879    19.41   0.000     .1372461    .1689655
                      |
                nocc2 |
                   2  |  -.1382813   .0032115   -43.06   0.000    -.1447385   -.1318241
                   3  |  -.0376944   .0070702    -5.33   0.000    -.0519099   -.0234788
                   4  |  -.3259439   .0045244   -72.04   0.000    -.3350408    -.316847
                   5  |   .0303906   .0063096     4.82   0.000     .0177044    .0430769
                   6  |  -.3379364   .0047082   -71.78   0.000    -.3474029   -.3284699
                   7  |  -.3671803   .0046235   -79.42   0.000    -.3764764   -.3578842
                   8  |  -.1761941   .0076929   -22.90   0.000    -.1916617   -.1607265
                   9  |  -.4260655   .0057681   -73.87   0.000     -.437663    -.414468
                  10  |  -.4503178   .0086619   -51.99   0.000    -.4677337   -.4329019
                  11  |  -.2359555   .0073566   -32.07   0.000     -.250747    -.221164
                  12  |   -.425005   .0094545   -44.95   0.000    -.4440146   -.4059954
                      |
                unemp |   -.002742    .001525    -1.80   0.078    -.0058083    .0003242
                      |
              quarter |
                   2  |   .0094525   .0014731     6.42   0.000     .0064907    .0124144
                   3  |   .0181887   .0018431     9.87   0.000      .014483    .0218944
                   4  |   .0216911   .0011717    18.51   0.000     .0193352     .024047
                      |
                _cons |   .4105934   .0430563     9.54   0.000     .3240229    .4971639
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "Yes"
. ** estadd local sltt "No"
. eststo nwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
(sum of wgt is 7,676,554,568)

Linear regression                               Number of obs     =    905,405
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.5044
                                                Root MSE          =     .39396

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0848052   .0068024   -12.47   0.000    -.0984824    -.071128
             treat_st |  -.0590323   .0119344    -4.95   0.000    -.0830281   -.0350366
treat_stblackrelwhite |  -.0275143   .0083123    -3.31   0.002    -.0442272   -.0108013
                      |
                state |
                  NH  |   .1644629   .0093503    17.59   0.000     .1456629    .1832629
                  VT  |  -.1117068   .0076787   -14.55   0.000    -.1271459   -.0962677
                  MA  |  -.0991521   .0132294    -7.49   0.000    -.1257516   -.0725526
                  RI  |  -.1706596   .0155791   -10.95   0.000    -.2019835   -.1393358
                  CT  |   .0496086   .0161727     3.07   0.004     .0170912    .0821261
                  NY  |  -.0146419   .0157453    -0.93   0.357    -.0462999    .0170162
                  NJ  |   .0492288    .017831     2.76   0.008     .0133772    .0850805
                  PA  |  -.0392154   .0140553    -2.79   0.008    -.0674756   -.0109553
                  OH  |  -.1180822   .0182661    -6.46   0.000    -.1548086   -.0813558
                  IN  |  -.2585993   .0427214    -6.05   0.000    -.3444965    -.172702
                  IL  |  -.1302465   .0134112    -9.71   0.000    -.1572114   -.1032815
                  MI  |  -.1415756   .0378541    -3.74   0.000    -.2176864   -.0654649
                  WI  |  -.4088237   .0337169   -12.13   0.000    -.4766161   -.3410313
                  MN  |  -.1997754   .0135478   -14.75   0.000    -.2270151   -.1725356
                  IA  |   -.156434   .0131218   -11.92   0.000    -.1828171   -.1300508
                  MO  |  -.0336365   .0105477    -3.19   0.003    -.0548441   -.0124288
                  ND  |   -.875246   .0144137   -60.72   0.000    -.9042267   -.8462652
                  SD  |  -.4339097   .0173136   -25.06   0.000    -.4687211   -.3990983
                  NE  |   -.389781   .0138793   -28.08   0.000    -.4176872   -.3618747
                  KS  |  -.1692765   .0170659    -9.92   0.000    -.2035897   -.1349633
                  DE  |   .1470378   .0136766    10.75   0.000     .1195391    .1745365
                  MD  |  -.3391732   .0183095   -18.52   0.000    -.3759869   -.3023595
                  DC  |  -.2363933   .0200062   -11.82   0.000    -.2766185   -.1961681
                  VA  |  -.1622907   .0143913   -11.28   0.000    -.1912263    -.133355
                  NC  |   .0875189   .0125121     6.99   0.000     .0623615    .1126762
                  SC  |   .0551286    .012989     4.24   0.000     .0290124    .0812447
                  GA  |   .1940218   .0136205    14.24   0.000     .1666359    .2214077
                  FL  |  -.0132973   .0197331    -0.67   0.504    -.0529734    .0263788
                  KY  |  -.2292005   .0214148   -10.70   0.000    -.2722579   -.1861431
                  TN  |  -.1588249   .0152693   -10.40   0.000    -.1895258    -.128124
                  AL  |  -.1346874   .0148277    -9.08   0.000    -.1645004   -.1048743
                  MS  |  -.0748727   .0123079    -6.08   0.000    -.0996194    -.050126
                  AR  |  -.0857029    .012401    -6.91   0.000    -.1106367   -.0607691
                  LA  |  -.0690004   .0164734    -4.19   0.000    -.1021224   -.0358784
                  OK  |  -.4415272   .0524225    -8.42   0.000    -.5469297   -.3361247
                  TX  |  -.1434715   .0193333    -7.42   0.000    -.1823437   -.1045994
                  ID  |   .0836611   .0144949     5.77   0.000     .0545171    .1128051
                  WY  |  -.7007968   .0166234   -42.16   0.000    -.7342203   -.6673733
                  CO  |   -.251632   .0130251   -19.32   0.000    -.2778208   -.2254433
                  NM  |   -.493628   .0071055   -69.47   0.000    -.5079145   -.4793415
                  AZ  |  -.1617517   .0181875    -8.89   0.000    -.1983201   -.1251832
                  UT  |  -.2035598   .0191892   -10.61   0.000    -.2421423   -.1649774
                  NV  |   .0330456   .0220874     1.50   0.141     -.011364    .0774553
                  WA  |  -.4305546   .0096878   -44.44   0.000    -.4500333   -.4110759
                  OR  |  -.1944764   .0089732   -21.67   0.000    -.2125181   -.1764347
                  CA  |   -.113392   .0172709    -6.57   0.000    -.1481175   -.0786665
                  AK  |   .3851732    .014583    26.41   0.000      .355852    .4144943
                  HI  |  -.1830451   .0189299    -9.67   0.000    -.2211063    -.144984
                      |
        state#c.lyear |
                  ME  |   .0024897    .000126    19.75   0.000     .0022363    .0027431
                  NH  |   .0014982   .0002316     6.47   0.000     .0010325     .001964
                  VT  |   .0039797   .0000824    48.28   0.000      .003814    .0041454
                  MA  |   .0043393   .0000942    46.09   0.000       .00415    .0045286
                  RI  |   .0041541   .0000876    47.44   0.000      .003978    .0043301
                  CT  |   .0029628   .0000767    38.63   0.000     .0028086     .003117
                  NY  |   .0030339   .0000682    44.47   0.000     .0028967     .003171
                  NJ  |   .0030706   .0000665    46.19   0.000     .0029369    .0032042
                  PA  |   .0024547   .0000709    34.65   0.000     .0023123    .0025972
                  OH  |   .0029279   .0000498    58.84   0.000     .0028279     .003028
                  IN  |   .0043966   .0004485     9.80   0.000     .0034947    .0052984
                  IL  |   .0037344   .0000798    46.77   0.000     .0035738    .0038949
                  MI  |   .0035319   .0003775     9.36   0.000      .002773    .0042909
                  WI  |   .0062647   .0003452    18.15   0.000     .0055706    .0069589
                  MN  |   .0047559   .0000816    58.32   0.000      .004592    .0049199
                  IA  |   .0039302   .0001052    37.35   0.000     .0037186    .0041418
                  MO  |   .0020308   .0000865    23.48   0.000     .0018569    .0022047
                  ND  |   .0106634   .0001058   100.80   0.000     .0104507    .0108761
                  SD  |   .0062991    .000066    95.37   0.000     .0061663    .0064319
                  NE  |   .0058725   .0001107    53.04   0.000     .0056499    .0060952
                  KS  |   .0038089   .0000752    50.62   0.000     .0036576    .0039602
                  DE  |   .0012848   .0001364     9.42   0.000     .0010105    .0015591
                  MD  |     .00662   .0000835    79.23   0.000      .006452    .0067879
                  DC  |   .0062978   .0001473    42.74   0.000     .0060016    .0065941
                  VA  |   .0048882   .0001382    35.38   0.000     .0046104     .005166
                  NC  |   .0017045   .0001412    12.07   0.000     .0014207    .0019883
                  SC  |   .0016683   .0001233    13.53   0.000     .0014204    .0019163
                  GA  |   .0009441    .000128     7.38   0.000     .0006867    .0012015
                  FL  |   .0025749    .000077    33.44   0.000     .0024201    .0027297
                  KY  |   .0038914   .0002409    16.16   0.000     .0034072    .0043757
                  TN  |   .0035934   .0000998    36.01   0.000     .0033927     .003794
                  AL  |   .0032572   .0000972    33.51   0.000     .0030618    .0034526
                  MS  |   .0025487   .0001186    21.48   0.000     .0023101    .0027872
                  AR  |    .002593   .0001801    14.40   0.000     .0022309    .0029551
                  LA  |   .0025497   .0001042    24.46   0.000     .0023401    .0027593
                  OK  |   .0056793   .0005928     9.58   0.000     .0044874    .0068712
                  TX  |   .0041601   .0000909    45.75   0.000     .0039773    .0043429
                  ID  |   .0016176    .000211     7.67   0.000     .0011933    .0020418
                  WY  |   .0094537   .0000652   145.04   0.000     .0093226    .0095847
                  CO  |   .0048918   .0000914    53.53   0.000     .0047081    .0050755
                  NM  |   .0064135   .0002043    31.39   0.000     .0060027    .0068243
                  AZ  |   .0044119   .0000879    50.18   0.000     .0042351    .0045887
                  UT  |   .0042675   .0000796    53.58   0.000     .0041074    .0044277
                  NV  |   .0030102    .000079    38.09   0.000     .0028513    .0031691
                  WA  |   .0071334   .0001186    60.13   0.000     .0068949    .0073719
                  OR  |   .0042942   .0001091    39.35   0.000     .0040748    .0045137
                  CA  |   .0046849   .0000685    68.38   0.000     .0045472    .0048227
                  AK  |   .0003904    .000054     7.23   0.000     .0002818    .0004989
                  HI  |    .004936   .0000547    90.19   0.000      .004826    .0050461
                      |
                 nind |
                   2  |   .0557059    .040514     1.37   0.176    -.0257529    .1371647
                   3  |   .1284491   .0384867     3.34   0.002     .0510664    .2058319
                   4  |  -.0798042   .0386256    -2.07   0.044    -.1574662   -.0021421
                   5  |    .115479   .0379159     3.05   0.004      .039244     .191714
                   6  |   .0921913   .0395274     2.33   0.024      .012716    .1716666
                   7  |   .0410514   .0409333     1.00   0.321    -.0412504    .1233533
                   8  |  -.0104623   .0417361    -0.25   0.803    -.0943782    .0734537
                   9  |  -.0832538   .0433619    -1.92   0.061    -.1704388    .0039312
                  10  |  -.0753675   .0395048    -1.91   0.062    -.1547971    .0040622
                  11  |   .0926125   .0436604     2.12   0.039     .0048274    .1803977
                      |
                 educ |   .0850833   .0019541    43.54   0.000     .0811543    .0890122
                exper |   .0464955   .0022067    21.07   0.000     .0420587    .0509324
               exper2 |  -.0014741   .0000958   -15.39   0.000    -.0016667   -.0012814
               exper3 |   .0000218   2.89e-06     7.55   0.000      .000016    .0000276
               exper4 |  -1.03e-07   3.03e-08    -3.39   0.001    -1.63e-07   -4.18e-08
                 edex |  -.0005592   .0001003    -5.58   0.000    -.0007608   -.0003576
                      |
                ee_cl |
                   2  |  -.1203676   .0046177   -26.07   0.000    -.1296521   -.1110832
                   3  |  -.1483734   .0064469   -23.01   0.000    -.1613359    -.135411
                   4  |  -.1369576   .0104452   -13.11   0.000    -.1579592   -.1159561
                   5  |  -.1552413   .0083047   -18.69   0.000     -.171939   -.1385435
                   6  |  -.1638863   .0078914   -20.77   0.000     -.179753   -.1480196
                   7  |  -.1590503   .0087108   -18.26   0.000    -.1765645   -.1415361
                   8  |  -.0683743   .0104555    -6.54   0.000    -.0893965   -.0473521
                   9  |   -.163412   .0107581   -15.19   0.000    -.1850425   -.1417814
                  10  |  -.1685281   .0102413   -16.46   0.000    -.1891196   -.1479365
                  11  |  -.1486474   .0094001   -15.81   0.000    -.1675476   -.1297472
                  12  |  -.0840983   .0093338    -9.01   0.000    -.1028651   -.0653316
                  13  |  -.1275902   .0158526    -8.05   0.000    -.1594641   -.0957164
                  14  |  -.1486071   .0113115   -13.14   0.000    -.1713505   -.1258638
                  15  |  -.1181218   .0104398   -11.31   0.000    -.1391123   -.0971312
                  16  |  -.0786598   .0109625    -7.18   0.000    -.1007013   -.0566183
                      |
                 marr |   .0382954   .0023915    16.01   0.000      .033487    .0431037
                partt |  -.1386132   .0029273   -47.35   0.000     -.144499   -.1327275
               public |    .014548   .0056801     2.56   0.014     .0031273    .0259687
                 cmsa |   .1532355   .0078771    19.45   0.000     .1373976    .1690734
                      |
                nocc2 |
                   2  |  -.1376169   .0033175   -41.48   0.000    -.1442873   -.1309465
                   3  |  -.0368236   .0071346    -5.16   0.000    -.0511687   -.0224784
                   4  |  -.3247574   .0045896   -70.76   0.000    -.3339855   -.3155294
                   5  |    .030224    .006342     4.77   0.000     .0174726    .0429754
                   6  |  -.3380438   .0047815   -70.70   0.000    -.3476577   -.3284299
                   7  |  -.3673882    .004686   -78.40   0.000    -.3768101   -.3579663
                   8  |  -.1748793    .007837   -22.31   0.000    -.1906367   -.1591219
                   9  |  -.4260103   .0058201   -73.20   0.000    -.4377123   -.4143083
                  10  |  -.4520439   .0086606   -52.20   0.000    -.4694571   -.4346306
                  11  |  -.2346296   .0073406   -31.96   0.000    -.2493889   -.2198702
                  12  |   -.425651   .0095728   -44.46   0.000    -.4448984   -.4064036
                      |
                unemp |  -.0025757   .0005519    -4.67   0.000    -.0036854   -.0014661
                      |
              quarter |
                   2  |   .0091076   .0014171     6.43   0.000     .0062584    .0119569
                   3  |   .0177697   .0017889     9.93   0.000      .014173    .0213665
                   4  |   .0212586   .0011881    17.89   0.000     .0188698    .0236474
                      |
                _cons |   .2378376   .0430303     5.53   0.000     .1513194    .3243558
---------------------------------------------------------------------------------------

. 
. ** estadd local unemp_level "Yes"
. ** estadd local yr_dum "No"
. ** estadd local sltt "Yes"
. eststo nwagstagdid_fem_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,600,095,661)

Linear regression                               Number of obs     =    184,674
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3404
                                                Root MSE          =     .36137

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1404175   .0122566   -11.46   0.000    -.1650611   -.1157739
             treat_st |  -.0575106    .031343    -1.83   0.073      -.12053    .0055089
treat_stblackrelwhite |  -.0145997   .0147175    -0.99   0.326    -.0441913    .0149918
                      |
                state |
                  NH  |   .0401495   .0053347     7.53   0.000     .0294234    .0508756
                  VT  |  -.0177449   .0033499    -5.30   0.000    -.0244804   -.0110095
                  MA  |   .0927049   .0098933     9.37   0.000      .072813    .1125968
                  RI  |   .0313378   .0107605     2.91   0.005     .0097023    .0529733
                  CT  |   .1394115   .0095106    14.66   0.000     .1202891    .1585338
                  NY  |   .1078881    .008343    12.93   0.000     .0911134    .1246627
                  NJ  |   .1784263   .0096524    18.49   0.000     .1590189    .1978337
                  PA  |   .0020237   .0069802     0.29   0.773    -.0120109    .0160584
                  OH  |   .0009256   .0067739     0.14   0.892    -.0126943    .0145455
                  IN  |   .0236594   .0058009     4.08   0.000      .011996    .0353228
                  IL  |   .0850079   .0071983    11.81   0.000     .0705349     .099481
                  MI  |   .0842235   .0066682    12.63   0.000     .0708162    .0976308
                  WI  |   .0242981   .0054229     4.48   0.000     .0133946    .0352016
                  MN  |   .0629064   .0072492     8.68   0.000     .0483309    .0774819
                  IA  |    .032757   .0309733     1.06   0.296     -.029519    .0950331
                  MO  |   .0204439   .0069633     2.94   0.005     .0064431    .0344446
                  ND  |   .0467183   .0326221     1.43   0.159    -.0188728    .1123093
                  SD  |   .0019165     .03126     0.06   0.951    -.0609359    .0647689
                  NE  |  -.0064877    .030448    -0.21   0.832    -.0677075    .0547322
                  KS  |   .0628125   .0296742     2.12   0.039     .0031485    .1224764
                  DE  |   .0597488   .0042734    13.98   0.000     .0511565    .0683411
                  MD  |   .1215363   .0086556    14.04   0.000     .1041331    .1389395
                  DC  |   .1276662   .0096298    13.26   0.000     .1083042    .1470283
                  VA  |   .1614075   .0301814     5.35   0.000     .1007237    .2220912
                  NC  |   .0525581   .0307966     1.71   0.094    -.0093626    .1144787
                  SC  |   .0045805   .0307696     0.15   0.882    -.0572859    .0664469
                  GA  |   .0967647   .0306593     3.16   0.003     .0351199    .1584094
                  FL  |   .0354783   .0311859     1.14   0.261    -.0272252    .0981818
                  KY  |  -.0263804   .0053761    -4.91   0.000    -.0371898    -.015571
                  TN  |   .0143756   .0302362     0.48   0.637    -.0464183    .0751695
                  AL  |   .0175853   .0300936     0.58   0.562     -.042922    .0780926
                  MS  |  -.0096008   .0309658    -0.31   0.758    -.0718617    .0526601
                  AR  |  -.0103178   .0309221    -0.33   0.740    -.0724908    .0518551
                  LA  |   .0601569   .0301487     2.00   0.052    -.0004611     .120775
                  OK  |  -.0399371   .0141908    -2.81   0.007    -.0684696   -.0114046
                  TX  |   .0863729   .0303419     2.85   0.006     .0253664    .1473793
                  ID  |   .0409828   .0313974     1.31   0.198    -.0221459    .1041115
                  WY  |   .1975028   .0330464     5.98   0.000     .1310586    .2639469
                  CO  |   .0081865   .0085399     0.96   0.343    -.0089841    .0253571
                  NM  |  -.0409964   .0074338    -5.51   0.000    -.0559431   -.0260498
                  AZ  |   .0770364   .0310755     2.48   0.017      .014555    .1395179
                  UT  |   .0158894    .030393     0.52   0.604    -.0452199    .0769987
                  NV  |   .1462191   .0323571     4.52   0.000     .0811608    .2112774
                  WA  |   .1005332   .0080762    12.45   0.000     .0842948    .1167715
                  OR  |   .0260577   .0076568     3.40   0.001     .0106627    .0414527
                  CA  |   .1739761   .0100159    17.37   0.000     .1538379    .1941144
                  AK  |   .2351009   .0062102    37.86   0.000     .2226145    .2475872
                  HI  |   .0923146   .0083349    11.08   0.000     .0755562     .109073
                      |
                 year |
                1990  |  -.0182912    .005277    -3.47   0.001    -.0289014   -.0076811
                1991  |  -.0315466   .0050274    -6.27   0.000    -.0416549   -.0214383
                1992  |  -.0307884   .0070901    -4.34   0.000     -.045044   -.0165327
                1993  |  -.0319264   .0059844    -5.33   0.000    -.0439587    -.019894
                1996  |  -.0142497   .0059843    -2.38   0.021     -.026282   -.0022174
                1997  |  -.0049524   .0069327    -0.71   0.478    -.0188915    .0089867
                1998  |   .0061086   .0061591     0.99   0.326    -.0062751    .0184924
                1999  |   .0167605   .0070068     2.39   0.021     .0026724    .0308486
                2000  |   .0144315   .0065973     2.19   0.034     .0011667    .0276963
                2001  |   .0187128   .0060209     3.11   0.003     .0066071    .0308185
                2002  |   .0277394   .0087845     3.16   0.003     .0100769    .0454019
                2003  |   .0349806   .0082166     4.26   0.000       .01846    .0515012
                2004  |   .0268781   .0065078     4.13   0.000     .0137933    .0399629
                2005  |   .0239054   .0079528     3.01   0.004     .0079151    .0398956
                2006  |   .0212236   .0101164     2.10   0.041     .0008833     .041564
                2007  |   .0255121   .0119496     2.13   0.038     .0014859    .0495383
                2008  |   .0088065   .0079793     1.10   0.275     -.007237      .02485
                2009  |   .0183903   .0091023     2.02   0.049     .0000889    .0366917
                2010  |   .0278948   .0101638     2.74   0.008     .0074591    .0483305
                2011  |   .0086438   .0112595     0.77   0.446     -.013995    .0312826
                2012  |  -.0055308   .0121809    -0.45   0.652    -.0300221    .0189604
                2013  |  -.0027852   .0103066    -0.27   0.788     -.023508    .0179375
                2014  |   .0063343   .0111636     0.57   0.573    -.0161115    .0287802
                2015  |    .010361   .0096283     1.08   0.287    -.0089981    .0297201
                2016  |   .0116503   .0099101     1.18   0.246    -.0082752    .0315759
                2017  |   .0293841    .009076     3.24   0.002     .0111355    .0476327
                2018  |   .0304219   .0098089     3.10   0.003     .0106998    .0501439
                2019  |   .0445035   .0100567     4.43   0.000     .0242831     .064724
                      |
                 nind |
                   2  |   .0868055   .0190955     4.55   0.000     .0484114    .1251996
                   3  |  -.0344954   .0167155    -2.06   0.044    -.0681043   -.0008866
                   4  |  -.2077552   .0220191    -9.44   0.000    -.2520276   -.1634828
                   5  |    .086691   .0176739     4.91   0.000     .0511551    .1222268
                   6  |  -.0640365   .0207729    -3.08   0.003    -.1058032   -.0222697
                   7  |  -.0772134    .018397    -4.20   0.000     -.114203   -.0402237
                   8  |  -.1759926   .0196081    -8.98   0.000    -.2154174   -.1365678
                   9  |  -.1283253   .0205217    -6.25   0.000    -.1695869   -.0870636
                  10  |  -.1455143   .0392953    -3.70   0.001    -.2245228   -.0665057
                  11  |   .0981563   .0199127     4.93   0.000     .0581191    .1381935
                      |
                 educ |    .072309   .0040871    17.69   0.000     .0640914    .0805266
                exper |   .0716004   .0024972    28.67   0.000     .0665795    .0766213
               exper2 |  -.0025675   .0001697   -15.13   0.000    -.0029086   -.0022264
               exper3 |   .0000514   4.82e-06    10.66   0.000     .0000417    .0000611
               exper4 |  -4.17e-07   4.70e-08    -8.86   0.000    -5.11e-07   -3.22e-07
                 edex |   -.000782   .0001054    -7.42   0.000    -.0009939   -.0005701
                      |
                ee_cl |
                   2  |   .0703541   .0169242     4.16   0.000     .0363258    .1043825
                   3  |   .0572921   .0184123     3.11   0.003     .0202716    .0943125
                   4  |   .0135554   .0257668     0.53   0.601    -.0382522    .0653629
                   5  |   .0131614   .0211692     0.62   0.537    -.0294021     .055725
                   6  |   .0458728   .0161638     2.84   0.007     .0133732    .0783724
                   7  |   .0544719   .0207828     2.62   0.012     .0126853    .0962584
                   8  |   .0148223   .0238313     0.62   0.537    -.0330938    .0627384
                   9  |   .0063531   .0225844     0.28   0.780    -.0390559    .0517621
                  10  |   .0316348   .0189714     1.67   0.102    -.0065097    .0697793
                  11  |   .0446283   .0206027     2.17   0.035     .0032039    .0860527
                  12  |   .0588699   .0236844     2.49   0.016     .0112493    .1064905
                  13  |   .0435882   .0208412     2.09   0.042     .0016842    .0854923
                  14  |   .0235063   .0199969     1.18   0.246    -.0167002    .0637128
                  15  |   .0400992   .0216939     1.85   0.071    -.0035192    .0837177
                  16  |   .0761273   .0220546     3.45   0.001     .0317836     .120471
                      |
                 marr |   .0638228   .0027645    23.09   0.000     .0582645    .0693811
                partt |  -.0945071    .017754    -5.32   0.000    -.1302038   -.0588103
               public |   -.051464    .008248    -6.24   0.000    -.0680477   -.0348804
                 cmsa |   .1108982   .0109997    10.08   0.000     .0887819    .1330145
                      |
                nocc2 |
                   2  |  -.0360296   .0105586    -3.41   0.001     -.057259   -.0148002
                   3  |  -.0196761   .0118539    -1.66   0.103      -.04351    .0041577
                   4  |  -.0703791   .0139431    -5.05   0.000    -.0984136   -.0423447
                   5  |   .0080803   .0175293     0.46   0.647    -.0271647    .0433253
                   6  |  -.2396793    .009674   -24.78   0.000    -.2591302   -.2202284
                   7  |  -.1925166   .0105782   -18.20   0.000    -.2137855   -.1712477
                   8  |   -.084649    .026939    -3.14   0.003    -.1388135   -.0304846
                   9  |  -.2187977   .0099222   -22.05   0.000    -.2387475   -.1988478
                  10  |  -.1426085   .0064505   -22.11   0.000    -.1555782   -.1296389
                  11  |  -.0672151   .0079979    -8.40   0.000    -.0832959   -.0511342
                  12  |  -.1872226   .0071699   -26.11   0.000    -.2016386   -.1728066
                      |
              quarter |
                   2  |   .0010722   .0028749     0.37   0.711    -.0047081    .0068526
                   3  |   .0077202   .0028757     2.68   0.010     .0019382    .0135022
                   4  |    .010853   .0020638     5.26   0.000     .0067035    .0150025
                      |
                _cons |   .4987031   .0558998     8.92   0.000     .3863091    .6110972
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,600,095,661)

Linear regression                               Number of obs     =    184,674
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3404
                                                Root MSE          =     .36136

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1404036   .0122707   -11.44   0.000    -.1650755   -.1157317
             treat_st |  -.0583651   .0322139    -1.81   0.076    -.1231355    .0064052
treat_stblackrelwhite |  -.0145727   .0147154    -0.99   0.327    -.0441599    .0150146
                      |
                state |
                  NH  |   .0358354   .0060941     5.88   0.000     .0235824    .0480883
                  VT  |  -.0220449   .0034807    -6.33   0.000    -.0290434   -.0150465
                  MA  |   .0928319   .0098712     9.40   0.000     .0729845    .1126793
                  RI  |   .0349854   .0102908     3.40   0.001     .0142944    .0556764
                  CT  |   .1394771   .0094919    14.69   0.000     .1203924    .1585617
                  NY  |   .1104295   .0080092    13.79   0.000     .0943259     .126533
                  NJ  |   .1800863   .0093569    19.25   0.000      .161273    .1988996
                  PA  |   .0032345   .0067253     0.48   0.633    -.0102878    .0167567
                  OH  |   .0028743    .006286     0.46   0.650    -.0097646    .0155131
                  IN  |   .0233117   .0058532     3.98   0.000     .0115429    .0350804
                  IL  |   .0883952    .006681    13.23   0.000     .0749621    .1018283
                  MI  |   .0895481   .0067356    13.29   0.000     .0760053    .1030909
                  WI  |   .0222396   .0057707     3.85   0.000     .0106368    .0338425
                  MN  |   .0595572   .0080819     7.37   0.000     .0433074     .075807
                  IA  |   .0287283   .0301129     0.95   0.345    -.0318178    .0892744
                  MO  |   .0210009    .006838     3.07   0.004     .0072522    .0347496
                  ND  |   .0405212   .0309583     1.31   0.197    -.0217247    .1027671
                  SD  |  -.0038623   .0298687    -0.13   0.898    -.0639173    .0561926
                  NE  |  -.0136253   .0287374    -0.47   0.638    -.0714056     .044155
                  KS  |   .0607101   .0295432     2.05   0.045     .0013095    .1201108
                  DE  |   .0569987   .0045541    12.52   0.000     .0478422    .0661553
                  MD  |   .1199891   .0090989    13.19   0.000     .1016946    .1382837
                  DC  |   .1338621   .0088509    15.12   0.000     .1160661    .1516581
                  VA  |   .1587761   .0298839     5.31   0.000     .0986906    .2188617
                  NC  |   .0534387   .0316397     1.69   0.098    -.0101771    .1170545
                  SC  |   .0084001   .0327015     0.26   0.798    -.0573507    .0741508
                  GA  |   .0987081    .031894     3.09   0.003     .0345808    .1628353
                  FL  |   .0379027   .0325874     1.16   0.251    -.0276187    .1034241
                  KY  |  -.0235672   .0055583    -4.24   0.000    -.0347429   -.0123915
                  TN  |   .0161395   .0314094     0.51   0.610    -.0470134    .0792924
                  AL  |   .0214344   .0320174     0.67   0.506    -.0429409    .0858096
                  MS  |  -.0033408   .0339157    -0.10   0.922    -.0715328    .0648513
                  AR  |  -.0075468   .0324803    -0.23   0.817    -.0728529    .0577592
                  LA  |   .0643668   .0321811     2.00   0.051    -.0003376    .1290712
                  OK  |  -.0413898   .0140683    -2.94   0.005    -.0696759   -.0131037
                  TX  |   .0886268   .0316574     2.80   0.007     .0249754    .1522782
                  ID  |   .0420091   .0323533     1.30   0.200    -.0230416    .1070599
                  WY  |   .1952034   .0328261     5.95   0.000      .129202    .2612047
                  CO  |   .0063551   .0089408     0.71   0.481    -.0116216    .0243317
                  NM  |   -.038629   .0072885    -5.30   0.000    -.0532835   -.0239746
                  AZ  |   .0796564   .0325382     2.45   0.018      .014234    .1450788
                  UT  |   .0130801   .0300989     0.43   0.666    -.0474377    .0735979
                  NV  |   .1498066   .0343238     4.36   0.000      .080794    .2188191
                  WA  |   .1033598   .0076269    13.55   0.000     .0880248    .1186948
                  OR  |   .0300166    .007402     4.06   0.000     .0151338    .0448993
                  CA  |   .1795372   .0096992    18.51   0.000     .1600357    .1990386
                  AK  |   .2421906   .0074356    32.57   0.000     .2272404    .2571409
                  HI  |   .0875893   .0089071     9.83   0.000     .0696804    .1054983
                      |
                 year |
                1990  |  -.0169514    .004925    -3.44   0.001    -.0268538    -.007049
                1991  |  -.0255921   .0061445    -4.17   0.000    -.0379464   -.0132378
                1992  |  -.0224281    .007345    -3.05   0.004    -.0371962     -.00766
                1993  |  -.0257368   .0069115    -3.72   0.001    -.0396334   -.0118403
                1996  |   -.013837   .0059449    -2.33   0.024      -.02579    -.001884
                1997  |  -.0060889     .00666    -0.91   0.365    -.0194797    .0073019
                1998  |   .0033369   .0067128     0.50   0.621    -.0101601    .0168338
                1999  |    .013006    .006644     1.96   0.056    -.0003526    .0263646
                2000  |   .0100077   .0058789     1.70   0.095    -.0018125     .021828
                2001  |   .0169917   .0067968     2.50   0.016     .0033258    .0306576
                2002  |    .029878   .0086732     3.44   0.001     .0124393    .0473167
                2003  |   .0380006   .0082773     4.59   0.000      .021358    .0546433
                2004  |   .0283447   .0063663     4.45   0.000     .0155445    .0411449
                2005  |   .0236986   .0080009     2.96   0.005     .0076117    .0397855
                2006  |   .0195151   .0106118     1.84   0.072    -.0018214    .0408516
                2007  |   .0238014   .0124793     1.91   0.062      -.00129    .0488927
                2008  |   .0111436   .0073307     1.52   0.135    -.0035958     .025883
                2009  |   .0329531   .0119256     2.76   0.008     .0089751    .0569311
                2010  |   .0437744   .0115805     3.78   0.000     .0204903    .0670584
                2011  |   .0219767   .0119436     1.84   0.072    -.0020375    .0459908
                2012  |   .0049292   .0122471     0.40   0.689    -.0196952    .0295537
                2013  |   .0054464   .0104659     0.52   0.605    -.0155967    .0264894
                2014  |   .0100301   .0114304     0.88   0.385    -.0129522    .0330124
                2015  |   .0106967   .0096959     1.10   0.275    -.0087983    .0301917
                2016  |   .0104276     .01049     0.99   0.325    -.0106641    .0315192
                2017  |   .0265159   .0096695     2.74   0.009     .0070739    .0459578
                2018  |   .0259388   .0097388     2.66   0.010     .0063576    .0455201
                2019  |   .0393079   .0107208     3.67   0.001     .0177522    .0608635
                      |
                 nind |
                   2  |   .0866501   .0191094     4.53   0.000     .0482281    .1250721
                   3  |  -.0346819   .0167295    -2.07   0.044    -.0683188    -.001045
                   4  |  -.2078827   .0220415    -9.43   0.000    -.2522001   -.1635653
                   5  |   .0865878   .0176991     4.89   0.000     .0510013    .1221743
                   6  |  -.0640485   .0207584    -3.09   0.003    -.1057859    -.022311
                   7  |  -.0774107   .0184625    -4.19   0.000     -.114532   -.0402894
                   8  |  -.1761388   .0196463    -8.97   0.000    -.2156404   -.1366372
                   9  |  -.1284534   .0205322    -6.26   0.000    -.1697361   -.0871707
                  10  |  -.1456896   .0393593    -3.70   0.001    -.2248267   -.0665524
                  11  |   .0979928   .0199388     4.91   0.000     .0579033    .1380824
                      |
                 educ |   .0723353   .0040904    17.68   0.000     .0641111    .0805596
                exper |   .0716533   .0024964    28.70   0.000      .066634    .0766726
               exper2 |  -.0025691   .0001695   -15.16   0.000    -.0029099   -.0022283
               exper3 |   .0000514   4.83e-06    10.66   0.000     .0000417    .0000611
               exper4 |  -4.17e-07   4.71e-08    -8.86   0.000    -5.12e-07   -3.23e-07
                 edex |   -.000784   .0001059    -7.40   0.000     -.000997   -.0005711
                      |
                ee_cl |
                   2  |   .0703976   .0169157     4.16   0.000     .0363862     .104409
                   3  |   .0573087   .0183927     3.12   0.003     .0203278    .0942896
                   4  |   .0135171   .0257595     0.52   0.602    -.0382759    .0653101
                   5  |   .0131649   .0212236     0.62   0.538     -.029508    .0558377
                   6  |   .0458531   .0161645     2.84   0.007     .0133522    .0783541
                   7  |   .0544768   .0207745     2.62   0.012     .0127069    .0962467
                   8  |   .0148095   .0237908     0.62   0.537    -.0330251    .0626441
                   9  |   .0062803   .0226234     0.28   0.783    -.0392071    .0517677
                  10  |   .0314725   .0189772     1.66   0.104    -.0066838    .0696287
                  11  |   .0445751   .0205951     2.16   0.035     .0031659    .0859842
                  12  |   .0589277   .0236498     2.49   0.016     .0113766    .1064787
                  13  |   .0433495    .020879     2.08   0.043     .0013696    .0853295
                  14  |    .023403    .020001     1.17   0.248    -.0168117    .0636176
                  15  |   .0400639   .0216801     1.85   0.071    -.0035268    .0836546
                  16  |   .0761747   .0220081     3.46   0.001     .0319245    .1204249
                      |
                 marr |   .0638397   .0027563    23.16   0.000     .0582978    .0693816
                partt |  -.0942717   .0177478    -5.31   0.000     -.129956   -.0585874
               public |  -.0513862   .0082666    -6.22   0.000    -.0680074   -.0347651
                 cmsa |   .1108823   .0109982    10.08   0.000      .088769    .1329957
                      |
                nocc2 |
                   2  |  -.0360185   .0105371    -3.42   0.001    -.0572048   -.0148322
                   3  |  -.0196543   .0118626    -1.66   0.104    -.0435057    .0041971
                   4  |   -.070408   .0139245    -5.06   0.000     -.098405    -.042411
                   5  |   .0080368   .0175528     0.46   0.649    -.0272555    .0433291
                   6  |  -.2396681   .0096962   -24.72   0.000    -.2591635   -.2201727
                   7  |  -.1924633   .0105793   -18.19   0.000    -.2137344   -.1711922
                   8  |  -.0848516   .0269097    -3.15   0.003    -.1389572    -.030746
                   9  |  -.2187391   .0099293   -22.03   0.000    -.2387033   -.1987748
                  10  |  -.1425874   .0064447   -22.12   0.000    -.1555453   -.1296295
                  11  |  -.0672061   .0079997    -8.40   0.000    -.0832906   -.0511216
                  12  |   -.187204   .0071733   -26.10   0.000    -.2016269   -.1727811
                      |
                unemp |  -.0035911   .0022887    -1.57   0.123     -.008193    .0010107
                      |
              quarter |
                   2  |   .0010614   .0028751     0.37   0.714    -.0047194    .0068422
                   3  |    .007751   .0028729     2.70   0.010     .0019747    .0135272
                   4  |   .0109826   .0020538     5.35   0.000     .0068531     .015112
                      |
                _cons |   .5153324   .0567846     9.08   0.000     .4011593    .6295055
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_mal_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
(sum of wgt is 1,600,095,661)

Linear regression                               Number of obs     =    184,674
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3406
                                                Root MSE          =     .36134

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.1414183   .0121939   -11.60   0.000    -.1659357   -.1169008
             treat_st |  -.0470946   .0189332    -2.49   0.016    -.0851625   -.0090268
treat_stblackrelwhite |  -.0135095   .0144627    -0.93   0.355    -.0425888    .0155698
                      |
                state |
                  NH  |   -.286563   .0101922   -28.12   0.000    -.3070559   -.2660702
                  VT  |  -.3840309    .016201   -23.70   0.000    -.4166052   -.3514567
                  MA  |  -.1900538   .0195036    -9.74   0.000    -.2292685   -.1508392
                  RI  |  -.2740669   .0270871   -10.12   0.000     -.328529   -.2196047
                  CT  |  -.1340169   .0213704    -6.27   0.000     -.176985   -.0910488
                  NY  |  -.0918968   .0254402    -3.61   0.001    -.1430477   -.0407459
                  NJ  |    -.15045   .0208428    -7.22   0.000    -.1923572   -.1085427
                  PA  |  -.2143028   .0198787   -10.78   0.000    -.2542717   -.1743339
                  OH  |   .0240577     .02258     1.07   0.292    -.0213425    .0694578
                  IN  |  -.1044236    .061759    -1.69   0.097    -.2285985    .0197513
                  IL  |  -.0181905   .0172396    -1.06   0.297    -.0528531     .016472
                  MI  |   .3902298   .0623654     6.26   0.000     .2648358    .5156238
                  WI  |  -.3004342   .0510125    -5.89   0.000    -.4030016   -.1978667
                  MN  |   -.135373   .0215556    -6.28   0.000    -.1787133   -.0920327
                  IA  |   .1221866   .0168498     7.25   0.000     .0883078    .1560655
                  MO  |   .0339601   .0157713     2.15   0.036     .0022497    .0656705
                  ND  |  -.6401215   .0324437   -19.73   0.000     -.705354    -.574889
                  SD  |  -.4354629   .0273195   -15.94   0.000    -.4903924   -.3805334
                  NE  |  -.3327466   .0147078   -22.62   0.000    -.3623186   -.3031747
                  KS  |   -.100522   .0184448    -5.45   0.000    -.1376076   -.0634363
                  DE  |   .3102476    .022491    13.79   0.000     .2650263    .3554688
                  MD  |  -.3152231   .0263853   -11.95   0.000    -.3682743   -.2621719
                  DC  |   -.288379   .0268272   -10.75   0.000    -.3423188   -.2344393
                  VA  |   .0712455   .0233173     3.06   0.004     .0243629    .1181281
                  NC  |   .1053049   .0168288     6.26   0.000     .0714683    .1391414
                  SC  |   .1344292   .0133214    10.09   0.000     .1076448    .1612136
                  GA  |   .1101422   .0177012     6.22   0.000     .0745515    .1457329
                  FL  |   .0558443   .0266528     2.10   0.041     .0022554    .1094333
                  KY  |   .1231833   .0365221     3.37   0.001     .0497507    .1966159
                  TN  |  -.2322195   .0179524   -12.94   0.000    -.2683153   -.1961237
                  AL  |  -.1908981   .0173271   -11.02   0.000    -.2257367   -.1560596
                  MS  |  -.1406868   .0201414    -6.98   0.000    -.1811838   -.1001897
                  AR  |  -.2549404   .0192385   -13.25   0.000    -.2936219   -.2162588
                  LA  |  -.1591942   .0249616    -6.38   0.000    -.2093829   -.1090056
                  OK  |  -.5135712    .091491    -5.61   0.000    -.6975263   -.3296162
                  TX  |  -.0946167   .0235886    -4.01   0.000    -.1420448   -.0471886
                  ID  |   .0102682   .0226484     0.45   0.652    -.0352695    .0558059
                  WY  |  -.9044766   .0261883   -34.54   0.000    -.9571318   -.8518215
                  CO  |  -.0408743   .0222307    -1.84   0.072    -.0855721    .0038236
                  NM  |  -.4058863   .0198349   -20.46   0.000    -.4457671   -.3660055
                  AZ  |  -.1938658   .0221392    -8.76   0.000    -.2383796    -.149352
                  UT  |    -.33474   .0364508    -9.18   0.000    -.4080294   -.2614507
                  NV  |    -.29212   .0416358    -7.02   0.000    -.3758344   -.2084056
                  WA  |  -.0318205   .0171904    -1.85   0.070    -.0663841    .0027431
                  OR  |   .0147741   .0136879     1.08   0.286    -.0127472    .0422954
                  CA  |   .1471798   .0234555     6.27   0.000     .1000195    .1943402
                  AK  |   .6391445   .0211242    30.26   0.000     .5966715    .6816175
                  HI  |  -.1009027   .0249348    -4.05   0.000    -.1510374    -.050768
                      |
        state#c.lyear |
                  ME  |   .0004684   .0002398     1.95   0.057    -.0000138    .0009506
                  NH  |   .0035524   .0002873    12.37   0.000     .0029748    .0041301
                  VT  |   .0039916   .0002041    19.55   0.000     .0035812    .0044021
                  MA  |   .0032493   .0001786    18.19   0.000     .0028902    .0036084
                  RI  |   .0035165   .0001334    26.36   0.000     .0032482    .0037848
                  CT  |   .0031581    .000214    14.75   0.000     .0027277    .0035884
                  NY  |   .0024739   .0001018    24.30   0.000     .0022692    .0026786
                  NJ  |   .0037172   .0002054    18.10   0.000     .0033042    .0041301
                  PA  |   .0026175   .0001557    16.81   0.000     .0023044    .0029306
                  OH  |   .0002731   .0001883     1.45   0.153    -.0001054    .0006516
                  IN  |   .0017228   .0005938     2.90   0.006     .0005289    .0029167
                  IL  |   .0015373   .0001778     8.65   0.000     .0011799    .0018947
                  MI  |  -.0025383   .0005632    -4.51   0.000    -.0036707    -.001406
                  WI  |   .0036518    .000422     8.65   0.000     .0028033    .0045003
                  MN  |    .002381   .0001285    18.54   0.000     .0021227    .0026393
                  IA  |  -.0005732   .0001368    -4.19   0.000    -.0008483   -.0002982
                  MO  |    .000365   .0001481     2.46   0.017     .0000672    .0006628
                  ND  |   .0070169   .0000942    74.47   0.000     .0068274    .0072064
                  SD  |    .004649   .0001109    41.90   0.000     .0044259    .0048721
                  NE  |   .0034872   .0002086    16.72   0.000     .0030678    .0039066
                  KS  |   .0019522   .0001604    12.17   0.000     .0016297    .0022747
                  DE  |  -.0022661   .0002752    -8.24   0.000    -.0028193   -.0017128
                  MD  |   .0047103   .0001627    28.96   0.000     .0043832    .0050373
                  DC  |   .0046411   .0002219    20.91   0.000     .0041949    .0050873
                  VA  |   .0012078   .0001674     7.22   0.000     .0008713    .0015444
                  NC  |  -.0001611   .0002336    -0.69   0.494    -.0006308    .0003086
                  SC  |  -.0007955   .0002385    -3.34   0.002    -.0012749    -.000316
                  GA  |   .0002537   .0001989     1.28   0.208    -.0001463    .0006537
                  FL  |   .0002166   .0001654     1.31   0.197    -.0001161    .0005493
                  KY  |   -.000938    .000336    -2.79   0.008    -.0016136   -.0002624
                  TN  |   .0028181   .0001711    16.48   0.000     .0024742     .003162
                  AL  |   .0024597   .0002638     9.33   0.000     .0019294      .00299
                  MS  |   .0017318   .0002183     7.93   0.000     .0012929    .0021707
                  AR  |   .0028035   .0002446    11.46   0.000     .0023117    .0032953
                  LA  |   .0025814   .0001878    13.74   0.000     .0022037     .002959
                  OK  |   .0050827   .0009376     5.42   0.000     .0031976    .0069678
                  TX  |   .0021638   .0001771    12.22   0.000     .0018078    .0025198
                  ID  |   .0006892    .000266     2.59   0.013     .0001544    .0012241
                  WY  |   .0108056   .0000652   165.84   0.000     .0106745    .0109366
                  CO  |   .0009467   .0001224     7.74   0.000     .0007006    .0011928
                  NM  |   .0040249   .0003237    12.43   0.000     .0033739    .0046758
                  AZ  |   .0030455   .0002109    14.44   0.000     .0026215    .0034695
                  UT  |   .0037711    .000064    58.92   0.000     .0036424    .0038998
                  NV  |     .00465   .0001915    24.28   0.000     .0042649     .005035
                  WA  |   .0018144   .0001369    13.25   0.000     .0015391    .0020896
                  OR  |   .0006472   .0001903     3.40   0.001     .0002647    .0010298
                  CA  |   .0008116   .0001304     6.23   0.000     .0005495    .0010737
                  AK  |  -.0034088    .000118   -28.89   0.000     -.003646   -.0031716
                  HI  |   .0023064   .0001976    11.67   0.000      .001909    .0027037
                      |
                 nind |
                   2  |   .0882789   .0192141     4.59   0.000     .0496462    .1269115
                   3  |  -.0350553   .0165791    -2.11   0.040    -.0683897   -.0017209
                   4  |  -.2072067   .0221533    -9.35   0.000     -.251749   -.1626645
                   5  |   .0876012   .0178149     4.92   0.000     .0517818    .1234205
                   6  |   -.063651   .0212112    -3.00   0.004    -.1062991    -.021003
                   7  |  -.0769849   .0187588    -4.10   0.000     -.114702   -.0392679
                   8  |  -.1747298   .0197447    -8.85   0.000    -.2144291   -.1350304
                   9  |  -.1265635   .0205131    -6.17   0.000    -.1678078   -.0853191
                  10  |  -.1446416   .0392366    -3.69   0.001     -.223532   -.0657511
                  11  |   .0987274   .0201511     4.90   0.000     .0582109    .1392439
                      |
                 educ |    .071647   .0041056    17.45   0.000     .0633922    .0799018
                exper |   .0712588   .0024058    29.62   0.000     .0664217    .0760959
               exper2 |  -.0025388   .0001661   -15.29   0.000    -.0028727   -.0022049
               exper3 |   .0000504   4.78e-06    10.56   0.000     .0000408    .0000601
               exper4 |  -4.08e-07   4.68e-08    -8.72   0.000    -5.02e-07   -3.14e-07
                 edex |  -.0007748   .0001072    -7.23   0.000    -.0009903   -.0005592
                      |
                ee_cl |
                   2  |   .0697025   .0171525     4.06   0.000      .035215    .1041899
                   3  |   .0570668   .0186961     3.05   0.004     .0194757    .0946579
                   4  |   .0145111   .0265921     0.55   0.588     -.038956    .0679781
                   5  |   .0111407   .0214308     0.52   0.606    -.0319488    .0542302
                   6  |    .043864   .0165147     2.66   0.011      .010659     .077069
                   7  |   .0537476   .0211415     2.54   0.014     .0112397    .0962554
                   8  |   .0154937    .024453     0.63   0.529    -.0336724    .0646598
                   9  |     .00347   .0228996     0.15   0.880    -.0425728    .0495129
                  10  |    .030431   .0194617     1.56   0.124    -.0086993    .0695614
                  11  |   .0438511   .0210471     2.08   0.043      .001533    .0861691
                  12  |   .0593184   .0243612     2.43   0.019     .0103369    .1082999
                  13  |   .0422305   .0214757     1.97   0.055    -.0009494    .0854103
                  14  |   .0231793   .0204738     1.13   0.263     -.017986    .0643447
                  15  |   .0416176    .022247     1.87   0.067     -.003113    .0863483
                  16  |   .0777104     .02267     3.43   0.001     .0321293    .1232915
                      |
                 marr |    .063865   .0027047    23.61   0.000     .0584267    .0693032
                partt |  -.0939008   .0177394    -5.29   0.000    -.1295682   -.0582334
               public |    -.05143   .0082813    -6.21   0.000    -.0680807   -.0347793
                 cmsa |    .110467   .0109953    10.05   0.000     .0883596    .1325745
                      |
                nocc2 |
                   2  |  -.0354299   .0105339    -3.36   0.002    -.0566098     -.01425
                   3  |  -.0193683   .0118764    -1.63   0.109    -.0432474    .0045108
                   4  |  -.0705017   .0140319    -5.02   0.000    -.0987148   -.0422886
                   5  |    .008229   .0175597     0.47   0.641    -.0270771    .0435351
                   6  |  -.2394045   .0097525   -24.55   0.000    -.2590132   -.2197958
                   7  |  -.1930155   .0106006   -18.21   0.000    -.2143294   -.1717016
                   8  |  -.0841734   .0271981    -3.09   0.003    -.1388588    -.029488
                   9  |  -.2186244   .0099431   -21.99   0.000    -.2386164   -.1986324
                  10  |  -.1425105    .006473   -22.02   0.000    -.1555254   -.1294956
                  11  |  -.0672709   .0079292    -8.48   0.000    -.0832137   -.0513281
                  12  |  -.1871751   .0071501   -26.18   0.000    -.2015512   -.1727989
                      |
                unemp |  -.0045446     .00113    -4.02   0.000    -.0068167   -.0022725
                      |
              quarter |
                   2  |    .001003   .0028286     0.35   0.724    -.0046843    .0066902
                   3  |   .0073513   .0029598     2.48   0.017     .0014003    .0133024
                   4  |     .01071   .0020522     5.22   0.000     .0065838    .0148363
                      |
                _cons |   .4878776   .0579046     8.43   0.000     .3714527    .6043026
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_mal_all_sltt 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,271,065,831)

Linear regression                               Number of obs     =    151,292
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4289
                                                Root MSE          =     .36562

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0557659   .0100026    -5.58   0.000    -.0758774   -.0356543
             treat_st |   -.060817   .0184223    -3.30   0.002    -.0978576   -.0237765
treat_stblackrelwhite |   .0004938   .0156032     0.03   0.975    -.0308786    .0318661
                      |
                state |
                  NH  |   .0483409    .004321    11.19   0.000     .0396529     .057029
                  VT  |  -.0060727   .0017006    -3.57   0.001     -.009492   -.0026534
                  MA  |   .1314246   .0088887    14.79   0.000     .1135527    .1492966
                  RI  |   .1367592    .009725    14.06   0.000     .1172059    .1563126
                  CT  |    .169528   .0090735    18.68   0.000     .1512845    .1877715
                  NY  |    .122867   .0079671    15.42   0.000     .1068481     .138886
                  NJ  |   .2125991   .0090103    23.60   0.000     .1944826    .2307156
                  PA  |   .0365015    .007424     4.92   0.000     .0215745    .0514286
                  OH  |   .0155841   .0074947     2.08   0.043     .0005149    .0306532
                  IN  |    .000265   .0070774     0.04   0.970     -.013965     .014495
                  IL  |   .0363661   .0076153     4.78   0.000     .0210544    .0516778
                  MI  |    .085682   .0080072    10.70   0.000     .0695824    .1017816
                  WI  |   .0434028   .0061524     7.05   0.000     .0310327     .055773
                  MN  |   .0862151   .0072204    11.94   0.000     .0716976    .1007326
                  IA  |    .044328    .018039     2.46   0.018     .0080582    .0805978
                  MO  |  -.0442782   .0076772    -5.77   0.000    -.0597143   -.0288421
                  ND  |   .0094155   .0187543     0.50   0.618    -.0282926    .0471237
                  SD  |  -.0389811   .0177774    -2.19   0.033    -.0747249   -.0032373
                  NE  |   -.035641   .0172408    -2.07   0.044     -.070306    -.000976
                  KS  |   .0052174   .0169779     0.31   0.760     -.028919    .0393538
                  DE  |   .1423657   .0062754    22.69   0.000     .1297481    .1549833
                  MD  |     .16403   .0091281    17.97   0.000     .1456768    .1823832
                  DC  |   .1822333   .0113575    16.05   0.000     .1593975    .2050691
                  VA  |   .1455287   .0178242     8.16   0.000     .1096907    .1813668
                  NC  |    .050186   .0177929     2.82   0.007     .0144111    .0859609
                  SC  |  -.0310498   .0178636    -1.74   0.089    -.0669669    .0048673
                  GA  |   .0561557   .0181297     3.10   0.003     .0197035    .0926078
                  FL  |   .0479343   .0180777     2.65   0.011     .0115866     .084282
                  KY  |  -.0395515   .0062845    -6.29   0.000    -.0521874   -.0269156
                  TN  |   .0244956   .0175751     1.39   0.170    -.0108415    .0598328
                  AL  |  -.0519458   .0173322    -3.00   0.004    -.0867945    -.017097
                  MS  |   -.071719   .0179851    -3.99   0.000    -.1078804   -.0355576
                  AR  |  -.0634824   .0177757    -3.57   0.001    -.0992228    -.027742
                  LA  |   -.016856   .0180614    -0.93   0.355    -.0531709    .0194588
                  OK  |  -.0977118   .0091903   -10.63   0.000    -.1161902   -.0792334
                  TX  |   .0521511   .0177467     2.94   0.005      .016469    .0878333
                  ID  |  -.0044575   .0176977    -0.25   0.802    -.0400411    .0311261
                  WY  |   .0958632   .0188974     5.07   0.000     .0578674    .1338591
                  CO  |   .0053119   .0089902     0.59   0.557     -.012764    .0233879
                  NM  |  -.0671333   .0054488   -12.32   0.000    -.0780889   -.0561776
                  AZ  |   .0582118   .0189514     3.07   0.004     .0201074    .0963162
                  UT  |   .0040059   .0185469     0.22   0.830    -.0332851    .0412969
                  NV  |   .1489277   .0209266     7.12   0.000      .106852    .1910034
                  WA  |   .0832802   .0086488     9.63   0.000     .0658905    .1006698
                  OR  |   .0151454   .0074105     2.04   0.046     .0002456    .0300451
                  CA  |   .1894411   .0086258    21.96   0.000     .1720978    .2067844
                  AK  |   .2234564   .0043287    51.62   0.000      .214753    .2321598
                  HI  |   .0741634   .0073713    10.06   0.000     .0593425    .0889844
                      |
                 year |
                1990  |  -.0014009   .0049753    -0.28   0.779    -.0114043    .0086026
                1991  |  -.0092302   .0069139    -1.34   0.188    -.0231314     .004671
                1992  |    .002669   .0083876     0.32   0.752    -.0141954    .0195334
                1993  |   .0117123   .0072385     1.62   0.112    -.0028416    .0262663
                1996  |   .0228461   .0080785     2.83   0.007     .0066032     .039089
                1997  |   .0247481    .006817     3.63   0.001     .0110416    .0384546
                1998  |   .0420572   .0068626     6.13   0.000     .0282591    .0558553
                1999  |   .0445709   .0064211     6.94   0.000     .0316604    .0574815
                2000  |   .0397083   .0074942     5.30   0.000     .0246402    .0547765
                2001  |   .0536589   .0075187     7.14   0.000     .0385415    .0687763
                2002  |   .0614832   .0072522     8.48   0.000     .0469017    .0760647
                2003  |   .0506939    .006309     8.04   0.000     .0380087     .063379
                2004  |   .0461759   .0088123     5.24   0.000     .0284576    .0638942
                2005  |   .0416824   .0088458     4.71   0.000     .0238966    .0594681
                2006  |   .0405065   .0075254     5.38   0.000     .0253756    .0556374
                2007  |    .033962   .0083788     4.05   0.000     .0171152    .0508088
                2008  |   .0291879   .0118894     2.45   0.018     .0052828    .0530931
                2009  |   .0525539   .0106827     4.92   0.000     .0310749    .0740329
                2010  |   .0583736   .0114808     5.08   0.000       .03529    .0814572
                2011  |   .0372511   .0101732     3.66   0.001     .0167965    .0577057
                2012  |   .0084321   .0098948     0.85   0.398    -.0114628     .028327
                2013  |   .0205838   .0093039     2.21   0.032     .0018771    .0392905
                2014  |   .0065703   .0175974     0.37   0.711    -.0288118    .0419523
                2015  |   .0227934   .0132504     1.72   0.092    -.0038483     .049435
                2016  |   .0306837   .0088292     3.48   0.001     .0129313     .048436
                2017  |   .0152342   .0121397     1.25   0.216    -.0091743    .0396427
                2018  |   .0166258   .0111029     1.50   0.141    -.0056982    .0389497
                2019  |   .0233053   .0094916     2.46   0.018     .0042211    .0423895
                      |
                 nind |
                   2  |    .063086   .0530297     1.19   0.240    -.0435373    .1697093
                   3  |   .0521399   .0397693     1.31   0.196    -.0278216    .1321014
                   4  |  -.2270583   .0514883    -4.41   0.000    -.3305825   -.1235341
                   5  |   .1483339   .0439175     3.38   0.001     .0600319    .2366359
                   6  |  -.0358306   .0486596    -0.74   0.465    -.1336674    .0620061
                   7  |  -.0927185   .0469444    -1.98   0.054    -.1871066    .0016696
                   8  |  -.1276137   .0505547    -2.52   0.015    -.2292606   -.0259667
                   9  |  -.1758087   .0461615    -3.81   0.000    -.2686227   -.0829947
                  10  |  -.1398713   .0612831    -2.28   0.027    -.2630892   -.0166535
                  11  |   .0114858   .0472118     0.24   0.809    -.0834398    .1064114
                      |
                 educ |   .1047775   .0057049    18.37   0.000     .0933071     .116248
                exper |   .0504349   .0034082    14.80   0.000     .0435823    .0572875
               exper2 |  -.0017584   .0002634    -6.68   0.000     -.002288   -.0012289
               exper3 |   .0000314   9.12e-06     3.44   0.001     .0000131    .0000498
               exper4 |  -2.17e-07   1.02e-07    -2.12   0.039    -4.22e-07   -1.10e-08
                 edex |  -.0004607   .0001249    -3.69   0.001    -.0007119   -.0002095
                      |
                ee_cl |
                   2  |   -.058288   .0139494    -4.18   0.000    -.0863351   -.0302409
                   3  |  -.1195109   .0179797    -6.65   0.000    -.1556616   -.0833602
                   4  |  -.1685385   .0335313    -5.03   0.000    -.2359577   -.1011194
                   5  |  -.0702644   .0208404    -3.37   0.001    -.1121669   -.0283619
                   6  |  -.0904483   .0173033    -5.23   0.000    -.1252388   -.0556578
                   7  |  -.1360485   .0222044    -6.13   0.000    -.1806934   -.0914036
                   8  |  -.1642559   .0350016    -4.69   0.000    -.2346314   -.0938805
                   9  |   -.044948   .0165555    -2.71   0.009     -.078235    -.011661
                  10  |  -.1101185   .0232368    -4.74   0.000    -.1568392   -.0633979
                  11  |   -.149561   .0246235    -6.07   0.000    -.1990699   -.1000521
                  12  |  -.1425974   .0315482    -4.52   0.000    -.2060292   -.0791656
                  13  |   .0022779   .0209864     0.11   0.914    -.0399181    .0444739
                  14  |  -.1013351   .0219993    -4.61   0.000    -.1455677   -.0571026
                  15  |  -.1144037    .026054    -4.39   0.000    -.1667888   -.0620186
                  16  |  -.1112494   .0322863    -3.45   0.001    -.1761654   -.0463334
                      |
                 marr |   .0060273   .0034914     1.73   0.091    -.0009926    .0130472
                partt |  -.0648477   .0070323    -9.22   0.000    -.0789871   -.0507083
               public |   .0234349   .0121901     1.92   0.060    -.0010749    .0479447
                 cmsa |   .1213288    .009623    12.61   0.000     .1019805    .1406771
                      |
                nocc2 |
                   2  |  -.0389576   .0108223    -3.60   0.001    -.0607173   -.0171978
                   3  |  -.0225622   .0137052    -1.65   0.106    -.0501184    .0049941
                   4  |  -.1066187   .0110253    -9.67   0.000    -.1287866   -.0844508
                   5  |   .1400028   .0164127     8.53   0.000     .1070028    .1730028
                   6  |  -.2347432   .0096289   -24.38   0.000    -.2541034   -.2153829
                   7  |  -.2425182   .0235507   -10.30   0.000    -.2898701   -.1951663
                   8  |  -.0902219   .0466297    -1.93   0.059    -.1839772    .0035334
                   9  |  -.2886752   .0153841   -18.76   0.000     -.319607   -.2577435
                  10  |  -.2585412   .0176352   -14.66   0.000    -.2939992   -.2230833
                  11  |   .0067212   .0188193     0.36   0.723    -.0311175    .0445598
                  12  |  -.2420178   .0132611   -18.25   0.000     -.268681   -.2153545
                      |
              quarter |
                   2  |   .0046289   .0027127     1.71   0.094    -.0008252    .0100831
                   3  |   .0143296   .0025692     5.58   0.000     .0091639    .0194952
                   4  |   .0183269   .0028722     6.38   0.000     .0125519    .0241019
                      |
                _cons |   .1631927    .057749     2.83   0.007     .0470805    .2793049
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "No"

added macro:
        e(unemp_level) : "No"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all

.         
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl marr p
> artt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,271,065,831)

Linear regression                               Number of obs     =    151,292
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4289
                                                Root MSE          =     .36562

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0557866   .0099958    -5.58   0.000    -.0758845   -.0356888
             treat_st |   -.061574   .0190021    -3.24   0.002    -.0997804   -.0233677
treat_stblackrelwhite |   .0005398   .0155815     0.03   0.973    -.0307889    .0318685
                      |
                state |
                  NH  |   .0455569   .0050757     8.98   0.000     .0353516    .0557621
                  VT  |  -.0086713   .0024913    -3.48   0.001    -.0136804   -.0036622
                  MA  |   .1314951   .0088767    14.81   0.000     .1136474    .1493428
                  RI  |   .1391995   .0095953    14.51   0.000     .1199068    .1584921
                  CT  |   .1698863   .0089985    18.88   0.000     .1517935    .1879791
                  NY  |   .1245384   .0078107    15.94   0.000     .1088338    .1402429
                  NJ  |   .2138201   .0088348    24.20   0.000     .1960565    .2315836
                  PA  |   .0373724   .0073591     5.08   0.000     .0225759    .0521689
                  OH  |   .0170187   .0074102     2.30   0.026     .0021195    .0319179
                  IN  |   .0003427   .0070988     0.05   0.962    -.0139305    .0146158
                  IL  |   .0386932   .0074493     5.19   0.000     .0237155    .0536709
                  MI  |   .0892928   .0084296    10.59   0.000      .072344    .1062417
                  WI  |   .0424047    .006185     6.86   0.000     .0299689    .0548405
                  MN  |   .0842753   .0073644    11.44   0.000     .0694683    .0990824
                  IA  |   .0422088   .0179858     2.35   0.023     .0060458    .0783717
                  MO  |  -.0438074   .0076407    -5.73   0.000      -.05917   -.0284448
                  ND  |   .0059026   .0184255     0.32   0.750    -.0311443    .0429495
                  SD  |  -.0422404   .0175729    -2.40   0.020     -.077573   -.0069077
                  NE  |  -.0397313   .0170504    -2.33   0.024    -.0740134   -.0054492
                  KS  |   .0042825   .0172484     0.25   0.805    -.0303977    .0389627
                  DE  |   .1408621   .0062447    22.56   0.000     .1283063     .153418
                  MD  |   .1633336    .009289    17.58   0.000     .1446569    .1820103
                  DC  |   .1862577   .0108772    17.12   0.000     .1643876    .2081278
                  VA  |   .1442328   .0180745     7.98   0.000     .1078916    .1805739
                  NC  |   .0513677   .0184594     2.78   0.008     .0142526    .0884828
                  SC  |  -.0280878   .0189545    -1.48   0.145    -.0661984    .0100229
                  GA  |   .0579204   .0189037     3.06   0.004     .0199119    .0959289
                  FL  |   .0498201   .0188685     2.64   0.011     .0118825    .0877577
                  KY  |  -.0376073   .0063826    -5.89   0.000    -.0504404   -.0247742
                  TN  |   .0260655    .018348     1.42   0.162    -.0108257    .0629568
                  AL  |   -.049403   .0183339    -2.69   0.010    -.0862658   -.0125403
                  MS  |  -.0674937   .0196185    -3.44   0.001    -.1069394   -.0280479
                  AR  |  -.0613361   .0187418    -3.27   0.002     -.099019   -.0236533
                  LA  |   -.013662   .0192063    -0.71   0.480    -.0522789    .0249548
                  OK  |  -.0984931   .0093168   -10.57   0.000    -.1172258   -.0797605
                  TX  |   .0538621   .0185276     2.91   0.006       .01661    .0911143
                  ID  |  -.0035556    .018342    -0.19   0.847    -.0404347    .0333236
                  WY  |   .0949084   .0191238     4.96   0.000     .0564575    .1333594
                  CO  |   .0043512   .0091438     0.48   0.636    -.0140337    .0227361
                  NM  |  -.0655973   .0052999   -12.38   0.000    -.0762535    -.054941
                  AZ  |   .0601817   .0197299     3.05   0.004      .020512    .0998514
                  UT  |   .0026222   .0188025     0.14   0.890    -.0351827    .0404271
                  NV  |   .1515419   .0219175     6.91   0.000     .1074739      .19561
                  WA  |   .0852595   .0086177     9.89   0.000     .0679326    .1025865
                  OR  |   .0178685   .0073913     2.42   0.019     .0030073    .0327298
                  CA  |   .1931042   .0084674    22.81   0.000     .1760794     .210129
                  AK  |   .2280307   .0049088    46.45   0.000     .2181608    .2379006
                  HI  |   .0714583   .0075942     9.41   0.000     .0561891    .0867274
                      |
                 year |
                1990  |  -.0005317   .0052989    -0.10   0.920    -.0111859    .0101225
                1991  |  -.0053922   .0082305    -0.66   0.515    -.0219407    .0111563
                1992  |   .0080249    .011005     0.73   0.469    -.0141023     .030152
                1993  |    .015776   .0094017     1.68   0.100    -.0031275    .0346795
                1996  |   .0233452   .0085504     2.73   0.009     .0061535    .0405369
                1997  |   .0242961   .0070631     3.44   0.001     .0100948    .0384974
                1998  |   .0405896   .0069635     5.83   0.000     .0265885    .0545907
                1999  |   .0424483   .0067145     6.32   0.000     .0289479    .0559488
                2000  |   .0371353   .0075233     4.94   0.000     .0220087    .0522619
                2001  |   .0526308   .0074982     7.02   0.000     .0375546     .067707
                2002  |   .0628668   .0072759     8.64   0.000     .0482376     .077496
                2003  |   .0526608   .0065539     8.03   0.000     .0394832    .0658384
                2004  |   .0471554   .0091775     5.14   0.000     .0287027     .065608
                2005  |   .0415609   .0088529     4.69   0.000     .0237609    .0593609
                2006  |   .0395145    .007685     5.14   0.000     .0240628    .0549662
                2007  |   .0329704   .0084042     3.92   0.000     .0160727    .0498682
                2008  |   .0307775    .012358     2.49   0.016       .00593     .055625
                2009  |   .0617168   .0146298     4.22   0.000     .0323015    .0911321
                2010  |   .0682852    .014856     4.60   0.000     .0384153    .0981552
                2011  |   .0456015   .0132831     3.43   0.001     .0188941     .072309
                2012  |   .0150797   .0122002     1.24   0.222    -.0094505    .0396099
                2013  |   .0258055   .0115363     2.24   0.030     .0026101    .0490008
                2014  |   .0089621   .0184652     0.49   0.630    -.0281647     .046089
                2015  |   .0231103   .0134513     1.72   0.092    -.0039353     .050156
                2016  |   .0300435   .0087158     3.45   0.001     .0125192    .0475679
                2017  |   .0135588   .0123991     1.09   0.280    -.0113713    .0384888
                2018  |   .0139904    .010649     1.31   0.195    -.0074208    .0354017
                2019  |   .0201609   .0091972     2.19   0.033     .0016687    .0386531
                      |
                 nind |
                   2  |   .0626145   .0530859     1.18   0.244    -.0441219    .1693509
                   3  |   .0517987   .0398238     1.30   0.200    -.0282725    .1318699
                   4  |  -.2273335   .0515538    -4.41   0.000    -.3309894   -.1236777
                   5  |   .1480358   .0440107     3.36   0.002     .0595463    .2365253
                   6  |   -.036186    .048722    -0.74   0.461     -.134148    .0617761
                   7  |  -.0930836   .0470381    -1.98   0.054      -.18766    .0014929
                   8  |  -.1279149   .0506492    -2.53   0.015     -.229752   -.0260778
                   9  |  -.1761491   .0462409    -3.81   0.000    -.2691227   -.0831754
                  10  |  -.1402091   .0613813    -2.28   0.027    -.2636245   -.0167936
                  11  |   .0111037   .0472846     0.23   0.815    -.0839683    .1061758
                      |
                 educ |   .1047687   .0057099    18.35   0.000     .0932881    .1162492
                exper |   .0504581   .0034116    14.79   0.000     .0435987    .0573176
               exper2 |  -.0017601   .0002634    -6.68   0.000    -.0022898   -.0012305
               exper3 |   .0000315   9.12e-06     3.45   0.001     .0000131    .0000498
               exper4 |  -2.17e-07   1.02e-07    -2.12   0.039    -4.23e-07   -1.17e-08
                 edex |  -.0004607   .0001252    -3.68   0.001    -.0007123    -.000209
                      |
                ee_cl |
                   2  |  -.0582889   .0139243    -4.19   0.000    -.0862856   -.0302923
                   3  |  -.1195084   .0179572    -6.66   0.000    -.1556139    -.083403
                   4  |  -.1685122    .033506    -5.03   0.000    -.2358806   -.1011438
                   5  |  -.0703321   .0208011    -3.38   0.001    -.1121556   -.0285087
                   6  |  -.0904703   .0172761    -5.24   0.000    -.1252062   -.0557344
                   7  |  -.1360485   .0221571    -6.14   0.000    -.1805984   -.0914986
                   8  |  -.1642484   .0349714    -4.70   0.000    -.2345631   -.0939336
                   9  |  -.0450783   .0165539    -2.72   0.009    -.0783621   -.0117944
                  10  |  -.1101911   .0232093    -4.75   0.000    -.1568566   -.0635257
                  11  |  -.1496148   .0246157    -6.08   0.000     -.199108   -.1001216
                  12  |  -.1426289   .0315182    -4.53   0.000    -.2060005   -.0792574
                  13  |    .002176   .0210036     0.10   0.918    -.0400545    .0444066
                  14  |  -.1013692   .0219809    -4.61   0.000    -.1455649   -.0571736
                  15  |  -.1144616   .0260423    -4.40   0.000    -.1668232   -.0621001
                  16  |  -.1112951    .032263    -3.45   0.001    -.1761642    -.046426
                      |
                 marr |   .0060205   .0034925     1.72   0.091    -.0010017    .0130427
                partt |  -.0647849   .0070198    -9.23   0.000    -.0788992   -.0506706
               public |   .0235096   .0121972     1.93   0.060    -.0010146    .0480337
                 cmsa |   .1212977   .0096113    12.62   0.000     .1019728    .1406226
                      |
                nocc2 |
                   2  |  -.0389188   .0108313    -3.59   0.001    -.0606965   -.0171411
                   3  |  -.0224782   .0137095    -1.64   0.108     -.050043    .0050867
                   4  |   -.106594   .0110176    -9.67   0.000    -.1287464   -.0844417
                   5  |   .1400288    .016398     8.54   0.000     .1070584    .1729992
                   6  |  -.2347173   .0096351   -24.36   0.000      -.25409   -.2153447
                   7  |  -.2425125   .0235542   -10.30   0.000    -.2898713   -.1951537
                   8  |  -.0902394   .0466432    -1.93   0.059    -.1840218    .0035429
                   9  |  -.2886386   .0153868   -18.76   0.000     -.319576   -.2577013
                  10  |  -.2585632   .0176407   -14.66   0.000    -.2940322   -.2230942
                  11  |   .0068694   .0188032     0.37   0.716    -.0309369    .0446758
                  12  |  -.2419882    .013242   -18.27   0.000     -.268613   -.2153633
                      |
                unemp |  -.0022209    .001506    -1.47   0.147    -.0052489    .0008071
                      |
              quarter |
                   2  |   .0046636   .0027168     1.72   0.093     -.000799    .0101262
                   3  |    .014331   .0025772     5.56   0.000     .0091492    .0195128
                   4  |   .0183818   .0028888     6.36   0.000     .0125734    .0241901
                      |
                _cons |   .1737249   .0541199     3.21   0.002     .0649096    .2825402
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "Yes"

added macro:
             e(yr_dum) : "Yes"

. estadd local sltt "No"

added macro:
               e(sltt) : "No"

. eststo uwagstagdid_fem_all_unemp 

. 
. reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.state#c.lyear i.nind educ exper exper2 exper3 exper4 edex i.ee_
> cl marr partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
(sum of wgt is 1,271,065,831)

Linear regression                               Number of obs     =    151,292
                                                F(47, 48)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.4286
                                                Root MSE          =     .36575

                                          (Std. Err. adjusted for 49 clusters in state)
---------------------------------------------------------------------------------------
                      |               Robust
               lwage3 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
        blackrelwhite |  -.0567615   .0096896    -5.86   0.000    -.0762437   -.0372793
             treat_st |     -.0539   .0213243    -2.53   0.015    -.0967754   -.0110247
treat_stblackrelwhite |   .0006399   .0149397     0.04   0.966    -.0293983    .0306782
                      |
                state |
                  NH  |  -.1129543   .0156977    -7.20   0.000    -.1445166   -.0813921
                  VT  |  -.2734957   .0155386   -17.60   0.000    -.3047382   -.2422532
                  MA  |  -.2594978   .0152208   -17.05   0.000    -.2901011   -.2288944
                  RI  |   -.396892   .0194042   -20.45   0.000    -.4359068   -.3578771
                  CT  |   .0529471   .0183974     2.88   0.006     .0159566    .0899376
                  NY  |  -.1607145   .0158857   -10.12   0.000    -.1926548   -.1287742
                  NJ  |  -.2297114   .0182278   -12.60   0.000    -.2663607    -.193062
                  PA  |  -.1855322   .0179772   -10.32   0.000    -.2216778   -.1493867
                  OH  |   -.025837   .0157924    -1.64   0.108    -.0575898    .0059158
                  IN  |  -.2091988   .0758703    -2.76   0.008    -.3617464   -.0566513
                  IL  |   .0157585   .0149675     1.05   0.298    -.0143356    .0458527
                  MI  |   .2034251   .0599315     3.39   0.001     .0829248    .3239254
                  WI  |  -.2090861   .0441701    -4.73   0.000     -.297896   -.1202762
                  MN  |  -.0003339   .0165218    -0.02   0.984    -.0335532    .0328854
                  IA  |  -.0334945   .0203431    -1.65   0.106     -.074397     .007408
                  MO  |   .1338984   .0214187     6.25   0.000     .0908332    .1769636
                  ND  |  -.7560666   .0292182   -25.88   0.000    -.8148138   -.6973195
                  SD  |  -.4049443   .0232714   -17.40   0.000    -.4517345   -.3581541
                  NE  |  -.2790466   .0261474   -10.67   0.000    -.3316195   -.2264736
                  KS  |   .1868746   .0244404     7.65   0.000     .1377338    .2360153
                  DE  |   .1176074    .033296     3.53   0.001     .0506613    .1845535
                  MD  |  -.3434137   .0193825   -17.72   0.000    -.3823847   -.3044427
                  DC  |  -.3733781   .0218289   -17.10   0.000     -.417268   -.3294883
                  VA  |  -.3359679   .0244028   -13.77   0.000     -.385033   -.2869027
                  NC  |   .0227194    .018982     1.20   0.237    -.0154464    .0608853
                  SC  |   .0330834   .0207161     1.60   0.117    -.0085691     .074736
                  GA  |   .0362697   .0254688     1.42   0.161    -.0149388    .0874781
                  FL  |   .2376323   .0293193     8.10   0.000      .178682    .2965827
                  KY  |  -.0101794   .0362582    -0.28   0.780    -.0830813    .0627225
                  TN  |   .0482265    .021981     2.19   0.033     .0040308    .0924222
                  AL  |  -.0257803   .0217714    -1.18   0.242    -.0695545    .0179939
                  MS  |  -.1538949    .019883    -7.74   0.000    -.1938724   -.1139174
                  AR  |  -.4750317   .0206989   -22.95   0.000    -.5166496   -.4334137
                  LA  |  -.0927994   .0296938    -3.13   0.003    -.1525028    -.033096
                  OK  |   .1377424   .1003516     1.37   0.176    -.0640279    .3395128
                  TX  |  -.2522985   .0281623    -8.96   0.000    -.3089226   -.1956744
                  ID  |   .0596631   .0256346     2.33   0.024     .0081213    .1112049
                  WY  |   -.667231   .0289623   -23.04   0.000    -.7254636   -.6089984
                  CO  |   .1348065   .0191531     7.04   0.000     .0962966    .1733165
                  NM  |   -.082719   .0192429    -4.30   0.000    -.1214095   -.0440285
                  AZ  |    .392587   .0265511    14.79   0.000     .3392024    .4459716
                  UT  |  -.1883733   .0308252    -6.11   0.000    -.2503516    -.126395
                  NV  |  -.0088173   .0507045    -0.17   0.863    -.1107655    .0931309
                  WA  |   .0296976   .0143444     2.07   0.044     .0008562    .0585389
                  OR  |  -.2281313   .0132484   -17.22   0.000    -.2547689   -.2014937
                  CA  |   .0386193   .0195194     1.98   0.054     -.000627    .0778656
                  AK  |   .3299156   .0237609    13.88   0.000      .282141    .3776902
                  HI  |  -.1388509   .0371083    -3.74   0.000    -.2134622   -.0642396
                      |
        state#c.lyear |
                  ME  |  -.0006448   .0001927    -3.35   0.002    -.0010323   -.0002574
                  NH  |   .0008891   .0002974     2.99   0.004      .000291    .0014871
                  VT  |   .0019221   .0001156    16.62   0.000     .0016896    .0021546
                  MA  |   .0031088   .0001505    20.66   0.000     .0028063    .0034114
                  RI  |   .0045017   .0001565    28.76   0.000     .0041871    .0048164
                  CT  |   .0004802   .0002242     2.14   0.037     .0000295     .000931
                  NY  |   .0021079   .0001198    17.59   0.000     .0018669    .0023488
                  NJ  |   .0036285    .000222    16.34   0.000      .003182     .004075
                  PA  |   .0015146   .0001989     7.61   0.000     .0011147    .0019146
                  OH  |  -.0002397   .0001824    -1.31   0.195    -.0006064    .0001271
                  IN  |   .0014031   .0008388     1.67   0.101    -.0002834    .0030895
                  IL  |  -.0004447   .0002076    -2.14   0.037    -.0008621   -.0000273
                  MI  |  -.0018114   .0006331    -2.86   0.006    -.0030844   -.0005385
                  WI  |   .0018208   .0004947     3.68   0.001     .0008262    .0028155
                  MN  |    .000189    .000178     1.06   0.294    -.0001689    .0005469
                  IA  |   .0000443   .0001512     0.29   0.771    -.0002597    .0003482
                  MO  |   -.002374   .0002777    -8.55   0.000    -.0029323   -.0018157
                  ND  |   .0067225    .000117    57.47   0.000     .0064874    .0069577
                  SD  |   .0028718   .0001015    28.30   0.000     .0026678    .0030758
                  NE  |   .0016364   .0002871     5.70   0.000     .0010591    .0022137
                  KS  |  -.0024836   .0002325   -10.68   0.000    -.0029511   -.0020162
                  DE  |  -.0004989   .0004437    -1.12   0.266     -.001391    .0003932
                  MD  |   .0042527   .0001658    25.65   0.000     .0039193    .0045861
                  DC  |   .0047702   .0001824    26.16   0.000     .0044036    .0051369
                  VA  |   .0039938    .000196    20.38   0.000     .0035997    .0043878
                  NC  |   -.000468   .0001845    -2.54   0.015     -.000839    -.000097
                  SC  |  -.0013002   .0002253    -5.77   0.000    -.0017531   -.0008472
                  GA  |  -.0005152   .0002431    -2.12   0.039    -.0010039   -.0000265
                  FL  |  -.0025361   .0001216   -20.86   0.000    -.0027805   -.0022917
                  KY  |  -.0009215   .0004234    -2.18   0.034    -.0017727   -.0000703
                  TN  |  -.0009601   .0003043    -3.15   0.003     -.001572   -.0003482
                  AL  |  -.0009551   .0003198    -2.99   0.004    -.0015981   -.0003122
                  MS  |    .000111   .0002515     0.44   0.661    -.0003946    .0006166
                  AR  |   .0033302   .0002763    12.05   0.000     .0027746    .0038858
                  LA  |   .0000559   .0001592     0.35   0.727    -.0002641     .000376
                  OK  |  -.0030067   .0011078    -2.71   0.009    -.0052342   -.0007792
                  TX  |   .0022193   .0001773    12.52   0.000     .0018628    .0025759
                  ID  |  -.0013049   .0002425    -5.38   0.000    -.0017925   -.0008173
                  WY  |    .006578    .000145    45.38   0.000     .0062865    .0068695
                  CO  |  -.0018574   .0001177   -15.79   0.000     -.002094   -.0016208
                  NM  |  -.0004217   .0001266    -3.33   0.002    -.0006762   -.0001672
                  AZ  |  -.0039251   .0001524   -25.76   0.000    -.0042315   -.0036187
                  UT  |   .0011645   .0001145    10.17   0.000     .0009343    .0013947
                  NV  |   .0008255   .0003636     2.27   0.028     .0000944    .0015565
                  WA  |  -.0001227   .0001282    -0.96   0.343    -.0003805    .0001351
                  OR  |   .0017117   .0001265    13.53   0.000     .0014574     .001966
                  CA  |   .0008187   .0000971     8.43   0.000     .0006235    .0010139
                  AK  |  -.0016855    .000096   -17.56   0.000    -.0018785   -.0014925
                  HI  |   .0014062   .0003602     3.90   0.000     .0006819    .0021305
                      |
                 nind |
                   2  |   .0658545   .0534061     1.23   0.224    -.0415256    .1732345
                   3  |   .0507845   .0394455     1.29   0.204     -.028526     .130095
                   4  |  -.2258109   .0518836    -4.35   0.000    -.3301299   -.1214919
                   5  |   .1482857   .0442102     3.35   0.002     .0593952    .2371762
                   6  |  -.0332505   .0485418    -0.68   0.497    -.1308504    .0643493
                   7  |  -.0913515    .047289    -1.93   0.059    -.1864323    .0037294
                   8  |  -.1257828   .0509792    -2.47   0.017    -.2282834   -.0232822
                   9  |  -.1734835     .04641    -3.74   0.000     -.266797     -.08017
                  10  |  -.1379804   .0619512    -2.23   0.031    -.2625418   -.0134191
                  11  |   .0128857   .0475176     0.27   0.787    -.0826548    .1084262
                      |
                 educ |   .1032847   .0056552    18.26   0.000     .0919142    .1146552
                exper |   .0495723   .0033898    14.62   0.000     .0427566     .056388
               exper2 |  -.0016768   .0002679    -6.26   0.000    -.0022154   -.0011382
               exper3 |   .0000292   9.31e-06     3.13   0.003     .0000104    .0000479
               exper4 |  -1.99e-07   1.04e-07    -1.90   0.063    -4.09e-07    1.14e-08
                 edex |  -.0004605   .0001233    -3.73   0.000    -.0007084   -.0002126
                      |
                ee_cl |
                   2  |  -.0594955    .014678    -4.05   0.000    -.0890077   -.0299834
                   3  |  -.1173704   .0178444    -6.58   0.000     -.153249   -.0814918
                   4  |  -.1608786   .0335446    -4.80   0.000    -.2283246   -.0934326
                   5  |   -.075858   .0202654    -3.74   0.000    -.1166042   -.0351117
                   6  |  -.0941866   .0176163    -5.35   0.000    -.1296065   -.0587667
                   7  |  -.1340632   .0221638    -6.05   0.000    -.1786266   -.0894998
                   8  |  -.1593637   .0348816    -4.57   0.000    -.2294979   -.0892296
                   9  |  -.0512395   .0173346    -2.96   0.005    -.0860931   -.0163858
                  10  |  -.1115653   .0232744    -4.79   0.000    -.1583617    -.064769
                  11  |  -.1467111   .0249163    -5.89   0.000    -.1968087   -.0966134
                  12  |  -.1363502   .0318143    -4.29   0.000    -.2003171   -.0723833
                  13  |  -.0014862   .0211344    -0.07   0.944    -.0439797    .0410073
                  14  |  -.1005277   .0223294    -4.50   0.000     -.145424   -.0556313
                  15  |  -.1116007   .0264465    -4.22   0.000     -.164775   -.0584265
                  16  |  -.1051131   .0326731    -3.22   0.002    -.1708066   -.0394195
                      |
                 marr |    .005561   .0034627     1.61   0.115    -.0014012    .0125231
                partt |  -.0636461   .0069609    -9.14   0.000    -.0776419   -.0496502
               public |   .0234798   .0122191     1.92   0.061    -.0010884     .048048
                 cmsa |    .121682   .0096285    12.64   0.000     .1023227    .1410413
                      |
                nocc2 |
                   2  |  -.0377389   .0106043    -3.56   0.001    -.0590602   -.0164176
                   3  |   -.022109   .0134458    -1.64   0.107    -.0491435    .0049255
                   4  |  -.1060108   .0110359    -9.61   0.000    -.1282001   -.0838215
                   5  |   .1404688   .0159971     8.78   0.000     .1083044    .1726332
                   6  |  -.2346269   .0096836   -24.23   0.000    -.2540971   -.2151567
                   7  |  -.2428188   .0233582   -10.40   0.000    -.2897836    -.195854
                   8  |  -.0951615   .0471082    -2.02   0.049    -.1898789   -.0004441
                   9  |  -.2881191   .0151268   -19.05   0.000    -.3185335   -.2577047
                  10  |  -.2582527   .0174775   -14.78   0.000    -.2933936   -.2231118
                  11  |   .0085024    .018584     0.46   0.649    -.0288632     .045868
                  12  |   -.241292    .012881   -18.73   0.000    -.2671911    -.215393
                      |
                unemp |  -.0004758   .0008501    -0.56   0.578    -.0021851    .0012335
                      |
              quarter |
                   2  |   .0050111   .0026591     1.88   0.066    -.0003354    .0103577
                   3  |   .0144294   .0025123     5.74   0.000     .0093779    .0194808
                   4  |   .0186275   .0029392     6.34   0.000     .0127179    .0245372
                      |
                _cons |   .2763641   .0548133     5.04   0.000     .1661546    .3865736
---------------------------------------------------------------------------------------

. 
. estadd local unemp_level "Yes"

added macro:
        e(unemp_level) : "Yes"

. estadd local yr_dum "No"

added macro:
             e(yr_dum) : "No"

. estadd local sltt "Yes"

added macro:
               e(sltt) : "Yes"

. eststo uwagstagdid_fem_all_sltt

. 
. ** RUST BELT ONLY BLACK-WHITE + WV, KY - IA
. ** keep if inrange(state, 31, 35) | inlist(state, 23, 41, 43) | inlist(state, 55, 61)
. 
. ** DROP ALWAYS RTW BLACK-WHITE
. ** drop if alwaysr2w == 1
. 
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl ma
> rr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo covstagdid_mal_cf 
.         
. ** reg covered blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl ma
> rr partt public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo covstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0, vce(cluster state) 
. 
. ** eststo wagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1, vce(cluster state)
. 
. ** eststo wagstagdid_fem_cf 
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 0, vce(cluster state)
. 
. ** eststo nwagstagdid_fem_cf
. 
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 0 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_mal_cf 
.         
. ** reg lwage3 blackrelwhite treat_st treat_stblackrelwhite i.state i.year i.nind educ exper exper2 exper3 exper4 edex i.ee_cl mar
> r partt  public cmsa i.nocc2 unemp i.quarter [aw = finalwt1] if female == 1 & covered == 1, vce(cluster state)
. 
. ** eststo uwagstagdid_fem_cf 
. 
. label variable blackrelwhite "$ Black $"

. label variable treat_st "$ Treat_{st} $"

. label variable treat_stblackrelwhite "$ Treat_{st} \times Black $"

. 
. ** FIXME ignore rust best stuff, dropping always rtw
. esttab covstagdid_mal_all covstagdid_mal_all_unemp covstagdid_mal_all_sltt covstagdid_fem_all covstagdid_fem_all_unemp covstagdid
> _fem_all_sltt using $tabs/fin_covstagdid.tex, se title(Difference in Differences of Union Coverage on Right to Work Laws Treatmen
> t in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule
> (lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) scala
> rs("unemp_level State Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time Trends")
(note: file /Users/amedeusdsouza/econ499/tabs/fin_covstagdid.tex not found)
(output written to /Users/amedeusdsouza/econ499/tabs/fin_covstagdid.tex)

. 
. esttab wagstagdid_mal_all wagstagdid_mal_all_unemp wagstagdid_mal_all_sltt wagstagdid_fem_all wagstagdid_fem_all_unemp wagstagdid
> _fem_all_sltt using $tabs/wagstagdid1.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment i
> n State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidrule(lr
> ){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) 
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid1.tex)

. 
. esttab nwagstagdid_mal_all nwagstagdid_mal_all_unemp nwagstagdid_mal_all_sltt nwagstagdid_fem_all nwagstagdid_fem_all_unemp nwags
> tagdid_fem_all_sltt using $tabs/wagstagdid2.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treat
> ment in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidr
> ule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01)
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid2.tex)

. 
. esttab uwagstagdid_mal_all uwagstagdid_mal_all_unemp uwagstagdid_mal_all_sltt uwagstagdid_fem_all uwagstagdid_fem_all_unemp uwags
> tagdid_fem_all_sltt using $tabs/wagstagdid3.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treat
> ment in State and Time) mgroups("Men" "Women", pattern(1 0 0 1 0 0) prefix(\multicolumn{@span}{c}{) suffix(}) span erepeat(\cmidr
> ule(lr){@span})) keep(blackrelwhite treat_st treat_stblackrelwhite) nomtitles replace label starlevels(* 0.1 ** 0.05 *** 0.01) sc
> alars("unemp_level State Monthly Unemployment Rate" "yr_dum Year Fixed Effect" "sltt State Linear Time Trends")
(output written to /Users/amedeusdsouza/econ499/tabs/wagstagdid3.tex)

. 
. panelcombine, use($tabs/wagstagdid1.tex $tabs/wagstagdid2.tex $tabs/wagstagdid3.tex) paneltitles("All (Black and White) People" "
> People Not Covered by Union - Spillover Effect" "People Covered by Union - Direct Effect") columncount(3) save($tabs/fin_wagstagd
> id.tex)

. 
. *** esttab wagstagdid_mal_all wagstagdid_fem_all nwagstagdid_mal_all nwagstagdid_fem_all uwagstagdid_mal_all uwagstagdid_fem_all 
> using $tabs/wagstagdid.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Tim
> e) nonumbers mtitles("men" "women" "men not covered by union" "women not covered by union" "men covered by union" "women covered 
> by union") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
. 
. ** esttab wagstagdid_mal_cf wagstagdid_fem_cf nwagstagdid_mal_cf nwagstagdid_fem_cf uwagstagdid_mal_cf uwagstagdid_fem_cf using $
> tabs/wagstagdid_cf.tex, se title(Difference in Differences of Real Log Wages on Right to Work Laws Treatment in State and Time) n
> onumbers mtitles("men" "women" "men not covered by union" "women not covered by union" "men covered by union" "women covered by u
> nion") keep(blackrelwhite treat_st treat_stblackrelwhite) replace
. 
. ** panelcombine, use($tabs/wagstagdid_all.tex $tabs/wagstagdid_cf.tex) paneltitles("All States" "W/O Always RTW States") columnco
> unt(3) save($tabs/wagstagdid.tex)
. 
. log close 
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/linreg/stagdid.log
  log type:  text
 closed on:  31 Mar 2021, 17:52:29
-----------------------------------------------------------------------------------------------------------------------------------
