------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/distreg/didst_dataprep.log
  log type:  text
 opened on:  16 Feb 2021, 21:55:10

. ********************************************************************************
. 
. rename twage nwage1

. 
. ** 0019 uses years 00 - 19
. keep if inrange(year, 2000, 2019)
(2,143,740 observations deleted)

. 
. ** keep needed variables
. ** FIXME add partt to list once defined in clean_nber_morg
. keep state year quarter nwage1 lwage1 hourly exper educ female nind2 nocc cmsa public marr his
> prace hispracesex eweight alloc1 covered

. 
. gen finalwt1 = round(eweight)

. 
. gen lyear = year - 2000

. 
. logit covered i.state i.year i.nind2 i.state#i.year i.nind2#i.year i.nind2#i.year#c.lyear [fw 
> = finalwt1]

note: 1.nind2#2000.year#c.lyear omitted because of collinearity
note: 1.nind2#2001.year#c.lyear omitted because of collinearity
note: 1.nind2#2002.year#c.lyear omitted because of collinearity
note: 1.nind2#2003.year#c.lyear omitted because of collinearity
note: 1.nind2#2004.year#c.lyear omitted because of collinearity
note: 1.nind2#2005.year#c.lyear omitted because of collinearity
note: 1.nind2#2006.year#c.lyear omitted because of collinearity
note: 1.nind2#2007.year#c.lyear omitted because of collinearity
note: 1.nind2#2008.year#c.lyear omitted because of collinearity
note: 1.nind2#2009.year#c.lyear omitted because of collinearity
note: 1.nind2#2010.year#c.lyear omitted because of collinearity
note: 1.nind2#2011.year#c.lyear omitted because of collinearity
note: 1.nind2#2012.year#c.lyear omitted because of collinearity
note: 1.nind2#2013.year#c.lyear omitted because of collinearity
note: 1.nind2#2014.year#c.lyear omitted because of collinearity
note: 2.nind2#2000.year#c.lyear omitted because of collinearity
note: 2.nind2#2001.year#c.lyear omitted because of collinearity
note: 2.nind2#2002.year#c.lyear omitted because of collinearity
note: 2.nind2#2003.year#c.lyear omitted because of collinearity
note: 2.nind2#2004.year#c.lyear omitted because of collinearity
note: 2.nind2#2005.year#c.lyear omitted because of collinearity
note: 2.nind2#2006.year#c.lyear omitted because of collinearity
note: 2.nind2#2007.year#c.lyear omitted because of collinearity
note: 2.nind2#2008.year#c.lyear omitted because of collinearity
note: 2.nind2#2009.year#c.lyear omitted because of collinearity
note: 2.nind2#2010.year#c.lyear omitted because of collinearity
note: 2.nind2#2011.year#c.lyear omitted because of collinearity
note: 2.nind2#2012.year#c.lyear omitted because of collinearity
note: 2.nind2#2013.year#c.lyear omitted because of collinearity
note: 2.nind2#2014.year#c.lyear omitted because of collinearity
note: 3.nind2#2000.year#c.lyear omitted because of collinearity
note: 3.nind2#2001.year#c.lyear omitted because of collinearity
note: 3.nind2#2002.year#c.lyear omitted because of collinearity
note: 3.nind2#2003.year#c.lyear omitted because of collinearity
note: 3.nind2#2004.year#c.lyear omitted because of collinearity
note: 3.nind2#2005.year#c.lyear omitted because of collinearity
note: 3.nind2#2006.year#c.lyear omitted because of collinearity
note: 3.nind2#2007.year#c.lyear omitted because of collinearity
note: 3.nind2#2008.year#c.lyear omitted because of collinearity
note: 3.nind2#2009.year#c.lyear omitted because of collinearity
note: 3.nind2#2010.year#c.lyear omitted because of collinearity
note: 3.nind2#2011.year#c.lyear omitted because of collinearity
note: 3.nind2#2012.year#c.lyear omitted because of collinearity
note: 3.nind2#2013.year#c.lyear omitted because of collinearity
note: 3.nind2#2014.year#c.lyear omitted because of collinearity
note: 4.nind2#2000.year#c.lyear omitted because of collinearity
note: 4.nind2#2001.year#c.lyear omitted because of collinearity
note: 4.nind2#2002.year#c.lyear omitted because of collinearity
note: 4.nind2#2003.year#c.lyear omitted because of collinearity
note: 4.nind2#2004.year#c.lyear omitted because of collinearity
note: 4.nind2#2005.year#c.lyear omitted because of collinearity
note: 4.nind2#2006.year#c.lyear omitted because of collinearity
note: 4.nind2#2007.year#c.lyear omitted because of collinearity
note: 4.nind2#2008.year#c.lyear omitted because of collinearity
note: 4.nind2#2009.year#c.lyear omitted because of collinearity
note: 4.nind2#2010.year#c.lyear omitted because of collinearity
note: 4.nind2#2011.year#c.lyear omitted because of collinearity
note: 4.nind2#2012.year#c.lyear omitted because of collinearity
note: 4.nind2#2013.year#c.lyear omitted because of collinearity
note: 4.nind2#2014.year#c.lyear omitted because of collinearity
note: 5.nind2#2000.year#c.lyear omitted because of collinearity
note: 5.nind2#2001.year#c.lyear omitted because of collinearity
note: 5.nind2#2002.year#c.lyear omitted because of collinearity
note: 5.nind2#2003.year#c.lyear omitted because of collinearity
note: 5.nind2#2004.year#c.lyear omitted because of collinearity
note: 5.nind2#2005.year#c.lyear omitted because of collinearity
note: 5.nind2#2006.year#c.lyear omitted because of collinearity
note: 5.nind2#2007.year#c.lyear omitted because of collinearity
note: 5.nind2#2008.year#c.lyear omitted because of collinearity
note: 5.nind2#2009.year#c.lyear omitted because of collinearity
note: 5.nind2#2010.year#c.lyear omitted because of collinearity
note: 5.nind2#2011.year#c.lyear omitted because of collinearity
note: 5.nind2#2012.year#c.lyear omitted because of collinearity
note: 5.nind2#2013.year#c.lyear omitted because of collinearity
note: 5.nind2#2014.year#c.lyear omitted because of collinearity
note: 6.nind2#2000.year#c.lyear omitted because of collinearity
note: 6.nind2#2001.year#c.lyear omitted because of collinearity
note: 6.nind2#2002.year#c.lyear omitted because of collinearity
note: 6.nind2#2003.year#c.lyear omitted because of collinearity
note: 6.nind2#2004.year#c.lyear omitted because of collinearity
note: 6.nind2#2005.year#c.lyear omitted because of collinearity
note: 6.nind2#2006.year#c.lyear omitted because of collinearity
note: 6.nind2#2007.year#c.lyear omitted because of collinearity
note: 6.nind2#2008.year#c.lyear omitted because of collinearity
note: 6.nind2#2009.year#c.lyear omitted because of collinearity
note: 6.nind2#2010.year#c.lyear omitted because of collinearity
note: 6.nind2#2011.year#c.lyear omitted because of collinearity
note: 6.nind2#2012.year#c.lyear omitted because of collinearity
note: 6.nind2#2013.year#c.lyear omitted because of collinearity
note: 6.nind2#2014.year#c.lyear omitted because of collinearity
note: 7.nind2#2000.year#c.lyear omitted because of collinearity
note: 7.nind2#2001.year#c.lyear omitted because of collinearity
note: 7.nind2#2002.year#c.lyear omitted because of collinearity
note: 7.nind2#2003.year#c.lyear omitted because of collinearity
note: 7.nind2#2004.year#c.lyear omitted because of collinearity
note: 7.nind2#2005.year#c.lyear omitted because of collinearity
note: 7.nind2#2006.year#c.lyear omitted because of collinearity
note: 7.nind2#2007.year#c.lyear omitted because of collinearity
note: 7.nind2#2008.year#c.lyear omitted because of collinearity
note: 7.nind2#2009.year#c.lyear omitted because of collinearity
note: 7.nind2#2010.year#c.lyear omitted because of collinearity
note: 7.nind2#2011.year#c.lyear omitted because of collinearity
note: 7.nind2#2012.year#c.lyear omitted because of collinearity
note: 7.nind2#2013.year#c.lyear omitted because of collinearity
note: 7.nind2#2014.year#c.lyear omitted because of collinearity
note: 8.nind2#2000.year#c.lyear omitted because of collinearity
note: 8.nind2#2001.year#c.lyear omitted because of collinearity
note: 8.nind2#2002.year#c.lyear omitted because of collinearity
note: 8.nind2#2003.year#c.lyear omitted because of collinearity
note: 8.nind2#2004.year#c.lyear omitted because of collinearity
note: 8.nind2#2005.year#c.lyear omitted because of collinearity
note: 8.nind2#2006.year#c.lyear omitted because of collinearity
note: 8.nind2#2007.year#c.lyear omitted because of collinearity
note: 8.nind2#2008.year#c.lyear omitted because of collinearity
note: 8.nind2#2009.year#c.lyear omitted because of collinearity
note: 8.nind2#2010.year#c.lyear omitted because of collinearity
note: 8.nind2#2011.year#c.lyear omitted because of collinearity
note: 8.nind2#2012.year#c.lyear omitted because of collinearity
note: 8.nind2#2013.year#c.lyear omitted because of collinearity
note: 8.nind2#2014.year#c.lyear omitted because of collinearity
note: 9.nind2#2000.year#c.lyear omitted because of collinearity
note: 9.nind2#2001.year#c.lyear omitted because of collinearity
note: 9.nind2#2002.year#c.lyear omitted because of collinearity
note: 9.nind2#2003.year#c.lyear omitted because of collinearity
note: 9.nind2#2004.year#c.lyear omitted because of collinearity
note: 9.nind2#2005.year#c.lyear omitted because of collinearity
note: 9.nind2#2006.year#c.lyear omitted because of collinearity
note: 9.nind2#2007.year#c.lyear omitted because of collinearity
note: 9.nind2#2008.year#c.lyear omitted because of collinearity
note: 9.nind2#2009.year#c.lyear omitted because of collinearity
note: 9.nind2#2010.year#c.lyear omitted because of collinearity
note: 9.nind2#2011.year#c.lyear omitted because of collinearity
note: 9.nind2#2012.year#c.lyear omitted because of collinearity
note: 9.nind2#2013.year#c.lyear omitted because of collinearity
note: 9.nind2#2014.year#c.lyear omitted because of collinearity
note: 10.nind2#2000.year#c.lyear omitted because of collinearity
note: 10.nind2#2001.year#c.lyear omitted because of collinearity
note: 10.nind2#2002.year#c.lyear omitted because of collinearity
note: 10.nind2#2003.year#c.lyear omitted because of collinearity
note: 10.nind2#2004.year#c.lyear omitted because of collinearity
note: 10.nind2#2005.year#c.lyear omitted because of collinearity
note: 10.nind2#2006.year#c.lyear omitted because of collinearity
note: 10.nind2#2007.year#c.lyear omitted because of collinearity
note: 10.nind2#2008.year#c.lyear omitted because of collinearity
note: 10.nind2#2009.year#c.lyear omitted because of collinearity
note: 10.nind2#2010.year#c.lyear omitted because of collinearity
note: 10.nind2#2011.year#c.lyear omitted because of collinearity
note: 10.nind2#2012.year#c.lyear omitted because of collinearity
note: 10.nind2#2013.year#c.lyear omitted because of collinearity
note: 10.nind2#2014.year#c.lyear omitted because of collinearity
note: 11.nind2#2000.year#c.lyear omitted because of collinearity
note: 11.nind2#2001.year#c.lyear omitted because of collinearity
note: 11.nind2#2002.year#c.lyear omitted because of collinearity
note: 11.nind2#2003.year#c.lyear omitted because of collinearity
note: 11.nind2#2004.year#c.lyear omitted because of collinearity
note: 11.nind2#2005.year#c.lyear omitted because of collinearity
note: 11.nind2#2006.year#c.lyear omitted because of collinearity
note: 11.nind2#2007.year#c.lyear omitted because of collinearity
note: 11.nind2#2008.year#c.lyear omitted because of collinearity
note: 11.nind2#2009.year#c.lyear omitted because of collinearity
note: 11.nind2#2010.year#c.lyear omitted because of collinearity
note: 11.nind2#2011.year#c.lyear omitted because of collinearity
note: 11.nind2#2012.year#c.lyear omitted because of collinearity
note: 11.nind2#2013.year#c.lyear omitted because of collinearity
note: 11.nind2#2014.year#c.lyear omitted because of collinearity
Iteration 0:   log likelihood = -5.176e+09  
Iteration 1:   log likelihood = -4.387e+09  
Iteration 2:   log likelihood = -4.195e+09  
Iteration 3:   log likelihood = -4.192e+09  
Iteration 4:   log likelihood = -4.191e+09  
Iteration 5:   log likelihood = -4.191e+09  
Iteration 6:   log likelihood = -4.191e+09  
Iteration 7:   log likelihood = -4.191e+09  
Iteration 8:   log likelihood = -4.191e+09  
Iteration 9:   log likelihood = -4.191e+09  (backed up)
Iteration 10:  log likelihood = -4.191e+09  (backed up)
Iteration 11:  log likelihood = -4.191e+09  (backed up)
Iteration 12:  log likelihood = -4.191e+09  (backed up)
Iteration 13:  log likelihood = -4.191e+09  (backed up)
Iteration 14:  log likelihood = -4.191e+09  (backed up)
Iteration 15:  log likelihood = -4.191e+09  (backed up)
Iteration 16:  log likelihood = -4.191e+09  (backed up)
Iteration 17:  log likelihood = -4.191e+09  (backed up)
Iteration 18:  log likelihood = -4.191e+09  (backed up)
Iteration 19:  log likelihood = -4.191e+09  (backed up)
Iteration 20:  log likelihood = -4.191e+09  (backed up)
Iteration 21:  log likelihood = -4.191e+09  (backed up)
Iteration 22:  log likelihood = -4.191e+09  (backed up)
Iteration 23:  log likelihood = -4.191e+09  (backed up)
Iteration 24:  log likelihood = -4.191e+09  (backed up)
Iteration 25:  log likelihood = -4.191e+09  (backed up)
Iteration 26:  log likelihood = -4.191e+09  (backed up)
--Break--
r(1);

end of do-file

--Break--
r(1);

. tab nind2 if nind2 ==.
no observations

. tab nind2

  RECODE of |
       nind |
   (uniform |
  one-digit |
  industry) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     35,021        1.76        1.76
          2 |    112,766        5.68        7.45
          3 |    239,189       12.05       19.50
          4 |    421,022       21.21       40.71
          5 |    142,381        7.17       47.88
          6 |    126,224        6.36       54.24
          7 |    244,892       12.34       66.58
          8 |    271,190       13.66       80.24
          9 |    215,406       10.85       91.09
         10 |     65,497        3.30       94.39
         11 |    111,351        5.61      100.00
------------+-----------------------------------
      Total |  1,984,939      100.00

. tab lyear

      lyear |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    100,627        5.06        5.06
          1 |    104,856        5.28       10.34
          2 |    113,419        5.71       16.05
          3 |    108,442        5.46       21.50
          4 |    106,870        5.38       26.88
          5 |    108,544        5.46       32.34
          6 |    108,609        5.47       37.81
          7 |    108,906        5.48       43.29
          8 |    107,423        5.41       48.70
          9 |    104,435        5.26       53.95
         10 |     98,837        4.97       58.92
         11 |     96,220        4.84       63.77
         12 |     96,968        4.88       68.65
         13 |     93,786        4.72       73.37
         14 |     92,724        4.67       78.03
         15 |     88,860        4.47       82.50
         16 |     90,143        4.54       87.04
         17 |     88,892        4.47       91.51
         18 |     86,358        4.35       95.86
         19 |     82,316        4.14      100.00
------------+-----------------------------------
      Total |  1,987,235      100.00

. tab state

1960 census |
   code for |
      state |      Freq.     Percent        Cum.
------------+-----------------------------------
         ME |     27,995        1.89        1.89
         NH |     31,860        2.15        4.04
         VT |     23,162        1.56        5.60
         MA |     22,181        1.50        7.10
         RI |     24,402        1.65        8.74
         CT |     28,013        1.89       10.64
         NY |     56,528        3.81       14.45
         NJ |     30,786        2.08       16.53
         PA |     47,748        3.22       19.75
         OH |     44,508        3.00       22.75
         IN |     23,203        1.57       24.32
         IL |     45,544        3.07       27.39
         MI |     35,852        2.42       29.81
         WI |     33,688        2.27       32.08
         MN |     40,212        2.71       34.80
         IA |     30,625        2.07       36.86
         MO |     24,104        1.63       38.49
         ND |     23,360        1.58       40.07
         SD |     26,555        1.79       41.86
         NE |     27,824        1.88       43.73
         KS |     26,726        1.80       45.54
         DE |     17,601        1.19       46.73
         MD |     32,482        2.19       48.92
         DC |     20,059        1.35       50.27
         VA |     29,303        1.98       52.25
         WV |     14,874        1.00       53.25
         NC |     28,862        1.95       55.20
         SC |     18,478        1.25       56.45
         GA |     24,221        1.63       58.08
         FL |     52,088        3.51       61.59
         KY |     20,706        1.40       62.99
         TN |     17,305        1.17       64.16
         AL |     15,322        1.03       65.19
         MS |     12,866        0.87       66.06
         AR |     16,877        1.14       67.20
         LA |     12,778        0.86       68.06
         OK |     17,697        1.19       69.26
         TX |     75,690        5.11       74.36
         MT |     17,016        1.15       75.51
         ID |     19,018        1.28       76.80
         WY |     23,798        1.61       78.40
         CO |     34,892        2.35       80.76
         NM |     15,503        1.05       81.80
         AZ |     19,358        1.31       83.11
         UT |     22,341        1.51       84.62
         NV |     25,981        1.75       86.37
         WA |     28,229        1.90       88.27
         OR |     21,986        1.48       89.76
         CA |    113,147        7.63       97.39
         AK |     20,204        1.36       98.75
         HI |     18,455        1.25      100.00
------------+-----------------------------------
      Total |  1,482,013      100.00

. tab covered

   computed |
      union |
   coverage |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  1,711,490       86.12       86.12
          1 |    275,745       13.88      100.00
------------+-----------------------------------
      Total |  1,987,235      100.00

. log close
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/distreg/didst_dataprep.log
  log type:  text
 closed on:  17 Feb 2021, 02:25:32
------------------------------------------------------------------------------------------------
