--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/dfl1/dfl-3per.log
  log type:  text
 opened on:  26 Apr 2021, 18:22:02

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. drop if year < 1983
(556,442 observations deleted)

. 
. ********************************************************************************
. * 1983 - 1988
. ********************************************************************************
. 
. keep if inrange(year, 1983, 1988)
(3,236,632 observations deleted)

. 
. ** men
. preserve

. keep if sex == 1
(426,924 observations deleted)

. 
. qui sum lwage3, detail

. 
. gen xstep = (r(max) - r(min)) / 200

. 
. gen kwage = r(min) + (_n-1)*xstep if _n <= 200
(467,219 missing values generated)

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(wmestpt wmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2, at(kwage) gauss width(0.065) ///
>         generate(bmestpt bmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 3, at(kwage) gauss width(0.065) ///
>         generate(hmestpt hmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_wmestpt u_wmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(n_wmestpt n_wmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_bmestpt u_bmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(nbmestpt n_bmde) nograph

.         
. ** lab wmestpt "non hisp white men estimation points"
. ** lab wmde "non hisp white men density estimate"
. 
. graph twoway (connected wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(so
> lid))  /// 
>                          (connected bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(ma
> genta) lp(solid))  ///
>                          (connected hmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(mi
> dgreen) lp(solid)), ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "Hispanic") c(1) pos(2) ring(0
> ) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men", size(vlarge))

. graph export "$figs/kde1men/bhw_men_8388.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/bhw_men_8388.png written in PNG format)

. 
. graph twoway (connected u_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected u_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsize(*.
> 5) size(large) region(lcolor(none))) ///
>                          subtitle("Men Covered by Union", size(vlarge))

. graph export "$figs/kde1men/u_bhw_men_8388.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/u_bhw_men_8388.png written in PNG format)

. 
. graph twoway (connected n_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected n_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsize(*.
> 5) size(large) region(lcolor(none))) ///
>                          subtitle("Men not Covered by Union", size(vlarge))

. graph export "$figs/kde1men/n_bhw_men_8388.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/n_bhw_men_8388.png written in PNG format)

. 
. ** probability of race that depends on other covariates
. 
. local nhr w b

. 
. clonevar nhrace = hisprace
(23,278 missing values generated)

. 
. replace nhrace =. if nhrace == 3
(28,125 real changes made, 28,125 to missing)

. 
. keep if inrange(nhrace, 1, 2)
(51,403 observations deleted)

. 
. gen nhblack = nhrace - 1

. 
. gen finalwt1 = round(eweight)

. 
. drop nind

. 
. rename nind2 nind

. 
. drop nocc2

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(341052 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(379206 differences between nocc2 and nocc3)

. 
. drop edex

. 
. gen edex = educ*exper

. 
. probit nhblack educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year [w = finalwt1]
(frequency weights assumed)

note: 12.state != 0 predicts failure perfectly
      12.state dropped and 992 obs not used

note: 44.state != 0 predicts failure perfectly
      44.state dropped and 1559 obs not used

Iteration 0:   log likelihood = -7.569e+08  
Iteration 1:   log likelihood = -6.427e+08  
Iteration 2:   log likelihood = -6.371e+08  
Iteration 3:   log likelihood = -6.370e+08  
Iteration 4:   log likelihood = -6.370e+08  
Iteration 5:   log likelihood = -6.370e+08  
Iteration 6:   log likelihood = -6.370e+08  

Probit regression                               Number of obs     = 2171349029
                                                LR chi2(101)      =   2.40e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -6.370e+08                     Pseudo R2         =     0.1584

------------------------------------------------------------------------------
     nhblack |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0516339   .0000839   615.59   0.000     .0514695    .0517983
       exper |    .127249   .0000638  1994.05   0.000     .1271239     .127374
      exper2 |  -.0049996   4.75e-06 -1051.71   0.000    -.0050089   -.0049903
      exper3 |   .0001046   1.58e-07   662.71   0.000     .0001043    .0001049
      exper4 |  -8.24e-07   1.69e-09  -488.45   0.000    -8.27e-07   -8.20e-07
        edex |  -.0029853   2.65e-06 -1124.92   0.000    -.0029905   -.0029801
             |
       ee_cl |
          2  |   .0568922   .0002597   219.11   0.000     .0563832    .0574011
          3  |  -.0886124   .0003587  -247.06   0.000    -.0893153   -.0879094
          4  |  -.3630539    .000527  -688.93   0.000    -.3640867    -.362021
          5  |   .1257571   .0003438   365.83   0.000     .1250834    .1264309
          6  |   -.024435   .0003235   -75.53   0.000    -.0250691   -.0238009
          7  |  -.1412849   .0003931  -359.43   0.000    -.1420553   -.1405145
          8  |  -.4179792   .0005095  -820.39   0.000    -.4189778   -.4169806
          9  |   .1932762   .0004737   408.03   0.000     .1923478    .1942046
         10  |  -.0367013   .0004525   -81.11   0.000    -.0375882   -.0358145
         11  |  -.0674215   .0004978  -135.44   0.000    -.0683971   -.0664458
         12  |  -.2676509   .0005718  -468.09   0.000    -.2687716   -.2665302
         13  |   .2225998   .0006124   363.49   0.000     .2213995    .2238001
         14  |    -.06114   .0005686  -107.52   0.000    -.0622545   -.0600256
         15  |  -.0597679   .0006122   -97.63   0.000    -.0609677   -.0585681
         16  |   -.046721   .0006506   -71.81   0.000    -.0479961   -.0454458
             |
        marr |  -.2287233   .0000946 -2417.72   0.000    -.2289087   -.2285379
       partt |   .1788015     .00014  1277.26   0.000     .1785271    .1790759
      public |   .3267877   .0001567  2085.71   0.000     .3264806    .3270948
        cmsa |   .4244992    .000108  3931.89   0.000     .4242876    .4247108
             |
       state |
         NH  |          0  (empty)
         VT  |   .2050844   .0036065    56.87   0.000     .1980158    .2121529
         MA  |   .7181328   .0028422   252.67   0.000     .7125621    .7237035
         RI  |     .44621   .0029835   149.56   0.000     .4403624    .4520577
         CT  |   1.080726   .0028475   379.54   0.000     1.075145    1.086307
         NY  |   1.353283   .0028278   478.57   0.000     1.347741    1.358825
         NJ  |   1.370696   .0028334   483.77   0.000     1.365143    1.376249
         PA  |   .9549552   .0028312   337.30   0.000     .9494062    .9605042
         OH  |    1.10737   .0028299   391.31   0.000     1.101823    1.112916
         IN  |    .987003    .002838   347.79   0.000     .9814407    .9925653
         IL  |   1.360272   .0028293   480.78   0.000     1.354726    1.365817
         MI  |   1.194837   .0028305   422.13   0.000      1.18929    1.200385
         WI  |    .605171    .002848   212.49   0.000      .599589    .6107531
         MN  |   .4925378   .0028588   172.29   0.000     .4869348    .4981409
         IA  |   .1487274   .0029738    50.01   0.000     .1428988     .154556
         MO  |    1.24174   .0028358   437.89   0.000     1.236182    1.247298
         ND  |          0  (empty)
         SD  |  -.4536978   .0075685   -59.95   0.000    -.4685318   -.4388638
         NE  |   .6746281   .0029378   229.64   0.000     .6688702     .680386
         KS  |   .9411789   .0028662   328.37   0.000     .9355613    .9467965
         DE  |   1.897466   .0030766   616.74   0.000     1.891436    1.903496
         MD  |   1.744075   .0028352   615.14   0.000     1.738518    1.749632
         DC  |   2.972871   .0028747  1034.15   0.000     2.967237    2.978506
         VA  |   1.727097   .0028303   610.23   0.000     1.721549    1.732644
         WV  |   .6671158   .0029638   225.09   0.000     .6613069    .6729246
         NC  |   1.925786   .0028292   680.69   0.000      1.92024    1.931331
         SC  |   2.259345    .002837   796.37   0.000     2.253784    2.264905
         GA  |   2.029323   .0028295   717.19   0.000     2.023777    2.034869
         FL  |   1.650772    .002829   583.51   0.000     1.645227    1.656316
         KY  |   1.132084   .0028439   398.07   0.000      1.12651    1.137658
         TN  |   1.535261   .0028333   541.86   0.000     1.529707    1.540814
         AL  |   1.841488   .0028352   649.50   0.000     1.835932    1.847045
         MS  |   2.356218   .0028377   830.33   0.000     2.350656     2.36178
         AR  |   1.555909   .0028507   545.80   0.000     1.550322    1.561496
         LA  |   2.028666   .0028337   715.91   0.000     2.023113     2.03422
         OK  |   1.044839   .0028496   366.67   0.000     1.039254    1.050424
         TX  |    1.53017   .0028279   541.10   0.000     1.524627    1.535712
         MT  |  -.0118005   .0046065    -2.56   0.010     -.020829    -.002772
         ID  |  -.0583706   .0042964   -13.59   0.000    -.0667914   -.0499497
         WY  |    .418516    .004058   103.13   0.000     .4105624    .4264695
         CO  |    .933639   .0028587   326.59   0.000      .928036     .939242
         NM  |   1.267666   .0030088   421.32   0.000     1.261768    1.273563
         AZ  |   .6847932   .0028755   238.15   0.000     .6791573    .6904291
         UT  |   .0475431    .003168    15.01   0.000      .041334    .0537523
         NV  |   1.098224   .0029368   373.96   0.000     1.092468     1.10398
         WA  |   .7871976   .0028528   275.94   0.000     .7816062    .7927889
         OR  |   .5105272   .0028873   176.82   0.000     .5048682    .5161862
         CA  |   1.198882   .0028278   423.97   0.000      1.19334    1.204425
         AK  |   .9298277   .0030537   304.49   0.000     .9238425    .9358129
         HI  |   .6331403   .0033349   189.86   0.000     .6266041    .6396765
             |
        nind |
          2  |  -.0737614   .0002787  -264.64   0.000    -.0743077   -.0732151
          3  |   .1007778   .0002424   415.82   0.000     .1003028    .1012528
          4  |   .0477321   .0002588   184.46   0.000     .0472249    .0482393
          5  |   .0915075   .0002661   343.93   0.000      .090986     .092029
          6  |   .1336882   .0003249   411.44   0.000     .1330513     .134325
          7  |   .0909338   .0002779   327.22   0.000     .0903892    .0914785
          8  |   .4675557   .0003149  1484.79   0.000     .4669385    .4681729
          9  |   .0638297   .0003301   193.34   0.000     .0631826    .0644768
         10  |   .1954267    .000325   601.37   0.000     .1947898    .1960637
         11  |  -.1780567   .0003244  -548.89   0.000    -.1786925   -.1774209
             |
       nocc2 |
          2  |   .2710886   .0002758   982.76   0.000      .270548    .2716293
          3  |   .0669991   .0002512   266.68   0.000     .0665067    .0674915
          4  |   .2656021   .0002704   982.23   0.000     .2650721    .2661321
          5  |    .253652   .0004588   552.86   0.000     .2527528    .2545513
          6  |   .6205635   .0002254  2753.30   0.000     .6201217    .6210052
          7  |   .1047363   .0002507   417.73   0.000     .1042449    .1052277
          8  |  -.0546436    .000576   -94.87   0.000    -.0557725   -.0535146
          9  |   .7860768   .0002152  3652.73   0.000      .785655    .7864986
         10  |   .5659914    .000212  2669.31   0.000     .5655758     .566407
         11  |   .3253078   .0002176  1494.84   0.000     .3248813    .3257343
         12  |   .7106078   .0002122  3349.07   0.000      .710192    .7110237
             |
     quarter |
          2  |   .0108134   .0001087    99.51   0.000     .0106004    .0110264
          3  |   .0139153   .0001153   120.68   0.000     .0136893    .0141413
          4  |   .0222849    .000109   204.39   0.000     .0220712    .0224985
             |
        year |
       1984  |   .0186867    .000133   140.55   0.000     .0184261    .0189473
       1985  |   .0388902   .0001462   266.02   0.000     .0386037    .0391768
       1986  |   .0554663   .0001337   414.95   0.000     .0552043    .0557283
       1987  |   .0670349   .0001342   499.57   0.000     .0667719    .0672979
       1988  |   .0677195   .0001344   503.86   0.000     .0674561    .0679829
             |
       _cons |  -4.400134   .0029905 -1471.38   0.000    -4.405995   -4.394272
------------------------------------------------------------------------------

.         predict pb1m
(option pr assumed; Pr(nhblack))
(104,696 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year if nhblack == 1 [w = finalwt1]
(frequency weights assumed)

note: 13.state != 0 predicts failure perfectly
      13.state dropped and 14 obs not used

note: 45.state != 0 predicts success perfectly
      45.state dropped and 1 obs not used

note: 81.state != 0 predicts failure perfectly
      81.state dropped and 3 obs not used

note: 82.state != 0 predicts failure perfectly
      82.state dropped and 5 obs not used

note: 83.state != 0 predicts failure perfectly
      83.state dropped and 9 obs not used

Iteration 0:   log likelihood = -1.510e+08  
Iteration 1:   log likelihood = -1.139e+08  
Iteration 2:   log likelihood = -1.132e+08  
Iteration 3:   log likelihood = -1.132e+08  
Iteration 4:   log likelihood = -1.132e+08  

Probit regression                               Number of obs     =  239716324
                                                LR chi2(96)       =   7.55e+07
                                                Prob > chi2       =     0.0000
Log likelihood = -1.132e+08                     Pseudo R2         =     0.2501

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0134542   .0002217    60.69   0.000     .0130197    .0138887
       exper |   .0483921   .0001702   284.37   0.000     .0480586    .0487256
      exper2 |  -.0015442    .000012  -128.24   0.000    -.0015678   -.0015206
      exper3 |   .0000191   3.77e-07    50.52   0.000     .0000183    .0000198
      exper4 |  -7.17e-08   3.88e-09   -18.48   0.000    -7.93e-08   -6.41e-08
        edex |   .0010244   6.53e-06   156.92   0.000     .0010116    .0010372
             |
       ee_cl |
          2  |   .2715006   .0007469   363.50   0.000     .2700367    .2729645
          3  |   .4019921   .0009812   409.68   0.000     .4000689    .4039152
          4  |   .3709198   .0013909   266.68   0.000     .3681938    .3736459
          5  |    .021831   .0009075    24.06   0.000     .0200524    .0236096
          6  |   .3349646   .0008636   387.87   0.000     .3332719    .3366572
          7  |   .4238259   .0010339   409.93   0.000     .4217994    .4258523
          8  |   .1898774   .0013271   143.08   0.000     .1872763    .1924785
          9  |   .0777436   .0011581    67.13   0.000     .0754738    .0800134
         10  |   .2882069   .0011333   254.31   0.000     .2859857    .2904281
         11  |   .0487448   .0012608    38.66   0.000     .0462737     .051216
         12  |  -.0678443   .0014682   -46.21   0.000     -.070722   -.0649667
         13  |   .1620912   .0014396   112.59   0.000     .1592696    .1649128
         14  |   .2352745   .0013787   170.65   0.000     .2325724    .2379767
         15  |   .2048568   .0015171   135.03   0.000     .2018834    .2078302
         16  |  -.1854326   .0016525  -112.22   0.000    -.1886714   -.1821939
             |
        marr |   .0549241   .0002226   246.70   0.000     .0544878    .0553605
       partt |  -.4157322   .0003609 -1152.07   0.000    -.4164394   -.4150249
      public |   .6641225   .0003375  1967.74   0.000      .663461     .664784
        cmsa |   .2758269    .000305   904.47   0.000     .2752292    .2764246
             |
       state |
         VT  |          0  (empty)
         MA  |  -.2601858    .014031   -18.54   0.000    -.2876861   -.2326855
         RI  |  -.2910206   .0143019   -20.35   0.000    -.3190518   -.2629895
         CT  |  -.1541269   .0140305   -10.99   0.000    -.1816261   -.1266277
         NY  |   .1336999   .0140028     9.55   0.000     .1062548    .1611449
         NJ  |  -.0423028   .0140082    -3.02   0.003    -.0697585   -.0148472
         PA  |  -.1226101   .0140093    -8.75   0.000    -.1500677   -.0951525
         OH  |  -.0902878   .0140066    -6.45   0.000    -.1177402   -.0628354
         IN  |  -.0889575   .0140192    -6.35   0.000    -.1164346   -.0614804
         IL  |  -.0156966   .0140046    -1.12   0.262     -.043145    .0117518
         MI  |   .1975278   .0140068    14.10   0.000     .1700749    .2249807
         WI  |  -.2119697   .0140438   -15.09   0.000     -.239495   -.1844444
         MN  |  -.1164756   .0140756    -8.27   0.000    -.1440633   -.0888879
         IA  |  -.2298696   .0143969   -15.97   0.000    -.2580871   -.2016521
         MO  |   .0342257   .0140132     2.44   0.015     .0067604    .0616909
         SD  |          0  (empty)
         NE  |  -.2329791    .014223   -16.38   0.000    -.2608557   -.2051025
         KS  |  -.4360127   .0140739   -30.98   0.000    -.4635969   -.4084284
         DE  |  -.3926076   .0142513   -27.55   0.000    -.4205396   -.3646756
         MD  |  -.3082614   .0140085   -22.01   0.000    -.3357175   -.2808053
         DC  |  -.4494967   .0140163   -32.07   0.000    -.4769682   -.4220252
         VA  |  -.7726209   .0140044   -55.17   0.000     -.800069   -.7451728
         WV  |   -.248625    .014288   -17.40   0.000    -.2766289   -.2206211
         NC  |  -1.154201   .0140039   -82.42   0.000    -1.181648   -1.126754
         SC  |  -1.368626   .0140142   -97.66   0.000    -1.396094   -1.341159
         GA  |  -.8142174   .0140026   -58.15   0.000     -.841662   -.7867729
         FL  |  -.8238974   .0140043   -58.83   0.000    -.8513453   -.7964494
         KY  |   -.452479   .0140296   -32.25   0.000    -.4799765   -.4249814
         TN  |  -.6645439   .0140089   -47.44   0.000    -.6920009   -.6370869
         AL  |  -.6927385   .0140082   -49.45   0.000     -.720194   -.6652831
         MS  |  -1.001406   .0140103   -71.48   0.000    -1.028866   -.9739466
         AR  |  -.6601007   .0140354   -47.03   0.000    -.6876096   -.6325917
         LA  |  -.8033899   .0140066   -57.36   0.000    -.8308423   -.7759374
         OK  |   -.631816   .0140425   -44.99   0.000    -.6593387   -.6042933
         TX  |  -.9569128   .0140033   -68.33   0.000    -.9843587   -.9294668
         MT  |          0  (empty)
         ID  |          0  (empty)
         WY  |          0  (empty)
         CO  |  -.6196423   .0140585   -44.08   0.000    -.6471964   -.5920882
         NM  |  -.6632121   .0144025   -46.05   0.000    -.6914405   -.6349838
         AZ  |  -.9855622   .0141236   -69.78   0.000    -1.013244   -.9578805
         UT  |  -1.562214   .0163433   -95.59   0.000    -1.594246   -1.530181
         NV  |   .2294198   .0141277    16.24   0.000     .2017301    .2571095
         WA  |   .0559241   .0140446     3.98   0.000     .0283973    .0834509
         OR  |  -.1982039   .0141254   -14.03   0.000    -.2258892   -.1705186
         CA  |  -.1164636    .014003    -8.32   0.000    -.1439089   -.0890183
         AK  |  -.0032165   .0144061    -0.22   0.823    -.0314518    .0250189
         HI  |  -.5682349   .0153837   -36.94   0.000    -.5983864   -.5380835
             |
        nind |
          2  |   .4090759   .0008757   467.16   0.000     .4073596    .4107921
          3  |   .8569866   .0007873  1088.56   0.000     .8554436    .8585296
          4  |   .1314205   .0008373   156.96   0.000     .1297795    .1330616
          5  |   1.043225   .0008295  1257.69   0.000     1.041599     1.04485
          6  |  -.2729005    .001025  -266.25   0.000    -.2749094   -.2708915
          7  |  -.0594764   .0008896   -66.86   0.000      -.06122   -.0577328
          8  |   .2756675   .0009092   303.20   0.000     .2738855    .2774495
          9  |   .3978087   .0009407   422.88   0.000      .395965    .3996525
         10  |   .0909734   .0009665    94.12   0.000      .089079    .0928677
         11  |   .3248717   .0009256   350.98   0.000     .3230576    .3266859
             |
       nocc2 |
          2  |   .2385353   .0008377   284.76   0.000     .2368935    .2401771
          3  |   .0958353   .0007933   120.81   0.000     .0942805    .0973901
          4  |   .7754033   .0007705  1006.42   0.000     .7738932    .7769133
          5  |   .5790872   .0011509   503.17   0.000     .5768316    .5813429
          6  |   .5804733   .0006712   864.79   0.000     .5791577    .5817889
          7  |   .3794528   .0008356   454.13   0.000     .3778152    .3810905
          8  |   .2813647   .0023917   117.64   0.000      .276677    .2860524
          9  |   .7057069   .0006466  1091.42   0.000     .7044396    .7069743
         10  |   .8548286   .0006537  1307.67   0.000     .8535474    .8561098
         11  |   .8747452   .0006767  1292.73   0.000      .873419    .8760715
         12  |   .7880709   .0006486  1215.01   0.000     .7867996    .7893421
             |
     quarter |
          2  |  -.0163246   .0002661   -61.35   0.000    -.0168461    -.015803
          3  |   -.020046   .0002823   -71.01   0.000    -.0205993   -.0194927
          4  |  -.0828651   .0002676  -309.60   0.000    -.0833897   -.0823405
             |
        year |
       1984  |  -.1071105   .0003232  -331.43   0.000    -.1077439   -.1064771
       1985  |  -.2051303   .0003588  -571.66   0.000    -.2058336    -.204427
       1986  |  -.2041618   .0003242  -629.79   0.000    -.2047972   -.2035264
       1987  |  -.2564999   .0003263  -786.14   0.000    -.2571394   -.2558604
       1988  |  -.2288724   .0003266  -700.84   0.000    -.2295124   -.2282323
             |
       _cons |  -2.402726   .0142505  -168.61   0.000    -2.430656   -2.374795
------------------------------------------------------------------------------

.         predict pu1b1m
(option pr assumed; Pr(covered))
(113,972 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year if nhblack == 0 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -1.094e+09  
Iteration 1:   log likelihood = -8.362e+08  
Iteration 2:   log likelihood = -8.264e+08  
Iteration 3:   log likelihood = -8.263e+08  
Iteration 4:   log likelihood = -8.263e+08  

Probit regression                               Number of obs     = 1927483226
                                                LR chi2(103)      =   5.35e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -8.263e+08                     Pseudo R2         =     0.2444

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0450168    .000084   536.17   0.000     .0448522    .0451813
       exper |   .0863268   .0000664  1300.27   0.000     .0861967    .0864569
      exper2 |  -.0026976   4.80e-06  -561.94   0.000     -.002707   -.0026881
      exper3 |   .0000448   1.61e-07   277.65   0.000     .0000445    .0000451
      exper4 |  -3.50e-07   1.76e-09  -199.17   0.000    -3.54e-07   -3.47e-07
        edex |   -.000694   2.71e-06  -255.65   0.000    -.0006993   -.0006887
             |
       ee_cl |
          2  |   .2246343   .0002975   755.03   0.000     .2240512    .2252174
          3  |   .2316414   .0003819   606.62   0.000      .230893    .2323898
          4  |  -.0348306   .0005403   -64.46   0.000    -.0358895   -.0337716
          5  |   .0486274   .0003802   127.92   0.000     .0478823    .0493725
          6  |   .2902394   .0003438   844.22   0.000     .2895655    .2909132
          7  |   .2094176   .0004056   516.31   0.000     .2086227    .2102126
          8  |   -.139522   .0005171  -269.84   0.000    -.1405354   -.1385086
          9  |   .2258353   .0004778   472.62   0.000     .2248987    .2267718
         10  |   .3274634   .0004454   735.14   0.000     .3265903    .3283364
         11  |   .0778686   .0004841   160.86   0.000     .0769198    .0788174
         12  |  -.2759468   .0005534  -498.65   0.000    -.2770314   -.2748622
         13  |   .3857076   .0005957   647.52   0.000     .3845401    .3868751
         14  |    .355478   .0005384   660.22   0.000     .3544227    .3565333
         15  |   .0492719   .0005627    87.57   0.000      .048169    .0503747
         16  |   -.258569    .000599  -431.69   0.000     -.259743   -.2573951
             |
        marr |   .0784617   .0000909   863.21   0.000     .0782836    .0786399
       partt |  -.2510026   .0001534 -1636.09   0.000    -.2513033   -.2507019
      public |    .751487   .0001454  5169.77   0.000     .7512021    .7517719
        cmsa |   .1737388   .0000887  1959.44   0.000      .173565    .1739126
             |
       state |
         NH  |   -.544236   .0011725  -464.16   0.000    -.5465341   -.5419379
         VT  |  -.2568386   .0009521  -269.76   0.000    -.2587047   -.2549725
         MA  |   .0113364   .0006957    16.29   0.000     .0099728       .0127
         RI  |  -.0350263   .0008542   -41.00   0.000    -.0367005    -.033352
         CT  |   .0049281   .0007249     6.80   0.000     .0035073    .0063488
         NY  |   .3466881   .0006773   511.83   0.000     .3453605    .3480156
         NJ  |   .1851811   .0006966   265.84   0.000     .1838158    .1865464
         PA  |   .1478757     .00068   217.48   0.000      .146543    .1492084
         OH  |   .0994511   .0006799   146.28   0.000     .0981186    .1007836
         IN  |   .0695996   .0006925   100.51   0.000     .0682424    .0709568
         IL  |   .1626818    .000682   238.54   0.000     .1613452    .1640185
         MI  |   .2883318   .0006826   422.39   0.000     .2869939    .2896697
         WI  |   .1005793   .0006927   145.20   0.000     .0992216     .101937
         MN  |     .14311   .0006995   204.59   0.000      .141739     .144481
         IA  |  -.1000735    .000731  -136.90   0.000    -.1015062   -.0986408
         MO  |  -.0063152   .0006989    -9.04   0.000    -.0076849   -.0049454
         ND  |  -.1651619   .0012977  -127.27   0.000    -.1677053   -.1626185
         SD  |  -.4313977    .001237  -348.75   0.000    -.4338222   -.4289733
         NE  |  -.2665303   .0008206  -324.79   0.000    -.2681387   -.2649219
         KS  |   -.284306   .0007461  -381.07   0.000    -.2857683   -.2828437
         DE  |  -.2010731   .0015241  -131.93   0.000    -.2040602   -.1980859
         MD  |  -.1371005   .0007235  -189.49   0.000    -.1385186   -.1356824
         DC  |  -.1537858   .0013729  -112.02   0.000    -.1564766    -.151095
         VA  |  -.5439749   .0007059  -770.66   0.000    -.5453583   -.5425914
         WV  |   .1879723    .000778   241.61   0.000     .1864475    .1894972
         NC  |  -.8611559   .0007199 -1196.28   0.000    -.8625668    -.859745
         SC  |  -1.032374   .0008584 -1202.63   0.000    -1.034057   -1.030692
         GA  |  -.5383768   .0007153  -752.71   0.000    -.5397787    -.536975
         FL  |  -.4801815   .0006967  -689.27   0.000    -.4815469   -.4788161
         KY  |  -.1195008   .0007134  -167.51   0.000     -.120899   -.1181026
         TN  |  -.4045066   .0007098  -569.88   0.000    -.4058978   -.4031154
         AL  |    -.26563   .0007299  -363.91   0.000    -.2670606   -.2641994
         MS  |  -.6473763   .0008104  -798.83   0.000    -.6489646   -.6457879
         AR  |  -.5493458   .0007854  -699.48   0.000    -.5508851   -.5478065
         LA  |  -.5486519   .0007468  -734.66   0.000    -.5501156   -.5471882
         OK  |  -.4599887   .0007361  -624.88   0.000    -.4614315   -.4585459
         TX  |   -.591442   .0006873  -860.50   0.000    -.5927891   -.5900949
         MT  |   .0665419   .0010462    63.61   0.000     .0644914    .0685923
         ID  |  -.2124381   .0009907  -214.44   0.000    -.2143798   -.2104964
         WY  |  -.2087498   .0012019  -173.69   0.000    -.2111055   -.2063942
         CO  |  -.2834072   .0007426  -381.64   0.000    -.2848627   -.2819517
         NM  |  -.5579267   .0010603  -526.17   0.000    -.5600049   -.5558484
         AZ  |  -.5430057   .0007697  -705.46   0.000    -.5445144   -.5414971
         UT  |  -.3490164   .0008606  -405.55   0.000    -.3507032   -.3473297
         NV  |   .0082956   .0009825     8.44   0.000     .0063698    .0102213
         WA  |   .3497539    .000709   493.33   0.000     .3483643    .3511434
         OR  |   .0768021   .0007331   104.77   0.000     .0753653     .078239
         CA  |   .1433848   .0006762   212.04   0.000     .1420594    .1447102
         AK  |   .2062976   .0009474   217.75   0.000     .2044407    .2081544
         HI  |   .2406258   .0012023   200.14   0.000     .2382694    .2429822
             |
        nind |
          2  |   .3721499    .000249  1494.84   0.000     .3716619    .3726378
          3  |   .5215398   .0002284  2283.95   0.000     .5210923    .5219874
          4  |   .0277103   .0002471   112.14   0.000      .027226    .0281947
          5  |   .8516619   .0002429  3505.72   0.000     .8511858     .852138
          6  |  -.3489424   .0003626  -962.31   0.000    -.3496531   -.3482316
          7  |  -.2609224   .0002796  -933.12   0.000    -.2614704   -.2603743
          8  |   .0557293   .0003249   171.55   0.000     .0550926    .0563661
          9  |   .5487548   .0002992  1834.10   0.000     .5481684    .5493412
         10  |    .085135   .0003391   251.04   0.000     .0844703    .0857997
         11  |   .4409304   .0002944  1497.95   0.000     .4403534    .4415073
             |
       nocc2 |
          2  |   .3637148   .0002468  1473.66   0.000     .3632311    .3641986
          3  |   .2989796   .0002091  1429.99   0.000     .2985698    .2993894
          4  |   1.020209   .0002277  4479.91   0.000     1.019763    1.020655
          5  |   .7268336   .0004431  1640.51   0.000     .7259652    .7277019
          6  |   .8515992   .0002092  4071.49   0.000     .8511893    .8520092
          7  |   .3728379   .0002335  1596.67   0.000     .3723802    .3732955
          8  |   .6354044     .00058  1095.60   0.000     .6342677    .6365411
          9  |   .9476887   .0002063  4594.34   0.000     .9472844     .948093
         10  |   1.123524   .0001855  6057.91   0.000      1.12316    1.123887
         11  |   1.173349   .0001864  6294.70   0.000     1.172984    1.173715
         12  |   1.260591   .0001917  6576.93   0.000     1.260215    1.260967
             |
     quarter |
          2  |  -.0033371   .0000978   -34.11   0.000    -.0035288   -.0031453
          3  |  -.0191566   .0001041  -184.04   0.000    -.0193606   -.0189526
          4  |  -.0086941   .0000981   -88.66   0.000    -.0088863   -.0085019
             |
        year |
       1984  |  -.0779535   .0001166  -668.36   0.000    -.0781821   -.0777249
       1985  |  -.1343742   .0001296 -1036.60   0.000    -.1346283   -.1341202
       1986  |    -.14749   .0001189 -1240.00   0.000    -.1477231   -.1472568
       1987  |   -.169761   .0001203 -1411.36   0.000    -.1699968   -.1695253
       1988  |  -.1836486   .0001207 -1521.42   0.000    -.1838852    -.183412
             |
       _cons |  -3.389549   .0012005 -2823.34   0.000    -3.391902   -3.387196
------------------------------------------------------------------------------

.         predict pu1b0m
(option pr assumed; Pr(covered))
(102,145 missing values generated)

. 
. gen theta2m = (pb1m/(1-pb1m)) * (pu1b1m/pu1b0m) if nhblack == 0 & covered == 1
(346,696 missing values generated)

. 
. replace theta2m = theta2m * hweight if nhblack == 0 & covered == 1
(69,320 real changes made)

. 
. kdensity lwage3 [aweight = theta2m] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(cu_wmestpt cu_wmde) nograph

. 
. graph twoway (connected u_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected u_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid))  ///
>                          (connected cu_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc
> (eltblue) lp(longdash)),  /// 
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "white" 2 "Black" 3 "white - c.f.") c(1) pos(2) ring(0) symxsize(*.5
> ) size(large) region(lcolor(none))) ///
>                          subtitle("Men Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1men/fin_cu_bhw_men_8388.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/fin_cu_bhw_men_8388.png written in PNG format)

.         
. gen theta3m = (pb1m/(1-pb1m)) * ((1-pu1b1m)/(1-pu1b1m)) if nhblack == 0 & covered == 0
(216,865 missing values generated)

. 
. replace theta3m = theta3m * hweight if nhblack == 0 & covered == 0
(199,151 real changes made)

. 
. kdensity lwage3 [aweight = theta3m] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(cn_wmestpt cn_wmde) nograph

. 
. graph twoway (connected n_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected n_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid))  ///
>                          (connected cn_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc
> (eltblue) lp(longdash)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "white" 2 "Black" 3 "white - c.f.") c(1) pos(2) ring(0) symxsize(*.5
> ) size(large) region(lcolor(none))) ///
>                          subtitle("Men not Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1men/fin_cn_bhw_men_8388.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/fin_cn_bhw_men_8388.png written in PNG format)

.         
. restore

. ********************************************************************************
. 
. ********************************************************************************
. ** women
. preserve

. keep if sex == 2
(467,419 observations deleted)

. 
. qui sum lwage3, detail

. 
. gen xstep = (r(max) - r(min)) / 200

. 
. gen kwage = r(min) + (_n-1)*xstep if _n <= 200
(426,724 missing values generated)

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(wfestpt wfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2, at(kwage) gauss width(0.065) ///
>         generate(bfestpt bfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 3, at(kwage) gauss width(0.065) ///
>         generate(hfestpt hfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_wfestpt u_wfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(n_wfestpt n_wfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_bfestpt u_bfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(nbfestpt n_bfde) nograph

.         
. ** lab wmestpt "non hisp white men estimation points"
. ** lab wmde "non hisp white men density estimate"
. 
. graph twoway (connected wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(so
> lid))  /// 
>                          (connected bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(ma
> genta) lp(solid))  ///
>                          (connected hfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(mi
> dgreen) lp(solid)), ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "Hispanic") c(1) pos(2) ring(0
> ) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women", size(vlarge))

. graph export "$figs/kde1wom/bhw_wom_8388.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/bhw_wom_8388.png written in PNG format)

. 
. graph twoway (connected u_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected u_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsize(*.
> 5) size(large) region(lcolor(none))) ///
>                          subtitle("Women Covered by Union", size(vlarge))

. graph export "$figs/kde1wom/u_bhw_wom_8388.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/u_bhw_wom_8388.png written in PNG format)

. 
. graph twoway (connected n_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected n_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsize(*.
> 5) size(large) region(lcolor(none))) ///
>                          subtitle("Women not Covered by Union", size(vlarge))

. graph export "$figs/kde1wom/n_bhw_wom_8388.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/n_bhw_wom_8388.png written in PNG format)

. 
. ** probability of race that depends on other covariates
. 
. local nhr w b

. 
. clonevar nhrace = hisprace
(20,809 missing values generated)

. 
. replace nhrace =. if nhrace == 3
(20,601 real changes made, 20,601 to missing)

. 
. keep if inrange(nhrace, 1, 2)
(41,410 observations deleted)

. 
. gen nhblack = nhrace - 1

. 
. gen finalwt1 = round(eweight)

. 
. drop nind

. 
. rename nind2 nind

. 
. drop nocc2

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(344958 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(365558 differences between nocc2 and nocc3)

. 
. drop edex

. 
. gen edex = educ*exper

. 
. probit nhblack educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -7.489e+08  
Iteration 1:   log likelihood = -6.286e+08  
Iteration 2:   log likelihood = -6.234e+08  
Iteration 3:   log likelihood = -6.232e+08  
Iteration 4:   log likelihood = -6.232e+08  
Iteration 5:   log likelihood = -6.232e+08  
Iteration 6:   log likelihood = -6.232e+08  

Probit regression                               Number of obs     = 1927843738
                                                LR chi2(103)      =   2.51e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -6.232e+08                     Pseudo R2         =     0.1679

------------------------------------------------------------------------------
     nhblack |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0406469   .0000919   442.07   0.000     .0404667    .0408271
       exper |   .1018075   .0000689  1477.34   0.000     .1016724    .1019425
      exper2 |  -.0039819   5.11e-06  -779.16   0.000    -.0039919   -.0039718
      exper3 |   .0000776   1.77e-07   438.67   0.000     .0000772    .0000779
      exper4 |  -5.87e-07   1.95e-09  -301.28   0.000    -5.91e-07   -5.83e-07
        edex |  -.0022374   3.06e-06  -731.72   0.000    -.0022434   -.0022314
             |
       ee_cl |
          2  |  -.0009331   .0003144    -2.97   0.003    -.0015493    -.000317
          3  |  -.0012871   .0004067    -3.16   0.002    -.0020843     -.00049
          4  |  -.3248022   .0005805  -559.49   0.000    -.3259401   -.3236644
          5  |   .0761995   .0004171   182.71   0.000     .0753821     .077017
          6  |  -.0586201    .000377  -155.51   0.000    -.0593589   -.0578813
          7  |  -.0527637   .0004412  -119.60   0.000    -.0536283    -.051899
          8  |  -.3442601   .0005686  -605.46   0.000    -.3453745   -.3431457
          9  |   .1572808   .0005266   298.69   0.000     .1562488    .1583129
         10  |  -.1141894   .0004906  -232.73   0.000     -.115151   -.1132277
         11  |  -.0634847   .0005341  -118.87   0.000    -.0645314   -.0624379
         12  |  -.1772463   .0006201  -285.85   0.000    -.1784616   -.1760309
         13  |   .2235903   .0006624   337.56   0.000      .222292    .2248885
         14  |  -.1370514   .0006048  -226.59   0.000    -.1382368   -.1358659
         15  |   .0009255    .000639     1.45   0.148     -.000327     .002178
         16  |   .0807876   .0006989   115.60   0.000     .0794179    .0821573
             |
        marr |  -.3146407   .0000859 -3664.30   0.000     -.314809   -.3144724
       partt |  -.1412739   .0001045 -1352.10   0.000    -.1414786   -.1410691
      public |   .4496512   .0001513  2972.32   0.000     .4493547    .4499477
        cmsa |   .5135827   .0001126  4560.79   0.000      .513362    .5138034
             |
       state |
         NH  |   .2544613   .0054491    46.70   0.000     .2437813    .2651413
         VT  |    .198997   .0052233    38.10   0.000     .1887595    .2092345
         MA  |      1.014   .0041333   245.32   0.000     1.005899    1.022101
         RI  |   .7754273   .0042142   184.00   0.000     .7671675     .783687
         CT  |   1.326414    .004138   320.54   0.000     1.318304    1.334525
         NY  |   1.701517   .0041242   412.57   0.000     1.693434      1.7096
         NJ  |    1.68198    .004128   407.46   0.000      1.67389    1.690071
         PA  |   1.338621   .0041264   324.40   0.000     1.330534    1.346709
         OH  |   1.440707   .0041257   349.20   0.000      1.43262    1.448793
         IN  |   1.356072   .0041308   328.29   0.000     1.347976    1.364168
         IL  |   1.692579   .0041253   410.30   0.000     1.684493    1.700664
         MI  |   1.493997   .0041264   362.06   0.000     1.485909    1.502084
         WI  |   .8904168   .0041387   215.15   0.000     .8823051    .8985284
         MN  |   .7027614   .0041472   169.45   0.000      .694633    .7108898
         IA  |   .5097352   .0042121   121.02   0.000     .5014796    .5179907
         MO  |   1.570784   .0041297   380.36   0.000      1.56269    1.578878
         ND  |   .2094966   .0064212    32.63   0.000     .1969112    .2220819
         SD  |   .2666914   .0056907    46.86   0.000     .2555378     .277845
         NE  |   1.104076   .0041821   264.00   0.000      1.09588    1.112273
         KS  |   1.199301   .0041528   288.80   0.000     1.191162     1.20744
         DE  |   2.409245   .0042886   561.78   0.000      2.40084    2.417651
         MD  |   2.087253   .0041295   505.45   0.000      2.07916    2.095347
         DC  |   3.184983   .0041535   766.82   0.000     3.176842    3.193124
         VA  |   1.997466   .0041261   484.11   0.000     1.989379    2.005553
         WV  |   1.178262   .0042172   279.39   0.000     1.169997    1.186528
         NC  |   2.180742   .0041252   528.64   0.000     2.172657    2.188827
         SC  |   2.583476   .0041306   625.44   0.000      2.57538    2.591572
         GA  |   2.334243   .0041254   565.82   0.000     2.326158    2.342329
         FL  |   1.935852    .004125   469.29   0.000     1.927767    1.943937
         KY  |    1.44089   .0041356   348.41   0.000     1.432784    1.448995
         TN  |    1.85485   .0041277   449.36   0.000      1.84676     1.86294
         AL  |   2.193394   .0041297   531.13   0.000       2.1853    2.201488
         MS  |   2.688338   .0041323   650.57   0.000     2.680239    2.696437
         AR  |   1.887541   .0041407   455.85   0.000     1.879425    1.895656
         LA  |   2.411295   .0041291   583.98   0.000     2.403203    2.419388
         OK  |   1.321953    .004139   319.39   0.000     1.313841    1.330066
         TX  |   1.787203   .0041244   433.33   0.000      1.77912    1.795287
         MT  |  -.0352131   .0067685    -5.20   0.000    -.0484792    -.021947
         ID  |   .3168209   .0052504    60.34   0.000     .3065302    .3271115
         WY  |   .3597949   .0058825    61.16   0.000     .3482653    .3713244
         CO  |   1.105268   .0041468   266.54   0.000      1.09714    1.113395
         NM  |   1.515896   .0042846   353.80   0.000     1.507498    1.524294
         AZ  |     .80153   .0041639   192.49   0.000     .7933689    .8096911
         UT  |   .2232905   .0044049    50.69   0.000     .2146571    .2319239
         NV  |   1.301083   .0042021   309.62   0.000     1.292847    1.309319
         WA  |    .944374   .0041456   227.80   0.000     .9362488    .9524993
         OR  |   .7295096   .0041727   174.83   0.000     .7213312     .737688
         CA  |   1.406892   .0041243   341.13   0.000     1.398809    1.414976
         AK  |   1.185341   .0042873   276.47   0.000     1.176938    1.193744
         HI  |   1.023973   .0043854   233.50   0.000     1.015378    1.032568
             |
        nind |
          2  |  -.3442021   .0007251  -474.72   0.000    -.3456232    -.342781
          3  |   .2135835   .0004774   447.42   0.000     .2126479    .2145191
          4  |   .0312144   .0004856    64.28   0.000     .0302626    .0321662
          5  |   .4739113   .0005014   945.21   0.000     .4729286     .474894
          6  |   .3231507   .0004932   655.23   0.000     .3221841    .3241174
          7  |   .2061343   .0004943   416.99   0.000     .2051654    .2071031
          8  |   .4677142    .000486   962.45   0.000     .4667617    .4686666
          9  |   .1861279   .0005054   368.26   0.000     .1851373    .1871185
         10  |   .4191579   .0004996   838.99   0.000     .4181787    .4201371
         11  |   .2580356   .0005191   497.04   0.000     .2570181    .2590531
             |
       nocc2 |
          2  |   .1655807   .0002873   576.30   0.000     .1650175    .1661438
          3  |   .1511977   .0003553   425.56   0.000     .1505014    .1518941
          4  |   .1953593   .0002643   739.22   0.000     .1948413    .1958773
          5  |   .1271835   .0002796   454.91   0.000     .1266355    .1277314
          6  |   .2934781   .0002214  1325.40   0.000     .2930441    .2939121
          7  |   .5017623   .0002599  1930.94   0.000      .501253    .5022716
          8  |  -.0944616   .0005975  -158.09   0.000    -.0956327   -.0932905
          9  |   .8018539   .0002363  3393.55   0.000     .8013908    .8023171
         10  |   .8248632   .0002671  3088.00   0.000     .8243396    .8253867
         11  |    .490896   .0005915   829.94   0.000     .4897367    .4920553
         12  |   .6715872   .0003238  2073.91   0.000     .6709525    .6722219
             |
     quarter |
          2  |   .0166748   .0001103   151.23   0.000     .0164587    .0168909
          3  |   .0102986   .0001175    87.63   0.000     .0100682    .0105289
          4  |   .0143742   .0001103   130.34   0.000     .0141581    .0145904
             |
        year |
       1984  |   .0315436    .000136   231.99   0.000     .0312771    .0318101
       1985  |   .0394397   .0001487   265.28   0.000     .0391483    .0397311
       1986  |   .0433742   .0001366   317.55   0.000     .0431065    .0436419
       1987  |   .0521964   .0001368   381.57   0.000     .0519283    .0524645
       1988  |    .056123   .0001368   410.21   0.000     .0558549    .0563912
             |
       _cons |  -4.561447   .0042823 -1065.19   0.000     -4.56984   -4.553054
------------------------------------------------------------------------------

.         predict pb1f
(option pr assumed; Pr(nhblack))
(97,103 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year if nhblack == 1 [w = finalwt1]
(frequency weights assumed)

note: 11.state != 0 predicts failure perfectly
      11.state dropped and 2 obs not used

note: 12.state != 0 predicts failure perfectly
      12.state dropped and 2 obs not used

note: 13.state != 0 predicts failure perfectly
      13.state dropped and 6 obs not used

note: 44.state != 0 predicts failure perfectly
      44.state dropped and 3 obs not used

note: 45.state != 0 predicts failure perfectly
      45.state dropped and 5 obs not used

note: 81.state != 0 predicts failure perfectly
      81.state dropped and 2 obs not used

note: 82.state != 0 predicts failure perfectly
      82.state dropped and 4 obs not used

note: 95.state omitted because of collinearity
Iteration 0:   log likelihood = -1.429e+08  
Iteration 1:   log likelihood = -1.064e+08  
Iteration 2:   log likelihood = -1.053e+08  
Iteration 3:   log likelihood = -1.053e+08  
Iteration 4:   log likelihood = -1.053e+08  

Probit regression                               Number of obs     =  251082510
                                                LR chi2(96)       =   7.52e+07
                                                Prob > chi2       =     0.0000
Log likelihood = -1.053e+08                     Pseudo R2         =     0.2632

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0924048   .0002422   381.51   0.000       .09193    .0928795
       exper |   .1154221   .0001918   601.70   0.000     .1150461    .1157981
      exper2 |  -.0044208   .0000135  -327.98   0.000    -.0044472   -.0043943
      exper3 |   .0000758   4.42e-07   171.50   0.000      .000075    .0000767
      exper4 |  -4.16e-07   4.73e-09   -87.99   0.000    -4.26e-07   -4.07e-07
        edex |  -.0013138   7.60e-06  -172.87   0.000    -.0013287   -.0012989
             |
       ee_cl |
          2  |   .1102498    .001024   107.66   0.000     .1082427    .1122569
          3  |  -.0281992   .0012336   -22.86   0.000    -.0306171   -.0257813
          4  |  -.1113185    .001612   -69.06   0.000    -.1144779   -.1081591
          5  |   .0594383   .0011839    50.21   0.000     .0571179    .0617586
          6  |  -.0138335   .0011265   -12.28   0.000    -.0160414   -.0116256
          7  |  -.0578339   .0012751   -45.36   0.000     -.060333   -.0553348
          8  |  -.1813689   .0015713  -115.42   0.000    -.1844486   -.1782891
          9  |   .0938818   .0013912    67.48   0.000      .091155    .0966086
         10  |   .1032094   .0013451    76.73   0.000      .100573    .1058457
         11  |  -.1503693   .0014576  -103.16   0.000    -.1532261   -.1475125
         12  |   .0174827   .0016571    10.55   0.000     .0142348    .0207305
         13  |   .2180539   .0016638   131.05   0.000     .2147928    .2213149
         14  |   .1725681   .0015731   109.70   0.000     .1694848    .1756514
         15  |  -.0122647   .0016679    -7.35   0.000    -.0155338   -.0089957
         16  |   .0744677   .0018046    41.27   0.000     .0709307    .0780046
             |
        marr |   .0137362   .0002051    66.96   0.000     .0133342    .0141383
       partt |  -.4031048   .0003047 -1322.85   0.000     -.403702   -.4025075
      public |   .7781619   .0003142  2476.67   0.000     .7775461    .7787777
        cmsa |   .2695947   .0003412   790.16   0.000      .268926    .2702635
             |
       state |
         ME  |          0  (empty)
         NH  |          0  (empty)
         VT  |          0  (empty)
         MA  |    .097938   .0056695    17.27   0.000     .0868259      .10905
         RI  |  -.0910628     .00628   -14.50   0.000    -.1033714   -.0787541
         CT  |   .2357414   .0056716    41.57   0.000     .2246253    .2468576
         NY  |   .7167535   .0055991   128.01   0.000     .7057794    .7277276
         NJ  |   .4755151   .0056141    84.70   0.000     .4645117    .4865185
         PA  |    .331729   .0056137    59.09   0.000     .3207262    .3427317
         OH  |   .2024049   .0056099    36.08   0.000     .1914096    .2134002
         IN  |  -.0816255   .0056442   -14.46   0.000    -.0926879   -.0705631
         IL  |    .315281   .0056052    56.25   0.000      .304295    .3262671
         MI  |   .6325879   .0056107   112.75   0.000      .621591    .6435847
         WI  |    .397709   .0057059    69.70   0.000     .3865257    .4088924
         MN  |   .4795307   .0057798    82.97   0.000     .4682025    .4908589
         IA  |  -.1389411   .0066512   -20.89   0.000    -.1519772    -.125905
         MO  |   .2089886   .0056259    37.15   0.000     .1979619    .2200152
         ND  |          0  (empty)
         SD  |          0  (empty)
         NE  |   .2317583   .0059776    38.77   0.000     .2200425    .2434741
         KS  |  -.2060087   .0058325   -35.32   0.000    -.2174402   -.1945771
         DE  |   .3347112   .0060907    54.95   0.000     .3227737    .3466487
         MD  |   .0963045   .0056138    17.15   0.000     .0853017    .1073074
         DC  |  -.0417091   .0056303    -7.41   0.000    -.0527442    -.030674
         VA  |  -.3972721   .0056121   -70.79   0.000    -.4082716   -.3862725
         WV  |  -.0184931   .0065195    -2.84   0.005    -.0312711   -.0057151
         NC  |  -.8179588   .0056178  -145.60   0.000    -.8289695   -.8069481
         SC  |  -1.007748   .0056508  -178.34   0.000    -1.018823   -.9966726
         GA  |  -.4875218   .0056094   -86.91   0.000     -.498516   -.4765277
         FL  |  -.2621998   .0056067   -46.77   0.000    -.2731888   -.2512109
         KY  |  -.0772859   .0056799   -13.61   0.000    -.0884184   -.0661535
         TN  |  -.2952018   .0056203   -52.52   0.000    -.3062173   -.2841862
         AL  |  -.4557537   .0056288   -80.97   0.000    -.4667859   -.4447215
         MS  |   -.654567   .0056404  -116.05   0.000     -.665622   -.6435119
         AR  |   -.215998   .0056998   -37.90   0.000    -.2271693   -.2048266
         LA  |   -.400123   .0056189   -71.21   0.000    -.4111359   -.3891101
         OK  |  -.3111831   .0057182   -54.42   0.000    -.3223907   -.2999756
         TX  |  -.6949847   .0056091  -123.90   0.000    -.7059784   -.6839909
         MT  |          0  (empty)
         ID  |          0  (empty)
         WY  |   .4143861   .0183468    22.59   0.000     .3784272    .4503451
         CO  |  -.2519236   .0057916   -43.50   0.000    -.2632749   -.2405724
         NM  |  -.5376195   .0076411   -70.36   0.000    -.5525958   -.5226432
         AZ  |  -.7931788   .0060716  -130.64   0.000    -.8050789   -.7812787
         UT  |   .0628275   .0080571     7.80   0.000     .0470359    .0786191
         NV  |   1.246761   .0058746   212.23   0.000     1.235247    1.258275
         WA  |    .209382   .0057573    36.37   0.000     .1980979    .2206661
         OR  |   .7037269   .0059478   118.32   0.000     .6920695    .7153843
         CA  |   .3433859   .0056014    61.30   0.000     .3324073    .3543644
         AK  |   .4160298      .0066    63.04   0.000     .4030942    .4289655
         HI  |          0  (omitted)
             |
        nind |
          2  |   .3752426   .0024146   155.41   0.000     .3705101    .3799751
          3  |   .5798139   .0017556   330.27   0.000      .576373    .5832548
          4  |    .145552   .0017928    81.18   0.000     .1420381    .1490659
          5  |   1.349808   .0017881   754.89   0.000     1.346304    1.353313
          6  |  -.1273359   .0018137   -70.21   0.000    -.1308907   -.1237811
          7  |  -.0771434    .001815   -42.50   0.000    -.0807008    -.073586
          8  |   .2531347   .0017751   142.60   0.000     .2496555    .2566139
          9  |   .5396749   .0017932   300.95   0.000     .5361602    .5431895
         10  |  -.1524339   .0018081   -84.31   0.000    -.1559776   -.1488902
         11  |   .2990191   .0018063   165.54   0.000     .2954788    .3025594
             |
       nocc2 |
          2  |   .1013626   .0008277   122.46   0.000     .0997403    .1029849
          3  |   .1964782   .0010132   193.92   0.000     .1944924     .198464
          4  |    .780287   .0007334  1063.97   0.000     .7788497    .7817244
          5  |   .6141709   .0007904   777.03   0.000     .6126218    .6157201
          6  |   .3745057   .0006692   559.61   0.000     .3731941    .3758174
          7  |    .611111   .0008224   743.07   0.000     .6094991    .6127229
          8  |   .5674816   .0020109   282.21   0.000     .5635403    .5714228
          9  |   .5823187   .0007001   831.81   0.000     .5809466    .5836908
         10  |   1.006558   .0007683  1310.05   0.000     1.005052    1.008064
         11  |   1.069185    .001381   774.24   0.000     1.066479    1.071892
         12  |   .9304633   .0008534  1090.25   0.000     .9287906     .932136
             |
     quarter |
          2  |   .0119527   .0002722    43.91   0.000     .0114191    .0124862
          3  |  -.0394111   .0002927  -134.64   0.000    -.0399848   -.0388373
          4  |  -.0141705   .0002729   -51.93   0.000    -.0147054   -.0136357
             |
        year |
       1984  |  -.0774629    .000333  -232.66   0.000    -.0781154   -.0768103
       1985  |  -.1155937   .0003655  -316.26   0.000    -.1163101   -.1148774
       1986  |  -.1683419   .0003362  -500.71   0.000    -.1690008   -.1676829
       1987  |  -.1935364   .0003386  -571.63   0.000       -.1942   -.1928728
       1988  |  -.1550382    .000336  -461.49   0.000    -.1556967   -.1543798
             |
       _cons |  -3.714509   .0065575  -566.45   0.000    -3.727361   -3.701656
------------------------------------------------------------------------------

.         predict pu1b1f
(option pr assumed; Pr(covered))
(110,665 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year if nhblack == 0 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -7.247e+08  
Iteration 1:   log likelihood = -5.341e+08  
Iteration 2:   log likelihood = -5.248e+08  
Iteration 3:   log likelihood = -5.248e+08  
Iteration 4:   log likelihood = -5.248e+08  
Iteration 5:   log likelihood = -5.248e+08  

Probit regression                               Number of obs     = 1666699086
                                                LR chi2(103)      =   4.00e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -5.248e+08                     Pseudo R2         =     0.2759

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0532146   .0001022   520.76   0.000     .0530143    .0534149
       exper |   .0914115   .0000819  1116.37   0.000      .091251     .091572
      exper2 |  -.0046689   6.02e-06  -776.20   0.000    -.0046807   -.0046572
      exper3 |   .0001228   2.08e-07   589.56   0.000     .0001224    .0001232
      exper4 |  -1.14e-06   2.31e-09  -494.69   0.000    -1.15e-06   -1.14e-06
        edex |  -.0012517   3.50e-06  -357.42   0.000    -.0012585   -.0012448
             |
       ee_cl |
          2  |   .0598868   .0004261   140.54   0.000     .0590516     .060722
          3  |  -.0868108   .0005141  -168.88   0.000    -.0878183   -.0858032
          4  |  -.2139571   .0006846  -312.53   0.000    -.2152989   -.2126153
          5  |   .0138937   .0005636    24.65   0.000     .0127891    .0149984
          6  |   .0619657   .0004862   127.46   0.000     .0610128    .0629186
          7  |  -.0930368   .0005504  -169.02   0.000    -.0941157    -.091958
          8  |   -.170373   .0006729  -253.20   0.000    -.1716918   -.1690542
          9  |   .1161579   .0006609   175.75   0.000     .1148625    .1174533
         10  |   .0208737    .000599    34.85   0.000     .0196996    .0220477
         11  |  -.1350553   .0006434  -209.91   0.000    -.1363163   -.1337943
         12  |  -.0560501   .0007155   -78.34   0.000    -.0574524   -.0546477
         13  |   .1764587   .0007924   222.68   0.000     .1749055    .1780118
         14  |    .042297   .0007102    59.56   0.000     .0409051    .0436889
         15  |  -.1823427    .000739  -246.75   0.000    -.1837911   -.1808943
         16  |  -.0486683   .0007806   -62.35   0.000    -.0501983   -.0471383
             |
        marr |  -.0153235   .0000974  -157.30   0.000    -.0155144   -.0151326
       partt |    -.37911    .000115 -3296.63   0.000    -.3793354   -.3788846
      public |   1.074802   .0001549  6939.78   0.000     1.074499    1.075106
        cmsa |   .0969253   .0001113   871.07   0.000     .0967072    .0971434
             |
       state |
         NH  |  -.3083892   .0014159  -217.81   0.000    -.3111643   -.3056141
         VT  |   -.059307   .0011854   -50.03   0.000    -.0616303   -.0569836
         MA  |   .1996307   .0008837   225.91   0.000     .1978987    .2013626
         RI  |   .0929889   .0010481    88.73   0.000     .0909347     .095043
         CT  |   .1845308    .000916   201.46   0.000     .1827355     .186326
         NY  |   .4846072    .000865   560.26   0.000     .4829119    .4863025
         NJ  |   .2529629   .0008869   285.22   0.000     .2512246    .2547012
         PA  |   .2669209   .0008702   306.74   0.000     .2652153    .2686264
         OH  |    .136506   .0008707   156.77   0.000     .1347994    .1382126
         IN  |  -.0105605   .0008884   -11.89   0.000    -.0123018   -.0088193
         IL  |   .0324398   .0008743    37.10   0.000     .0307262    .0341534
         MI  |   .3320377   .0008727   380.46   0.000     .3303272    .3337482
         WI  |   .2465543   .0008829   279.26   0.000     .2448239    .2482848
         MN  |   .3228611   .0008859   364.46   0.000     .3211248    .3245973
         IA  |  -.0691422     .00093   -74.35   0.000    -.0709649   -.0673195
         MO  |  -.1545187   .0008986  -171.96   0.000    -.1562799   -.1527576
         ND  |  -.0445819   .0015948   -27.95   0.000    -.0477077   -.0414561
         SD  |  -.3535693   .0015071  -234.60   0.000    -.3565231   -.3506154
         NE  |  -.1629645   .0010365  -157.22   0.000    -.1649961   -.1609329
         KS  |  -.3248086   .0009658  -336.32   0.000    -.3267015   -.3229157
         DE  |   .0071521   .0018888     3.79   0.000     .0034501    .0108541
         MD  |   .0026522   .0009226     2.87   0.004     .0008439    .0044605
         DC  |  -.2503036   .0015538  -161.09   0.000     -.253349   -.2472582
         VA  |  -.5015904   .0009055  -553.92   0.000    -.5033652   -.4998156
         WV  |   .0098055   .0010289     9.53   0.000     .0077889     .011822
         NC  |  -.7377684   .0009117  -809.23   0.000    -.7395553   -.7359815
         SC  |  -1.063131   .0011331  -938.22   0.000    -1.065352    -1.06091
         GA  |  -.5619359   .0009167  -613.02   0.000    -.5637325   -.5601393
         FL  |  -.3011298   .0008898  -338.42   0.000    -.3028738   -.2993858
         KY  |  -.2409867   .0009203  -261.87   0.000    -.2427904    -.239183
         TN  |  -.3445339   .0009069  -379.92   0.000    -.3463113   -.3427565
         AL  |  -.2700515   .0009416  -286.80   0.000     -.271897    -.268206
         MS  |  -.7955343   .0010803  -736.40   0.000    -.7976517    -.793417
         AR  |  -.4774807   .0010041  -475.52   0.000    -.4794487   -.4755126
         LA  |  -.5144553   .0009776  -526.23   0.000    -.5163714   -.5125392
         OK  |  -.3227108   .0009395  -343.50   0.000    -.3245522   -.3208694
         TX  |  -.5646583    .000882  -640.17   0.000    -.5663871   -.5629296
         MT  |   .2365533   .0012531   188.78   0.000     .2340973    .2390093
         ID  |  -.1589238   .0012915  -123.05   0.000    -.1614552   -.1563925
         WY  |  -.1021557    .001513   -67.52   0.000     -.105121   -.0991903
         CO  |   -.164025   .0009366  -175.13   0.000    -.1658607   -.1621893
         NM  |  -.4848577   .0013521  -358.59   0.000    -.4875078   -.4822077
         AZ  |  -.4423448   .0009864  -448.45   0.000    -.4442781   -.4404116
         UT  |  -.1002685   .0010924   -91.79   0.000    -.1024096   -.0981275
         NV  |   .3364533   .0011752   286.30   0.000       .33415    .3387566
         WA  |    .483821   .0009014   536.72   0.000     .4820542    .4855878
         OR  |   .3000097   .0009304   322.45   0.000     .2981861    .3018333
         CA  |   .3260889   .0008641   377.36   0.000     .3243952    .3277825
         AK  |   .3656133   .0011497   318.00   0.000     .3633599    .3678668
         HI  |   .4919399   .0013232   371.77   0.000     .4893464    .4945333
             |
        nind |
          2  |   .4738652   .0008437   561.68   0.000     .4722117    .4755187
          3  |   .8553659   .0006837  1251.14   0.000     .8540259    .8567059
          4  |   .6377522   .0006935   919.63   0.000      .636393    .6391114
          5  |     1.6577   .0006987  2372.51   0.000      1.65633    1.659069
          6  |   .2144002   .0007225   296.74   0.000     .2129841    .2158164
          7  |   .2645003   .0007166   369.12   0.000     .2630958    .2659047
          8  |   .6121611   .0006949   880.89   0.000     .6107991    .6135232
          9  |   1.005225   .0007009  1434.20   0.000     1.003852    1.006599
         10  |   .3821974   .0007321   522.09   0.000     .3807626    .3836322
         11  |   .7357921   .0007127  1032.44   0.000     .7343953    .7371889
             |
       nocc2 |
          2  |   .2035078   .0003358   606.04   0.000     .2028496    .2041659
          3  |   .3862516   .0003788  1019.64   0.000     .3855092    .3869941
          4  |   .9597795    .000283  3391.01   0.000     .9592247    .9603342
          5  |   .8848288   .0003083  2870.21   0.000     .8842246     .885433
          6  |    .433309   .0002564  1689.64   0.000     .4328063    .4338116
          7  |   .7441384   .0002974  2502.42   0.000     .7435556    .7447212
          8  |   .5652213   .0007261   778.43   0.000     .5637981    .5666444
          9  |    .581378    .000283  2054.63   0.000     .5808234    .5819326
         10  |   1.250594   .0002986  4188.41   0.000     1.250009    1.251179
         11  |   1.259806   .0005618  2242.35   0.000     1.258705    1.260907
         12  |   1.171966   .0003432  3414.46   0.000     1.171293    1.172638
             |
     quarter |
          2  |  -.0108766   .0001204   -90.37   0.000    -.0111125   -.0106407
          3  |  -.0135945   .0001282  -106.00   0.000    -.0138458   -.0133431
          4  |  -.0187223     .00012  -156.08   0.000    -.0189575   -.0184872
             |
        year |
       1984  |  -.0636037   .0001443  -440.86   0.000    -.0638865   -.0633209
       1985  |  -.0941786   .0001595  -590.29   0.000    -.0944913   -.0938659
       1986  |  -.1098589   .0001469  -747.83   0.000    -.1101469    -.109571
       1987  |  -.1263139   .0001479  -853.93   0.000    -.1266039    -.126024
       1988  |  -.1406697   .0001484  -948.22   0.000    -.1409605   -.1403789
             |
       _cons |  -3.717955   .0016276 -2284.37   0.000    -3.721145   -3.714765
------------------------------------------------------------------------------

.         predict pu1b0f
(option pr assumed; Pr(covered))
(97,103 missing values generated)

. 
. gen theta2f = (pb1f/(1-pb1f)) * (pu1b1f/pu1b0f) if nhblack == 0 & covered == 1
(347,521 missing values generated)

. 
. replace theta2f = theta2f * hweight if nhblack == 0 & covered == 1
(37,993 real changes made)

. 
. kdensity lwage3 [aweight = theta2f] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(cu_wfestpt cu_wfde) nograph

. 
. graph twoway (connected u_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected u_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid))  ///
>                          (connected cu_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc
> (eltblue) lp(longdash)),  /// 
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "white" 2 "Black" 3 "white - c.f.") c(1) pos(2) ring(0) symxsize(*.5
> ) size(large) region(lcolor(none))) ///
>                          subtitle("Women Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1wom/fin_cu_bhw_wom_8388.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/fin_cu_bhw_wom_8388.png written in PNG format)

.         
. gen theta3f = (pb1f/(1-pb1f)) * ((1-pu1b1f)/(1-pu1b1f)) if nhblack == 0 & covered == 0
(185,555 missing values generated)

. 
. replace theta3f = theta3f * hweight if nhblack == 0 & covered == 0
(199,959 real changes made)

. 
. kdensity lwage3 [aweight = theta3f] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(cn_wfestpt cn_wfde) nograph

. 
. graph twoway (connected n_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected n_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid))  ///
>                          (connected cn_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc
> (eltblue) lp(longdash)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "white" 2 "Black" 3 "white - c.f.") c(1) pos(2) ring(0) symxsize(*.5
> ) size(large) region(lcolor(none))) ///
>                          subtitle("Women not Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1wom/fin_cn_bhw_wom_8388.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/fin_cn_bhw_wom_8388.png written in PNG format)

.         
. restore

. 
. log close
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/dfl1/dfl-3per.log
  log type:  text
 closed on:  26 Apr 2021, 18:27:09
--------------------------------------------------------------------------------------------------------------
