---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/dfl1/dfl1.log
  log type:  text
 opened on:  11 Mar 2021, 11:50:43

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017
> .
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
(2,109 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,113 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,737 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,612 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. drop if year < 1983
(556,442 observations deleted)

. 
. ** men
. preserve

. keep if sex == 1
(2,033,246 observations deleted)

. 
. qui sum lwage3, detail

. 
. gen xstep = (r(max) - r(min)) / 200

. 
. gen kwage = r(min) + (_n-1)*xstep if _n <= 200
(2,097,526 missing values generated)

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(wmestpt wmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2, at(kwage) gauss width(0.065) ///
>         generate(bmestpt bmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 3, at(kwage) gauss width(0.065) ///
>         generate(hmestpt hmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_wmestpt u_wmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(n_wmestpt n_wmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_bmestpt u_bmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(nbmestpt n_bmde) nograph

.         
. ** lab wmestpt "non hisp white men estimation points"
. ** lab wmde "non hisp white men density estimate"
. 
. graph twoway (connected wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) 
> lp(solid))  /// 
>                          (connected bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) 
> lc(magenta) lp(solid))  ///
>                          (connected hmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) 
> lc(midgreen) lp(solid)), ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) //
> /
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "Hispanic") c(1) pos(2) r
> ing(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men", size(vlarge))

. graph export "$figs/kde1men/bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/bhw_men.png written in PNG format)

. 
. graph twoway (connected u_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue
> ) lp(solid))  /// 
>                          (connected u_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick
> ) lc(magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) //
> /
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsi
> ze(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men Covered by Union", size(vlarge))

. graph export "$figs/kde1men/u_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/u_bhw_men.png written in PNG format)

. 
. graph twoway (connected n_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue
> ) lp(solid))  /// 
>                          (connected n_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick
> ) lc(magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) //
> /
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsi
> ze(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men not Covered by Union", size(vlarge))

. graph export "$figs/kde1men/n_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/n_bhw_men.png written in PNG format)

. 
. ** probability of race that depends on other covariates
. 
. local nhr w b

. 
. clonevar nhrace = hisprace
(128,836 missing values generated)

. 
. replace nhrace =. if nhrace == 3
(209,055 real changes made, 209,055 to missing)

. 
. keep if inrange(nhrace, 1, 2)
(337,891 observations deleted)

. 
. gen nhblack = nhrace - 1

. 
. gen finalwt1 = round(eweight)

. 
. drop nind

. 
. rename nind2 nind

. 
. drop nocc2

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(1377643 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(1583532 differences between nocc2 and nocc3)

. 
. drop edex

. 
. gen edex = educ*exper

. 
. probit nhblack educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.noc
> c3 i.quarter i.year [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.116e+09  
Iteration 1:   log likelihood = -3.568e+09  
Iteration 2:   log likelihood = -3.543e+09  
Iteration 3:   log likelihood = -3.542e+09  
Iteration 4:   log likelihood = -3.542e+09  
Iteration 5:   log likelihood = -3.542e+09  
Iteration 6:   log likelihood = -3.542e+09  

Probit regression                               Number of obs     =  1.140e+10
                                                LR chi2(124)      =   1.15e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.542e+09                     Pseudo R2         =     0.1394

------------------------------------------------------------------------------
     nhblack |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0016116   .0000395   -40.78   0.000    -.0016891   -.0015342
       exper |   .1046307   .0000314  3334.10   0.000     .1045692    .1046922
      exper2 |  -.0046616   2.29e-06 -2034.38   0.000    -.0046661   -.0046571
      exper3 |   .0000914   7.84e-08  1166.39   0.000     .0000912    .0000916
      exper4 |  -6.49e-07   8.63e-10  -751.92   0.000    -6.51e-07   -6.47e-07
        edex |  -.0013813   1.33e-06 -1036.02   0.000    -.0013839   -.0013787
             |
       ee_cl |
          2  |   .1598713   .0001286  1243.57   0.000     .1596194    .1601233
          3  |   .0436374   .0001584   275.53   0.000     .0433269    .0439478
          4  |  -.1807565   .0002464  -733.73   0.000    -.1812393   -.1802736
          5  |   .0818183   .0001822   448.95   0.000     .0814611    .0821755
          6  |   .0656238   .0001598   410.72   0.000     .0653106    .0659369
          7  |   .0269265   .0001813   148.54   0.000     .0265712    .0272818
          8  |  -.1872627   .0002379  -787.07   0.000     -.187729   -.1867963
          9  |   .1764745   .0002331   757.15   0.000     .1760176    .1769313
         10  |   .0708254   .0002091   338.78   0.000     .0704157    .0712352
         11  |   .0391337   .0002196   178.19   0.000     .0387032    .0395641
         12  |  -.1286461   .0002525  -509.53   0.000    -.1291409   -.1281512
         13  |   .3415328   .0002924  1168.19   0.000     .3409598    .3421058
         14  |   .0787368   .0002543   309.59   0.000     .0782383    .0792353
         15  |   .0615581   .0002558   240.64   0.000     .0610567    .0620595
         16  |  -.0276126   .0002732  -101.08   0.000     -.028148   -.0270772
             |
        marr |  -.2993991   .0000378 -7927.75   0.000    -.2994731   -.2993251
       partt |   .1137764   .0000622  1829.39   0.000     .1136545    .1138983
      public |   .2847175    .000068  4185.97   0.000     .2845842    .2848508
        cmsa |   .4558174   .0000503  9064.35   0.000     .4557189     .455916
             |
       state |
         NH  |   .0571436    .000989    57.78   0.000     .0552052    .0590819
         VT  |   .0261697   .0012536    20.88   0.000     .0237127    .0286267
         MA  |   .6171322   .0007953   775.96   0.000     .6155734     .618691
         RI  |   .5132303   .0008472   605.82   0.000     .5115699    .5148907
         CT  |   .9318761    .000799  1166.31   0.000     .9303101    .9334421
         NY  |   1.163418    .000786  1480.23   0.000     1.161877    1.164958
         NJ  |   1.104441   .0007901  1397.85   0.000     1.102892    1.105989
         PA  |   .7891354   .0007881  1001.27   0.000     .7875907    .7906801
         OH  |   .8973984   .0007869  1140.47   0.000     .8958562    .8989407
         IN  |   .8011302   .0007922  1011.30   0.000     .7995776    .8026829
         IL  |   1.129908   .0007869  1435.87   0.000     1.128366    1.131451
         MI  |   .9566249   .0007879  1214.09   0.000     .9550806    .9581692
         WI  |   .5309146    .000797   666.10   0.000     .5293524    .5324768
         MN  |   .5058727   .0007976   634.27   0.000     .5043095    .5074359
         IA  |   .2519047   .0008473   297.31   0.000     .2502441    .2535654
         MO  |   .9763247   .0007909  1234.49   0.000     .9747746    .9778747
         ND  |   .3027237   .0012115   249.87   0.000     .3003492    .3050983
         SD  |   .1918575   .0011222   170.97   0.000      .189658    .1940569
         NE  |   .5833071   .0008309   701.98   0.000     .5816785    .5849358
         KS  |   .8013974   .0008036   997.30   0.000     .7998224    .8029724
         DE  |   1.750873   .0009573  1828.95   0.000     1.748997    1.752749
         MD  |   1.703229   .0007891  2158.34   0.000     1.701683    1.704776
         DC  |   2.304734   .0008162  2823.62   0.000     2.303134    2.306334
         VA  |   1.485722   .0007876  1886.46   0.000     1.484178    1.487266
         WV  |   .5239314   .0008724   600.60   0.000     .5222216    .5256412
         NC  |   1.598128    .000787  2030.60   0.000     1.596585     1.59967
         SC  |   1.776689   .0007911  2245.97   0.000     1.775138    1.778239
         GA  |   1.808722   .0007866  2299.30   0.000      1.80718    1.810263
         FL  |   1.352837   .0007864  1720.25   0.000     1.351295    1.354378
         KY  |   .8874586   .0007955  1115.65   0.000     .8858995    .8890177
         TN  |   1.285686   .0007894  1628.64   0.000     1.284139    1.287233
         AL  |    1.64662    .000791  2081.73   0.000      1.64507     1.64817
         MS  |   2.048776   .0007916  2588.28   0.000     2.047225    2.050328
         AR  |   1.330155   .0007975  1667.90   0.000     1.328592    1.331718
         LA  |   1.699965   .0007918  2147.04   0.000     1.698414    1.701517
         OK  |   .8506402   .0007999  1063.39   0.000     .8490723     .852208
         TX  |   1.325345   .0007856  1687.04   0.000     1.323806    1.326885
         MT  |  -.1317152   .0013141  -100.23   0.000    -.1342909   -.1291395
         ID  |  -.0340423   .0009945   -34.23   0.000    -.0359915   -.0320932
         WY  |   .1815505   .0012983   139.84   0.000     .1790059    .1840951
         CO  |   .6891526    .000801   860.35   0.000     .6875826    .6907225
         NM  |   .7199412   .0008716   825.97   0.000     .7182328    .7216496
         AZ  |   .6598938   .0007989   826.01   0.000      .658328    .6614596
         UT  |   .0090186   .0008548    10.55   0.000     .0073431    .0106941
         NV  |    .947172   .0008097  1169.75   0.000      .945585    .9487591
         WA  |   .5306329   .0007972   665.60   0.000     .5290704    .5321954
         OR  |   .2387245   .0008185   291.67   0.000     .2371204    .2403287
         CA  |   .9782333   .0007858  1244.95   0.000     .9766932    .9797734
         AK  |   .6252216   .0009344   669.13   0.000     .6233903     .627053
         HI  |   .9045197    .000934   968.39   0.000      .902689    .9063504
             |
        nind |
          2  |   -.173311   .0001409 -1230.32   0.000    -.1735871   -.1730349
          3  |   .2036371   .0001318  1544.47   0.000     .2033787    .2038955
          4  |    .132595    .000134   989.39   0.000     .1323323    .1328576
          5  |   .3210774   .0001362  2356.77   0.000     .3208104    .3213444
          6  |   .2368007   .0001511  1567.42   0.000     .2365046    .2370968
          7  |   .2154095   .0001377  1564.17   0.000     .2151396    .2156794
          8  |   .6486599   .0001476  4395.93   0.000     .6483707    .6489491
          9  |   .2956743   .0001548  1909.53   0.000     .2953708    .2959778
         10  |   .2154759   .0001602  1345.45   0.000      .215162    .2157898
         11  |   .0381725   .0001596   239.17   0.000     .0378597    .0384853
             |
       nocc3 |
          2  |   .2477698   .0000585  4233.56   0.000     .2476551    .2478845
          3  |   .4863495   .0000616  7893.76   0.000     .4862287    .4864702
          4  |   .3377761   .0000542  6233.49   0.000     .3376699    .3378823
             |
     quarter |
          2  |   .0005704   .0000466    12.24   0.000     .0004791    .0006617
          3  |   .0050402   .0000471   106.94   0.000     .0049478    .0051325
          4  |   .0060928   .0000468   130.27   0.000     .0060012    .0061845
             |
        year |
       1984  |   .0150375   .0001309   114.84   0.000     .0147809    .0152942
       1985  |   .0312709   .0001422   219.98   0.000     .0309923    .0315496
       1986  |   .0470323   .0001311   358.70   0.000     .0467754    .0472893
       1987  |    .059184   .0001315   449.94   0.000     .0589262    .0594419
       1988  |   .0575984   .0001317   437.33   0.000     .0573403    .0578566
       1989  |    .079438   .0001265   627.87   0.000       .07919     .079686
       1990  |   .0800335   .0001267   631.84   0.000     .0797853    .0802818
       1991  |    .075172   .0001274   590.24   0.000     .0749223    .0754216
       1992  |   .0578297   .0001275   453.74   0.000     .0575799    .0580795
       1993  |   .0661974   .0001273   520.03   0.000     .0659479    .0664469
       1996  |   .0354091   .0001368   258.90   0.000      .035141    .0356772
       1997  |   .0397367   .0001364   291.40   0.000     .0394695     .040004
       1998  |   .0643531   .0001355   475.08   0.000     .0640876    .0646186
       1999  |   .0647938   .0001371   472.57   0.000     .0645251    .0650626
       2000  |   .0868263   .0001386   626.57   0.000     .0865547    .0870979
       2001  |   .0591812   .0001414   418.63   0.000     .0589041    .0594582
       2002  |   .0699987   .0001413   495.51   0.000     .0697219    .0702756
       2003  |   .0510171   .0001433   356.09   0.000     .0507363    .0512979
       2004  |   .0507019   .0001428   355.00   0.000      .050422    .0509819
       2005  |   .0613766   .0001414   434.01   0.000     .0610994    .0616538
       2006  |   .0860796   .0001401   614.62   0.000     .0858051    .0863541
       2007  |   .1131376   .0001385   817.17   0.000     .1128663     .113409
       2008  |   .1115505   .0001389   803.32   0.000     .1112784    .1118227
       2009  |   .0816035   .0001418   575.37   0.000     .0813255    .0818815
       2010  |   .1031329   .0001424   724.28   0.000     .1028538     .103412
       2011  |   .0847725    .000143   592.72   0.000     .0844922    .0850528
       2012  |   .0982493   .0001421   691.59   0.000     .0979709    .0985278
       2013  |   .1501957    .000142  1057.71   0.000     .1499174    .1504741
       2014  |   .1566649   .0001421  1102.27   0.000     .1563864    .1569435
       2015  |   .1911544    .000141  1356.15   0.000     .1908781    .1914307
       2016  |   .2046576   .0001401  1460.97   0.000      .204383    .2049321
       2017  |   .2031609   .0001402  1449.38   0.000     .2028862    .2034356
       2018  |   .2171228   .0001394  1557.75   0.000     .2168496     .217396
       2019  |   .2079241     .00014  1484.98   0.000     .2076497    .2081986
             |
       _cons |  -3.482964   .0009129 -3815.08   0.000    -3.484754   -3.481175
------------------------------------------------------------------------------

.         predict pb1m
(option pr assumed; Pr(nhblack))
(376,289 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.noc
> c3 i.quarter i.year if nhblack == 1 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -7.209e+08  
Iteration 1:   log likelihood = -5.575e+08  
Iteration 2:   log likelihood = -5.528e+08  
Iteration 3:   log likelihood = -5.528e+08  
Iteration 4:   log likelihood = -5.528e+08  

Probit regression                               Number of obs     = 1331935146
                                                LR chi2(124)      =   3.36e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -5.528e+08                     Pseudo R2         =     0.2331

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0179294   .0001109   161.61   0.000     .0177119    .0181468
       exper |   .0445549   .0000879   506.80   0.000     .0443826    .0447273
      exper2 |  -.0017789   6.10e-06  -291.82   0.000    -.0017909    -.001767
      exper3 |   .0000365   1.97e-07   184.85   0.000     .0000361    .0000369
      exper4 |  -3.09e-07   2.10e-09  -146.79   0.000    -3.13e-07   -3.05e-07
        edex |   .0001942   3.42e-06    56.72   0.000     .0001875    .0002009
             |
       ee_cl |
          2  |   .1934028   .0004071   475.10   0.000      .192605    .1942007
          3  |   .2501066   .0004842   516.49   0.000     .2491575    .2510557
          4  |    .189509   .0007087   267.39   0.000     .1881199    .1908981
          5  |   .0063637    .000517    12.31   0.000     .0053504     .007377
          6  |   .2086706   .0004664   447.45   0.000     .2077565    .2095846
          7  |   .2825166   .0005208   542.50   0.000      .281496    .2835373
          8  |   .1172692   .0006756   173.59   0.000     .1159451    .1185932
          9  |   .0527275   .0006121    86.15   0.000     .0515279    .0539271
         10  |   .2440678   .0005712   427.29   0.000     .2429482    .2451873
         11  |   .2558173    .000603   424.21   0.000     .2546354    .2569992
         12  |   .1203335    .000697   172.65   0.000     .1189674    .1216996
         13  |   .2091272   .0007311   286.04   0.000     .2076943    .2105602
         14  |   .2708095   .0006686   405.02   0.000      .269499      .27212
         15  |   .3011874   .0006798   443.03   0.000      .299855    .3025199
         16  |   .0268469   .0007391    36.32   0.000     .0253983    .0282956
             |
        marr |   .0563808   .0000937   601.41   0.000     .0561971    .0565645
       partt |  -.3214387   .0001727 -1861.63   0.000    -.3217772   -.3211003
      public |   .8387902   .0001459  5748.37   0.000     .8385042    .8390762
        cmsa |   .2447992   .0001544  1585.09   0.000     .2444965    .2451019
             |
       state |
         NH  |  -.0140844    .004464    -3.16   0.002    -.0228336   -.0053351
         VT  |  -.2264868   .0061247   -36.98   0.000     -.238491   -.2144825
         MA  |   .0063338   .0036939     1.71   0.086    -.0009061    .0135737
         RI  |  -.0002983   .0038056    -0.08   0.938    -.0077572    .0071606
         CT  |   .1074208   .0036931    29.09   0.000     .1001825    .1146592
         NY  |   .5493176   .0036731   149.55   0.000     .5421183    .5565168
         NJ  |   .2462243   .0036785    66.94   0.000     .2390145    .2534341
         PA  |   .2604557   .0036778    70.82   0.000     .2532474     .267664
         OH  |   .1098833   .0036755    29.90   0.000     .1026794    .1170872
         IN  |   .0636451   .0036849    17.27   0.000     .0564227    .0708674
         IL  |   .3321846   .0036746    90.40   0.000     .3249825    .3393866
         MI  |   .4355277   .0036765   118.46   0.000     .4283219    .4427334
         WI  |    .078294   .0036976    21.17   0.000     .0710469    .0855412
         MN  |   .1439784   .0037012    38.90   0.000     .1367243    .1512325
         IA  |  -.0561736   .0038634   -14.54   0.000    -.0637458   -.0486015
         MO  |   .0938137   .0036815    25.48   0.000     .0865981    .1010293
         ND  |   .0369452    .005429     6.81   0.000     .0263045    .0475859
         SD  |  -.2960166   .0049341   -59.99   0.000    -.3056873   -.2863458
         NE  |  -.0345499   .0037782    -9.14   0.000    -.0419549   -.0271448
         KS  |  -.1787428     .00371   -48.18   0.000    -.1860142   -.1714714
         DE  |  -.1355339   .0038875   -34.86   0.000    -.1431532   -.1279146
         MD  |   .0007404   .0036753     0.20   0.840    -.0064631    .0079439
         DC  |  -.0556903   .0036888   -15.10   0.000    -.0629201   -.0484604
         VA  |  -.5111445   .0036758  -139.05   0.000     -.518349   -.5039399
         WV  |  -.0643948   .0038996   -16.51   0.000    -.0720379   -.0567518
         NC  |  -.8003656   .0036762  -217.72   0.000    -.8075708   -.7931604
         SC  |  -.9660668   .0036837  -262.25   0.000    -.9732868   -.9588468
         GA  |  -.6028955    .003674  -164.10   0.000    -.6100963   -.5956946
         FL  |  -.4943112   .0036749  -134.51   0.000    -.5015138   -.4871086
         KY  |  -.0515817   .0036911   -13.97   0.000    -.0588161   -.0443472
         TN  |  -.3740968   .0036789  -101.69   0.000    -.3813072   -.3668863
         AL  |  -.3302416   .0036782   -89.78   0.000    -.3374508   -.3230325
         MS  |  -.6575698   .0036795  -178.71   0.000    -.6647815   -.6503581
         AR  |  -.4793844   .0036949  -129.74   0.000    -.4866262   -.4721426
         LA  |  -.4922297   .0036799  -133.76   0.000    -.4994422   -.4850172
         OK  |  -.4057524   .0037059  -109.49   0.000    -.4130158    -.398489
         TX  |  -.5626585   .0036737  -153.16   0.000    -.5698588   -.5554581
         MT  |  -.1022386   .0063283   -16.16   0.000    -.1146418   -.0898354
         ID  |  -.6853379   .0050037  -136.97   0.000    -.6951449   -.6755309
         WY  |  -.4898292   .0067267   -72.82   0.000    -.5030133   -.4766451
         CO  |  -.1978473   .0037071   -53.37   0.000    -.2051131   -.1905815
         NM  |  -.5823506   .0039747  -146.52   0.000    -.5901408   -.5745604
         AZ  |  -.5761243   .0037176  -154.97   0.000    -.5834107   -.5688379
         UT  |  -.8503435   .0041745  -203.70   0.000    -.8585253   -.8421616
         NV  |   .2350494   .0037065    63.41   0.000     .2277847     .242314
         WA  |   .2354227   .0036961    63.69   0.000     .2281784     .242667
         OR  |   .2031918   .0037509    54.17   0.000     .1958401    .2105435
         CA  |   .1934504   .0036733    52.66   0.000     .1862507      .20065
         AK  |     .07338   .0039852    18.41   0.000     .0655693    .0811908
         HI  |   -.345348   .0039809   -86.75   0.000    -.3531504   -.3375456
             |
        nind |
          2  |   .3495837   .0004832   723.55   0.000     .3486368    .3505307
          3  |   .6787992   .0004616  1470.55   0.000     .6778945    .6797039
          4  |   .0262259   .0004726    55.49   0.000     .0252996    .0271522
          5  |   .7904957   .0004678  1689.69   0.000     .7895788    .7914126
          6  |  -.1994558   .0005274  -378.16   0.000    -.2004896   -.1984221
          7  |  -.1137203   .0004858  -234.08   0.000    -.1146724   -.1127681
          8  |   .2330007   .0004908   474.76   0.000     .2320388    .2339626
          9  |   .5581198   .0004995  1117.33   0.000     .5571408    .5590989
         10  |   .1051368   .0005247   200.37   0.000     .1041084    .1061653
         11  |   .3119602   .0005021   621.29   0.000      .310976    .3129443
             |
       nocc3 |
          2  |   .2071431   .0001701  1218.12   0.000     .2068098    .2074764
          3  |   .3601872   .0001602  2249.03   0.000     .3598733    .3605011
          4  |   .5035803   .0001532  3286.59   0.000       .50328    .5038806
             |
     quarter |
          2  |  -.0114982   .0001201   -95.77   0.000    -.0117335   -.0112628
          3  |  -.0381557   .0001217  -313.48   0.000    -.0383943   -.0379172
          4  |  -.0372485   .0001208  -308.32   0.000    -.0374853   -.0370118
             |
        year |
       1984  |  -.1030445   .0003178  -324.24   0.000    -.1036674   -.1024216
       1985  |  -.2037902    .000349  -583.92   0.000    -.2044742   -.2031061
       1986  |  -.1848374   .0003178  -581.53   0.000    -.1854604   -.1842145
       1987  |  -.2378154   .0003199  -743.43   0.000    -.2384424   -.2371885
       1988  |  -.2026314   .0003199  -633.42   0.000    -.2032584   -.2020044
       1989  |  -.2929355   .0003077  -952.03   0.000    -.2935386   -.2923324
       1990  |  -.3143271   .0003083 -1019.42   0.000    -.3149315   -.3137228
       1991  |  -.3182484   .0003101 -1026.18   0.000    -.3188563   -.3176406
       1992  |  -.3507326   .0003118 -1124.72   0.000    -.3513438   -.3501215
       1993  |  -.3791012   .0003117 -1216.35   0.000    -.3797121   -.3784904
       1996  |  -.3837036   .0003399 -1128.81   0.000    -.3843698   -.3830374
       1997  |  -.4320983   .0003403 -1269.66   0.000    -.4327654   -.4314313
       1998  |  -.4363755   .0003364 -1297.34   0.000    -.4370348   -.4357162
       1999  |  -.4516644   .0003426 -1318.20   0.000    -.4523359   -.4509928
       2000  |  -.4841435   .0003479 -1391.57   0.000    -.4848254   -.4834616
       2001  |  -.5201654   .0003602 -1444.24   0.000    -.5208713   -.5194595
       2002  |  -.5093591   .0003592 -1418.00   0.000    -.5100632   -.5086551
       2003  |  -.4864019   .0003638 -1336.85   0.000     -.487115   -.4856888
       2004  |  -.5791578   .0003714 -1559.37   0.000    -.5798858   -.5784299
       2005  |  -.6192968   .0003683 -1681.69   0.000    -.6200185    -.618575
       2006  |  -.6593217   .0003639 -1811.67   0.000     -.660035   -.6586084
       2007  |  -.6194989   .0003549 -1745.33   0.000    -.6201946   -.6188033
       2008  |  -.6228446   .0003584 -1737.91   0.000     -.623547   -.6221422
       2009  |  -.6082935   .0003661 -1661.58   0.000     -.609011   -.6075759
       2010  |  -.6118997   .0003679 -1663.25   0.000    -.6126207   -.6111786
       2011  |   -.658306    .000376 -1750.72   0.000     -.659043    -.657569
       2012  |  -.6290201    .000371 -1695.58   0.000    -.6297472    -.628293
       2013  |  -.6096187   .0003647 -1671.66   0.000    -.6103335    -.608904
       2014  |  -.6547246   .0003685 -1776.97   0.000    -.6554468   -.6540025
       2015  |  -.6692106   .0003644 -1836.55   0.000    -.6699248   -.6684964
       2016  |  -.6800389   .0003638 -1869.36   0.000    -.6807519   -.6793259
       2017  |  -.6066891   .0003583 -1693.41   0.000    -.6073913    -.605987
       2018  |  -.6948674   .0003598 -1931.30   0.000    -.6955726   -.6941623
       2019  |  -.7129157    .000364 -1958.78   0.000    -.7136291   -.7122024
             |
       _cons |  -2.106515   .0039188  -537.54   0.000    -2.114196   -2.098834
------------------------------------------------------------------------------

.         predict pu1b1m
(option pr assumed; Pr(covered))
(376,289 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.noc
> c3 i.quarter i.year if nhblack == 0 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.833e+09  
Iteration 1:   log likelihood = -3.699e+09  
Iteration 2:   log likelihood = -3.648e+09  
Iteration 3:   log likelihood = -3.648e+09  
Iteration 4:   log likelihood = -3.648e+09  
Iteration 5:   log likelihood = -3.648e+09  

Probit regression                               Number of obs     =  1.005e+10
                                                LR chi2(124)      =   2.37e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.648e+09                     Pseudo R2         =     0.2452

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0439464   .0000423  1038.89   0.000     .0438635    .0440293
       exper |   .0773322   .0000353  2188.19   0.000     .0772629    .0774014
      exper2 |  -.0028514   2.55e-06 -1120.15   0.000    -.0028564   -.0028464
      exper3 |     .00007   8.63e-08   810.82   0.000     .0000698    .0000702
      exper4 |  -7.28e-07   9.52e-10  -764.67   0.000    -7.29e-07   -7.26e-07
        edex |  -.0011047   1.44e-06  -766.68   0.000    -.0011075   -.0011018
             |
       ee_cl |
          2  |   .0911972   .0001626   560.99   0.000     .0908786    .0915158
          3  |   .1019476   .0001912   533.29   0.000      .101573    .1023223
          4  |  -.0440729   .0002754  -160.05   0.000    -.0446126   -.0435332
          5  |  -.1424088   .0002218  -642.13   0.000    -.1428435   -.1419741
          6  |   .1395644   .0001885   740.20   0.000     .1391949     .139934
          7  |   .1572346   .0002102   748.09   0.000     .1568226    .1576465
          8  |  -.1330845   .0002664  -499.57   0.000    -.1336067   -.1325624
          9  |  -.0054512   .0002616   -20.84   0.000     -.005964   -.0049385
         10  |   .1751738   .0002325   753.49   0.000     .1747181    .1756295
         11  |   .1272856   .0002429   524.02   0.000     .1268095    .1277616
         12  |  -.1535511   .0002761  -556.19   0.000    -.1540922     -.15301
         13  |   .1957469   .0003143   622.74   0.000     .1951308     .196363
         14  |   .2064171   .0002716   759.96   0.000     .2058848    .2069495
         15  |   .1049464   .0002718   386.18   0.000     .1044138     .105479
         16  |   -.150989   .0002891  -522.25   0.000    -.1515556   -.1504223
             |
        marr |   .0601346   .0000397  1515.39   0.000     .0600568    .0602123
       partt |  -.2958509    .000077 -3842.13   0.000    -.2960018      -.2957
      public |   .9097296   .0000643  1.4e+04   0.000     .9096036    .9098556
        cmsa |    .173619   .0000437  3977.24   0.000     .1735335    .1737046
             |
       state |
         NH  |  -.2687451   .0003768  -713.30   0.000    -.2694836   -.2680067
         VT  |  -.2446832   .0004216  -580.37   0.000    -.2455095   -.2438568
         MA  |   .0105005   .0002759    38.05   0.000     .0099596    .0110413
         RI  |   .0417575   .0003463   120.60   0.000     .0410788    .0424361
         CT  |   .0184661   .0002927    63.08   0.000     .0178924    .0190399
         NY  |   .3484768   .0002629  1325.63   0.000     .3479616     .348992
         NJ  |   .1759601   .0002749   640.14   0.000     .1754213    .1764988
         PA  |    .087795   .0002644   332.01   0.000     .0872768    .0883133
         OH  |   .0534644   .0002632   203.16   0.000     .0529486    .0539802
         IN  |   -.041135   .0002711  -151.75   0.000    -.0416663   -.0406038
         IL  |   .1435686   .0002652   541.28   0.000     .1430487    .1440885
         MI  |   .1919008   .0002656   722.48   0.000     .1913802    .1924214
         WI  |  -.0030222   .0002718   -11.12   0.000     -.003555   -.0024895
         MN  |   .1055636   .0002726   387.30   0.000     .1050294    .1060978
         IA  |  -.1188556   .0002959  -401.61   0.000    -.1194356   -.1182755
         MO  |  -.0394466   .0002735  -144.24   0.000    -.0399826   -.0389106
         ND  |  -.3990383   .0005139  -776.45   0.000    -.4000456   -.3980311
         SD  |  -.5666607   .0004708 -1203.65   0.000    -.5675834    -.565738
         NE  |  -.3090798   .0003249  -951.42   0.000    -.3097165    -.308443
         KS  |  -.3257903   .0002965 -1098.65   0.000    -.3263715   -.3252091
         DE  |  -.2461105   .0007286  -337.77   0.000    -.2475386   -.2446824
         MD  |  -.2332996   .0002892  -806.57   0.000    -.2338665   -.2327327
         DC  |  -.2511292   .0005415  -463.81   0.000    -.2521904   -.2500679
         VA  |  -.6417492   .0002818 -2277.33   0.000    -.6423015   -.6411969
         WV  |   .0031192   .0003279     9.51   0.000     .0024765    .0037619
         NC  |    -.93162   .0002915 -3195.93   0.000    -.9321914   -.9310487
         SC  |  -.9363533   .0003363 -2784.62   0.000    -.9370124   -.9356943
         GA  |  -.5952351   .0002847 -2090.41   0.000    -.5957932    -.594677
         FL  |  -.4866304   .0002732 -1781.49   0.000    -.4871658    -.486095
         KY  |  -.1976531    .000281  -703.36   0.000    -.1982039   -.1971023
         TN  |  -.4755111   .0002829 -1681.03   0.000    -.4760655   -.4749567
         AL  |  -.3222305   .0002965 -1086.90   0.000    -.3228115   -.3216494
         MS  |  -.6327316   .0003278 -1930.10   0.000    -.6333741   -.6320891
         AR  |  -.6443482    .000321 -2007.09   0.000    -.6449774    -.643719
         LA  |  -.5512767   .0003124 -1764.53   0.000    -.5518891   -.5506644
         OK  |  -.5184754   .0002988 -1735.32   0.000     -.519061   -.5178898
         TX  |  -.5975061   .0002683 -2227.32   0.000    -.5980319   -.5969803
         MT  |  -.0057141   .0003814   -14.98   0.000    -.0064616   -.0049666
         ID  |  -.4398767   .0003587 -1226.31   0.000    -.4405797   -.4391737
         WY  |   -.390719   .0004935  -791.79   0.000    -.3916861   -.3897518
         CO  |  -.2902457   .0002926  -991.90   0.000    -.2908192   -.2896722
         NM  |  -.5299454   .0004098 -1293.03   0.000    -.5307487   -.5291421
         AZ  |  -.5468736   .0002966 -1844.07   0.000    -.5474548   -.5462924
         UT  |  -.5214744   .0003199 -1630.31   0.000    -.5221013   -.5208475
         NV  |   .0652082   .0003214   202.90   0.000     .0645783    .0658381
         WA  |   .2395356   .0002731   877.25   0.000     .2390005    .2400708
         OR  |    .065484   .0002847   230.04   0.000     .0649261    .0660419
         CA  |   .1329008   .0002619   507.52   0.000     .1323876    .1334141
         AK  |   .1553666   .0004016   386.88   0.000     .1545795    .1561537
         HI  |   .1850358    .000478   387.09   0.000     .1840989    .1859727
             |
        nind |
          2  |   .4826723   .0001317  3665.56   0.000     .4824143    .4829304
          3  |   .4733119    .000127  3726.27   0.000      .473063    .4735609
          4  |   .0175347   .0001329   131.97   0.000     .0172743    .0177951
          5  |   .8530103   .0001309  6518.36   0.000     .8527538    .8532668
          6  |  -.2544095   .0001699 -1497.33   0.000    -.2547425   -.2540765
          7  |  -.1404484   .0001421  -988.37   0.000    -.1407269   -.1401699
          8  |   .2848286   .0001547  1841.75   0.000     .2845255    .2851317
          9  |   .9711287   .0001459  6656.68   0.000     .9708427    .9714146
         10  |    .181174   .0001692  1070.60   0.000     .1808423    .1815057
         11  |   .5266719   .0001506  3497.58   0.000     .5263767     .526967
             |
       nocc3 |
          2  |   .2736698   .0000646  4239.19   0.000     .2735433    .2737963
          3  |   .5296579   .0000697  7598.63   0.000     .5295213    .5297946
          4  |   .8018895   .0000535  1.5e+04   0.000     .8017846    .8019944
             |
     quarter |
          2  |  -.0161752   .0000466  -347.30   0.000    -.0162665   -.0160839
          3  |  -.0147671   .0000472  -312.53   0.000    -.0148597   -.0146745
          4  |  -.0195624   .0000467  -418.65   0.000     -.019654   -.0194708
             |
        year |
       1984  |  -.0732755   .0001149  -637.61   0.000    -.0735007   -.0730503
       1985  |  -.1251499   .0001262  -991.98   0.000    -.1253972   -.1249027
       1986  |  -.1441089   .0001167 -1235.13   0.000    -.1443376   -.1438802
       1987  |  -.1671269    .000118 -1416.93   0.000    -.1673581   -.1668957
       1988  |  -.1801865   .0001183 -1523.49   0.000    -.1804183   -.1799547
       1989  |  -.2251206   .0001147 -1963.17   0.000    -.2253454   -.2248959
       1990  |  -.2457958   .0001153 -2131.77   0.000    -.2460218   -.2455698
       1991  |  -.2608803   .0001163 -2242.43   0.000    -.2611083   -.2606522
       1992  |  -.2740861   .0001165 -2353.21   0.000    -.2743144   -.2738578
       1993  |  -.2759201   .0001166 -2365.61   0.000    -.2761487   -.2756915
       1996  |  -.3373197   .0001261 -2674.77   0.000    -.3375669   -.3370725
       1997  |  -.3396957    .000126 -2695.03   0.000    -.3399427   -.3394486
       1998  |  -.3678235   .0001271 -2894.30   0.000    -.3680726   -.3675744
       1999  |  -.3556083   .0001278 -2781.45   0.000    -.3558589   -.3553578
       2000  |  -.3817774   .0001311 -2912.61   0.000    -.3820343   -.3815205
       2001  |  -.3973265   .0001326 -2995.73   0.000    -.3975864   -.3970665
       2002  |  -.3992233   .0001334 -2991.79   0.000    -.3994849   -.3989618
       2003  |  -.4139674    .000135 -3066.75   0.000     -.414232   -.4137028
       2004  |  -.4302491   .0001356 -3172.10   0.000    -.4305149   -.4299832
       2005  |  -.4666606    .000136 -3430.69   0.000    -.4669272    -.466394
       2006  |  -.4733627   .0001362 -3476.67   0.000    -.4736296   -.4730959
       2007  |  -.4738776   .0001353 -3501.29   0.000    -.4741429   -.4736124
       2008  |  -.4246903   .0001351 -3143.17   0.000    -.4249551   -.4244255
       2009  |  -.4373061   .0001376 -3179.06   0.000    -.4375757   -.4370365
       2010  |  -.4581834   .0001403 -3265.76   0.000    -.4584584   -.4579084
       2011  |  -.4878097   .0001417 -3442.44   0.000    -.4880874   -.4875319
       2012  |   -.478536   .0001413 -3386.75   0.000    -.4788129    -.478259
       2013  |   -.483626   .0001433 -3375.11   0.000    -.4839069   -.4833452
       2014  |  -.4873483   .0001434 -3399.23   0.000    -.4876293   -.4870673
       2015  |  -.4960333   .0001446 -3429.28   0.000    -.4963168   -.4957498
       2016  |  -.4970647   .0001434 -3465.93   0.000    -.4973458   -.4967836
       2017  |  -.4706883   .0001425 -3302.52   0.000    -.4709676    -.470409
       2018  |  -.4639479   .0001422 -3262.96   0.000    -.4642266   -.4636692
       2019  |  -.4913016   .0001443 -3404.71   0.000    -.4915844   -.4910188
             |
       _cons |  -2.768045    .000567 -4882.07   0.000    -2.769156   -2.766934
------------------------------------------------------------------------------

.         predict pu1b0m
(option pr assumed; Pr(covered))
(376,289 missing values generated)

. 
. gen theta2m = (pb1m/(1-pb1m)) * (pu1b1m/pu1b0m) if nhblack == 0 & covered == 1
(1,520,425 missing values generated)

. 
. replace theta2m = theta2m * hweight if nhblack == 0 & covered == 1
(239,410 real changes made)

. 
. kdensity lwage3 [aweight = theta2m] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(cu_wmestpt cu_wmde) nograph

. 
. graph twoway (connected u_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue
> ) lp(solid))  /// 
>                          (connected u_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick
> ) lc(magenta) lp(solid))  ///
>                          (connected cu_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthic
> k) lc(eltblue) lp(longdash)),  /// 
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) //
> /
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "non-Hisp white - c.f.") 
> c(1) pos(2) ring(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1men/cu_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/cu_bhw_men.png written in PNG format)

.         
. gen theta3m = (pb1m/(1-pb1m)) * ((1-pu1b1m)/(1-pu1b1m)) if nhblack == 0 & covered == 0
(746,636 missing values generated)

. 
. replace theta3m = theta3m * hweight if nhblack == 0 & covered == 0
(1,013,199 real changes made)

. 
. kdensity lwage3 [aweight = theta3m] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(cn_wmestpt cn_wmde) nograph

. 
. graph twoway (connected n_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue
> ) lp(solid))  /// 
>                          (connected n_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick
> ) lc(magenta) lp(solid))  ///
>                          (connected cn_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthic
> k) lc(eltblue) lp(longdash)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) //
> /
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "non-Hisp white - c.f.") 
> c(1) pos(2) ring(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men not Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1men/cn_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/cn_bhw_men.png written in PNG format)

.         
. restore

. ********************************************************************************
. 
. ********************************************************************************
. ** women
. preserve

. keep if sex == 2
(2,097,726 observations deleted)

. 
. qui sum lwage3, detail

. 
. gen xstep = (r(max) - r(min)) / 200

. 
. gen kwage = r(min) + (_n-1)*xstep if _n <= 200
(2,033,046 missing values generated)

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(wfestpt wfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2, at(kwage) gauss width(0.065) ///
>         generate(bfestpt bfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 3, at(kwage) gauss width(0.065) ///
>         generate(hfestpt hfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_wfestpt u_wfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(n_wfestpt n_wfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_bfestpt u_bfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(nbfestpt n_bfde) nograph

.         
. ** lab wmestpt "non hisp white men estimation points"
. ** lab wmde "non hisp white men density estimate"
. 
. graph twoway (connected wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) 
> lp(solid))  /// 
>                          (connected bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) 
> lc(magenta) lp(solid))  ///
>                          (connected hfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) 
> lc(midgreen) lp(solid)), ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) //
> /
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "Hispanic") c(1) pos(2) r
> ing(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women", size(vlarge))

. graph export "$figs/kde1wom/bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/bhw_wom.png written in PNG format)

. 
. graph twoway (connected u_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue
> ) lp(solid))  /// 
>                          (connected u_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick
> ) lc(magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) //
> /
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsi
> ze(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women Covered by Union", size(vlarge))

. graph export "$figs/kde1wom/u_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/u_bhw_wom.png written in PNG format)

. 
. graph twoway (connected n_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue
> ) lp(solid))  /// 
>                          (connected n_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick
> ) lc(magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) //
> /
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsi
> ze(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women not Covered by Union", size(vlarge))

. graph export "$figs/kde1wom/n_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/n_bhw_wom.png written in PNG format)

. 
. ** probability of race that depends on other covariates
. 
. local nhr w b

. 
. clonevar nhrace = hisprace
(123,752 missing values generated)

. 
. replace nhrace =. if nhrace == 3
(163,809 real changes made, 163,809 to missing)

. 
. keep if inrange(nhrace, 1, 2)
(287,561 observations deleted)

. 
. gen nhblack = nhrace - 1

. 
. gen finalwt1 = round(eweight)

. 
. drop nind

. 
. rename nind2 nind

. 
. drop nocc2

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(1486200 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(1635048 differences between nocc2 and nocc3)

. 
. drop edex

. 
. gen edex = educ*exper

. 
. probit nhblack educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.noc
> c3 i.quarter i.year [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.508e+09  
Iteration 1:   log likelihood = -3.754e+09  
Iteration 2:   log likelihood = -3.720e+09  
Iteration 3:   log likelihood = -3.719e+09  
Iteration 4:   log likelihood = -3.719e+09  
Iteration 5:   log likelihood = -3.719e+09  
Iteration 6:   log likelihood = -3.719e+09  
Iteration 7:   log likelihood = -3.719e+09  

Probit regression                               Number of obs     =  1.095e+10
                                                LR chi2(124)      =   1.58e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.719e+09                     Pseudo R2         =     0.1752

------------------------------------------------------------------------------
     nhblack |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0066151   .0000393  -168.12   0.000    -.0066922   -.0065379
       exper |   .1077033   .0000313  3437.54   0.000     .1076419    .1077648
      exper2 |  -.0056501   2.34e-06 -2418.26   0.000    -.0056547   -.0056456
      exper3 |   .0001214   8.21e-08  1478.20   0.000     .0001212    .0001216
      exper4 |  -9.48e-07   9.20e-10 -1030.38   0.000    -9.50e-07   -9.46e-07
        edex |  -.0008798   1.41e-06  -625.31   0.000    -.0008826   -.0008771
             |
       ee_cl |
          2  |   .0364139    .000137   265.74   0.000     .0361453    .0366825
          3  |  -.0034228   .0001614   -21.20   0.000    -.0037392   -.0031064
          4  |  -.3046443   .0002471 -1232.97   0.000    -.3051285     -.30416
          5  |   .0574087    .000205   280.00   0.000     .0570068    .0578105
          6  |  -.0404688   .0001696  -238.56   0.000    -.0408013   -.0401363
          7  |  -.0284547   .0001872  -152.00   0.000    -.0288216   -.0280878
          8  |  -.2522265   .0002416 -1043.93   0.000       -.2527   -.2517529
          9  |   .1713123   .0002499   685.57   0.000     .1708226    .1718021
         10  |  -.0668382   .0002172  -307.69   0.000     -.067264   -.0664125
         11  |  -.0545189   .0002244  -242.97   0.000    -.0549586   -.0540791
         12  |  -.1820786   .0002555  -712.68   0.000    -.1825794   -.1815779
         13  |   .2516963   .0003065   821.16   0.000     .2510956    .2522971
         14  |  -.0964639    .000261  -369.55   0.000    -.0969755   -.0959523
         15  |  -.0499403   .0002584  -193.25   0.000    -.0504468   -.0494338
         16  |  -.0980042   .0002756  -355.61   0.000    -.0985444    -.097464
             |
        marr |  -.5138134   .0000351 -1.5e+04   0.000    -.5138822   -.5137445
       partt |  -.1579779   .0000444 -3557.50   0.000     -.158065   -.1578909
      public |   .3263974   .0000624  5229.35   0.000     .3262751    .3265198
        cmsa |    .529616   .0000502  1.1e+04   0.000     .5295176    .5297144
             |
       state |
         NH  |   .0824964   .0011978    68.87   0.000     .0801488    .0848441
         VT  |  -.0045396   .0016094    -2.82   0.005     -.007694   -.0013852
         MA  |   .8531414     .00097   879.49   0.000     .8512402    .8550427
         RI  |   .6888657   .0010111   681.28   0.000     .6868839    .6908475
         CT  |    1.16146   .0009733  1193.30   0.000     1.159552    1.163367
         NY  |   1.476316   .0009632  1532.65   0.000     1.474428    1.478204
         NJ  |   1.379578   .0009666  1427.29   0.000     1.377683    1.381472
         PA  |   1.093489   .0009648  1133.34   0.000     1.091598     1.09538
         OH  |   1.183303    .000964  1227.55   0.000     1.181414    1.185192
         IN  |   1.093022   .0009681  1129.09   0.000     1.091125     1.09492
         IL  |   1.458845   .0009639  1513.43   0.000     1.456956    1.460735
         MI  |   1.253909   .0009649  1299.58   0.000     1.252018      1.2558
         WI  |    .803266   .0009716   826.73   0.000     .8013616    .8051703
         MN  |   .6357084   .0009739   652.76   0.000     .6337996    .6376171
         IA  |   .3789174     .00102   371.49   0.000     .3769182    .3809165
         MO  |   1.282438   .0009668  1326.43   0.000     1.280543    1.284333
         ND  |   .3168629   .0014704   215.50   0.000      .313981    .3197448
         SD  |   .0659633   .0014741    44.75   0.000     .0630741    .0688525
         NE  |   .8125405   .0009974   814.63   0.000     .8105856    .8144955
         KS  |   .9794516    .000979  1000.50   0.000     .9775328    .9813703
         DE  |   2.073119   .0011012  1882.54   0.000      2.07096    2.075277
         MD  |   1.994102   .0009657  2065.01   0.000     1.992209    1.995995
         DC  |   2.512855   .0009861  2548.33   0.000     2.510922    2.514788
         VA  |   1.742633   .0009646  1806.53   0.000     1.740742    1.744524
         WV  |    .799739    .001039   769.71   0.000     .7977026    .8017754
         NC  |   1.895157   .0009642  1965.62   0.000     1.893267    1.897047
         SC  |    2.10247   .0009672  2173.76   0.000     2.100574    2.104366
         GA  |   2.115772   .0009638  2195.16   0.000     2.113883    2.117661
         FL  |    1.61963   .0009636  1680.78   0.000     1.617741    1.621519
         KY  |   1.112209   .0009712  1145.24   0.000     1.110305    1.114112
         TN  |   1.580747    .000966  1636.42   0.000     1.578854    1.582641
         AL  |   2.015724   .0009673  2083.90   0.000     2.013828    2.017619
         MS  |   2.431642   .0009677  2512.72   0.000     2.429745    2.433538
         AR  |   1.623107   .0009722  1669.52   0.000     1.621202    1.625013
         LA  |   2.068295   .0009678  2137.21   0.000     2.066398    2.070192
         OK  |   1.114143   .0009745  1143.33   0.000     1.112233    1.116053
         TX  |   1.592607   .0009631  1653.67   0.000     1.590719    1.594494
         MT  |  -.3262781   .0019778  -164.97   0.000    -.3301546   -.3224016
         ID  |  -.1400999   .0012754  -109.85   0.000    -.1425995   -.1376002
         WY  |   .0035329   .0018902     1.87   0.062    -.0001717    .0072376
         CO  |   .8071049   .0009774   825.80   0.000     .8051893    .8090205
         NM  |   .8762097   .0010445   838.86   0.000     .8741624    .8782569
         AZ  |   .7666559   .0009757   785.77   0.000     .7647436    .7685682
         UT  |   -.000731   .0010504    -0.70   0.486    -.0027898    .0013278
         NV  |   1.151451   .0009849  1169.12   0.000     1.149521    1.153382
         WA  |   .6122485    .000975   627.94   0.000     .6103376    .6141595
         OR  |   .2919315   .0009977   292.60   0.000      .289976     .293887
         CA  |    1.18104   .0009633  1226.09   0.000     1.179152    1.182928
         AK  |   .8064143   .0010999   733.15   0.000     .8042585    .8085701
         HI  |   1.037268   .0011078   936.30   0.000     1.035096    1.039439
             |
        nind |
          2  |  -.1122047   .0003223  -348.17   0.000    -.1128363    -.111573
          3  |   .3894678   .0002602  1496.57   0.000     .3889577    .3899778
          4  |    .333073   .0002589  1286.27   0.000     .3325655    .3335805
          5  |   .6162611   .0002649  2326.60   0.000     .6157419    .6167802
          6  |   .4813572   .0002627  1832.47   0.000     .4808423     .481872
          7  |   .4131465   .0002617  1578.71   0.000     .4126336    .4136595
          8  |   .7190329    .000259  2775.97   0.000     .7185253    .7195406
          9  |   .4242182   .0002647  1602.41   0.000     .4236993     .424737
         10  |   .4025061   .0002679  1502.40   0.000      .401981    .4030312
         11  |   .5338133   .0002713  1967.71   0.000     .5332816     .534345
             |
       nocc3 |
          2  |   .1761895   .0000467  3771.31   0.000      .176098    .1762811
          3  |   .4643515   .0000548  8471.97   0.000      .464244    .4644589
          4  |   .5330856   .0000753  7081.42   0.000     .5329381    .5332331
             |
     quarter |
          2  |   .0062896   .0000458   137.39   0.000     .0061999    .0063794
          3  |   .0043482   .0000464    93.75   0.000     .0042573    .0044391
          4  |   .0051288   .0000459   111.72   0.000     .0050388    .0052188
             |
        year |
       1984  |   .0325855   .0001352   241.09   0.000     .0323206    .0328504
       1985  |   .0352897    .000146   241.74   0.000     .0350036    .0355758
       1986  |   .0369707   .0001353   273.23   0.000     .0367055    .0372359
       1987  |   .0458916   .0001355   338.77   0.000      .045626    .0461571
       1988  |   .0515777   .0001354   381.06   0.000     .0513124     .051843
       1989  |   .0465909   .0001305   357.11   0.000     .0463352    .0468466
       1990  |   .0573777   .0001304   439.95   0.000     .0571221    .0576333
       1991  |    .058112   .0001308   444.13   0.000     .0578556    .0583685
       1992  |   .0475178   .0001302   365.09   0.000     .0472627    .0477729
       1993  |    .056304   .0001298   433.81   0.000     .0560496    .0565584
       1996  |   .0464246   .0001371   338.64   0.000     .0461559    .0466933
       1997  |   .0660592   .0001363   484.78   0.000     .0657921    .0663263
       1998  |   .0889593   .0001358   655.18   0.000     .0886932    .0892254
       1999  |   .1198035   .0001362   879.42   0.000     .1195365    .1200705
       2000  |   .1075489   .0001378   780.48   0.000     .1072788     .107819
       2001  |   .1142271   .0001393   820.20   0.000     .1139541    .1145001
       2002  |    .107432   .0001401   766.85   0.000     .1071574    .1077066
       2003  |   .0912029   .0001411   646.47   0.000     .0909264    .0914795
       2004  |    .091894   .0001412   650.82   0.000     .0916172    .0921707
       2005  |   .0738713   .0001406   525.42   0.000     .0735957    .0741468
       2006  |   .1124928   .0001393   807.36   0.000     .1122197    .1127659
       2007  |   .1400272   .0001384  1012.04   0.000      .139756    .1402983
       2008  |   .1268757   .0001385   916.23   0.000     .1266043    .1271471
       2009  |   .1319708   .0001394   946.85   0.000     .1316976    .1322439
       2010  |   .1396493   .0001412   989.25   0.000     .1393726     .139926
       2011  |   .1350513   .0001421   950.67   0.000     .1347728    .1353297
       2012  |   .1932416   .0001405  1375.64   0.000     .1929663     .193517
       2013  |    .192632   .0001418  1358.79   0.000     .1923541    .1929099
       2014  |   .2097207   .0001418  1479.02   0.000     .2094428    .2099986
       2015  |    .232274   .0001415  1641.55   0.000     .2319967    .2325513
       2016  |   .2309398   .0001403  1645.60   0.000     .2306648    .2312149
       2017  |   .2169154   .0001407  1541.29   0.000     .2166395    .2171912
       2018  |   .2380252   .0001404  1695.39   0.000     .2377501    .2383004
       2019  |   .2545222   .0001407  1808.54   0.000     .2542464    .2547981
             |
       _cons |  -3.678257   .0010922 -3367.82   0.000    -3.680397   -3.676116
------------------------------------------------------------------------------

.         predict pb1f
(option pr assumed; Pr(nhblack))
(376,543 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.noc
> c3 i.quarter i.year if nhblack == 1 [w = finalwt1]
(frequency weights assumed)

note: 11.state != 0 predicts failure perfectly
      11.state dropped and 40 obs not used

note: 81.state != 0 predicts failure perfectly
      81.state dropped and 15 obs not used

note: 82.state != 0 predicts failure perfectly
      82.state dropped and 52 obs not used

note: 95.state omitted because of collinearity
Iteration 0:   log likelihood = -7.630e+08  
Iteration 1:   log likelihood = -5.762e+08  
Iteration 2:   log likelihood = -5.689e+08  
Iteration 3:   log likelihood = -5.688e+08  
Iteration 4:   log likelihood = -5.688e+08  

Probit regression                               Number of obs     = 1569937643
                                                LR chi2(121)      =   3.88e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -5.688e+08                     Pseudo R2         =     0.2545

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0547188   .0001054   518.94   0.000     .0545121    .0549255
       exper |   .0814857     .00009   905.02   0.000     .0813093    .0816622
      exper2 |  -.0038442   6.43e-06  -597.97   0.000    -.0038568   -.0038316
      exper3 |   .0000963   2.15e-07   447.09   0.000     .0000959    .0000967
      exper4 |  -8.78e-07   2.35e-09  -373.06   0.000    -8.82e-07   -8.73e-07
        edex |  -.0006443   3.53e-06  -182.49   0.000    -.0006512   -.0006374
             |
       ee_cl |
          2  |     .02734   .0004669    58.55   0.000     .0264248    .0282551
          3  |  -.0252189   .0005197   -48.53   0.000    -.0262375   -.0242004
          4  |  -.0672995   .0007124   -94.47   0.000    -.0686957   -.0659033
          5  |  -.0312853   .0005835   -53.62   0.000    -.0324289   -.0301418
          6  |  -.0080191    .000519   -15.45   0.000    -.0090362    -.007002
          7  |  -.0672862   .0005598  -120.19   0.000    -.0683835   -.0661889
          8  |  -.1037845   .0006936  -149.62   0.000     -.105144    -.102425
          9  |  -.0281337    .000665   -42.31   0.000     -.029437   -.0268304
         10  |   .0139792    .000614    22.77   0.000     .0127758    .0151827
         11  |  -.0289493   .0006352   -45.57   0.000    -.0301943   -.0277042
         12  |  -.0522545   .0007144   -73.14   0.000    -.0536547   -.0508543
         13  |   .0132193   .0007829    16.89   0.000      .011685    .0147537
         14  |  -.0158336   .0007056   -22.44   0.000    -.0172166   -.0144507
         15  |  -.0530963    .000706   -75.21   0.000      -.05448   -.0517126
         16  |  -.0429353   .0007514   -57.14   0.000     -.044408   -.0414626
             |
        marr |   .0155896   .0000898   173.66   0.000     .0154136    .0157655
       partt |  -.3543449   .0001352 -2621.05   0.000    -.3546098   -.3540799
      public |   .8605982   .0001287  6688.08   0.000      .860346    .8608504
        cmsa |   .2367626   .0001653  1431.89   0.000     .2364385    .2370866
             |
       state |
         ME  |          0  (empty)
         NH  |   .1569244   .0041944    37.41   0.000     .1487035    .1651454
         VT  |    .156407   .0071647    21.83   0.000     .1423645    .1704495
         MA  |   .4709874     .00201   234.32   0.000     .4670479     .474927
         RI  |    .499485   .0021947   227.59   0.000     .4951835    .5037864
         CT  |    .521421   .0020124   259.11   0.000     .5174769    .5253651
         NY  |     1.0388    .001976   525.70   0.000     1.034927    1.042673
         NJ  |   .6892686   .0019852   347.20   0.000     .6853776    .6931596
         PA  |   .5854441   .0019844   295.02   0.000     .5815548    .5893335
         OH  |   .4272104    .001981   215.65   0.000     .4233277    .4310932
         IN  |   .1388652   .0020012    69.39   0.000     .1349428    .1427875
         IL  |   .6318293   .0019787   319.32   0.000     .6279511    .6357074
         MI  |   .7728181   .0019819   389.94   0.000     .7689336    .7767025
         WI  |   .4146788   .0020215   205.14   0.000     .4107168    .4186408
         MN  |   .5652421   .0020394   277.16   0.000      .561245    .5692392
         IA  |   .0717691    .002527    28.40   0.000     .0668164    .0767219
         MO  |   .3145944   .0019917   157.95   0.000     .3106907    .3184981
         ND  |   .2052426   .0065527    31.32   0.000     .1923995    .2180857
         SD  |   .2473647   .0058095    42.58   0.000     .2359783    .2587512
         NE  |   .3635745   .0021519   168.96   0.000     .3593569    .3677921
         KS  |   .0007227   .0020715     0.35   0.727    -.0033373    .0047827
         DE  |   .4760426   .0023018   206.81   0.000     .4715311    .4805541
         MD  |   .3092038   .0019798   156.18   0.000     .3053234    .3130841
         DC  |   .2755343   .0020007   137.72   0.000      .271613    .2794555
         VA  |  -.1958948   .0019835   -98.76   0.000    -.1997824   -.1920071
         WV  |   .2878418   .0024808   116.03   0.000     .2829795    .2927041
         NC  |  -.5095252   .0019866  -256.49   0.000    -.5134188   -.5056317
         SC  |  -.5320549   .0019974  -266.37   0.000    -.5359698   -.5281401
         GA  |  -.3227255   .0019804  -162.96   0.000    -.3266071   -.3188438
         FL  |   -.034705   .0019795   -17.53   0.000    -.0385846   -.0308253
         KY  |   .3140231   .0020134   155.97   0.000     .3100769    .3179693
         TN  |   -.123311   .0019888   -62.00   0.000     -.127209    -.119413
         AL  |  -.0173383   .0019894    -8.72   0.000    -.0212375   -.0134391
         MS  |  -.3342755    .001993  -167.72   0.000    -.3381817   -.3303693
         AR  |  -.2381726   .0020223  -117.77   0.000    -.2421364   -.2342089
         LA  |  -.1106681   .0019886   -55.65   0.000    -.1145657   -.1067705
         OK  |  -.1134988   .0020446   -55.51   0.000    -.1175061   -.1094914
         TX  |  -.2993084   .0019795  -151.20   0.000    -.3031881   -.2954286
         MT  |          0  (empty)
         ID  |          0  (empty)
         WY  |  -.2721706   .0105287   -25.85   0.000    -.2928065   -.2515347
         CO  |   .1456137   .0020598    70.69   0.000     .1415766    .1496509
         NM  |   .0129966   .0025354     5.13   0.000     .0080272     .017966
         AZ  |  -.3143491   .0020934  -150.16   0.000    -.3184522   -.3102461
         UT  |  -.1744035   .0029791   -58.54   0.000    -.1802424   -.1685647
         NV  |   .7759449   .0020414   380.10   0.000     .7719438     .779946
         WA  |   .5990404   .0020348   294.40   0.000     .5950524    .6030285
         OR  |   .4579035   .0021932   208.79   0.000     .4536049     .462202
         CA  |   .6174368   .0019771   312.29   0.000     .6135617    .6213119
         AK  |   .4101221   .0026109   157.08   0.000     .4050049    .4152394
         HI  |          0  (omitted)
             |
        nind |
          2  |   .3203446   .0012452   257.26   0.000      .317904    .3227851
          3  |   .6713311   .0010879   617.09   0.000     .6691989    .6734634
          4  |   .3118259   .0010907   285.89   0.000     .3096881    .3139636
          5  |   1.114432   .0010913  1021.22   0.000     1.112294    1.116571
          6  |  -.0994541   .0011029   -90.17   0.000    -.1016158   -.0972924
          7  |  -.0177464   .0010993   -16.14   0.000     -.019901   -.0155917
          8  |    .411947   .0010879   378.66   0.000     .4098147    .4140792
          9  |   .8280016   .0010924   757.99   0.000     .8258606    .8301426
         10  |   .1290861   .0011075   116.56   0.000     .1269155    .1312567
         11  |   .3886963   .0010972   354.27   0.000     .3865459    .3908467
             |
       nocc3 |
          2  |   .0050786   .0001287    39.45   0.000     .0048263    .0053309
          3  |   .1295631     .00014   925.76   0.000     .1292888    .1298374
          4  |   .4785369   .0001889  2532.68   0.000     .4781666    .4789072
             |
     quarter |
          2  |  -.0235115   .0001175  -200.02   0.000    -.0237419   -.0232811
          3  |  -.0178029    .000119  -149.58   0.000    -.0180361   -.0175696
          4  |  -.0396452   .0001183  -334.99   0.000    -.0398771   -.0394132
             |
        year |
       1984  |   -.083917   .0003286  -255.40   0.000     -.084561    -.083273
       1985  |  -.0902237   .0003555  -253.77   0.000    -.0909206   -.0895269
       1986  |   -.158682   .0003305  -480.15   0.000    -.1593297   -.1580343
       1987  |   -.184266   .0003327  -553.88   0.000    -.1849181    -.183614
       1988  |  -.1454484   .0003301  -440.59   0.000    -.1460954   -.1448014
       1989  |  -.1993922   .0003173  -628.40   0.000    -.2000141   -.1987703
       1990  |  -.2745952     .00032  -858.07   0.000    -.2752225    -.273968
       1991  |  -.2640866   .0003207  -823.43   0.000    -.2647152    -.263458
       1992  |  -.2386504   .0003178  -750.87   0.000    -.2392733   -.2380274
       1993  |  -.2606614   .0003175  -820.91   0.000    -.2612837   -.2600391
       1996  |  -.2942635    .000339  -868.01   0.000     -.294928   -.2935991
       1997  |  -.3261111   .0003377  -965.62   0.000     -.326773   -.3254491
       1998  |  -.3475327   .0003385 -1026.78   0.000    -.3481961   -.3468694
       1999  |  -.3927963   .0003401 -1154.85   0.000     -.393463   -.3921297
       2000  |  -.3489919   .0003428 -1018.04   0.000    -.3496638     -.34832
       2001  |  -.3495233   .0003469 -1007.63   0.000    -.3502031   -.3488434
       2002  |  -.3685832     .00035 -1053.14   0.000    -.3692692   -.3678973
       2003  |  -.3980601    .000354 -1124.35   0.000     -.398754   -.3973662
       2004  |  -.4541761   .0003633 -1250.16   0.000    -.4548882   -.4534641
       2005  |  -.4367194    .000359 -1216.50   0.000     -.437423   -.4360158
       2006  |  -.4637826   .0003551 -1305.89   0.000    -.4644787   -.4630865
       2007  |  -.4771288   .0003516 -1356.85   0.000     -.477818   -.4764396
       2008  |  -.5243791    .000355 -1476.98   0.000     -.525075   -.5236832
       2009  |  -.4875108   .0003558 -1370.36   0.000    -.4882081   -.4868136
       2010  |  -.4918596     .00036 -1366.39   0.000    -.4925651    -.491154
       2011  |  -.4821781   .0003623 -1331.00   0.000    -.4828881    -.481468
       2012  |  -.4802369   .0003585 -1339.70   0.000    -.4809394   -.4795343
       2013  |  -.4815766   .0003613 -1332.84   0.000    -.4822848   -.4808685
       2014  |  -.5409284    .000365 -1482.07   0.000    -.5416438   -.5402131
       2015  |  -.5069327   .0003595 -1410.00   0.000    -.5076374    -.506228
       2016  |  -.4299816    .000351 -1224.88   0.000    -.4306697   -.4292936
       2017  |  -.5538396   .0003634 -1524.01   0.000    -.5545519   -.5531273
       2018  |  -.6286323   .0003627 -1733.13   0.000    -.6293432   -.6279214
       2019  |  -.5690211   .0003585 -1587.09   0.000    -.5697238   -.5683184
             |
       _cons |  -2.975616    .002587 -1150.21   0.000    -2.980687   -2.970546
------------------------------------------------------------------------------

.         predict pu1b1f
(option pr assumed; Pr(covered))
(422,781 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.noc
> c3 i.quarter i.year if nhblack == 0 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -3.788e+09  
Iteration 1:   log likelihood = -2.716e+09  
Iteration 2:   log likelihood = -2.659e+09  
Iteration 3:   log likelihood = -2.658e+09  
Iteration 4:   log likelihood = -2.658e+09  
Iteration 5:   log likelihood = -2.658e+09  

Probit regression                               Number of obs     = 9360241334
                                                LR chi2(124)      =   2.26e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -2.658e+09                     Pseudo R2         =     0.2982

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0782555   .0000447  1749.09   0.000     .0781678    .0783432
       exper |   .0884189     .00004  2212.41   0.000     .0883406    .0884973
      exper2 |  -.0042099   2.97e-06 -1415.85   0.000    -.0042157    -.004204
      exper3 |   .0001112   1.03e-07  1079.97   0.000      .000111    .0001114
      exper4 |  -1.07e-06   1.15e-09  -930.28   0.000    -1.07e-06   -1.06e-06
        edex |  -.0014244   1.66e-06  -860.06   0.000    -.0014277   -.0014212
             |
       ee_cl |
          2  |  -.0396084   .0002152  -184.08   0.000    -.0400301   -.0391867
          3  |  -.2465941   .0002365 -1042.48   0.000    -.2470577   -.2461304
          4  |  -.3079381   .0003136  -981.81   0.000    -.3085528   -.3073233
          5  |   -.082489   .0003202  -257.61   0.000    -.0831166   -.0818614
          6  |  -.0836881   .0002494  -335.62   0.000    -.0841769   -.0831994
          7  |  -.2114177   .0002664  -793.61   0.000    -.2119398   -.2108956
          8  |  -.3025451   .0003145  -962.01   0.000    -.3031615   -.3019287
          9  |   .0100736   .0003545    28.41   0.000     .0093787    .0107685
         10  |  -.1270485   .0002998  -423.81   0.000    -.1276361    -.126461
         11  |  -.2186024   .0003056  -715.35   0.000    -.2192014   -.2180035
         12  |  -.2199164   .0003297  -667.03   0.000    -.2205626   -.2192702
         13  |   .0854355   .0004064   210.23   0.000      .084639     .086232
         14  |  -.1021798   .0003454  -295.81   0.000    -.1028568   -.1015028
         15  |  -.1947256   .0003391  -574.29   0.000    -.1953901    -.194061
         16  |  -.1604284   .0003459  -463.85   0.000    -.1611063   -.1597505
             |
        marr |  -.0098611   .0000423  -233.01   0.000     -.009944   -.0097781
       partt |   -.329202   .0000523 -6293.86   0.000    -.3293045   -.3290995
      public |   1.094865   .0000621  1.8e+04   0.000     1.094743    1.094987
        cmsa |      .1026   .0000516  1990.09   0.000     .1024989     .102701
             |
       state |
         NH  |  -.0904148   .0004131  -218.89   0.000    -.0912244   -.0896052
         VT  |  -.0405434   .0004589   -88.35   0.000    -.0414428    -.039644
         MA  |   .1403473   .0003136   447.54   0.000     .1397327    .1409619
         RI  |    .216252   .0003822   565.85   0.000     .2155029     .217001
         CT  |   .1865695   .0003311   563.44   0.000     .1859205    .1872185
         NY  |   .4357244    .000301  1447.63   0.000     .4351344    .4363143
         NJ  |   .2087036   .0003148   662.91   0.000     .2080865    .2093206
         PA  |    .135149   .0003041   444.42   0.000      .134553     .135745
         OH  |   .0479465    .000303   158.24   0.000     .0473526    .0485404
         IN  |  -.2006587   .0003163  -634.45   0.000    -.2012786   -.2000389
         IL  |    .010132    .000306    33.11   0.000     .0095322    .0107317
         MI  |   .2447223   .0003055   801.10   0.000     .2441236    .2453211
         WI  |   .0523963   .0003125   167.66   0.000     .0517837    .0530088
         MN  |   .2619985     .00031   845.13   0.000     .2613909    .2626061
         IA  |  -.1240685   .0003403  -364.61   0.000    -.1247354   -.1234015
         MO  |  -.2566192   .0003192  -803.89   0.000    -.2572448   -.2559935
         ND  |  -.3679151   .0005789  -635.53   0.000    -.3690498   -.3667805
         SD  |   -.511908   .0005303  -965.32   0.000    -.5129474   -.5108687
         NE  |  -.2561285   .0003691  -693.88   0.000     -.256852    -.255405
         KS  |  -.4898565   .0003499 -1399.84   0.000    -.4905423   -.4891706
         DE  |  -.1257913   .0008314  -151.30   0.000    -.1274209   -.1241618
         MD  |  -.1344112   .0003295  -407.96   0.000     -.135057   -.1337655
         DC  |  -.4102152   .0005801  -707.12   0.000    -.4113522   -.4090782
         VA  |  -.6508609   .0003247 -2004.63   0.000    -.6514972   -.6502245
         WV  |  -.1033968    .000398  -259.78   0.000    -.1041769   -.1026167
         NC  |  -.9336792   .0003366 -2774.20   0.000    -.9343388   -.9330195
         SC  |  -.9936427   .0003948 -2516.88   0.000    -.9944165   -.9928689
         GA  |  -.7520159   .0003332 -2256.70   0.000     -.752669   -.7513628
         FL  |  -.3520329   .0003129 -1125.16   0.000    -.3526461   -.3514197
         KY  |  -.3248303   .0003271  -993.14   0.000    -.3254713   -.3241892
         TN  |   -.557679   .0003309 -1685.41   0.000    -.5583275   -.5570305
         AL  |  -.3465093     .00035  -990.14   0.000    -.3471952   -.3458234
         MS  |   -.772226    .000394 -1959.78   0.000    -.7729983   -.7714537
         AR  |  -.6398014   .0003738 -1711.52   0.000    -.6405341   -.6390688
         LA  |  -.6194851   .0003739 -1656.91   0.000    -.6202179   -.6187523
         OK  |  -.4633564   .0003464 -1337.77   0.000    -.4640352   -.4626775
         TX  |  -.6343184   .0003091 -2052.15   0.000    -.6349242   -.6337125
         MT  |   .0862526   .0004262   202.36   0.000     .0854172     .087088
         ID  |  -.4568466   .0004242 -1076.91   0.000     -.457678   -.4560151
         WY  |  -.6213394   .0006208 -1000.84   0.000    -.6225562   -.6201226
         CO  |  -.2202205   .0003341  -659.21   0.000    -.2208753   -.2195657
         NM  |  -.4318653   .0004558  -947.43   0.000    -.4327587   -.4309719
         AZ  |   -.473567   .0003404 -1391.30   0.000    -.4742341   -.4728999
         UT  |  -.4563961   .0003733 -1222.57   0.000    -.4571278   -.4556645
         NV  |   .1976418   .0003711   532.57   0.000     .1969145    .1983692
         WA  |   .3798016   .0003124  1215.79   0.000     .3791893    .3804138
         OR  |   .2740635   .0003248   843.72   0.000     .2734269    .2747002
         CA  |   .2662701   .0003002   886.89   0.000     .2656817    .2668586
         AK  |   .3232798   .0004513   716.30   0.000     .3223952    .3241643
         HI  |   .4163069   .0005187   802.65   0.000     .4152903    .4173235
             |
        nind |
          2  |    .392099   .0003906  1003.78   0.000     .3913334    .3928646
          3  |    .649816   .0003359  1934.84   0.000     .6491577    .6504742
          4  |   .6277844   .0003363  1866.97   0.000     .6271253    .6284434
          5  |   1.289221   .0003393  3799.11   0.000     1.288556    1.289886
          6  |   .0753819   .0003486   216.22   0.000     .0746986    .0760652
          7  |   .1013904   .0003455   293.46   0.000     .1007132    .1020676
          8  |   .6956243   .0003359  2071.09   0.000      .694966    .6962826
          9  |   1.226216   .0003375  3633.60   0.000     1.225555    1.226878
         10  |   .3660158    .000355  1030.89   0.000     .3653199    .3667117
         11  |   .6340067   .0003431  1847.88   0.000     .6333342    .6346792
             |
       nocc3 |
          2  |  -.0521516   .0000561  -929.77   0.000    -.0522616   -.0520417
          3  |   .0079878   .0000717   111.36   0.000     .0078472    .0081284
          4  |   .6709109   .0000847  7918.37   0.000     .6707449     .671077
             |
     quarter |
          2  |  -.0034854   .0000538   -64.80   0.000    -.0035908     -.00338
          3  |   .0010235   .0000547    18.73   0.000     .0009164    .0011306
          4  |  -.0138297   .0000537  -257.38   0.000     -.013935   -.0137244
             |
        year |
       1984  |  -.0623266   .0001437  -433.67   0.000    -.0626083   -.0620449
       1985  |  -.0978279    .000157  -623.09   0.000    -.0981356   -.0975202
       1986  |  -.1188476   .0001455  -816.67   0.000    -.1191328   -.1185624
       1987  |  -.1374376   .0001464  -938.72   0.000    -.1377245   -.1371506
       1988  |  -.1521506   .0001467 -1037.46   0.000    -.1524381   -.1518632
       1989  |   -.182678   .0001422 -1284.54   0.000    -.1829567   -.1823993
       1990  |   -.179921   .0001423 -1264.57   0.000    -.1801999   -.1796422
       1991  |  -.2026298   .0001432 -1414.86   0.000    -.2029105   -.2023491
       1992  |  -.1804367    .000142 -1270.76   0.000     -.180715   -.1801584
       1993  |  -.1813994   .0001419 -1278.23   0.000    -.1816775   -.1811212
       1996  |  -.1828877   .0001495 -1222.97   0.000    -.1831808   -.1825946
       1997  |  -.2045086   .0001499 -1364.12   0.000    -.2048025   -.2042148
       1998  |   -.229677   .0001511 -1519.65   0.000    -.2299732   -.2293807
       1999  |  -.2415894   .0001526 -1583.38   0.000    -.2418884   -.2412903
       2000  |  -.2360975   .0001538 -1534.75   0.000     -.236399   -.2357959
       2001  |  -.2330253    .000155 -1503.28   0.000    -.2333291   -.2327214
       2002  |  -.2447272   .0001558 -1570.45   0.000    -.2450326   -.2444218
       2003  |  -.2567235   .0001569 -1636.43   0.000     -.257031    -.256416
       2004  |  -.2690373   .0001575 -1708.10   0.000     -.269346   -.2687286
       2005  |  -.2818265   .0001571 -1793.48   0.000    -.2821345   -.2815185
       2006  |  -.2888368   .0001576 -1832.56   0.000    -.2891457   -.2885278
       2007  |  -.2792657   .0001567 -1782.52   0.000    -.2795728   -.2789587
       2008  |  -.2584485   .0001558 -1658.70   0.000    -.2587539   -.2581431
       2009  |  -.2590453   .0001563 -1657.62   0.000    -.2593516    -.258739
       2010  |  -.2727206   .0001591 -1713.73   0.000    -.2730325   -.2724087
       2011  |  -.2736231   .0001611 -1698.97   0.000    -.2739388   -.2733075
       2012  |  -.3146057   .0001626 -1934.33   0.000    -.3149245    -.314287
       2013  |  -.2926182   .0001634 -1790.50   0.000    -.2929385   -.2922978
       2014  |  -.3100701    .000165 -1879.41   0.000    -.3103935   -.3097468
       2015  |  -.3125351    .000165 -1894.25   0.000    -.3128584   -.3122117
       2016  |   -.308794    .000163 -1894.12   0.000    -.3091135   -.3084745
       2017  |  -.3347832   .0001641 -2040.06   0.000    -.3351048   -.3344615
       2018  |  -.3320907   .0001643 -2021.68   0.000    -.3324126   -.3317687
       2019  |   -.340988   .0001653 -2062.38   0.000    -.3413121    -.340664
             |
       _cons |  -3.227851    .000692 -4664.47   0.000    -3.229207   -3.226494
------------------------------------------------------------------------------

.         predict pu1b0f
(option pr assumed; Pr(covered))
(376,543 missing values generated)

. 
. gen theta2f = (pb1f/(1-pb1f)) * (pu1b1f/pu1b0f) if nhblack == 0 & covered == 1
(1,582,011 missing values generated)

. 
. replace theta2f = theta2f * hweight if nhblack == 0 & covered == 1
(163,674 real changes made)

. 
. kdensity lwage3 [aweight = theta2f] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(cu_wfestpt cu_wfde) nograph

. 
. graph twoway (connected u_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue
> ) lp(solid))  /// 
>                          (connected u_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick
> ) lc(magenta) lp(solid))  ///
>                          (connected cu_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthic
> k) lc(eltblue) lp(longdash)),  /// 
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) //
> /
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "non-Hisp white - c.f.") 
> c(1) pos(2) ring(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1wom/cu_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/cu_bhw_wom.png written in PNG format)

.         
. gen theta3f = (pb1f/(1-pb1f)) * ((1-pu1b1f)/(1-pu1b1f)) if nhblack == 0 & covered == 0
(756,369 missing values generated)

. 
. replace theta3f = theta3f * hweight if nhblack == 0 & covered == 0
(989,316 real changes made)

. 
. kdensity lwage3 [aweight = theta3f] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(cn_wfestpt cn_wfde) nograph

. 
. graph twoway (connected n_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue
> ) lp(solid))  /// 
>                          (connected n_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick
> ) lc(magenta) lp(solid))  ///
>                          (connected cn_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthic
> k) lc(eltblue) lp(longdash)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) //
> /
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "non-Hisp white - c.f.") 
> c(1) pos(2) ring(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women not Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1wom/cn_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/cn_bhw_wom.png written in PNG format)

.         
. restore

. 
. log close
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/dfl1/dfl1.log
  log type:  text
 closed on:  11 Mar 2021, 12:03:20
---------------------------------------------------------------------------------------------------------
