------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/dfl1/dfl1.log
  log type:  text
 opened on:   8 Mar 2021, 14:53:16

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2
> 004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extende
> d to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
(2,109 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,113 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,737 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,612 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** NOTE in current draft we have not dropped <83, self empl + w/o pay
. ********************************************************************************
. 
. drop if year < 1983
(556,661 observations deleted)

. 
. ** men
. preserve

. keep if sex == 1
(2,033,574 observations deleted)

. 
. qui sum lwage3, detail

. 
. gen xstep = (r(max) - r(min)) / 200

. 
. gen kwage = r(min) + (_n-1)*xstep if _n <= 200
(2,097,792 missing values generated)

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(wmestpt wmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2, at(kwage) gauss width(0.065) ///
>         generate(bmestpt bmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 3, at(kwage) gauss width(0.065) ///
>         generate(hmestpt hmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.0
> 65) ///
>         generate(u_wmestpt u_wmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.0
> 65) ///
>         generate(n_wmestpt n_wmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 1, at(kwage) gauss width(0.0
> 65) ///
>         generate(u_bmestpt u_bmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 0, at(kwage) gauss width(0.0
> 65) ///
>         generate(nbmestpt n_bmde) nograph

.         
. ** lab wmestpt "non hisp white men estimation points"
. ** lab wmde "non hisp white men density estimate"
. 
. graph twoway (connected wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> eltblue) lp(solid))  /// 
>                          (connected bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(m
> edthick) lc(magenta) lp(solid))  ///
>                          (connected hmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(m
> edthick) lc(midgreen) lp(solid)), ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(l
> arge)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)
> ) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "Hispanic") c(1)
>  pos(2) ring(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men", size(vlarge))

. graph export "$figs/kde1men/bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/bhw_men.png written in PNG format)

. 
. graph twoway (connected u_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) l
> c(eltblue) lp(solid))  /// 
>                          (connected u_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth
> (medthick) lc(magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(l
> arge)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)
> ) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(
> 0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men Covered by Union", size(vlarge))

. graph export "$figs/kde1men/u_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/u_bhw_men.png written in PNG format)

. 
. graph twoway (connected n_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) l
> c(eltblue) lp(solid))  /// 
>                          (connected n_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth
> (medthick) lc(magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(l
> arge)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)
> ) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(
> 0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men not Covered by Union", size(vlarge))

. graph export "$figs/kde1men/n_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/n_bhw_men.png written in PNG format)

. 
. ** probability of race that depends on other covariates
. 
. local nhr w b

. 
. clonevar nhrace = hisprace
(128,854 missing values generated)

. 
. replace nhrace =. if nhrace == 3
(209,076 real changes made, 209,076 to missing)

. 
. keep if inrange(nhrace, 1, 2)
(337,930 observations deleted)

. 
. gen nhblack = nhrace - 1

. 
. gen finalwt1 = round(eweight)

. 
. drop nind

. 
. rename nind2 nind

. 
. drop nocc2

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(1377832 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(1583739 differences between nocc2 and nocc3)

. 
. drop edex

. 
. gen edex = educ*exper

. 
. probit nhblack educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.n
> ind i.nocc3 i.quarter i.year [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.116e+09  
Iteration 1:   log likelihood = -3.568e+09  
Iteration 2:   log likelihood = -3.543e+09  
Iteration 3:   log likelihood = -3.543e+09  
Iteration 4:   log likelihood = -3.543e+09  
Iteration 5:   log likelihood = -3.543e+09  
Iteration 6:   log likelihood = -3.543e+09  

Probit regression                               Number of obs     =  1.140e+10
                                                LR chi2(124)      =   1.15e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.543e+09                     Pseudo R2         =     0.1394

------------------------------------------------------------------------------
     nhblack |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0016269   .0000395   -41.17   0.000    -.0017043   -.0015494
       exper |   .1046425   .0000314  3334.49   0.000      .104581     .104704
      exper2 |  -.0046626   2.29e-06 -2034.84   0.000    -.0046671   -.0046581
      exper3 |   .0000914   7.84e-08  1166.86   0.000     .0000913    .0000916
      exper4 |  -6.50e-07   8.63e-10  -752.41   0.000    -6.51e-07   -6.48e-07
        edex |  -.0013816   1.33e-06 -1036.28   0.000    -.0013843    -.001379
             |
       ee_cl |
          2  |   .1599204   .0001286  1243.96   0.000     .1596684    .1601723
          3  |   .0437036   .0001584   275.95   0.000     .0433932     .044014
          4  |  -.1806464   .0002464  -733.29   0.000    -.1811292   -.1801635
          5  |   .0818465   .0001822   449.11   0.000     .0814893    .0822037
          6  |   .0657402   .0001598   411.45   0.000     .0654271    .0660534
          7  |   .0270222   .0001813   149.07   0.000     .0266669    .0273775
          8  |  -.1870428   .0002379  -786.16   0.000    -.1875091   -.1865765
          9  |   .1765057   .0002331   757.29   0.000     .1760489    .1769625
         10  |   .0709026   .0002091   339.15   0.000     .0704928    .0713123
         11  |   .0392431   .0002196   178.69   0.000     .0388126    .0396735
         12  |  -.1284645   .0002525  -508.82   0.000    -.1289593   -.1279696
         13  |   .3415973   .0002924  1168.43   0.000     .3410243    .3421703
         14  |   .0788194   .0002543   309.92   0.000     .0783209    .0793178
         15  |   .0616927   .0002558   241.17   0.000     .0611914    .0621941
         16  |  -.0274158   .0002732  -100.37   0.000    -.0279512   -.0268805
             |
        marr |  -.2994114   .0000378 -7928.16   0.000    -.2994854   -.2993374
       partt |   .1137811   .0000622  1829.49   0.000     .1136592    .1139029
      public |   .2846434    .000068  4184.95   0.000     .2845101    .2847767
        cmsa |   .4558248   .0000503  9064.53   0.000     .4557262    .4559233
             |
       state |
         NH  |   .0571444    .000989    57.78   0.000      .055206    .0590827
         VT  |   .0261596   .0012536    20.87   0.000     .0237026    .0286167
         MA  |   .6171032   .0007953   775.93   0.000     .6155444    .6186619
         RI  |   .5131917   .0008472   605.77   0.000     .5115312    .5148521
         CT  |   .9318686    .000799  1166.31   0.000     .9303026    .9334346
         NY  |   1.163402    .000786  1480.21   0.000     1.161861    1.164942
         NJ  |   1.104436   .0007901  1397.84   0.000     1.102888    1.105985
         PA  |    .789127   .0007881  1001.26   0.000     .7875822    .7906717
         OH  |   .8973859   .0007869  1140.46   0.000     .8958437    .8989281
         IN  |   .8011262   .0007922  1011.30   0.000     .7995736    .8026789
         IL  |   1.129898   .0007869  1435.86   0.000     1.128356     1.13144
         MI  |   .9566128   .0007879  1214.07   0.000     .9550685    .9581571
         WI  |   .5309116    .000797   666.10   0.000     .5293494    .5324737
         MN  |   .5058681   .0007976   634.27   0.000     .5043049    .5074313
         IA  |   .2519038   .0008473   297.31   0.000     .2502431    .2535644
         MO  |   .9763211   .0007909  1234.48   0.000      .974771    .9778712
         ND  |   .3027298   .0012115   249.88   0.000     .3003553    .3051043
         SD  |   .1918026   .0011222   170.92   0.000     .1896032     .194002
         NE  |    .583304   .0008309   701.98   0.000     .5816753    .5849326
         KS  |   .8013863   .0008036   997.28   0.000     .7998113    .8029613
         DE  |   1.750864   .0009573  1828.94   0.000     1.748988     1.75274
         MD  |   1.703427   .0007891  2158.59   0.000      1.70188    1.704974
         DC  |   2.304729   .0008162  2823.61   0.000     2.303129    2.306329
         VA  |   1.485718   .0007876  1886.46   0.000     1.484175    1.487262
         WV  |   .5239271   .0008724   600.59   0.000     .5222173    .5256368
         NC  |   1.598122    .000787  2030.59   0.000      1.59658    1.599665
         SC  |   1.776685   .0007911  2245.97   0.000     1.775135    1.778236
         GA  |   1.808716   .0007866  2299.29   0.000     1.807175    1.810258
         FL  |   1.352926   .0007864  1720.36   0.000     1.351385    1.354467
         KY  |   .8874541   .0007955  1115.64   0.000      .885895    .8890132
         TN  |   1.285682   .0007894  1628.63   0.000     1.284135    1.287229
         AL  |   1.646574    .000791  2081.68   0.000     1.645024    1.648124
         MS  |   2.048775   .0007916  2588.28   0.000     2.047223    2.050326
         AR  |   1.330153   .0007975  1667.90   0.000      1.32859    1.331716
         LA  |   1.699938   .0007918  2147.01   0.000     1.698387     1.70149
         OK  |   .8506383   .0007999  1063.39   0.000     .8490705    .8522062
         TX  |   1.325333   .0007856  1687.03   0.000     1.323794    1.326873
         MT  |  -.1317145   .0013141  -100.23   0.000    -.1342902   -.1291388
         ID  |  -.0341671   .0009945   -34.36   0.000    -.0361163    -.032218
         WY  |    .181559   .0012983   139.84   0.000     .1790143    .1841036
         CO  |   .6891462    .000801   860.34   0.000     .6875762    .6907161
         NM  |    .719944   .0008716   825.97   0.000     .7182356    .7216524
         AZ  |   .6598833   .0007989   826.00   0.000     .6583175    .6614491
         UT  |   .0090077   .0008548    10.54   0.000     .0073323    .0106832
         NV  |    .947154   .0008097  1169.73   0.000      .945567     .948741
         WA  |   .5305963   .0007972   665.55   0.000     .5290337    .5321588
         OR  |   .2387187   .0008185   291.67   0.000     .2371146    .2403229
         CA  |   .9782091   .0007858  1244.92   0.000     .9766691    .9797492
         AK  |   .6252108   .0009344   669.12   0.000     .6233794    .6270421
         HI  |    .904496    .000934   968.37   0.000     .9026653    .9063267
             |
        nind |
          2  |  -.1732999   .0001409 -1230.25   0.000     -.173576   -.1730238
          3  |   .2036404   .0001319  1544.48   0.000      .203382    .2038988
          4  |   .1325942    .000134   989.38   0.000     .1323316    .1328569
          5  |   .3210926   .0001362  2356.87   0.000     .3208256    .3213596
          6  |   .2367976   .0001511  1567.39   0.000     .2365015    .2370937
          7  |   .2154001   .0001377  1564.10   0.000     .2151302      .21567
          8  |   .6486457   .0001476  4395.82   0.000     .6483564    .6489349
          9  |   .2958429   .0001548  1910.64   0.000     .2955394    .2961464
         10  |   .2155151   .0001601  1345.71   0.000     .2152012     .215829
         11  |   .0382397   .0001596   239.59   0.000     .0379269    .0385526
             |
       nocc3 |
          2  |   .2477632   .0000585  4233.45   0.000     .2476485    .2478779
          3  |   .4863413   .0000616  7893.66   0.000     .4862205     .486462
          4  |   .3377665   .0000542  6233.33   0.000     .3376603    .3378727
             |
     quarter |
          2  |   .0005656   .0000466    12.14   0.000     .0004743    .0006569
          3  |   .0050724   .0000471   107.62   0.000       .00498    .0051647
          4  |   .0061155   .0000468   130.76   0.000     .0060238    .0062071
             |
        year |
       1984  |   .0150456   .0001309   114.90   0.000     .0147889    .0153022
       1985  |    .031284   .0001422   220.07   0.000     .0310053    .0315626
       1986  |   .0470452   .0001311   358.80   0.000     .0467882    .0473022
       1987  |   .0591768   .0001315   449.89   0.000      .058919    .0594347
       1988  |   .0576106   .0001317   437.42   0.000     .0573525    .0578687
       1989  |   .0794496   .0001265   627.96   0.000     .0792017    .0796976
       1990  |   .0800723   .0001267   632.15   0.000      .079824    .0803205
       1991  |   .0751828   .0001274   590.33   0.000     .0749332    .0754325
       1992  |   .0578372   .0001274   453.80   0.000     .0575874     .058087
       1993  |   .0663354   .0001273   521.13   0.000     .0660859    .0665849
       1996  |   .0354159   .0001368   258.95   0.000     .0351478    .0356839
       1997  |   .0397439   .0001364   291.45   0.000     .0394767    .0400112
       1998  |   .0643594   .0001355   475.12   0.000     .0640939    .0646249
       1999  |   .0648006   .0001371   472.62   0.000     .0645319    .0650693
       2000  |   .0869719   .0001386   627.68   0.000     .0867004    .0872435
       2001  |   .0591258   .0001414   418.25   0.000     .0588487    .0594028
       2002  |   .0699581   .0001413   495.23   0.000     .0696812    .0702349
       2003  |   .0510242   .0001433   356.14   0.000     .0507434     .051305
       2004  |   .0507082   .0001428   355.04   0.000     .0504283    .0509882
       2005  |   .0613823   .0001414   434.05   0.000     .0611051    .0616595
       2006  |   .0860853   .0001401   614.66   0.000     .0858108    .0863598
       2007  |   .1131443   .0001385   817.22   0.000     .1128729    .1134156
       2008  |   .1115562   .0001389   803.36   0.000      .111284    .1118284
       2009  |   .0816102   .0001418   575.42   0.000     .0813323    .0818882
       2010  |   .1031385   .0001424   724.32   0.000     .1028594    .1034176
       2011  |   .0847785    .000143   592.76   0.000     .0844982    .0850588
       2012  |   .0982555   .0001421   691.63   0.000      .097977    .0985339
       2013  |   .1502024    .000142  1057.75   0.000     .1499241    .1504807
       2014  |   .1566705   .0001421  1102.31   0.000     .1563919    .1569491
       2015  |   .1911611    .000141  1356.19   0.000     .1908848    .1914373
       2016  |   .2046643   .0001401  1461.02   0.000     .2043897    .2049389
       2017  |   .2031682   .0001402  1449.43   0.000     .2028934    .2034429
       2018  |   .2171283   .0001394  1557.79   0.000     .2168551    .2174015
       2019  |   .2079294     .00014  1485.01   0.000      .207655    .2082039
             |
       _cons |  -3.482873   .0009129 -3814.98   0.000    -3.484663   -3.481084
------------------------------------------------------------------------------

.         predict pb1m
(option pr assumed; Pr(nhblack))
(376,470 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.n
> ind i.nocc3 i.quarter i.year if nhblack == 1 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -7.209e+08  
Iteration 1:   log likelihood = -5.575e+08  
Iteration 2:   log likelihood = -5.529e+08  
Iteration 3:   log likelihood = -5.528e+08  
Iteration 4:   log likelihood = -5.528e+08  

Probit regression                               Number of obs     = 1331972724
                                                LR chi2(124)      =   3.36e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -5.528e+08                     Pseudo R2         =     0.2331

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0179357   .0001109   161.67   0.000     .0177182    .0181531
       exper |    .044551   .0000879   506.75   0.000     .0443787    .0447233
      exper2 |  -.0017786   6.10e-06  -291.77   0.000    -.0017905   -.0017666
      exper3 |   .0000365   1.97e-07   184.77   0.000     .0000361    .0000369
      exper4 |  -3.09e-07   2.10e-09  -146.68   0.000    -3.13e-07   -3.04e-07
        edex |   .0001945   3.42e-06    56.81   0.000     .0001878    .0002012
             |
       ee_cl |
          2  |   .1933888   .0004071   475.07   0.000     .1925909    .1941866
          3  |   .2500778   .0004842   516.43   0.000     .2491287    .2510269
          4  |   .1894712   .0007087   267.34   0.000     .1880821    .1908602
          5  |   .0063552    .000517    12.29   0.000     .0053419    .0073685
          6  |   .2085836   .0004664   447.26   0.000     .2076695    .2094976
          7  |   .2824634   .0005208   542.40   0.000     .2814427     .283484
          8  |   .1170772   .0006755   173.31   0.000     .1157531    .1184012
          9  |   .0527281   .0006121    86.15   0.000     .0515285    .0539277
         10  |   .2440313   .0005712   427.24   0.000     .2429118    .2451508
         11  |   .2557533    .000603   424.12   0.000     .2545714    .2569352
         12  |   .1202438    .000697   172.52   0.000     .1188777    .1216098
         13  |   .2091112   .0007311   286.03   0.000     .2076783    .2105441
         14  |    .270768   .0006686   404.97   0.000     .2694576    .2720785
         15  |   .3011185   .0006798   442.94   0.000     .2997861     .302451
         16  |   .0267446   .0007391    36.18   0.000      .025296    .0281933
             |
        marr |   .0563862   .0000937   601.47   0.000     .0562025      .05657
       partt |  -.3214498   .0001727 -1861.72   0.000    -.3217882   -.3211114
      public |   .8388775   .0001459  5749.14   0.000     .8385915    .8391635
        cmsa |   .2447887   .0001544  1585.02   0.000      .244486    .2450914
             |
       state |
         NH  |   -.014085    .004464    -3.16   0.002    -.0228342   -.0053357
         VT  |  -.2264874   .0061247   -36.98   0.000    -.2384917   -.2144832
         MA  |   .0063466   .0036939     1.72   0.086    -.0008933    .0135864
         RI  |  -.0002854   .0038056    -0.07   0.940    -.0077443    .0071734
         CT  |   .1074327   .0036931    29.09   0.000     .1001944    .1146711
         NY  |   .5493285   .0036731   149.55   0.000     .5421293    .5565277
         NJ  |    .246232   .0036785    66.94   0.000     .2390223    .2534418
         PA  |    .260466   .0036778    70.82   0.000     .2532577    .2676743
         OH  |    .109888   .0036755    29.90   0.000     .1026841    .1170919
         IN  |   .0636498   .0036849    17.27   0.000     .0564275    .0708722
         IL  |   .3321929   .0036746    90.40   0.000     .3249909    .3393949
         MI  |   .4355369   .0036764   118.47   0.000     .4283312    .4427426
         WI  |   .0782914   .0036976    21.17   0.000     .0710443    .0855385
         MN  |   .1439877   .0037011    38.90   0.000     .1367336    .1512418
         IA  |  -.0561657   .0038634   -14.54   0.000    -.0637378   -.0485935
         MO  |   .0938141   .0036815    25.48   0.000     .0865985    .1010296
         ND  |   .0369347    .005429     6.80   0.000      .026294    .0475754
         SD  |  -.2959879   .0049341   -59.99   0.000    -.3056587   -.2863172
         NE  |  -.0345499   .0037781    -9.14   0.000    -.0419549   -.0271448
         KS  |  -.1787323     .00371   -48.18   0.000    -.1860037   -.1714609
         DE  |  -.1355216   .0038875   -34.86   0.000    -.1431409   -.1279023
         MD  |   .0005938   .0036753     0.16   0.872    -.0066096    .0077973
         DC  |  -.0556806   .0036887   -15.09   0.000    -.0629104   -.0484508
         VA  |  -.5111414   .0036758  -139.05   0.000    -.5183458   -.5039369
         WV  |  -.0643941   .0038996   -16.51   0.000    -.0720371   -.0567511
         NC  |  -.8003652   .0036762  -217.72   0.000    -.8075703     -.79316
         SC  |  -.9660686   .0036837  -262.25   0.000    -.9732886   -.9588486
         GA  |  -.6028918    .003674  -164.10   0.000    -.6100926   -.5956909
         FL  |  -.4944471   .0036748  -134.55   0.000    -.5016497   -.4872446
         KY  |  -.0515821   .0036911   -13.97   0.000    -.0588165   -.0443477
         TN  |  -.3740952   .0036788  -101.69   0.000    -.3813055   -.3668848
         AL  |  -.3302404   .0036782   -89.78   0.000    -.3374495   -.3230312
         MS  |  -.6575697   .0036795  -178.71   0.000    -.6647814    -.650358
         AR  |  -.4793804   .0036948  -129.74   0.000    -.4866222   -.4721387
         LA  |  -.4922226   .0036799  -133.76   0.000    -.4994351   -.4850102
         OK  |  -.4057587   .0037059  -109.49   0.000    -.4130221   -.3984954
         TX  |  -.5626541   .0036737  -153.16   0.000    -.5698544   -.5554538
         MT  |  -.1022397   .0063283   -16.16   0.000    -.1146429   -.0898366
         ID  |  -.6853405   .0050037  -136.97   0.000    -.6951474   -.6755335
         WY  |  -.4898153   .0067267   -72.82   0.000    -.5029993   -.4766313
         CO  |  -.1978383   .0037071   -53.37   0.000    -.2051041   -.1905725
         NM  |  -.5823617   .0039746  -146.52   0.000    -.5901519   -.5745716
         AZ  |  -.5761235   .0037176  -154.97   0.000    -.5834098   -.5688371
         UT  |  -.8503228   .0041745  -203.70   0.000    -.8585047    -.842141
         NV  |   .2350643   .0037065    63.42   0.000     .2277997     .242329
         WA  |   .2354289   .0036961    63.70   0.000     .2281846    .2426732
         OR  |   .2032082   .0037509    54.18   0.000     .1958565    .2105598
         CA  |    .193456   .0036733    52.66   0.000     .1862564    .2006556
         AK  |   .0733852   .0039851    18.41   0.000     .0655745     .081196
         HI  |   -.345346   .0039809   -86.75   0.000    -.3531484   -.3375436
             |
        nind |
          2  |   .3494714   .0004831   723.32   0.000     .3485245    .3504184
          3  |   .6787816   .0004616  1470.52   0.000     .6778769    .6796863
          4  |    .026215   .0004726    55.47   0.000     .0252887    .0271413
          5  |   .7904665   .0004678  1689.63   0.000     .7895496    .7913835
          6  |  -.1994776   .0005274  -378.20   0.000    -.2005114   -.1984439
          7  |  -.1137332   .0004858  -234.11   0.000    -.1146854    -.112781
          8  |   .2329644   .0004908   474.68   0.000     .2320025    .2339263
          9  |    .557951   .0004995  1117.00   0.000      .556972      .55893
         10  |   .1050628   .0005247   200.23   0.000     .1040344    .1060912
         11  |    .311877   .0005021   621.12   0.000     .3108928    .3128611
             |
       nocc3 |
          2  |   .2071581   .0001701  1218.20   0.000     .2068248    .2074914
          3  |   .3602027   .0001602  2249.12   0.000     .3598889    .3605166
          4  |   .5035994   .0001532  3286.70   0.000     .5032991    .5038997
             |
     quarter |
          2  |  -.0114981   .0001201   -95.77   0.000    -.0117335   -.0112628
          3  |  -.0381887   .0001217  -313.75   0.000    -.0384272   -.0379501
          4  |  -.0372821   .0001208  -308.60   0.000    -.0375188   -.0370453
             |
        year |
       1984  |  -.1030439   .0003178  -324.23   0.000    -.1036668    -.102421
       1985  |  -.2037957    .000349  -583.93   0.000    -.2044798   -.2031117
       1986  |  -.1848433   .0003178  -581.54   0.000    -.1854663   -.1842204
       1987  |  -.2378209   .0003199  -743.44   0.000    -.2384479   -.2371939
       1988  |  -.2026348   .0003199  -633.42   0.000    -.2032618   -.2020078
       1989  |  -.2929407   .0003077  -952.04   0.000    -.2935438   -.2923376
       1990  |  -.3143714   .0003083 -1019.58   0.000    -.3149758   -.3137671
       1991  |  -.3182541   .0003101 -1026.20   0.000     -.318862   -.3176463
       1992  |  -.3507375   .0003118 -1124.73   0.000    -.3513487   -.3501263
       1993  |  -.3792608   .0003117 -1216.90   0.000    -.3798716   -.3786499
       1996  |  -.3837021   .0003399 -1128.80   0.000    -.3843683   -.3830359
       1997  |  -.4320955   .0003403 -1269.65   0.000    -.4327626   -.4314285
       1998  |  -.4363721   .0003364 -1297.32   0.000    -.4370313   -.4357128
       1999  |  -.4516618   .0003426 -1318.19   0.000    -.4523334   -.4509902
       2000  |  -.4844312   .0003479 -1392.50   0.000    -.4851131   -.4837494
       2001  |  -.5201581   .0003602 -1444.22   0.000    -.5208641   -.5194522
       2002  |  -.5093573   .0003592 -1417.99   0.000    -.5100613   -.5086532
       2003  |  -.4863939   .0003638 -1336.82   0.000     -.487107   -.4856808
       2004  |  -.5791488   .0003714 -1559.34   0.000    -.5798767   -.5784208
       2005  |  -.6192916   .0003683 -1681.67   0.000    -.6200134   -.6185699
       2006  |  -.6593171   .0003639 -1811.65   0.000    -.6600304   -.6586038
       2007  |  -.6194926   .0003549 -1745.31   0.000    -.6201883   -.6187969
       2008  |  -.6228374   .0003584 -1737.89   0.000    -.6235398   -.6221349
       2009  |  -.6082919   .0003661 -1661.57   0.000    -.6090095   -.6075744
       2010  |  -.6118959   .0003679 -1663.24   0.000    -.6126169   -.6111748
       2011  |   -.658301    .000376 -1750.70   0.000     -.659038    -.657564
       2012  |  -.6290137    .000371 -1695.56   0.000    -.6297408   -.6282866
       2013  |  -.6096125   .0003647 -1671.64   0.000    -.6103273   -.6088977
       2014  |  -.6547181   .0003685 -1776.94   0.000    -.6554403    -.653996
       2015  |  -.6692067   .0003644 -1836.53   0.000    -.6699209   -.6684925
       2016  |  -.6800355   .0003638 -1869.34   0.000    -.6807485   -.6793225
       2017  |  -.6066854   .0003583 -1693.39   0.000    -.6073875   -.6059832
       2018  |  -.6948623   .0003598 -1931.29   0.000    -.6955675   -.6941571
       2019  |  -.7129095    .000364 -1958.76   0.000    -.7136228   -.7121961
             |
       _cons |  -2.106525   .0039188  -537.55   0.000    -2.114206   -2.098844
------------------------------------------------------------------------------

.         predict pu1b1m
(option pr assumed; Pr(covered))
(376,470 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.n
> ind i.nocc3 i.quarter i.year if nhblack == 0 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.833e+09  
Iteration 1:   log likelihood = -3.699e+09  
Iteration 2:   log likelihood = -3.648e+09  
Iteration 3:   log likelihood = -3.648e+09  
Iteration 4:   log likelihood = -3.648e+09  
Iteration 5:   log likelihood = -3.648e+09  

Probit regression                               Number of obs     =  1.005e+10
                                                LR chi2(124)      =   2.37e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.648e+09                     Pseudo R2         =     0.2452

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0439419   .0000423  1038.79   0.000      .043859    .0440249
       exper |   .0773346   .0000353  2188.27   0.000     .0772654    .0774039
      exper2 |  -.0028513   2.55e-06 -1120.13   0.000    -.0028563   -.0028463
      exper3 |     .00007   8.63e-08   810.73   0.000     .0000698    .0000702
      exper4 |  -7.27e-07   9.51e-10  -764.52   0.000    -7.29e-07   -7.26e-07
        edex |  -.0011046   1.44e-06  -766.65   0.000    -.0011074   -.0011018
             |
       ee_cl |
          2  |   .0912025   .0001626   561.03   0.000     .0908839    .0915212
          3  |   .1019461   .0001912   533.29   0.000     .1015715    .1023208
          4  |   -.044095   .0002754  -160.13   0.000    -.0446347   -.0435553
          5  |  -.1424219   .0002218  -642.19   0.000    -.1428565   -.1419872
          6  |   .1395125   .0001885   739.94   0.000      .139143    .1398821
          7  |   .1572039   .0002102   747.94   0.000     .1567919    .1576158
          8  |   -.133131   .0002664  -499.74   0.000    -.1336531   -.1326088
          9  |  -.0054764   .0002616   -20.93   0.000    -.0059891   -.0049636
         10  |   .1751012   .0002325   753.18   0.000     .1746455    .1755569
         11  |   .1272442   .0002429   523.86   0.000     .1267682    .1277203
         12  |  -.1536112   .0002761  -556.41   0.000    -.1541523   -.1530702
         13  |   .1956191   .0003143   622.34   0.000      .195003    .1962351
         14  |    .206299   .0002716   759.54   0.000     .2057666    .2068313
         15  |   .1048705   .0002718   385.91   0.000     .1043379    .1054031
         16  |  -.1510661   .0002891  -522.53   0.000    -.1516327   -.1504994
             |
        marr |   .0601071   .0000397  1514.71   0.000     .0600293    .0601849
       partt |  -.2958993    .000077 -3842.82   0.000    -.2960502   -.2957484
      public |   .9097675   .0000643  1.4e+04   0.000     .9096415    .9098935
        cmsa |    .173656   .0000437  3978.15   0.000     .1735704    .1737416
             |
       state |
         NH  |  -.2687601   .0003768  -713.34   0.000    -.2694985   -.2680216
         VT  |  -.2447089   .0004216  -580.43   0.000    -.2455352   -.2438826
         MA  |   .0103992   .0002759    37.69   0.000     .0098583      .01094
         RI  |   .0416251   .0003462   120.22   0.000     .0409465    .0423038
         CT  |   .0184325   .0002927    62.96   0.000     .0178588    .0190063
         NY  |   .3484451   .0002629  1325.51   0.000     .3479298    .3489603
         NJ  |   .1759262   .0002749   640.01   0.000     .1753874    .1764649
         PA  |   .0877285   .0002644   331.76   0.000     .0872102    .0882468
         OH  |   .0534141   .0002632   202.96   0.000     .0528983    .0539299
         IN  |  -.0411539   .0002711  -151.82   0.000    -.0416852   -.0406226
         IL  |   .1435368   .0002652   541.16   0.000      .143017    .1440567
         MI  |   .1918687   .0002656   722.36   0.000     .1913481    .1923893
         WI  |  -.0030459   .0002718   -11.20   0.000    -.0035787   -.0025131
         MN  |   .1055368   .0002726   387.20   0.000     .1050026     .106071
         IA  |  -.1188669   .0002959  -401.65   0.000    -.1194469   -.1182868
         MO  |  -.0394672   .0002735  -144.32   0.000    -.0400032   -.0389312
         ND  |  -.3990378   .0005139  -776.45   0.000     -.400045   -.3980305
         SD  |  -.5667714   .0004708 -1203.92   0.000    -.5676941   -.5658487
         NE  |  -.3091265   .0003249  -951.56   0.000    -.3097632   -.3084897
         KS  |  -.3258584   .0002965 -1098.89   0.000    -.3264396   -.3252772
         DE  |  -.2460949   .0007286  -337.74   0.000     -.247523   -.2446668
         MD  |  -.2333339   .0002892  -806.69   0.000    -.2339009    -.232767
         DC  |  -.2511919   .0005415  -463.92   0.000    -.2522532   -.2501307
         VA  |  -.6417757   .0002818 -2277.42   0.000     -.642328   -.6412233
         WV  |   .0031152   .0003279     9.50   0.000     .0024725    .0037579
         NC  |  -.9316422   .0002915 -3196.01   0.000    -.9322136   -.9310709
         SC  |  -.9363728   .0003363 -2784.68   0.000    -.9370318   -.9357137
         GA  |  -.5952588   .0002847 -2090.49   0.000    -.5958169   -.5947008
         FL  |  -.4867296   .0002732 -1781.86   0.000     -.487265   -.4861942
         KY  |  -.1976729    .000281  -703.43   0.000    -.1982237   -.1971221
         TN  |  -.4755318   .0002829 -1681.10   0.000    -.4760863   -.4749774
         AL  |   -.322268   .0002965 -1087.03   0.000    -.3228491    -.321687
         MS  |  -.6327403   .0003278 -1930.13   0.000    -.6333828   -.6320978
         AR  |  -.6443633    .000321 -2007.14   0.000    -.6449925   -.6437341
         LA  |  -.5512955   .0003124 -1764.59   0.000    -.5519078   -.5506832
         OK  |  -.5185029   .0002988 -1735.41   0.000    -.5190885   -.5179173
         TX  |  -.5975542   .0002683 -2227.50   0.000      -.59808   -.5970285
         MT  |  -.0057106   .0003814   -14.97   0.000    -.0064581   -.0049631
         ID  |  -.4400581   .0003587 -1226.84   0.000    -.4407611   -.4393551
         WY  |  -.3907193   .0004935  -791.79   0.000    -.3916865   -.3897521
         CO  |  -.2903062   .0002926  -992.11   0.000    -.2908797   -.2897327
         NM  |  -.5299671   .0004098 -1293.09   0.000    -.5307704   -.5291639
         AZ  |   -.546977   .0002966 -1844.43   0.000    -.5475582   -.5463958
         UT  |  -.5216088   .0003199 -1630.76   0.000    -.5222357   -.5209819
         NV  |   .0650945   .0003214   202.55   0.000     .0644647    .0657244
         WA  |   .2393131   .0002731   876.44   0.000      .238778    .2398483
         OR  |   .0654115   .0002847   229.79   0.000     .0648536    .0659694
         CA  |   .1328605   .0002619   507.36   0.000     .1323472    .1333737
         AK  |   .1552902   .0004016   386.70   0.000     .1545031    .1560772
         HI  |   .1849884    .000478   387.00   0.000     .1840515    .1859253
             |
        nind |
          2  |   .4824974   .0001317  3664.27   0.000     .4822393    .4827555
          3  |   .4733044    .000127  3726.22   0.000     .4730555    .4735534
          4  |   .0175221   .0001329   131.88   0.000     .0172617    .0177825
          5  |   .8529924   .0001309  6518.24   0.000     .8527359    .8532489
          6  |  -.2544306   .0001699 -1497.45   0.000    -.2547636   -.2540976
          7  |  -.1404728   .0001421  -988.54   0.000    -.1407513   -.1401943
          8  |    .284799   .0001547  1841.56   0.000     .2844959    .2851021
          9  |   .9710937   .0001459  6656.45   0.000     .9708077    .9713796
         10  |   .1811509   .0001692  1070.47   0.000     .1808192    .1814825
         11  |   .5266233   .0001506  3497.26   0.000     .5263281    .5269184
             |
       nocc3 |
          2  |   .2736601   .0000646  4239.04   0.000     .2735336    .2737867
          3  |   .5296426   .0000697  7598.43   0.000      .529506    .5297793
          4  |   .8018712   .0000535  1.5e+04   0.000     .8017663    .8019761
             |
     quarter |
          2  |  -.0161641   .0000466  -347.06   0.000    -.0162553   -.0160728
          3  |  -.0147656   .0000472  -312.51   0.000    -.0148582    -.014673
          4  |  -.0195446   .0000467  -418.27   0.000    -.0196362    -.019453
             |
        year |
       1984  |  -.0732728   .0001149  -637.59   0.000     -.073498   -.0730475
       1985  |  -.1251845   .0001262  -992.27   0.000    -.1254318   -.1249373
       1986  |  -.1440992   .0001167 -1235.05   0.000    -.1443279   -.1438705
       1987  |  -.1671837   .0001179 -1417.43   0.000    -.1674148   -.1669525
       1988  |  -.1801759   .0001183 -1523.41   0.000    -.1804077   -.1799441
       1989  |    -.22511   .0001147 -1963.08   0.000    -.2253347   -.2248852
       1990  |   -.245816   .0001153 -2131.96   0.000    -.2460419     -.24559
       1991  |  -.2609145   .0001163 -2242.74   0.000    -.2611425   -.2606865
       1992  |  -.2740807   .0001165 -2353.17   0.000     -.274309   -.2738524
       1993  |   -.275911   .0001166 -2365.54   0.000    -.2761396   -.2756824
       1996  |   -.337309   .0001261 -2674.70   0.000    -.3375562   -.3370618
       1997  |  -.3396841    .000126 -2694.95   0.000    -.3399312   -.3394371
       1998  |  -.3678112   .0001271 -2894.22   0.000    -.3680603   -.3675621
       1999  |  -.3555957   .0001278 -2781.36   0.000    -.3558462   -.3553451
       2000  |  -.3820454   .0001311 -2914.82   0.000    -.3823023   -.3817885
       2001  |  -.3973458   .0001326 -2995.90   0.000    -.3976057   -.3970858
       2002  |  -.3994103   .0001334 -2993.33   0.000    -.3996718   -.3991488
       2003  |  -.4139508    .000135 -3066.64   0.000    -.4142154   -.4136862
       2004  |  -.4302319   .0001356 -3171.98   0.000    -.4304977    -.429966
       2005  |  -.4666439    .000136 -3430.58   0.000    -.4669105   -.4663773
       2006  |  -.4733467   .0001362 -3476.57   0.000    -.4736135   -.4730798
       2007  |  -.4738599   .0001353 -3501.17   0.000    -.4741251   -.4735946
       2008  |  -.4246744   .0001351 -3143.06   0.000    -.4249392   -.4244096
       2009  |  -.4372907   .0001376 -3178.96   0.000    -.4375603   -.4370211
       2010  |  -.4581692   .0001403 -3265.67   0.000    -.4584442   -.4578942
       2011  |  -.4877965   .0001417 -3442.36   0.000    -.4880743   -.4875188
       2012  |  -.4785236   .0001413 -3386.68   0.000    -.4788005   -.4782467
       2013  |  -.4836127   .0001433 -3375.03   0.000    -.4838936   -.4833319
       2014  |  -.4873331   .0001434 -3399.13   0.000    -.4876141   -.4870521
       2015  |  -.4960196   .0001446 -3429.19   0.000    -.4963031   -.4957361
       2016  |  -.4970495   .0001434 -3465.83   0.000    -.4973306   -.4967684
       2017  |  -.4706742   .0001425 -3302.43   0.000    -.4709535   -.4703949
       2018  |  -.4639324   .0001422 -3262.86   0.000     -.464211   -.4636537
       2019  |  -.4912857   .0001443 -3404.61   0.000    -.4915686   -.4910029
             |
       _cons |  -2.767915    .000567 -4881.85   0.000    -2.769026   -2.766804
------------------------------------------------------------------------------

.         predict pu1b0m
(option pr assumed; Pr(covered))
(376,470 missing values generated)

. 
. gen theta2m = (pb1m/(1-pb1m)) * (pu1b1m/pu1b0m) if nhblack == 0 & covered == 1
(1,520,652 missing values generated)

. 
. replace theta2m = theta2m * hweight if nhblack == 0 & covered == 1
(239,410 real changes made)

. 
. kdensity lwage3 [aweight = theta2m] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(cu_wmestpt cu_wmde) nograph

. 
. graph twoway (connected u_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) l
> c(eltblue) lp(solid))  /// 
>                          (connected u_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth
> (medthick) lc(magenta) lp(solid))  ///
>                          (connected cu_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidt
> h(medthick) lc(eltblue) lp(longdash)),  /// 
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(l
> arge)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)
> ) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "non-Hisp white 
> - c.f.") c(1) pos(2) ring(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1men/cu_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/cu_bhw_men.png written in PNG format)

.         
. gen theta3m = (pb1m/(1-pb1m)) * ((1-pu1b1m)/(1-pu1b1m)) if nhblack == 0 & covered == 0
(746,827 missing values generated)

. 
. replace theta3m = theta3m * hweight if nhblack == 0 & covered == 0
(1,013,235 real changes made)

. 
. kdensity lwage3 [aweight = theta3m] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(cn_wmestpt cn_wmde) nograph

. 
. graph twoway (connected n_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) l
> c(eltblue) lp(solid))  /// 
>                          (connected n_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth
> (medthick) lc(magenta) lp(solid))  ///
>                          (connected cn_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidt
> h(medthick) lc(eltblue) lp(longdash)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(l
> arge)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)
> ) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "non-Hisp white 
> - c.f.") c(1) pos(2) ring(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men not Covered by Union - with Counterfactual", size(vlarg
> e))

. graph export "$figs/kde1men/cn_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/cn_bhw_men.png written in PNG format)

.         
. restore

. ********************************************************************************
. 
. ********************************************************************************
. ** women
. preserve

. keep if sex == 2
(2,097,992 observations deleted)

. 
. qui sum lwage3, detail

. 
. gen xstep = (r(max) - r(min)) / 200

. 
. gen kwage = r(min) + (_n-1)*xstep if _n <= 200
(2,033,374 missing values generated)

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(wfestpt wfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2, at(kwage) gauss width(0.065) ///
>         generate(bfestpt bfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 3, at(kwage) gauss width(0.065) ///
>         generate(hfestpt hfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.0
> 65) ///
>         generate(u_wfestpt u_wfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.0
> 65) ///
>         generate(n_wfestpt n_wfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 1, at(kwage) gauss width(0.0
> 65) ///
>         generate(u_bfestpt u_bfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 0, at(kwage) gauss width(0.0
> 65) ///
>         generate(nbfestpt n_bfde) nograph

.         
. ** lab wmestpt "non hisp white men estimation points"
. ** lab wmde "non hisp white men density estimate"
. 
. graph twoway (connected wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> eltblue) lp(solid))  /// 
>                          (connected bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(m
> edthick) lc(magenta) lp(solid))  ///
>                          (connected hfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(m
> edthick) lc(midgreen) lp(solid)), ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(l
> arge)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)
> ) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "Hispanic") c(1)
>  pos(2) ring(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women", size(vlarge))

. graph export "$figs/kde1wom/bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/bhw_wom.png written in PNG format)

. 
. graph twoway (connected u_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) l
> c(eltblue) lp(solid))  /// 
>                          (connected u_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth
> (medthick) lc(magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(l
> arge)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)
> ) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(
> 0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women Covered by Union", size(vlarge))

. graph export "$figs/kde1wom/u_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/u_bhw_wom.png written in PNG format)

. 
. graph twoway (connected n_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) l
> c(eltblue) lp(solid))  /// 
>                          (connected n_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth
> (medthick) lc(magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(l
> arge)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)
> ) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(
> 0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women not Covered by Union", size(vlarge))

. graph export "$figs/kde1wom/n_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/n_bhw_wom.png written in PNG format)

. 
. ** probability of race that depends on other covariates
. 
. local nhr w b

. 
. clonevar nhrace = hisprace
(123,775 missing values generated)

. 
. replace nhrace =. if nhrace == 3
(163,842 real changes made, 163,842 to missing)

. 
. keep if inrange(nhrace, 1, 2)
(287,617 observations deleted)

. 
. gen nhblack = nhrace - 1

. 
. gen finalwt1 = round(eweight)

. 
. drop nind

. 
. rename nind2 nind

. 
. drop nocc2

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(1486449 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(1635310 differences between nocc2 and nocc3)

. 
. drop edex

. 
. gen edex = educ*exper

. 
. probit nhblack educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.n
> ind i.nocc3 i.quarter i.year [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.509e+09  
Iteration 1:   log likelihood = -3.754e+09  
Iteration 2:   log likelihood = -3.720e+09  
Iteration 3:   log likelihood = -3.719e+09  
Iteration 4:   log likelihood = -3.719e+09  
Iteration 5:   log likelihood = -3.719e+09  
Iteration 6:   log likelihood = -3.719e+09  
Iteration 7:   log likelihood = -3.719e+09  

Probit regression                               Number of obs     =  1.095e+10
                                                LR chi2(124)      =   1.58e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.719e+09                     Pseudo R2         =     0.1752

------------------------------------------------------------------------------
     nhblack |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0065598   .0000393  -166.72   0.000    -.0066369   -.0064827
       exper |   .1077747   .0000313  3440.02   0.000     .1077133    .1078361
      exper2 |  -.0056534   2.34e-06 -2419.74   0.000    -.0056579   -.0056488
      exper3 |   .0001215   8.21e-08  1479.79   0.000     .0001214    .0001217
      exper4 |  -9.49e-07   9.20e-10 -1032.07   0.000    -9.51e-07   -9.48e-07
        edex |  -.0008831   1.41e-06  -627.66   0.000    -.0008858   -.0008803
             |
       ee_cl |
          2  |    .036364    .000137   265.38   0.000     .0360955    .0366326
          3  |  -.0035366   .0001614   -21.91   0.000    -.0038529   -.0032202
          4  |  -.3048671   .0002471 -1233.89   0.000    -.3053514   -.3043828
          5  |   .0572088    .000205   279.03   0.000      .056807    .0576107
          6  |  -.0405935   .0001696  -239.30   0.000     -.040926    -.040261
          7  |  -.0284173   .0001872  -151.80   0.000    -.0287842   -.0280504
          8  |  -.2523373   .0002416 -1044.40   0.000    -.2528109   -.2518638
          9  |   .1708773   .0002499   683.87   0.000     .1703876     .171367
         10  |   -.066964   .0002172  -308.28   0.000    -.0673898   -.0665383
         11  |  -.0546022   .0002244  -243.35   0.000     -.055042   -.0541625
         12  |  -.1820988   .0002555  -712.77   0.000    -.1825995   -.1815981
         13  |   .2516926   .0003065   821.21   0.000     .2510919    .2522933
         14  |  -.0966358    .000261  -370.23   0.000    -.0971474   -.0961242
         15  |  -.0500957   .0002584  -193.85   0.000    -.0506022   -.0495892
         16  |  -.0979723   .0002756  -355.50   0.000    -.0985125   -.0974322
             |
        marr |  -.5138207   .0000351 -1.5e+04   0.000    -.5138895   -.5137518
       partt |  -.1579288   .0000444 -3556.58   0.000    -.1580158   -.1578417
      public |   .3263839   .0000624  5229.20   0.000     .3262615    .3265062
        cmsa |   .5295901   .0000502  1.1e+04   0.000     .5294917    .5296885
             |
       state |
         NH  |   .0825105   .0011978    68.88   0.000     .0801629    .0848582
         VT  |  -.0045926   .0016094    -2.85   0.004    -.0077469   -.0014382
         MA  |   .8531426     .00097   879.49   0.000     .8512413    .8550438
         RI  |   .6888741   .0010111   681.29   0.000     .6868923    .6908559
         CT  |   1.161466   .0009733  1193.30   0.000     1.159558    1.163373
         NY  |   1.476314   .0009632  1532.65   0.000     1.474426    1.478202
         NJ  |   1.379616   .0009666  1427.33   0.000     1.377722    1.381511
         PA  |   1.093486   .0009648  1133.34   0.000     1.091595    1.095377
         OH  |   1.183288    .000964  1227.53   0.000     1.181399    1.185177
         IN  |   1.092953   .0009681  1129.02   0.000     1.091056     1.09485
         IL  |   1.458818   .0009639  1513.41   0.000     1.456929    1.460707
         MI  |   1.253891   .0009649  1299.56   0.000     1.251999    1.255782
         WI  |   .8032594   .0009716   826.73   0.000     .8013551    .8051637
         MN  |   .6356593   .0009739   652.71   0.000     .6337505     .637568
         IA  |    .378872     .00102   371.45   0.000     .3768729    .3808712
         MO  |   1.282449   .0009668  1326.44   0.000     1.280554    1.284344
         ND  |    .316848   .0014704   215.49   0.000     .3139661    .3197298
         SD  |   .0659241   .0014741    44.72   0.000      .063035    .0688133
         NE  |   .8125333   .0009974   814.62   0.000     .8105784    .8144883
         KS  |   .9794715    .000979  1000.52   0.000     .9775528    .9813902
         DE  |   2.073678   .0011011  1883.20   0.000     2.071519    2.075836
         MD  |   1.994117   .0009657  2065.02   0.000     1.992224     1.99601
         DC  |   2.512873   .0009861  2548.35   0.000      2.51094    2.514805
         VA  |    1.74284   .0009646  1806.75   0.000      1.74095    1.744731
         WV  |   .7997293    .001039   769.70   0.000     .7976929    .8017658
         NC  |    1.89519   .0009641  1965.66   0.000       1.8933    1.897079
         SC  |   2.102412   .0009672  2173.70   0.000     2.100516    2.104308
         GA  |   2.115907   .0009638  2195.30   0.000     2.114018    2.117796
         FL  |   1.619666   .0009636  1680.82   0.000     1.617777    1.621555
         KY  |   1.112186   .0009712  1145.22   0.000     1.110283     1.11409
         TN  |   1.580757    .000966  1636.43   0.000     1.578863     1.58265
         AL  |   2.015726   .0009673  2083.91   0.000      2.01383    2.017622
         MS  |   2.431644   .0009677  2512.72   0.000     2.429747     2.43354
         AR  |   1.623089   .0009722  1669.50   0.000     1.621184    1.624995
         LA  |   2.068371   .0009678  2137.29   0.000     2.066474    2.070268
         OK  |   1.114397   .0009745  1143.60   0.000     1.112487    1.116307
         TX  |    1.59265   .0009631  1653.71   0.000     1.590762    1.594537
         MT  |   -.326285   .0019778  -164.97   0.000    -.3301615   -.3224086
         ID  |  -.1401767   .0012753  -109.91   0.000    -.1426763   -.1376771
         WY  |   .0035045   .0018902     1.85   0.064    -.0002002    .0072092
         CO  |   .8071041   .0009774   825.80   0.000     .8051886    .8090197
         NM  |   .8762212   .0010445   838.87   0.000      .874174    .8782684
         AZ  |    .766675   .0009757   785.79   0.000     .7647627    .7685873
         UT  |  -.0007062   .0010504    -0.67   0.501     -.002765    .0013526
         NV  |    1.15145   .0009849  1169.12   0.000      1.14952     1.15338
         WA  |    .612265    .000975   627.96   0.000      .610354     .614176
         OR  |   .2919436   .0009977   292.61   0.000     .2899881     .293899
         CA  |   1.181052   .0009633  1226.10   0.000     1.179164     1.18294
         AK  |   .8064299   .0010999   733.17   0.000      .804274    .8085857
         HI  |   1.037276   .0011078   936.31   0.000     1.035104    1.039447
             |
        nind |
          2  |  -.1121883   .0003223  -348.11   0.000      -.11282   -.1115567
          3  |   .3894872   .0002602  1496.63   0.000     .3889771    .3899973
          4  |   .3330815   .0002589  1286.30   0.000      .332574    .3335891
          5  |   .6162795   .0002649  2326.66   0.000     .6157604    .6167987
          6  |   .4813663   .0002627  1832.49   0.000     .4808514    .4818811
          7  |   .4131451   .0002617  1578.70   0.000     .4126322     .413658
          8  |   .7190423    .000259  2775.99   0.000     .7185346    .7195499
          9  |    .424225   .0002647  1602.43   0.000     .4237061    .4247439
         10  |   .4027317   .0002679  1503.27   0.000     .4022066    .4032568
         11  |   .5338123   .0002713  1967.70   0.000     .5332806     .534344
             |
       nocc3 |
          2  |   .1761621   .0000467  3770.76   0.000     .1760705    .1762536
          3  |    .464362   .0000548  8472.50   0.000     .4642546    .4644694
          4  |   .5330153   .0000753  7080.57   0.000     .5328678    .5331628
             |
     quarter |
          2  |   .0062468   .0000458   136.46   0.000     .0061571    .0063365
          3  |   .0043936   .0000464    94.74   0.000     .0043027    .0044845
          4  |   .0050822   .0000459   110.71   0.000     .0049922    .0051722
             |
        year |
       1984  |   .0327961   .0001351   242.67   0.000     .0325312     .033061
       1985  |   .0355128    .000146   243.31   0.000     .0352267    .0357988
       1986  |   .0370051   .0001353   273.49   0.000     .0367399    .0372703
       1987  |   .0458004   .0001355   338.11   0.000     .0455349    .0460659
       1988  |   .0515271   .0001354   380.69   0.000     .0512618    .0517924
       1989  |     .04653   .0001305   356.65   0.000     .0462743    .0467857
       1990  |   .0573065   .0001304   439.42   0.000     .0570509    .0575621
       1991  |    .058016   .0001308   443.41   0.000     .0577595    .0582724
       1992  |   .0474248   .0001301   364.39   0.000     .0471697    .0476799
       1993  |   .0562784   .0001298   433.63   0.000      .056024    .0565327
       1996  |   .0463825   .0001371   338.33   0.000     .0461138    .0466512
       1997  |   .0660177   .0001363   484.48   0.000     .0657507    .0662848
       1998  |   .0889176   .0001358   654.88   0.000     .0886515    .0891837
       1999  |    .119763   .0001362   879.13   0.000      .119496      .12003
       2000  |   .1075702   .0001378   780.69   0.000     .1073002    .1078403
       2001  |   .1142592   .0001393   820.50   0.000     .1139863    .1145322
       2002  |   .1073237   .0001401   766.09   0.000     .1070491    .1075982
       2003  |   .0911614   .0001411   646.19   0.000     .0908849     .091438
       2004  |   .0918531   .0001412   650.54   0.000     .0915764    .0921299
       2005  |   .0738297   .0001406   525.13   0.000     .0735541    .0741052
       2006  |   .1124512   .0001393   807.07   0.000     .1121782    .1127243
       2007  |   .1399843   .0001384  1011.74   0.000     .1397131    .1402555
       2008  |   .1268308   .0001385   915.92   0.000     .1265594    .1271022
       2009  |   .1319229   .0001394   946.52   0.000     .1316497    .1321961
       2010  |   .1396022   .0001412   988.93   0.000     .1393255    .1398788
       2011  |   .1350033   .0001421   950.34   0.000     .1347248    .1352817
       2012  |   .1931952   .0001405  1375.32   0.000     .1929199    .1934705
       2013  |   .1925856   .0001418  1358.48   0.000     .1923077    .1928634
       2014  |   .2096744   .0001418  1478.71   0.000     .2093965    .2099523
       2015  |   .2322294   .0001415  1641.26   0.000     .2319521    .2325067
       2016  |   .2308965   .0001403  1645.31   0.000     .2306215    .2311716
       2017  |   .2168726   .0001407  1541.00   0.000     .2165968    .2171485
       2018  |   .2379821   .0001404  1695.10   0.000      .237707    .2382573
       2019  |   .2544825   .0001407  1808.28   0.000     .2542067    .2547583
             |
       _cons |  -3.678927   .0010922 -3368.45   0.000    -3.681067   -3.676786
------------------------------------------------------------------------------

.         predict pb1f
(option pr assumed; Pr(nhblack))
(376,757 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.n
> ind i.nocc3 i.quarter i.year if nhblack == 1 [w = finalwt1]
(frequency weights assumed)

note: 11.state != 0 predicts failure perfectly
      11.state dropped and 40 obs not used

note: 81.state != 0 predicts failure perfectly
      81.state dropped and 15 obs not used

note: 82.state != 0 predicts failure perfectly
      82.state dropped and 52 obs not used

note: 95.state omitted because of collinearity
Iteration 0:   log likelihood = -7.631e+08  
Iteration 1:   log likelihood = -5.762e+08  
Iteration 2:   log likelihood = -5.689e+08  
Iteration 3:   log likelihood = -5.688e+08  
Iteration 4:   log likelihood = -5.688e+08  

Probit regression                               Number of obs     = 1570038540
                                                LR chi2(121)      =   3.88e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -5.688e+08                     Pseudo R2         =     0.2545

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0547105   .0001054   518.86   0.000     .0545038    .0549171
       exper |   .0814729     .00009   904.90   0.000     .0812964    .0816493
      exper2 |  -.0038441   6.43e-06  -597.96   0.000    -.0038567   -.0038315
      exper3 |   .0000963   2.15e-07   447.10   0.000     .0000959    .0000967
      exper4 |  -8.78e-07   2.35e-09  -373.05   0.000    -8.82e-07   -8.73e-07
        edex |  -.0006439   3.53e-06  -182.38   0.000    -.0006508    -.000637
             |
       ee_cl |
          2  |   .0272081   .0004669    58.27   0.000     .0262929    .0281232
          3  |  -.0252302   .0005197   -48.55   0.000    -.0262487   -.0242116
          4  |  -.0673129   .0007124   -94.49   0.000    -.0687091   -.0659167
          5  |  -.0312088   .0005835   -53.49   0.000    -.0323523   -.0300652
          6  |  -.0079761    .000519   -15.37   0.000    -.0089932   -.0069589
          7  |  -.0673149   .0005598  -120.24   0.000    -.0684122   -.0662176
          8  |  -.1037671   .0006936  -149.60   0.000    -.1051266   -.1024076
          9  |  -.0280165    .000665   -42.13   0.000    -.0293198   -.0267132
         10  |   .0140357    .000614    22.86   0.000     .0128322    .0152392
         11  |  -.0289032   .0006352   -45.50   0.000    -.0301482   -.0276582
         12  |  -.0522282   .0007144   -73.11   0.000    -.0536284    -.050828
         13  |   .0132804   .0007828    16.96   0.000     .0117461    .0148147
         14  |  -.0158172   .0007056   -22.42   0.000    -.0172001   -.0144343
         15  |  -.0530665    .000706   -75.17   0.000    -.0544502   -.0516828
         16  |   -.042932   .0007514   -57.14   0.000    -.0444047   -.0414593
             |
        marr |   .0156039   .0000898   173.82   0.000     .0154279    .0157798
       partt |  -.3543967   .0001352 -2621.49   0.000    -.3546617   -.3541317
      public |   .8606321   .0001287  6688.35   0.000     .8603799    .8608843
        cmsa |    .236755   .0001653  1431.86   0.000      .236431    .2370791
             |
       state |
         ME  |          0  (empty)
         NH  |    .156915   .0041945    37.41   0.000      .148694     .165136
         VT  |   .1564181   .0071647    21.83   0.000     .1423755    .1704607
         MA  |   .4710121     .00201   234.33   0.000     .4670725    .4749517
         RI  |   .4994955   .0021947   227.60   0.000     .4951941     .503797
         CT  |    .521442   .0020124   259.12   0.000     .5174978    .5253861
         NY  |   1.038777    .001976   525.69   0.000     1.034904     1.04265
         NJ  |   .6892842   .0019852   347.20   0.000     .6853932    .6931752
         PA  |   .5854631   .0019844   295.03   0.000     .5815738    .5893525
         OH  |   .4272238    .001981   215.66   0.000     .4233411    .4311065
         IN  |   .1388711   .0020012    69.39   0.000     .1349488    .1427935
         IL  |   .6318428   .0019787   319.32   0.000     .6279646     .635721
         MI  |   .7728391   .0019819   389.95   0.000     .7689546    .7767235
         WI  |   .4146969   .0020215   205.15   0.000     .4107349    .4186589
         MN  |   .5652662   .0020394   277.17   0.000     .5612691    .5692633
         IA  |   .0717812    .002527    28.41   0.000     .0668284     .076734
         MO  |   .3146109   .0019917   157.96   0.000     .3107072    .3185146
         ND  |   .2052356   .0065528    31.32   0.000     .1923924    .2180789
         SD  |   .2473786   .0058095    42.58   0.000     .2359921    .2587651
         NE  |   .3635846   .0021519   168.96   0.000      .359367    .3678023
         KS  |   .0007206   .0020715     0.35   0.728    -.0033395    .0047806
         DE  |   .4751345   .0023016   206.44   0.000     .4706235    .4796455
         MD  |    .309207   .0019798   156.18   0.000     .3053266    .3130873
         DC  |   .2755494   .0020007   137.73   0.000     .2716281    .2794707
         VA  |  -.1959326   .0019835   -98.78   0.000    -.1998202    -.192045
         WV  |   .2878498   .0024808   116.03   0.000     .2829875     .292712
         NC  |   -.509544   .0019866  -256.49   0.000    -.5134376   -.5056504
         SC  |  -.5320657   .0019974  -266.38   0.000    -.5359806   -.5281509
         GA  |  -.3228251   .0019805  -163.01   0.000    -.3267067   -.3189434
         FL  |  -.0347376   .0019795   -17.55   0.000    -.0386173   -.0308579
         KY  |   .3140369   .0020134   155.97   0.000     .3100907    .3179832
         TN  |  -.1233107   .0019888   -62.00   0.000    -.1272088   -.1194127
         AL  |   -.017332   .0019894    -8.71   0.000    -.0212312   -.0134328
         MS  |  -.3342834    .001993  -167.73   0.000    -.3381897   -.3303772
         AR  |  -.2381752   .0020224  -117.77   0.000    -.2421389   -.2342114
         LA  |  -.1106752   .0019886   -55.65   0.000    -.1145729   -.1067776
         OK  |  -.1136294   .0020446   -55.58   0.000    -.1176367    -.109622
         TX  |   -.299321   .0019795  -151.21   0.000    -.3032008   -.2954413
         MT  |          0  (empty)
         ID  |          0  (empty)
         WY  |  -.2721632   .0105289   -25.85   0.000    -.2927995    -.251527
         CO  |   .1456171   .0020598    70.69   0.000     .1415799    .1496542
         NM  |   .0129867   .0025354     5.12   0.000     .0080173     .017956
         AZ  |  -.3143483   .0020934  -150.16   0.000    -.3184513   -.3102452
         UT  |  -.1744225   .0029791   -58.55   0.000    -.1802614   -.1685836
         NV  |   .7760279   .0020414   380.14   0.000     .7720267     .780029
         WA  |   .5990535   .0020348   294.41   0.000     .5950654    .6030416
         OR  |   .4579235   .0021932   208.79   0.000      .453625    .4622221
         CA  |   .6174168   .0019771   312.28   0.000     .6135417    .6212919
         AK  |   .4101329   .0026109   157.09   0.000     .4050156    .4152501
         HI  |          0  (omitted)
             |
        nind |
          2  |   .3203204   .0012452   257.24   0.000     .3178799     .322761
          3  |   .6713145   .0010879   617.08   0.000     .6691822    .6734467
          4  |   .3118357   .0010907   285.90   0.000     .3096979    .3139734
          5  |   1.114419   .0010913  1021.21   0.000      1.11228    1.116558
          6  |  -.0994647   .0011029   -90.18   0.000    -.1016263    -.097303
          7  |  -.0177429   .0010993   -16.14   0.000    -.0198975   -.0155883
          8  |   .4119306   .0010879   378.64   0.000     .4097983    .4140629
          9  |   .8279864   .0010924   757.98   0.000     .8258454    .8301274
         10  |   .1287048   .0011075   116.22   0.000     .1265342    .1308754
         11  |   .3886677   .0010972   354.25   0.000     .3865173     .390818
             |
       nocc3 |
          2  |   .0050882   .0001287    39.52   0.000     .0048359    .0053405
          3  |   .1295078     .00014   925.37   0.000     .1292335    .1297821
          4  |   .4785647   .0001889  2532.82   0.000     .4781944     .478935
             |
     quarter |
          2  |  -.0234708   .0001175  -199.68   0.000    -.0237012   -.0232404
          3  |  -.0177911    .000119  -149.48   0.000    -.0180244   -.0175578
          4  |  -.0396199   .0001183  -334.79   0.000    -.0398519    -.039388
             |
        year |
       1984  |  -.0839395   .0003286  -255.47   0.000    -.0845835   -.0832956
       1985  |    -.09058   .0003555  -254.80   0.000    -.0912768   -.0898833
       1986  |  -.1586867   .0003305  -480.17   0.000    -.1593344    -.158039
       1987  |  -.1842478   .0003327  -553.82   0.000    -.1848999   -.1835958
       1988  |   -.145427   .0003301  -440.52   0.000     -.146074   -.1447799
       1989  |  -.1993739   .0003173  -628.34   0.000    -.1999958    -.198752
       1990  |  -.2745752     .00032  -858.00   0.000    -.2752024    -.273948
       1991  |  -.2640697   .0003207  -823.37   0.000    -.2646983   -.2634411
       1992  |  -.2386766   .0003178  -750.96   0.000    -.2392995   -.2380536
       1993  |  -.2607163   .0003175  -821.10   0.000    -.2613386    -.260094
       1996  |  -.2942464    .000339  -867.96   0.000    -.2949108   -.2935819
       1997  |   -.326092   .0003377  -965.57   0.000    -.3267539   -.3254301
       1998  |  -.3475152   .0003385 -1026.73   0.000    -.3481786   -.3468518
       1999  |  -.3927796   .0003401 -1154.80   0.000    -.3934462   -.3921129
       2000  |  -.3490957   .0003428 -1018.39   0.000    -.3497676   -.3484239
       2001  |  -.3495491   .0003469 -1007.71   0.000    -.3502289   -.3488692
       2002  |  -.3685704     .00035 -1053.10   0.000    -.3692564   -.3678845
       2003  |  -.3980486    .000354 -1124.32   0.000    -.3987424   -.3973547
       2004  |  -.4541638   .0003633 -1250.13   0.000    -.4548758   -.4534517
       2005  |  -.4367073    .000359 -1216.47   0.000    -.4374109   -.4360037
       2006  |  -.4637708   .0003551 -1305.85   0.000    -.4644669   -.4630747
       2007  |  -.4771148   .0003516 -1356.81   0.000     -.477804   -.4764256
       2008  |   -.524366    .000355 -1476.95   0.000    -.5250618   -.5236701
       2009  |  -.4874932   .0003558 -1370.31   0.000    -.4881905   -.4867959
       2010  |   -.491841     .00036 -1366.34   0.000    -.4925465   -.4911354
       2011  |   -.482159   .0003623 -1330.95   0.000    -.4828691    -.481449
       2012  |  -.4802193   .0003585 -1339.65   0.000    -.4809219   -.4795167
       2013  |  -.4815574   .0003613 -1332.79   0.000    -.4822656   -.4808492
       2014  |  -.5409125    .000365 -1482.03   0.000    -.5416279   -.5401972
       2015  |  -.5069137   .0003595 -1409.95   0.000    -.5076184   -.5062091
       2016  |  -.4299643    .000351 -1224.83   0.000    -.4306523   -.4292762
       2017  |  -.5538225   .0003634 -1523.96   0.000    -.5545348   -.5531102
       2018  |  -.6286182   .0003627 -1733.09   0.000    -.6293291   -.6279073
       2019  |  -.5690074   .0003585 -1587.05   0.000    -.5697101   -.5683047
             |
       _cons |  -2.975429    .002587 -1150.14   0.000      -2.9805   -2.970359
------------------------------------------------------------------------------

.         predict pu1b1f
(option pr assumed; Pr(covered))
(422,997 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.n
> ind i.nocc3 i.quarter i.year if nhblack == 0 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -3.788e+09  
Iteration 1:   log likelihood = -2.716e+09  
Iteration 2:   log likelihood = -2.659e+09  
Iteration 3:   log likelihood = -2.658e+09  
Iteration 4:   log likelihood = -2.658e+09  
Iteration 5:   log likelihood = -2.658e+09  

Probit regression                               Number of obs     = 9360549016
                                                LR chi2(124)      =   2.26e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -2.658e+09                     Pseudo R2         =     0.2982

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0782441   .0000447  1748.86   0.000     .0781564    .0783318
       exper |    .088427     .00004  2212.61   0.000     .0883487    .0885053
      exper2 |  -.0042104   2.97e-06 -1416.04   0.000    -.0042163   -.0042046
      exper3 |   .0001112   1.03e-07  1080.18   0.000      .000111    .0001114
      exper4 |  -1.07e-06   1.15e-09  -930.53   0.000    -1.07e-06   -1.06e-06
        edex |  -.0014246   1.66e-06  -860.14   0.000    -.0014278   -.0014213
             |
       ee_cl |
          2  |  -.0396195   .0002152  -184.13   0.000    -.0400413   -.0391978
          3  |  -.2465703   .0002365 -1042.38   0.000    -.2470339   -.2461067
          4  |  -.3078963   .0003136  -981.68   0.000     -.308511   -.3072815
          5  |  -.0825109   .0003202  -257.67   0.000    -.0831385   -.0818833
          6  |  -.0837162   .0002494  -335.74   0.000     -.084205   -.0832275
          7  |  -.2113991   .0002664  -793.54   0.000    -.2119213    -.210877
          8  |  -.3025057   .0003145  -961.89   0.000    -.3031221   -.3018893
          9  |   .0100358   .0003545    28.31   0.000     .0093409    .0107307
         10  |  -.1270707   .0002998  -423.88   0.000    -.1276583   -.1264832
         11  |  -.2186109   .0003056  -715.38   0.000    -.2192098   -.2180119
         12  |  -.2199062   .0003297  -667.00   0.000    -.2205524     -.21926
         13  |   .0853549   .0004064   210.04   0.000     .0845584    .0861514
         14  |  -.1021619   .0003454  -295.76   0.000    -.1028389   -.1014849
         15  |  -.1947577   .0003391  -574.39   0.000    -.1954223   -.1940932
         16  |  -.1604294   .0003459  -463.85   0.000    -.1611072   -.1597515
             |
        marr |  -.0098883   .0000423  -233.66   0.000    -.0099712   -.0098053
       partt |  -.3291996   .0000523 -6293.87   0.000    -.3293021   -.3290971
      public |   1.094926   .0000621  1.8e+04   0.000     1.094804    1.095048
        cmsa |   .1026089   .0000516  1990.29   0.000     .1025079    .1027099
             |
       state |
         NH  |  -.0904598    .000413  -219.00   0.000    -.0912694   -.0896502
         VT  |  -.0405568   .0004589   -88.38   0.000    -.0414562   -.0396574
         MA  |   .1403425   .0003136   447.52   0.000     .1397278    .1409571
         RI  |   .2162457   .0003822   565.84   0.000     .2154966    .2169947
         CT  |   .1865649   .0003311   563.42   0.000     .1859159    .1872139
         NY  |   .4357638    .000301  1447.76   0.000     .4351738    .4363537
         NJ  |   .2086733   .0003148   662.82   0.000     .2080562    .2092903
         PA  |   .1351364   .0003041   444.38   0.000     .1345404    .1357325
         OH  |   .0479024    .000303   158.09   0.000     .0473085    .0484962
         IN  |  -.2006775   .0003163  -634.51   0.000    -.2012973   -.2000576
         IL  |   .0101144    .000306    33.05   0.000     .0095146    .0107141
         MI  |   .2446825   .0003055   800.97   0.000     .2440838    .2452812
         WI  |   .0523796   .0003125   167.61   0.000     .0517671    .0529921
         MN  |   .2618744     .00031   844.73   0.000     .2612668     .262482
         IA  |  -.1241012   .0003403  -364.70   0.000    -.1247681   -.1234343
         MO  |  -.2566262   .0003192  -803.91   0.000    -.2572519   -.2560005
         ND  |  -.3679162   .0005789  -635.53   0.000    -.3690509   -.3667816
         SD  |  -.5119162   .0005303  -965.33   0.000    -.5129556   -.5108768
         NE  |  -.2561515   .0003691  -693.94   0.000     -.256875    -.255428
         KS  |  -.4898643   .0003499 -1399.86   0.000    -.4905501   -.4891784
         DE  |   -.125783   .0008314  -151.29   0.000    -.1274125   -.1241534
         MD  |  -.1344193   .0003295  -407.98   0.000     -.135065   -.1337735
         DC  |  -.4102123   .0005801  -707.12   0.000    -.4113493   -.4090753
         VA  |  -.6508672   .0003247 -2004.65   0.000    -.6515036   -.6502309
         WV  |  -.1034006    .000398  -259.79   0.000    -.1041807   -.1026205
         NC  |  -.9336898   .0003366 -2774.23   0.000    -.9343495   -.9330302
         SC  |  -.9936562   .0003948 -2516.91   0.000      -.99443   -.9928824
         GA  |   -.752025   .0003332 -2256.72   0.000    -.7526782   -.7513719
         FL  |  -.3520423   .0003129 -1125.19   0.000    -.3526555   -.3514291
         KY  |  -.3248424   .0003271  -993.18   0.000    -.3254835   -.3242014
         TN  |  -.5576882   .0003309 -1685.44   0.000    -.5583367   -.5570397
         AL  |  -.3465192     .00035  -990.17   0.000    -.3472051   -.3458333
         MS  |   -.772236    .000394 -1959.80   0.000    -.7730083   -.7714637
         AR  |  -.6398115   .0003738 -1711.54   0.000    -.6405442   -.6390788
         LA  |  -.6194951   .0003739 -1656.93   0.000    -.6202279   -.6187623
         OK  |   -.463365   .0003464 -1337.79   0.000    -.4640439   -.4626862
         TX  |  -.6343312   .0003091 -2052.19   0.000     -.634937   -.6337254
         MT  |   .0862499   .0004262   202.36   0.000     .0854145    .0870853
         ID  |  -.4568811   .0004242 -1077.00   0.000    -.4577126   -.4560497
         WY  |  -.6213581   .0006208 -1000.87   0.000    -.6225749   -.6201413
         CO  |  -.2202395   .0003341  -659.26   0.000    -.2208943   -.2195848
         NM  |  -.4318776   .0004558  -947.46   0.000     -.432771   -.4309842
         AZ  |  -.4735768   .0003404 -1391.33   0.000     -.474244   -.4729097
         UT  |  -.4564108   .0003733 -1222.60   0.000    -.4571425   -.4556791
         NV  |   .1976416   .0003711   532.57   0.000     .1969143     .198369
         WA  |    .379794   .0003124  1215.77   0.000     .3791817    .3804063
         OR  |   .2740552   .0003248   843.69   0.000     .2734186    .2746919
         CA  |   .2662335   .0003002   886.77   0.000     .2656451     .266822
         AK  |   .3232782   .0004513   716.30   0.000     .3223936    .3241628
         HI  |   .4163156   .0005187   802.67   0.000      .415299    .4173321
             |
        nind |
          2  |   .3920864   .0003906  1003.74   0.000     .3913208     .392852
          3  |   .6498138   .0003359  1934.82   0.000     .6491556    .6504721
          4  |   .6277959   .0003363  1867.00   0.000     .6271368    .6284549
          5  |   1.289209   .0003393  3799.07   0.000     1.288544    1.289874
          6  |   .0753744   .0003486   216.20   0.000     .0746911    .0760577
          7  |   .1013958   .0003455   293.48   0.000     .1007186     .102073
          8  |   .6956303   .0003359  2071.11   0.000      .694972    .6962886
          9  |   1.226178   .0003375  3633.47   0.000     1.225517     1.22684
         10  |    .365935    .000355  1030.66   0.000     .3652391    .3666309
         11  |   .6339426   .0003431  1847.69   0.000     .6332701     .634615
             |
       nocc3 |
          2  |  -.0521353   .0000561  -929.48   0.000    -.0522453   -.0520254
          3  |   .0079292   .0000717   110.54   0.000     .0077886    .0080698
          4  |   .6709209   .0000847  7918.53   0.000     .6707548     .671087
             |
     quarter |
          2  |  -.0035001   .0000538   -65.07   0.000    -.0036056   -.0033947
          3  |   .0010084   .0000547    18.45   0.000     .0009012    .0011155
          4  |  -.0138496   .0000537  -257.75   0.000    -.0139549   -.0137443
             |
        year |
       1984  |   -.062326   .0001437  -433.67   0.000    -.0626077   -.0620443
       1985  |  -.0978318    .000157  -623.11   0.000    -.0981395   -.0975241
       1986  |   -.118847   .0001455  -816.67   0.000    -.1191323   -.1185618
       1987  |  -.1374376   .0001464  -938.72   0.000    -.1377246   -.1371507
       1988  |  -.1522119   .0001467 -1037.88   0.000    -.1524994   -.1519245
       1989  |   -.182709   .0001422 -1284.76   0.000    -.1829878   -.1824303
       1990  |  -.1799533   .0001423 -1264.80   0.000    -.1802322   -.1796744
       1991  |  -.2026493   .0001432 -1415.00   0.000      -.20293   -.2023686
       1992  |  -.1805182    .000142 -1271.35   0.000    -.1807965   -.1802399
       1993  |   -.181427   .0001419 -1278.43   0.000    -.1817051   -.1811488
       1996  |  -.1828858   .0001495 -1222.96   0.000    -.1831789   -.1825927
       1997  |  -.2045067   .0001499 -1364.11   0.000    -.2048006   -.2042129
       1998  |  -.2296744   .0001511 -1519.63   0.000    -.2299706   -.2293782
       1999  |  -.2415868   .0001526 -1583.36   0.000    -.2418859   -.2412878
       2000  |  -.2362317   .0001538 -1535.67   0.000    -.2365332   -.2359302
       2001  |  -.2330217    .000155 -1503.26   0.000    -.2333256   -.2327179
       2002  |  -.2446396   .0001558 -1570.00   0.000     -.244945   -.2443342
       2003  |  -.2567185   .0001569 -1636.40   0.000     -.257026    -.256411
       2004  |  -.2690314   .0001575 -1708.06   0.000    -.2693402   -.2687227
       2005  |  -.2818206   .0001571 -1793.44   0.000    -.2821286   -.2815126
       2006  |  -.2888304   .0001576 -1832.52   0.000    -.2891394   -.2885215
       2007  |  -.2792595   .0001567 -1782.48   0.000    -.2795666   -.2789524
       2008  |  -.2584415   .0001558 -1658.65   0.000    -.2587469   -.2581361
       2009  |  -.2590377   .0001563 -1657.57   0.000     -.259344   -.2587314
       2010  |  -.2727121   .0001591 -1713.67   0.000     -.273024   -.2724002
       2011  |  -.2736143   .0001611 -1698.91   0.000      -.27393   -.2732987
       2012  |  -.3145973   .0001626 -1934.28   0.000     -.314916   -.3142785
       2013  |  -.2926086   .0001634 -1790.44   0.000    -.2929289   -.2922883
       2014  |   -.310059    .000165 -1879.34   0.000    -.3103823   -.3097356
       2015  |  -.3125234    .000165 -1894.18   0.000    -.3128467      -.3122
       2016  |  -.3087828    .000163 -1894.05   0.000    -.3091023   -.3084632
       2017  |  -.3347711   .0001641 -2039.99   0.000    -.3350927   -.3344494
       2018  |  -.3320773   .0001643 -2021.60   0.000    -.3323993   -.3317554
       2019  |   -.340975   .0001653 -2062.30   0.000    -.3412991    -.340651
             |
       _cons |  -3.227697    .000692 -4664.27   0.000    -3.229054   -3.226341
------------------------------------------------------------------------------

.         predict pu1b0f
(option pr assumed; Pr(covered))
(376,757 missing values generated)

. 
. gen theta2f = (pb1f/(1-pb1f)) * (pu1b1f/pu1b0f) if nhblack == 0 & covered == 1
(1,582,282 missing values generated)

. 
. replace theta2f = theta2f * hweight if nhblack == 0 & covered == 1
(163,675 real changes made)

. 
. kdensity lwage3 [aweight = theta2f] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(cu_wfestpt cu_wfde) nograph

. 
. graph twoway (connected u_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) l
> c(eltblue) lp(solid))  /// 
>                          (connected u_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth
> (medthick) lc(magenta) lp(solid))  ///
>                          (connected cu_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidt
> h(medthick) lc(eltblue) lp(longdash)),  /// 
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(l
> arge)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)
> ) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "non-Hisp white 
> - c.f.") c(1) pos(2) ring(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women Covered by Union - with Counterfactual", size(vlarge)
> )

. graph export "$figs/kde1wom/cu_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/cu_bhw_wom.png written in PNG format)

.         
. gen theta3f = (pb1f/(1-pb1f)) * ((1-pu1b1f)/(1-pu1b1f)) if nhblack == 0 & covered == 0
(756,605 missing values generated)

. 
. replace theta3f = theta3f * hweight if nhblack == 0 & covered == 0
(989,352 real changes made)

. 
. kdensity lwage3 [aweight = theta3f] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(cn_wfestpt cn_wfde) nograph

. 
. graph twoway (connected n_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) l
> c(eltblue) lp(solid))  /// 
>                          (connected n_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth
> (medthick) lc(magenta) lp(solid))  ///
>                          (connected cn_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidt
> h(medthick) lc(eltblue) lp(longdash)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(l
> arge)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)
> ) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "non-Hisp white 
> - c.f.") c(1) pos(2) ring(0) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women not Covered by Union - with Counterfactual", size(vla
> rge))

. graph export "$figs/kde1wom/cn_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/cn_bhw_wom.png written in PNG format)

.         
. restore

. 
end of do-file

