--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/dfl1/dfl1.log
  log type:  text
 opened on:  26 Mar 2021, 13:14:11

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extended to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
. **      replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2019) 
(2,831 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,792 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,058 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,609 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** drop self employed and w/o pay
. keep if (classx < 5 & year < 1994) | (class94 < 6 & year >= 1994)
(813 observations deleted)

. ********************************************************************************
. 
. drop if year < 1983
(556,442 observations deleted)

. 
. ** men
. preserve

. keep if sex == 1
(2,033,247 observations deleted)

. 
. qui sum lwage3, detail

. 
. gen xstep = (r(max) - r(min)) / 200

. 
. gen kwage = r(min) + (_n-1)*xstep if _n <= 200
(2,097,528 missing values generated)

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(wmestpt wmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2, at(kwage) gauss width(0.065) ///
>         generate(bmestpt bmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 3, at(kwage) gauss width(0.065) ///
>         generate(hmestpt hmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_wmestpt u_wmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(n_wmestpt n_wmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_bmestpt u_bmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(nbmestpt n_bmde) nograph

.         
. ** lab wmestpt "non hisp white men estimation points"
. ** lab wmde "non hisp white men density estimate"
. 
. graph twoway (connected wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(so
> lid))  /// 
>                          (connected bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(ma
> genta) lp(solid))  ///
>                          (connected hmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(mi
> dgreen) lp(solid)), ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "Hispanic") c(1) pos(2) ring(0
> ) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Men", size(vlarge))

. graph export "$figs/kde1men/bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/bhw_men.png written in PNG format)

. 
. graph twoway (connected u_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected u_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsize(*.
> 5) size(large) region(lcolor(none))) ///
>                          subtitle("Men Covered by Union", size(vlarge))

. graph export "$figs/kde1men/u_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/u_bhw_men.png written in PNG format)

. 
. graph twoway (connected n_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected n_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsize(*.
> 5) size(large) region(lcolor(none))) ///
>                          subtitle("Men not Covered by Union", size(vlarge))

. graph export "$figs/kde1men/n_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/n_bhw_men.png written in PNG format)

. 
. ** probability of race that depends on other covariates
. 
. local nhr w b

. 
. clonevar nhrace = hisprace
(128,836 missing values generated)

. 
. replace nhrace =. if nhrace == 3
(209,055 real changes made, 209,055 to missing)

. 
. keep if inrange(nhrace, 1, 2)
(337,891 observations deleted)

. 
. gen nhblack = nhrace - 1

. 
. gen finalwt1 = round(eweight)

. 
. drop nind

. 
. rename nind2 nind

. 
. drop nocc2

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(1377645 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(1583534 differences between nocc2 and nocc3)

. 
. drop edex

. 
. gen edex = educ*exper

. 
. probit nhblack educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.116e+09  
Iteration 1:   log likelihood = -3.534e+09  
Iteration 2:   log likelihood = -3.507e+09  
Iteration 3:   log likelihood = -3.506e+09  
Iteration 4:   log likelihood = -3.506e+09  
Iteration 5:   log likelihood = -3.506e+09  
Iteration 6:   log likelihood = -3.506e+09  

Probit regression                               Number of obs     =  1.140e+10
                                                LR chi2(132)      =   1.22e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.506e+09                     Pseudo R2         =     0.1481

------------------------------------------------------------------------------
     nhblack |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0030339   .0000397    76.34   0.000      .002956    .0031118
       exper |   .1070463   .0000315  3398.04   0.000     .1069846    .1071081
      exper2 |  -.0046861   2.30e-06 -2036.46   0.000    -.0046906   -.0046816
      exper3 |   .0000912   7.87e-08  1159.37   0.000     .0000911    .0000914
      exper4 |  -6.46e-07   8.67e-10  -745.30   0.000    -6.48e-07   -6.44e-07
        edex |  -.0014732   1.34e-06 -1100.07   0.000    -.0014759   -.0014706
             |
       ee_cl |
          2  |    .150507    .000129  1166.33   0.000     .1502541    .1507599
          3  |   .0392259   .0001591   246.59   0.000     .0389141    .0395377
          4  |  -.1880886   .0002476  -759.57   0.000     -.188574   -.1876033
          5  |   .0664472   .0001831   362.99   0.000     .0660884    .0668059
          6  |   .0561196   .0001605   349.68   0.000      .055805    .0564342
          7  |   .0283204   .0001821   155.49   0.000     .0279634    .0286774
          8  |  -.1902642   .0002392  -795.54   0.000    -.1907329   -.1897954
          9  |   .1567518   .0002342   669.43   0.000     .1562929    .1572108
         10  |   .0631586   .0002101   300.61   0.000     .0627468    .0635704
         11  |   .0466147   .0002208   211.14   0.000      .046182    .0470474
         12  |  -.1300016   .0002538  -512.18   0.000    -.1304991   -.1295042
         13  |   .3200385   .0002937  1089.60   0.000     .3194628    .3206142
         14  |   .0728254   .0002556   284.90   0.000     .0723244    .0733264
         15  |   .0690454   .0002572   268.48   0.000     .0685414    .0695495
         16  |  -.0284591   .0002746  -103.63   0.000    -.0289973   -.0279209
             |
        marr |  -.2852509    .000038 -7508.67   0.000    -.2853253   -.2851764
       partt |   .0880457   .0000624  1411.51   0.000     .0879235     .088168
      public |   .2582473   .0000684  3777.45   0.000     .2581133    .2583813
        cmsa |   .4636107   .0000506  9162.42   0.000     .4635115    .4637099
             |
       state |
         NH  |   .0605554   .0009909    61.11   0.000     .0586132    .0624975
         VT  |    .024966   .0012573    19.86   0.000     .0225017    .0274304
         MA  |   .6182579   .0007958   776.92   0.000     .6166982    .6198176
         RI  |   .5105283   .0008481   602.00   0.000     .5088661    .5121904
         CT  |   .9341271   .0007995  1168.38   0.000     .9325601    .9356941
         NY  |   1.164162   .0007864  1480.45   0.000     1.162621    1.165703
         NJ  |   1.109481   .0007905  1403.45   0.000     1.107932    1.111031
         PA  |   .7849137   .0007885   995.40   0.000     .7833682    .7864592
         OH  |    .891076   .0007873  1131.87   0.000      .889533     .892619
         IN  |   .7983957   .0007926  1007.25   0.000     .7968421    .7999493
         IL  |   1.128323   .0007873  1433.13   0.000      1.12678    1.129866
         MI  |   .9553985   .0007883  1211.90   0.000     .9538534    .9569437
         WI  |   .5242456   .0007975   657.33   0.000     .5226825    .5258088
         MN  |   .5004448   .0007981   627.06   0.000     .4988806     .502009
         IA  |    .244393   .0008482   288.14   0.000     .2427306    .2460554
         MO  |   .9745067   .0007913  1231.49   0.000     .9729558    .9760577
         ND  |   .3045788   .0012146   250.76   0.000     .3021983    .3069594
         SD  |   .1902121   .0011254   169.01   0.000     .1880063    .1924178
         NE  |   .5796187   .0008318   696.80   0.000     .5779884     .581249
         KS  |   .8060039   .0008041  1002.39   0.000     .8044279    .8075799
         DE  |   1.750742   .0009596  1824.37   0.000     1.748861    1.752623
         MD  |   1.713293   .0007896  2169.95   0.000     1.711745     1.71484
         DC  |   2.300072   .0008168  2815.90   0.000     2.298471    2.301673
         VA  |   1.496493    .000788  1899.16   0.000     1.494948    1.498037
         WV  |   .5194404   .0008733   594.77   0.000     .5177287    .5211521
         NC  |   1.603132   .0007874  2035.91   0.000     1.601588    1.604675
         SC  |   1.785686   .0007915  2256.06   0.000     1.784134    1.787237
         GA  |   1.815726    .000787  2307.04   0.000     1.814184    1.817269
         FL  |   1.358301   .0007868  1726.32   0.000     1.356759    1.359843
         KY  |    .881237   .0007959  1107.17   0.000      .879677     .882797
         TN  |    1.28261   .0007899  1623.85   0.000     1.281062    1.284158
         AL  |   1.650855   .0007914  2085.92   0.000     1.649304    1.652407
         MS  |    2.05079    .000792  2589.38   0.000     2.049238    2.052342
         AR  |   1.325311    .000798  1660.81   0.000     1.323747    1.326875
         LA  |   1.706233   .0007922  2153.76   0.000      1.70468    1.707786
         OK  |   .8528292   .0008005  1065.40   0.000     .8512602    .8543981
         TX  |    1.32842    .000786  1690.13   0.000      1.32688    1.329961
         MT  |   -.128296   .0013148   -97.58   0.000     -.130873    -.125719
         ID  |   -.034737   .0009953   -34.90   0.000    -.0366878   -.0327862
         WY  |   .1983649   .0013032   152.22   0.000     .1958107     .200919
         CO  |   .6925052   .0008016   863.90   0.000     .6909341    .6940763
         NM  |    .728791   .0008727   835.10   0.000     .7270805    .7305014
         AZ  |   .6610769   .0007994   826.94   0.000       .65951    .6626437
         UT  |  -.0001053   .0008562    -0.12   0.902    -.0017833    .0015728
         NV  |   .9406069   .0008104  1160.73   0.000     .9390187    .9421952
         WA  |   .5347683   .0007977   670.40   0.000     .5332049    .5363317
         OR  |   .2267632   .0008191   276.84   0.000     .2251578    .2283686
         CA  |   .9844436   .0007861  1252.24   0.000     .9829028    .9859844
         AK  |   .6328877   .0009361   676.11   0.000      .631053    .6347224
         HI  |   .9079422   .0009356   970.41   0.000     .9061084     .909776
             |
        nind |
          2  |  -.0176484   .0001465  -120.48   0.000    -.0179355   -.0173613
          3  |   .1837482   .0001324  1387.65   0.000     .1834887    .1840077
          4  |   .1274139   .0001367   931.96   0.000      .127146    .1276819
          5  |   .2485519   .0001394  1783.01   0.000     .2482787    .2488252
          6  |   .2629451   .0001563  1682.17   0.000     .2626388    .2632515
          7  |   .2149887   .0001396  1540.30   0.000     .2147151    .2152622
          8  |   .6085871   .0001521  4000.33   0.000     .6082889    .6088852
          9  |   .2034911   .0001604  1268.81   0.000     .2031768    .2038055
         10  |   .1890969   .0001617  1169.63   0.000     .1887801    .1894138
         11  |   .0277482   .0001614   171.90   0.000     .0274318    .0280646
             |
       nocc2 |
          2  |   .2441736   .0000982  2486.07   0.000     .2439811    .2443661
          3  |   .0901767    .000093   969.46   0.000     .0899944     .090359
          4  |   .3126309   .0001027  3045.35   0.000     .3124297    .3128321
          5  |   .2015062   .0001602  1258.03   0.000     .2011922    .2018201
          6  |   .5781673   .0000892  6479.82   0.000     .5779924    .5783422
          7  |   .2323316   .0000967  2403.30   0.000     .2321421    .2325211
          8  |   .0318116   .0002229   142.69   0.000     .0313747    .0322486
          9  |   .6531593   .0000838  7794.59   0.000     .6529951    .6533235
         10  |   .5010607   .0000884  5668.81   0.000     .5008874    .5012339
         11  |   .2437075   .0000883  2759.25   0.000     .2435344    .2438806
         12  |   .6868168   .0000855  8034.21   0.000     .6866493    .6869844
             |
     quarter |
          2  |  -.0004721   .0000468   -10.08   0.000    -.0005639   -.0003803
          3  |   .0046547   .0000474    98.25   0.000     .0045619    .0047476
          4  |   .0061861    .000047   131.58   0.000      .006094    .0062783
             |
        year |
       1984  |    .015917   .0001317   120.88   0.000     .0156589    .0161751
       1985  |   .0324961    .000143   227.29   0.000     .0322159    .0327763
       1986  |   .0459276   .0001319   348.31   0.000     .0456691     .046186
       1987  |   .0585281   .0001323   442.44   0.000     .0582688    .0587874
       1988  |   .0579126   .0001324   437.26   0.000      .057653    .0581722
       1989  |   .0804654   .0001272   632.48   0.000     .0802161    .0807148
       1990  |   .0795577   .0001274   624.62   0.000     .0793081    .0798074
       1991  |   .0757508   .0001281   591.53   0.000     .0754998    .0760018
       1992  |   .0552171   .0001282   430.84   0.000     .0549659    .0554683
       1993  |   .0625845    .000128   488.95   0.000     .0623336    .0628353
       1996  |   .0321399   .0001376   233.62   0.000     .0318703    .0324096
       1997  |   .0372264   .0001371   271.44   0.000     .0369576    .0374952
       1998  |   .0647124   .0001362   475.14   0.000     .0644455    .0649794
       1999  |   .0647386   .0001379   469.46   0.000     .0644683    .0650088
       2000  |   .0874231   .0001394   627.34   0.000       .08715    .0876962
       2001  |    .058876   .0001422   414.13   0.000     .0585974    .0591547
       2002  |   .0697829    .000142   491.27   0.000     .0695045    .0700613
       2003  |    .046354   .0001441   321.75   0.000     .0460716    .0466364
       2004  |   .0456811   .0001436   318.09   0.000     .0453997    .0459626
       2005  |   .0584021   .0001422   410.75   0.000     .0581234    .0586808
       2006  |   .0817619   .0001409   580.44   0.000     .0814859     .082038
       2007  |   .1096424   .0001392   787.59   0.000     .1093695    .1099152
       2008  |   .1069712   .0001396   766.29   0.000     .1066976    .1072448
       2009  |     .07955   .0001426   558.01   0.000     .0792706    .0798295
       2010  |   .0984726   .0001431   687.91   0.000     .0981921    .0987532
       2011  |   .0776526   .0001438   539.92   0.000     .0773707    .0779345
       2012  |   .0942345   .0001428   660.01   0.000     .0939546    .0945143
       2013  |   .1427129   .0001427   999.89   0.000     .1424332    .1429926
       2014  |   .1502733   .0001428  1052.18   0.000     .1499934    .1505532
       2015  |   .1839748   .0001417  1298.43   0.000     .1836971    .1842525
       2016  |   .1970871   .0001408  1399.35   0.000      .196811    .1973631
       2017  |   .1950195   .0001409  1384.02   0.000     .1947433    .1952957
       2018  |   .2082008   .0001401  1486.12   0.000     .2079262    .2084754
       2019  |   .1995215   .0001408  1417.45   0.000     .1992456    .1997974
             |
       _cons |  -3.692949   .0009172 -4026.29   0.000    -3.694747   -3.691151
------------------------------------------------------------------------------

.         predict pb1m
(option pr assumed; Pr(nhblack))
(376,290 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year if nhblack == 1 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -7.209e+08  
Iteration 1:   log likelihood = -5.535e+08  
Iteration 2:   log likelihood = -5.483e+08  
Iteration 3:   log likelihood = -5.483e+08  
Iteration 4:   log likelihood = -5.483e+08  

Probit regression                               Number of obs     = 1331935146
                                                LR chi2(132)      =   3.45e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -5.483e+08                     Pseudo R2         =     0.2394

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0211687   .0001118   189.36   0.000     .0209496    .0213878
       exper |   .0432432   .0000882   490.23   0.000     .0430703    .0434161
      exper2 |  -.0016068   6.11e-06  -262.89   0.000    -.0016188   -.0015948
      exper3 |   .0000319   1.98e-07   161.20   0.000     .0000315    .0000323
      exper4 |  -2.69e-07   2.11e-09  -127.40   0.000    -2.73e-07   -2.64e-07
        edex |    .000126   3.44e-06    36.62   0.000     .0001193    .0001328
             |
       ee_cl |
          2  |   .1847709   .0004073   453.60   0.000     .1839725    .1855693
          3  |   .2346462   .0004858   483.05   0.000     .2336941    .2355983
          4  |   .1619919   .0007124   227.40   0.000     .1605956    .1633881
          5  |   .0059745   .0005171    11.55   0.000     .0049611     .006988
          6  |    .202971   .0004669   434.69   0.000     .2020558    .2038862
          7  |   .2652227   .0005223   507.84   0.000      .264199    .2662463
          8  |   .1052932   .0006789   155.09   0.000     .1039625    .1066239
          9  |   .0493899   .0006128    80.60   0.000      .048189    .0505909
         10  |    .236467   .0005724   413.12   0.000     .2353451    .2375889
         11  |   .2428354   .0006049   401.46   0.000     .2416499     .244021
         12  |    .107079   .0007003   152.91   0.000     .1057066    .1084515
         13  |   .2028452   .0007321   277.09   0.000     .2014103      .20428
         14  |   .2626365   .0006701   391.92   0.000      .261323    .2639499
         15  |   .2931905   .0006818   430.03   0.000     .2918542    .2945268
         16  |   .0109932   .0007425    14.81   0.000     .0095379    .0124485
             |
        marr |   .0614274   .0000941   652.62   0.000     .0612429    .0616119
       partt |  -.3313673   .0001731 -1914.75   0.000    -.3317065   -.3310281
      public |   .8261993   .0001469  5622.53   0.000     .8259113    .8264873
        cmsa |   .2463944   .0001547  1592.34   0.000     .2460911    .2466977
             |
       state |
         NH  |   -.040557   .0044481    -9.12   0.000    -.0492752   -.0318389
         VT  |  -.2948279   .0061342   -48.06   0.000    -.3068506   -.2828051
         MA  |  -.0491885    .003658   -13.45   0.000     -.056358    -.042019
         RI  |  -.0580031   .0037712   -15.38   0.000    -.0653944   -.0506117
         CT  |   .0602982   .0036569    16.49   0.000     .0531307    .0674656
         NY  |   .5025217   .0036366   138.18   0.000     .4953941    .5096493
         NJ  |   .2115666   .0036421    58.09   0.000     .2044282     .218705
         PA  |   .2164827   .0036413    59.45   0.000     .2093459    .2236196
         OH  |   .0631206   .0036391    17.35   0.000     .0559881     .070253
         IN  |   .0116192   .0036486     3.18   0.001     .0044681    .0187704
         IL  |   .2885802   .0036381    79.32   0.000     .2814497    .2957107
         MI  |   .3919527     .00364   107.68   0.000     .3848183     .399087
         WI  |   .0435646   .0036613    11.90   0.000     .0363886    .0507406
         MN  |   .0984566   .0036654    26.86   0.000     .0912726    .1056406
         IA  |  -.1112068    .003829   -29.04   0.000    -.1187116    -.103702
         MO  |    .045353   .0036451    12.44   0.000     .0382087    .0524973
         ND  |  -.0199001   .0054011    -3.68   0.000    -.0304861    -.009314
         SD  |  -.3656074   .0049091   -74.48   0.000     -.375229   -.3559858
         NE  |  -.0763139   .0037436   -20.39   0.000    -.0836512   -.0689765
         KS  |  -.2238455   .0036741   -60.93   0.000    -.2310465   -.2166444
         DE  |  -.1754873   .0038539   -45.53   0.000    -.1830409   -.1679338
         MD  |  -.0305625   .0036388    -8.40   0.000    -.0376944   -.0234305
         DC  |  -.0902582   .0036525   -24.71   0.000    -.0974169   -.0830994
         VA  |  -.5571542   .0036394  -153.09   0.000    -.5642872   -.5500211
         WV  |    -.10681   .0038664   -27.63   0.000    -.1143879    -.099232
         NC  |  -.8494955   .0036397  -233.40   0.000    -.8566292   -.8423618
         SC  |    -1.0202   .0036474  -279.71   0.000    -1.027349   -1.013051
         GA  |  -.6487615   .0036375  -178.36   0.000    -.6558908   -.6416322
         FL  |  -.5481283   .0036384  -150.65   0.000    -.5552594   -.5409973
         KY  |  -.0934166   .0036549   -25.56   0.000    -.1005801   -.0862531
         TN  |  -.4203174   .0036425  -115.39   0.000    -.4274565   -.4131784
         AL  |   -.377254   .0036418  -103.59   0.000    -.3843917   -.3701162
         MS  |    -.70488   .0036431  -193.48   0.000    -.7120203   -.6977397
         AR  |  -.5354786   .0036587  -146.36   0.000    -.5426494   -.5283077
         LA  |  -.5407963   .0036435  -148.43   0.000    -.5479374   -.5336553
         OK  |  -.4517528   .0036699  -123.10   0.000    -.4589457   -.4445599
         TX  |   -.614404   .0036372  -168.92   0.000    -.6215329   -.6072752
         MT  |  -.1709637   .0063608   -26.88   0.000    -.1834306   -.1584968
         ID  |  -.7502065   .0049864  -150.45   0.000    -.7599797   -.7404333
         WY  |  -.5490253   .0067194   -81.71   0.000    -.5621949   -.5358556
         CO  |  -.2382414    .003671   -64.90   0.000    -.2454365   -.2310462
         NM  |  -.6254386   .0039436  -158.59   0.000     -.633168   -.6177092
         AZ  |  -.6303243   .0036822  -171.18   0.000    -.6375412   -.6231074
         UT  |  -.9098096   .0041445  -219.52   0.000    -.9179327   -.9016865
         NV  |   .1812851   .0036706    49.39   0.000     .1740909    .1884793
         WA  |   .1970213     .00366    53.83   0.000     .1898478    .2041949
         OR  |   .1792281   .0037161    48.23   0.000     .1719447    .1865116
         CA  |    .156392   .0036368    43.00   0.000     .1492639      .16352
         AK  |   .0345633   .0039547     8.74   0.000     .0268123    .0423143
         HI  |  -.3987157   .0039536  -100.85   0.000    -.4064647   -.3909666
             |
        nind |
          2  |    .336112   .0004968   676.62   0.000     .3351384    .3370856
          3  |   .6892128   .0004629  1488.83   0.000     .6883055    .6901201
          4  |   .0625847   .0004794   130.54   0.000      .061645    .0635243
          5  |   .8117588   .0004753  1707.99   0.000     .8108273    .8126903
          6  |  -.1583024   .0005379  -294.29   0.000    -.1593567   -.1572482
          7  |  -.1164617   .0004902  -237.58   0.000    -.1174225    -.115501
          8  |   .1239603   .0004996   248.11   0.000     .1229811    .1249395
          9  |   .4028526     .00051   789.87   0.000     .4018529    .4038522
         10  |   .0814408   .0005288   154.01   0.000     .0804044    .0824773
         11  |    .317945    .000507   627.10   0.000     .3169512    .3189387
             |
       nocc2 |
          2  |   .2979451   .0003335   893.48   0.000     .2972915    .2985987
          3  |   .2344097   .0003227   726.50   0.000     .2337773    .2350421
          4  |   .7463646   .0003111  2399.47   0.000     .7457549    .7469742
          5  |   .8168574   .0004339  1882.78   0.000      .816007    .8177077
          6  |   .6337286   .0002819  2247.75   0.000      .633176    .6342812
          7  |   .3730173   .0003516  1060.85   0.000     .3723281    .3737065
          8  |   .3035301   .0009369   323.98   0.000     .3016938    .3053663
          9  |   .7516328   .0002704  2779.90   0.000     .7511029    .7521627
         10  |   .8739543   .0002835  3083.21   0.000     .8733987    .8745098
         11  |   .8967541   .0002881  3112.11   0.000     .8961894    .8973189
         12  |   .8185734   .0002734  2993.87   0.000     .8180375    .8191093
             |
     quarter |
          2  |  -.0116589   .0001205   -96.72   0.000    -.0118952   -.0114227
          3  |  -.0372422   .0001222  -304.68   0.000    -.0374817   -.0370026
          4  |  -.0362498   .0001213  -298.87   0.000    -.0364876   -.0360121
             |
        year |
       1984  |   -.101069   .0003188  -317.00   0.000    -.1016939   -.1004441
       1985  |  -.1996641     .00035  -570.53   0.000      -.20035   -.1989781
       1986  |    -.18737   .0003189  -587.61   0.000    -.1879949    -.186745
       1987  |  -.2403347   .0003209  -748.96   0.000    -.2409636   -.2397058
       1988  |  -.2052315   .0003209  -639.51   0.000    -.2058605   -.2046025
       1989  |  -.2894377   .0003088  -937.20   0.000     -.290043   -.2888324
       1990  |  -.3153122   .0003095 -1018.85   0.000    -.3159187   -.3147056
       1991  |  -.3135422   .0003112 -1007.49   0.000    -.3141521   -.3129322
       1992  |     -.3484   .0003128 -1113.66   0.000    -.3490132   -.3477868
       1993  |  -.3796848   .0003128 -1213.93   0.000    -.3802979   -.3790718
       1996  |   -.381329   .0003412 -1117.72   0.000    -.3819976   -.3806603
       1997  |  -.4319289   .0003419 -1263.43   0.000    -.4325989   -.4312588
       1998  |  -.4356561   .0003378 -1289.87   0.000    -.4363181   -.4349941
       1999  |  -.4510509    .000344 -1311.08   0.000    -.4517252   -.4503766
       2000  |  -.4791694   .0003493 -1371.60   0.000    -.4798541   -.4784847
       2001  |    -.51523   .0003617 -1424.45   0.000     -.515939   -.5145211
       2002  |  -.5047153   .0003605 -1399.91   0.000    -.5054219   -.5040086
       2003  |  -.5026313   .0003654 -1375.67   0.000    -.5033474   -.5019152
       2004  |  -.5829644   .0003724 -1565.27   0.000    -.5836944   -.5822344
       2005  |  -.6216885   .0003697 -1681.45   0.000    -.6224131   -.6209638
       2006  |  -.6742503   .0003653 -1845.49   0.000    -.6749663   -.6735342
       2007  |  -.6287128   .0003563 -1764.77   0.000    -.6294111   -.6280145
       2008  |  -.6267657   .0003597 -1742.31   0.000    -.6274708   -.6260606
       2009  |  -.6142626   .0003675 -1671.33   0.000     -.614983   -.6135423
       2010  |  -.6223758   .0003693 -1685.27   0.000    -.6230997    -.621652
       2011  |  -.6643179   .0003774 -1760.18   0.000    -.6650576   -.6635782
       2012  |  -.6332584   .0003725 -1699.90   0.000    -.6339886   -.6325283
       2013  |  -.6180733   .0003661 -1688.33   0.000    -.6187909   -.6173558
       2014  |  -.6647848   .0003699 -1797.25   0.000    -.6655098   -.6640599
       2015  |  -.6736387   .0003663 -1839.23   0.000    -.6743565   -.6729208
       2016  |  -.6848686   .0003651 -1875.69   0.000    -.6855842   -.6841529
       2017  |  -.6110028   .0003594 -1700.27   0.000    -.6117071   -.6102984
       2018  |  -.7014666   .0003614 -1941.05   0.000    -.7021749   -.7007583
       2019  |  -.7145813   .0003655 -1955.20   0.000    -.7152977    -.713865
             |
       _cons |  -2.449037   .0038935  -629.00   0.000    -2.456668   -2.441406
------------------------------------------------------------------------------

.         predict pu1b1m
(option pr assumed; Pr(covered))
(376,290 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year if nhblack == 0 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.833e+09  
Iteration 1:   log likelihood = -3.643e+09  
Iteration 2:   log likelihood = -3.581e+09  
Iteration 3:   log likelihood = -3.581e+09  
Iteration 4:   log likelihood = -3.581e+09  
Iteration 5:   log likelihood = -3.581e+09  

Probit regression                               Number of obs     =  1.005e+10
                                                LR chi2(132)      =   2.50e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.581e+09                     Pseudo R2         =     0.2591

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0442696    .000043  1030.47   0.000     .0441854    .0443538
       exper |   .0746633   .0000356  2097.84   0.000     .0745935     .074733
      exper2 |  -.0024914   2.56e-06  -973.38   0.000    -.0024964   -.0024864
      exper3 |   .0000599   8.68e-08   690.63   0.000     .0000598    .0000601
      exper4 |  -6.36e-07   9.56e-10  -665.23   0.000    -6.38e-07   -6.34e-07
        edex |  -.0011847   1.46e-06  -813.61   0.000    -.0011876   -.0011818
             |
       ee_cl |
          2  |   .0876889   .0001629   538.43   0.000     .0873697    .0880081
          3  |   .1002098   .0001924   520.90   0.000     .0998327    .1005868
          4  |  -.0687316   .0002784  -246.84   0.000    -.0692774   -.0681859
          5  |  -.1558087   .0002221  -701.55   0.000    -.1562439   -.1553734
          6  |    .133446   .0001891   705.52   0.000     .1330752    .1338167
          7  |    .152772   .0002114   722.67   0.000     .1523576    .1531863
          8  |  -.1372863   .0002691  -510.15   0.000    -.1378137   -.1367589
          9  |  -.0305667   .0002624  -116.50   0.000    -.0310809   -.0300524
         10  |   .1633471   .0002336   699.37   0.000     .1628893    .1638048
         11  |   .1234834   .0002444   505.21   0.000     .1230044    .1239625
         12  |  -.1590806   .0002787  -570.72   0.000     -.159627   -.1585343
         13  |   .1590606   .0003156   503.96   0.000      .158442    .1596792
         14  |   .1939407    .000273   710.36   0.000     .1934056    .1944758
         15  |   .1004385   .0002735   367.27   0.000     .0999025    .1009745
         16  |   -.162664   .0002919  -557.35   0.000     -.163236    -.162092
             |
        marr |   .0770158     .00004  1924.20   0.000     .0769374    .0770943
       partt |  -.3173914   .0000771 -4114.08   0.000    -.3175426   -.3172402
      public |   .8869019   .0000653  1.4e+04   0.000      .886774    .8870299
        cmsa |   .1843558   .0000439  4196.24   0.000     .1842697    .1844419
             |
       state |
         NH  |   -.256544   .0003797  -675.73   0.000    -.2572881   -.2557998
         VT  |  -.2355697   .0004249  -554.37   0.000    -.2364025   -.2347368
         MA  |   .0225951   .0002781    81.24   0.000       .02205    .0231403
         RI  |   .0430586   .0003492   123.31   0.000     .0423742     .043743
         CT  |   .0272613   .0002953    92.33   0.000     .0266826      .02784
         NY  |   .3602015   .0002648  1360.08   0.000     .3596824    .3607206
         NJ  |   .1949557   .0002771   703.48   0.000     .1944125    .1954989
         PA  |   .0918846   .0002664   344.91   0.000     .0913624    .0924067
         OH  |   .0576114   .0002651   217.30   0.000     .0570918     .058131
         IN  |  -.0345249   .0002731  -126.44   0.000    -.0350601   -.0339897
         IL  |   .1561256   .0002673   584.19   0.000     .1556018    .1566494
         MI  |   .1996851   .0002676   746.28   0.000     .1991606    .2002095
         WI  |   .0033373   .0002739    12.19   0.000     .0028005     .003874
         MN  |   .1162653   .0002746   423.32   0.000      .115727    .1168036
         IA  |  -.1075146    .000298  -360.75   0.000    -.1080987   -.1069304
         MO  |  -.0348055   .0002755  -126.34   0.000    -.0353455   -.0342655
         ND  |  -.3832863   .0005173  -740.96   0.000    -.3843001   -.3822724
         SD  |  -.5566416    .000474 -1174.28   0.000    -.5575707   -.5557126
         NE  |   -.301014   .0003274  -919.46   0.000    -.3016557   -.3003724
         KS  |  -.3159168   .0002988 -1057.36   0.000    -.3165024   -.3153312
         DE  |  -.2424891   .0007322  -331.19   0.000    -.2439242   -.2410541
         MD  |  -.2123465   .0002916  -728.11   0.000    -.2129181   -.2117749
         DC  |  -.2380435   .0005474  -434.90   0.000    -.2391163   -.2369707
         VA  |  -.6279762   .0002839 -2212.01   0.000    -.6285326   -.6274198
         WV  |    .005101   .0003297    15.47   0.000     .0044548    .0057473
         NC  |  -.9320932   .0002936 -3174.76   0.000    -.9326686   -.9315178
         SC  |  -.9397674   .0003385 -2776.13   0.000    -.9404309    -.939104
         GA  |  -.5919239   .0002869 -2063.10   0.000    -.5924862   -.5913615
         FL  |   -.485554   .0002752 -1764.34   0.000    -.4860933   -.4850146
         KY  |   -.192542   .0002829  -680.53   0.000    -.1930965   -.1919875
         TN  |  -.4722101   .0002849 -1657.59   0.000    -.4727684   -.4716517
         AL  |  -.3159378   .0002985 -1058.35   0.000    -.3165229   -.3153527
         MS  |  -.6316559   .0003299 -1914.42   0.000    -.6323026   -.6310092
         AR  |   -.644025    .000323 -1993.74   0.000    -.6446581   -.6433918
         LA  |   -.545282   .0003146 -1733.27   0.000    -.5458986   -.5446654
         OK  |  -.5166698    .000301 -1716.39   0.000    -.5172598   -.5160798
         TX  |   -.595388   .0002703 -2202.94   0.000    -.5959177   -.5948583
         MT  |    .010022   .0003842    26.09   0.000     .0092691     .010775
         ID  |  -.4311804    .000361 -1194.35   0.000     -.431888   -.4304728
         WY  |  -.3753756   .0004959  -756.89   0.000    -.3763476   -.3744035
         CO  |  -.2754124   .0002951  -933.43   0.000    -.2759907   -.2748341
         NM  |  -.5274112   .0004134 -1275.92   0.000    -.5282214    -.526601
         AZ  |  -.5454089   .0002989 -1824.67   0.000    -.5459947    -.544823
         UT  |  -.5145369   .0003221 -1597.37   0.000    -.5151683   -.5139056
         NV  |   .0635184   .0003237   196.21   0.000     .0628839    .0641529
         WA  |   .2536502   .0002751   921.90   0.000      .253111    .2541895
         OR  |   .0725688   .0002868   252.99   0.000     .0720066     .073131
         CA  |   .1454072   .0002638   551.13   0.000     .1448901    .1459243
         AK  |   .1763662   .0004042   436.30   0.000     .1755739    .1771585
         HI  |    .187403    .000483   388.03   0.000     .1864564    .1883496
             |
        nind |
          2  |   .4675264   .0001355  3451.47   0.000     .4672609    .4677919
          3  |    .487136   .0001281  3802.79   0.000     .4868849     .487387
          4  |   .0363402   .0001352   268.83   0.000     .0360753    .0366052
          5  |   .7958423   .0001331  5979.97   0.000     .7955815    .7961031
          6  |  -.2569421    .000181 -1419.73   0.000    -.2572968   -.2565874
          7  |  -.1831727   .0001435 -1276.63   0.000    -.1834539   -.1828915
          8  |   .1039691   .0001615   643.69   0.000     .1036526    .1042857
          9  |    .595321   .0001525  3903.15   0.000      .595022    .5956199
         10  |   .0900645   .0001711   526.37   0.000     .0897292    .0903999
         11  |    .504364   .0001523  3311.82   0.000     .5040655    .5046625
             |
       nocc2 |
          2  |   .3810254   .0001082  3521.35   0.000     .3808133    .3812375
          3  |   .2970632   .0000965  3079.68   0.000     .2968741    .2972522
          4  |   .9879455   .0001017  9711.49   0.000     .9877461    .9881449
          5  |   .9113394   .0001717  5306.81   0.000     .9110028     .911676
          6  |   .8519639   .0000983  8666.33   0.000     .8517713    .8521566
          7  |   .3470284   .0001135  3056.45   0.000     .3468059     .347251
          8  |   .5732693    .000282  2032.62   0.000     .5727166    .5738221
          9  |   .9441938   .0000933  1.0e+04   0.000     .9440109    .9443767
         10  |   1.094146   .0000896  1.2e+04   0.000      1.09397    1.094321
         11  |   1.169732   .0000874  1.3e+04   0.000      1.16956    1.169903
         12  |   1.209811   .0000906  1.3e+04   0.000     1.209634    1.209989
             |
     quarter |
          2  |  -.0162908    .000047  -346.53   0.000     -.016383   -.0161987
          3  |  -.0148933   .0000477  -312.30   0.000    -.0149867   -.0147998
          4  |  -.0194593   .0000472  -412.46   0.000    -.0195518   -.0193669
             |
        year |
       1984  |  -.0733863   .0001159  -633.05   0.000    -.0736135   -.0731591
       1985  |  -.1273105   .0001273 -1000.28   0.000    -.1275599    -.127061
       1986  |  -.1447804   .0001177 -1230.37   0.000     -.145011   -.1445497
       1987  |  -.1665406    .000119 -1399.89   0.000    -.1667738   -.1663074
       1988  |  -.1801177   .0001193 -1509.73   0.000    -.1803516   -.1798839
       1989  |   -.225248   .0001157 -1946.40   0.000    -.2254748   -.2250212
       1990  |  -.2485208   .0001164 -2135.54   0.000    -.2487489   -.2482927
       1991  |  -.2621551   .0001174 -2232.54   0.000    -.2623852   -.2619249
       1992  |  -.2762514   .0001175 -2350.67   0.000    -.2764817    -.276021
       1993  |  -.2799522   .0001177 -2379.27   0.000    -.2801829   -.2797216
       1996  |  -.3389922   .0001273 -2663.34   0.000    -.3392417   -.3387428
       1997  |  -.3412573   .0001272 -2682.55   0.000    -.3415066    -.341008
       1998  |   -.370644   .0001283 -2889.02   0.000    -.3708955   -.3703926
       1999  |  -.3608566   .0001291 -2794.57   0.000    -.3611097   -.3606035
       2000  |  -.3847701   .0001324 -2906.19   0.000    -.3850296   -.3845106
       2001  |  -.3997819   .0001339 -2984.62   0.000    -.4000445   -.3995194
       2002  |  -.4035696   .0001348 -2994.60   0.000    -.4038338   -.4033055
       2003  |  -.4316877   .0001362 -3169.13   0.000    -.4319547   -.4314207
       2004  |  -.4496314   .0001369 -3283.69   0.000    -.4498997    -.449363
       2005  |  -.4879178   .0001373 -3554.74   0.000    -.4881868   -.4876487
       2006  |  -.4911808   .0001374 -3573.88   0.000    -.4914502   -.4909114
       2007  |  -.4927296   .0001366 -3607.26   0.000    -.4929973   -.4924619
       2008  |  -.4444117   .0001364 -3258.58   0.000     -.444679   -.4441444
       2009  |  -.4568898   .0001389 -3289.88   0.000     -.457162   -.4566176
       2010  |  -.4772563   .0001415 -3372.04   0.000    -.4775337   -.4769789
       2011  |  -.5046834   .0001429 -3530.57   0.000    -.5049636   -.5044032
       2012  |  -.4961542   .0001426 -3479.89   0.000    -.4964336   -.4958747
       2013  |    -.50365   .0001445 -3484.81   0.000    -.5039332   -.5033667
       2014  |  -.5073795   .0001447 -3507.04   0.000    -.5076631    -.507096
       2015  |  -.5139023   .0001459 -3522.04   0.000    -.5141883   -.5136163
       2016  |  -.5148441   .0001448 -3555.73   0.000    -.5151279   -.5145603
       2017  |  -.4859316   .0001438 -3380.14   0.000    -.4862134   -.4856498
       2018  |  -.4799481   .0001435 -3343.52   0.000    -.4802294   -.4796667
       2019  |  -.5098225   .0001457 -3498.88   0.000    -.5101081   -.5095369
             |
       _cons |  -3.120653   .0005783 -5396.07   0.000    -3.121786   -3.119519
------------------------------------------------------------------------------

.         predict pu1b0m
(option pr assumed; Pr(covered))
(376,290 missing values generated)

. 
. gen theta2m = (pb1m/(1-pb1m)) * (pu1b1m/pu1b0m) if nhblack == 0 & covered == 1
(1,520,427 missing values generated)

. 
. replace theta2m = theta2m * hweight if nhblack == 0 & covered == 1
(239,410 real changes made)

. 
. kdensity lwage3 [aweight = theta2m] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(cu_wmestpt cu_wmde) nograph

. 
. graph twoway (connected u_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected u_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid))  ///
>                          (connected cu_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc
> (eltblue) lp(longdash)),  /// 
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "white" 2 "Black" 3 "white - c.f.") c(1) pos(2) ring(0) symxsize(*.5
> ) size(large) region(lcolor(none))) ///
>                          subtitle("Men Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1men/cu_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/cu_bhw_men.png written in PNG format)

.         
. gen theta3m = (pb1m/(1-pb1m)) * ((1-pu1b1m)/(1-pu1b1m)) if nhblack == 0 & covered == 0
(746,637 missing values generated)

. 
. replace theta3m = theta3m * hweight if nhblack == 0 & covered == 0
(1,013,200 real changes made)

. 
. kdensity lwage3 [aweight = theta3m] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(cn_wmestpt cn_wmde) nograph

. 
. graph twoway (connected n_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected n_bmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid))  ///
>                          (connected cn_wmde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc
> (eltblue) lp(longdash)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "white" 2 "Black" 3 "white - c.f.") c(1) pos(2) ring(0) symxsize(*.5
> ) size(large) region(lcolor(none))) ///
>                          subtitle("Men not Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1men/cn_bhw_men.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1men/cn_bhw_men.png written in PNG format)

.         
. restore

. ********************************************************************************
. 
. ********************************************************************************
. ** women
. preserve

. keep if sex == 2
(2,097,728 observations deleted)

. 
. qui sum lwage3, detail

. 
. gen xstep = (r(max) - r(min)) / 200

. 
. gen kwage = r(min) + (_n-1)*xstep if _n <= 200
(2,033,047 missing values generated)

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(wfestpt wfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2, at(kwage) gauss width(0.065) ///
>         generate(bfestpt bfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 3, at(kwage) gauss width(0.065) ///
>         generate(hfestpt hfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_wfestpt u_wfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(n_wfestpt n_wfde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(u_bfestpt u_bfde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(nbfestpt n_bfde) nograph

.         
. ** lab wmestpt "non hisp white men estimation points"
. ** lab wmde "non hisp white men density estimate"
. 
. graph twoway (connected wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(so
> lid))  /// 
>                          (connected bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(ma
> genta) lp(solid))  ///
>                          (connected hfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(mi
> dgreen) lp(solid)), ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black" 3 "Hispanic") c(1) pos(2) ring(0
> ) symxsize(*.5) size(large) region(lcolor(none))) ///
>                          subtitle("Women", size(vlarge))

. graph export "$figs/kde1wom/bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/bhw_wom.png written in PNG format)

. 
. graph twoway (connected u_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected u_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsize(*.
> 5) size(large) region(lcolor(none))) ///
>                          subtitle("Women Covered by Union", size(vlarge))

. graph export "$figs/kde1wom/u_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/u_bhw_wom.png written in PNG format)

. 
. graph twoway (connected n_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected n_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "non-Hisp white" 2 "non-Hisp Black") c(1) pos(2) ring(0) symxsize(*.
> 5) size(large) region(lcolor(none))) ///
>                          subtitle("Women not Covered by Union", size(vlarge))

. graph export "$figs/kde1wom/n_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/n_bhw_wom.png written in PNG format)

. 
. ** probability of race that depends on other covariates
. 
. local nhr w b

. 
. clonevar nhrace = hisprace
(123,752 missing values generated)

. 
. replace nhrace =. if nhrace == 3
(163,809 real changes made, 163,809 to missing)

. 
. keep if inrange(nhrace, 1, 2)
(287,561 observations deleted)

. 
. gen nhblack = nhrace - 1

. 
. gen finalwt1 = round(eweight)

. 
. drop nind

. 
. rename nind2 nind

. 
. drop nocc2

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(1486201 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(1635049 differences between nocc2 and nocc3)

. 
. drop edex

. 
. gen edex = educ*exper

. 
. probit nhblack educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.508e+09  
Iteration 1:   log likelihood = -3.744e+09  
Iteration 2:   log likelihood = -3.708e+09  
Iteration 3:   log likelihood = -3.707e+09  
Iteration 4:   log likelihood = -3.707e+09  
Iteration 5:   log likelihood = -3.707e+09  
Iteration 6:   log likelihood = -3.707e+09  
Iteration 7:   log likelihood = -3.707e+09  

Probit regression                               Number of obs     =  1.095e+10
                                                LR chi2(132)      =   1.60e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.707e+09                     Pseudo R2         =     0.1777

------------------------------------------------------------------------------
     nhblack |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0029089   .0000394   -73.74   0.000    -.0029862   -.0028316
       exper |   .1120296   .0000314  3568.90   0.000     .1119681    .1120911
      exper2 |  -.0058131   2.34e-06 -2484.37   0.000    -.0058177   -.0058085
      exper3 |   .0001255   8.22e-08  1525.80   0.000     .0001253    .0001256
      exper4 |  -9.86e-07   9.21e-10 -1070.25   0.000    -9.87e-07   -9.84e-07
        edex |  -.0009903   1.41e-06  -702.85   0.000    -.0009931   -.0009876
             |
       ee_cl |
          2  |   .0369314   .0001373   268.95   0.000     .0366622    .0372005
          3  |   .0016018   .0001618     9.90   0.000     .0012846    .0019189
          4  |  -.3149325   .0002476 -1272.18   0.000    -.3154177   -.3144473
          5  |   .0470509   .0002053   229.16   0.000     .0466485    .0474534
          6  |  -.0411677     .00017  -242.23   0.000    -.0415008   -.0408346
          7  |   -.023763   .0001876  -126.67   0.000    -.0241307   -.0233953
          8  |   -.265033   .0002421 -1094.78   0.000    -.2655075   -.2645585
          9  |   .1584278   .0002502   633.15   0.000     .1579374    .1589183
         10  |  -.0678357   .0002176  -311.72   0.000    -.0682622   -.0674091
         11  |  -.0490737   .0002248  -218.26   0.000    -.0495143    -.048633
         12  |  -.1923932    .000256  -751.58   0.000    -.1928949   -.1918915
         13  |   .2327579    .000307   758.28   0.000     .2321563    .2333595
         14  |  -.0985768   .0002615  -376.98   0.000    -.0990894   -.0980643
         15  |  -.0440981   .0002589  -170.30   0.000    -.0446056   -.0435906
         16  |  -.1056063   .0002761  -382.49   0.000    -.1061475   -.1050652
             |
        marr |  -.5117606   .0000352 -1.5e+04   0.000    -.5118296   -.5116917
       partt |  -.1657485   .0000447 -3706.19   0.000    -.1658362   -.1656609
      public |   .3233852   .0000626  5164.73   0.000     .3232625    .3235079
        cmsa |   .5348384   .0000503  1.1e+04   0.000     .5347397    .5349371
             |
       state |
         NH  |   .0826631   .0011973    69.04   0.000     .0803165    .0850097
         VT  |  -.0032727   .0016101    -2.03   0.042    -.0064284    -.000117
         MA  |   .8536637   .0009691   880.87   0.000     .8517643    .8555631
         RI  |   .6852132   .0010104   678.15   0.000     .6832328    .6871936
         CT  |   1.159656   .0009724  1192.57   0.000      1.15775    1.161562
         NY  |   1.477249   .0009623  1535.16   0.000     1.475363    1.479135
         NJ  |   1.382867   .0009656  1432.11   0.000     1.380974    1.384759
         PA  |   1.094489   .0009639  1135.51   0.000       1.0926    1.096378
         OH  |   1.184173    .000963  1229.68   0.000     1.182285     1.18606
         IN  |   1.091201   .0009671  1128.31   0.000     1.089306    1.093097
         IL  |   1.460301    .000963  1516.46   0.000     1.458414    1.462189
         MI  |   1.253918   .0009639  1300.88   0.000     1.252029    1.255807
         WI  |   .8023997   .0009707   826.62   0.000     .8004972    .8043023
         MN  |   .6345722   .0009729   652.22   0.000     .6326653    .6364792
         IA  |   .3752503   .0010194   368.13   0.000     .3732524    .3772482
         MO  |   1.283715   .0009659  1329.07   0.000     1.281822    1.285608
         ND  |   .3171528   .0014704   215.69   0.000     .3142707    .3200348
         SD  |    .063225   .0014753    42.86   0.000     .0603335    .0661166
         NE  |   .8113703   .0009966   814.13   0.000      .809417    .8133237
         KS  |   .9820522   .0009781  1004.07   0.000     .9801352    .9839692
         DE  |   2.072681   .0011009  1882.64   0.000     2.070523    2.074839
         MD  |   1.996506   .0009647  2069.55   0.000     1.994615    1.998397
         DC  |   2.516275   .0009852  2554.09   0.000     2.514344    2.518205
         VA  |   1.744289   .0009637  1810.06   0.000       1.7424    1.746178
         WV  |   .8001852   .0010383   770.70   0.000     .7981503    .8022202
         NC  |   1.893803   .0009632  1966.19   0.000     1.891915    1.895691
         SC  |    2.10171   .0009663  2175.10   0.000     2.099816    2.103604
         GA  |   2.117568   .0009629  2199.22   0.000     2.115681    2.119456
         FL  |   1.620697   .0009627  1683.57   0.000      1.61881    1.622584
         KY  |   1.111286   .0009702  1145.39   0.000     1.109385    1.113188
         TN  |   1.580488    .000965  1637.78   0.000     1.578596    1.582379
         AL  |   2.012734   .0009663  2082.85   0.000      2.01084    2.014628
         MS  |   2.431001   .0009668  2514.51   0.000     2.429107    2.432896
         AR  |   1.622993   .0009713  1670.99   0.000      1.62109    1.624897
         LA  |   2.068896   .0009668  2139.92   0.000     2.067001    2.070791
         OK  |   1.111898   .0009736  1142.10   0.000      1.10999    1.113806
         TX  |   1.592815   .0009621  1655.55   0.000     1.590929    1.594701
         MT  |  -.3242695   .0019784  -163.90   0.000    -.3281471   -.3203918
         ID  |  -.1399728   .0012756  -109.73   0.000    -.1424729   -.1374726
         WY  |   .0110079   .0018891     5.83   0.000     .0073053    .0147105
         CO  |   .8096039   .0009764   829.15   0.000     .8076902    .8115177
         NM  |   .8804932   .0010437   843.61   0.000     .8784476    .8825389
         AZ  |   .7679661   .0009748   787.84   0.000     .7660556    .7698766
         UT  |  -.0024156   .0010498    -2.30   0.021    -.0044732   -.0003581
         NV  |   1.150779    .000984  1169.50   0.000      1.14885    1.152707
         WA  |   .6149168   .0009741   631.28   0.000     .6130076    .6168259
         OR  |   .2908309   .0009969   291.73   0.000      .288877    .2927848
         CA  |   1.183699   .0009623  1230.09   0.000     1.181813    1.185585
         AK  |   .8070662   .0010996   733.95   0.000      .804911    .8092214
         HI  |   1.037782   .0011072   937.30   0.000     1.035612    1.039952
             |
        nind |
          2  |  -.0325229   .0003256   -99.88   0.000    -.0331611   -.0318847
          3  |   .3750483    .000261  1437.01   0.000     .3745367    .3755598
          4  |   .2840713   .0002617  1085.33   0.000     .2835583    .2845843
          5  |   .6520569    .000267  2442.08   0.000     .6515336    .6525802
          6  |   .5355926   .0002649  2022.24   0.000     .5350735    .5361117
          7  |   .4342462   .0002632  1649.99   0.000     .4337304    .4347621
          8  |   .7438746   .0002614  2845.85   0.000     .7433623    .7443869
          9  |   .4153858   .0002676  1552.00   0.000     .4148612    .4159104
         10  |    .395415   .0002696  1466.94   0.000     .3948867    .3959433
         11  |   .5678444   .0002727  2081.96   0.000     .5673098     .568379
             |
       nocc2 |
          2  |   .2386899   .0000949  2514.74   0.000     .2385038    .2388759
          3  |   .1350664   .0001254  1077.22   0.000     .1348206    .1353121
          4  |   .1951949   .0000941  2074.53   0.000     .1950105    .1953793
          5  |   .0824416    .000102   808.00   0.000     .0822417    .0826416
          6  |   .2780457   .0000825  3368.42   0.000     .2778839    .2782075
          7  |   .5059171   .0000992  5097.94   0.000     .5057226    .5061116
          8  |   .0032682   .0002146    15.23   0.000     .0028476    .0036887
          9  |   .6301731   .0000887  7105.35   0.000     .6299993    .6303469
         10  |   .7543983   .0001113  6780.64   0.000     .7541802    .7546163
         11  |   .4096148   .0002406  1702.35   0.000     .4091432    .4100864
         12  |   .6350846   .0001295  4903.92   0.000     .6348307    .6353384
             |
     quarter |
          2  |   .0058938   .0000458   128.55   0.000     .0058039    .0059837
          3  |   .0041186   .0000465    88.67   0.000     .0040275    .0042096
          4  |   .0046239    .000046   100.57   0.000     .0045338     .004714
             |
        year |
       1984  |   .0316187   .0001354   233.61   0.000     .0313534     .031884
       1985  |   .0343283   .0001462   234.79   0.000     .0340417    .0346149
       1986  |   .0356542   .0001355   263.11   0.000     .0353887    .0359198
       1987  |   .0446969   .0001357   329.43   0.000     .0444309    .0449628
       1988  |   .0499027   .0001356   368.09   0.000     .0496369    .0501684
       1989  |   .0449126   .0001307   343.71   0.000     .0446565    .0451687
       1990  |    .055234   .0001306   422.81   0.000     .0549779      .05549
       1991  |   .0564923   .0001311   431.03   0.000     .0562354    .0567491
       1992  |   .0438161   .0001304   336.12   0.000     .0435606    .0440716
       1993  |   .0509301     .00013   391.76   0.000     .0506753    .0511849
       1996  |   .0400618   .0001373   291.71   0.000     .0397926     .040331
       1997  |   .0586253   .0001365   429.46   0.000     .0583578    .0588929
       1998  |   .0822666    .000136   604.82   0.000         .082    .0825331
       1999  |   .1129065   .0001365   827.39   0.000      .112639    .1131739
       2000  |   .1007575   .0001381   729.86   0.000     .1004869    .1010281
       2001  |   .1082227   .0001395   775.65   0.000     .1079492    .1084961
       2002  |   .1022999   .0001403   728.96   0.000     .1020249     .102575
       2003  |   .0867781   .0001413   614.04   0.000     .0865011    .0870551
       2004  |   .0871301   .0001415   615.96   0.000     .0868529    .0874074
       2005  |   .0700114   .0001408   497.16   0.000     .0697354    .0702874
       2006  |   .1088238   .0001396   779.75   0.000     .1085503    .1090974
       2007  |   .1349128   .0001386   973.39   0.000     .1346412    .1351845
       2008  |   .1228512   .0001387   885.77   0.000     .1225793     .123123
       2009  |   .1275018   .0001396   913.16   0.000     .1272281    .1277754
       2010  |   .1344537   .0001414   950.74   0.000     .1341765    .1347309
       2011  |   .1285667   .0001423   903.33   0.000     .1282877    .1288456
       2012  |   .1878044   .0001407  1334.53   0.000     .1875286    .1880803
       2013  |   .1872578    .000142  1318.43   0.000     .1869795    .1875362
       2014  |   .2048555    .000142  1442.21   0.000     .2045771    .2051339
       2015  |    .228745   .0001417  1613.97   0.000     .2284672    .2290228
       2016  |   .2267864   .0001406  1613.24   0.000     .2265108    .2270619
       2017  |   .2140882    .000141  1518.59   0.000     .2138119    .2143645
       2018  |   .2348677   .0001406  1670.14   0.000      .234592    .2351433
       2019  |   .2533848    .000141  1797.42   0.000     .2531085    .2536611
             |
       _cons |  -3.900747   .0010947 -3563.40   0.000    -3.902893   -3.898602
------------------------------------------------------------------------------

.         predict pb1f
(option pr assumed; Pr(nhblack))
(376,543 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year if nhblack == 1 [w = finalwt1]
(frequency weights assumed)

note: 11.state != 0 predicts failure perfectly
      11.state dropped and 40 obs not used

note: 81.state != 0 predicts failure perfectly
      81.state dropped and 15 obs not used

note: 82.state != 0 predicts failure perfectly
      82.state dropped and 52 obs not used

note: 95.state omitted because of collinearity
Iteration 0:   log likelihood = -7.630e+08  
Iteration 1:   log likelihood = -5.692e+08  
Iteration 2:   log likelihood = -5.612e+08  
Iteration 3:   log likelihood = -5.612e+08  
Iteration 4:   log likelihood = -5.612e+08  

Probit regression                               Number of obs     = 1569937643
                                                LR chi2(129)      =   4.04e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -5.612e+08                     Pseudo R2         =     0.2646

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0652494   .0001069   610.59   0.000     .0650399    .0654588
       exper |    .085845   .0000906   947.12   0.000     .0856673    .0860226
      exper2 |  -.0038022   6.46e-06  -588.38   0.000    -.0038149   -.0037896
      exper3 |   .0000944   2.16e-07   436.34   0.000      .000094    .0000949
      exper4 |  -8.64e-07   2.36e-09  -365.33   0.000    -8.68e-07   -8.59e-07
        edex |  -.0009031   3.56e-06  -253.58   0.000    -.0009101   -.0008961
             |
       ee_cl |
          2  |    .014139   .0004667    30.29   0.000     .0132242    .0150538
          3  |  -.0567024   .0005213  -108.77   0.000    -.0577241   -.0556807
          4  |  -.1354364   .0007176  -188.75   0.000    -.1368428     -.13403
          5  |  -.0412701   .0005836   -70.72   0.000    -.0424139   -.0401262
          6  |  -.0282809   .0005195   -54.44   0.000    -.0292992   -.0272627
          7  |  -.1025374   .0005616  -182.57   0.000    -.1036382   -.1014366
          8  |  -.1563379   .0006979  -224.02   0.000    -.1577057   -.1549701
          9  |   -.051789   .0006662   -77.74   0.000    -.0530947   -.0504833
         10  |   -.013822   .0006155   -22.46   0.000    -.0150282   -.0126157
         11  |  -.0646636   .0006374  -101.44   0.000     -.065913   -.0634142
         12  |   -.109239   .0007185  -152.05   0.000    -.1106471   -.1078309
         13  |   -.014297   .0007845   -18.22   0.000    -.0158346   -.0127594
         14  |  -.0432031   .0007076   -61.06   0.000      -.04459   -.0418163
         15  |  -.0855423   .0007085  -120.73   0.000     -.086931   -.0841537
         16  |  -.0929411   .0007556  -123.00   0.000    -.0944221   -.0914601
             |
        marr |   .0142896   .0000904   158.01   0.000     .0141123    .0144668
       partt |  -.3678589    .000136 -2704.26   0.000    -.3681255   -.3675923
      public |   .8553228     .00013  6577.21   0.000     .8550679    .8555777
        cmsa |   .2528198   .0001663  1520.20   0.000     .2524938    .2531457
             |
       state |
         ME  |          0  (empty)
         NH  |   .2026977   .0041587    48.74   0.000     .1945468    .2108486
         VT  |   .1482037    .007262    20.41   0.000     .1339704    .1624369
         MA  |   .4736208   .0020163   234.90   0.000      .469669    .4775726
         RI  |   .5098912   .0022022   231.53   0.000     .5055749    .5142074
         CT  |   .5308842   .0020185   263.00   0.000     .5269279    .5348405
         NY  |   1.039128   .0019818   524.35   0.000     1.035244    1.043012
         NJ  |   .6993048   .0019911   351.22   0.000     .6954024    .7032073
         PA  |   .5884945   .0019902   295.69   0.000     .5845938    .5923953
         OH  |   .4299905   .0019868   216.43   0.000     .4260964    .4338845
         IN  |   .1375707    .002007    68.55   0.000     .1336371    .1415043
         IL  |   .6349738   .0019845   319.97   0.000     .6310844    .6388633
         MI  |   .7810045   .0019877   392.92   0.000     .7771087    .7849004
         WI  |   .4105331   .0020274   202.49   0.000     .4065594    .4145067
         MN  |   .5592426   .0020458   273.36   0.000     .5552329    .5632524
         IA  |   .0785686   .0025325    31.02   0.000      .073605    .0835322
         MO  |   .3131648   .0019976   156.77   0.000     .3092496    .3170801
         ND  |   .2050374   .0065493    31.31   0.000     .1922011    .2178737
         SD  |    .212822   .0058339    36.48   0.000     .2013877    .2242564
         NE  |   .3521607   .0021592   163.10   0.000     .3479288    .3563926
         KS  |  -.0039349   .0020777    -1.89   0.058    -.0080072    .0001374
         DE  |   .4838975   .0023078   209.68   0.000     .4793743    .4884208
         MD  |    .329886   .0019856   166.14   0.000     .3259943    .3337777
         DC  |   .2947501   .0020067   146.88   0.000      .290817    .2986832
         VA  |  -.1943804   .0019893   -97.71   0.000    -.1982794   -.1904814
         WV  |   .2841912   .0024932   113.99   0.000     .2793046    .2890778
         NC  |  -.5227741   .0019924  -262.39   0.000     -.526679   -.5188691
         SC  |  -.5536192   .0020033  -276.35   0.000    -.5575457   -.5496927
         GA  |  -.3312252   .0019862  -166.76   0.000    -.3351181   -.3273322
         FL  |  -.0540076   .0019852   -27.20   0.000    -.0578985   -.0501166
         KY  |   .3080602   .0020193   152.56   0.000     .3041026    .3120179
         TN  |  -.1325091   .0019947   -66.43   0.000    -.1364185   -.1285996
         AL  |  -.0335169   .0019953   -16.80   0.000    -.0374276   -.0296062
         MS  |  -.3546125   .0019988  -177.41   0.000    -.3585301   -.3506948
         AR  |  -.2527819   .0020284  -124.62   0.000    -.2567574   -.2488063
         LA  |  -.1211202   .0019945   -60.73   0.000    -.1250292   -.1172111
         OK  |  -.1356198   .0020514   -66.11   0.000    -.1396405   -.1315991
         TX  |  -.3143518   .0019853  -158.34   0.000    -.3182429   -.3104606
         MT  |          0  (empty)
         ID  |          0  (empty)
         WY  |  -.1610354   .0102319   -15.74   0.000    -.1810896   -.1409811
         CO  |   .1535934   .0020667    74.32   0.000     .1495429     .157644
         NM  |  -.0133385   .0025541    -5.22   0.000    -.0183445   -.0083326
         AZ  |  -.3237158   .0021014  -154.04   0.000    -.3278346   -.3195971
         UT  |   -.162532   .0029931   -54.30   0.000    -.1683983   -.1566657
         NV  |   .7753811   .0020474   378.72   0.000     .7713683    .7793939
         WA  |   .6113315   .0020414   299.46   0.000     .6073304    .6153326
         OR  |   .4935096   .0021998   224.34   0.000     .4891981    .4978212
         CA  |   .6333971   .0019829   319.43   0.000     .6295107    .6372835
         AK  |   .4140424   .0026201   158.02   0.000      .408907    .4191777
         HI  |          0  (omitted)
             |
        nind |
          2  |   .3089876   .0012664   243.98   0.000     .3065055    .3114698
          3  |   .6367049   .0010944   581.80   0.000       .63456    .6388498
          4  |   .2445318   .0011017   221.96   0.000     .2423725     .246691
          5  |   1.132111   .0011004  1028.86   0.000     1.129955    1.134268
          6  |  -.0628166   .0011125   -56.46   0.000    -.0649972   -.0606361
          7  |  -.0369344   .0011075   -33.35   0.000     -.039105   -.0347637
          8  |    .272737   .0010973   248.56   0.000     .2705864    .2748876
          9  |   .6876568   .0011022   623.92   0.000     .6854966     .689817
         10  |   .0454488   .0011151    40.76   0.000     .0432632    .0476345
         11  |   .4072195   .0011053   368.42   0.000     .4050531    .4093859
             |
       nocc2 |
          2  |   .2301567   .0003031   759.41   0.000     .2295627    .2307507
          3  |   .2211253   .0003919   564.18   0.000     .2203572    .2218935
          4  |   .7700169   .0002821  2729.78   0.000      .769464    .7705697
          5  |   .8173861   .0003073  2659.56   0.000     .8167838    .8179885
          6  |   .4904049   .0002666  1839.46   0.000     .4898824    .4909274
          7  |   .5987175    .000333  1798.13   0.000     .5980649    .5993701
          8  |   .4951455   .0008224   602.05   0.000     .4935336    .4967574
          9  |   .6951177   .0002779  2501.31   0.000      .694573    .6956623
         10  |   1.027046   .0003257  3153.30   0.000     1.026408    1.027685
         11  |   1.173634   .0005633  2083.46   0.000      1.17253    1.174738
         12  |   .8438096    .000342  2467.02   0.000     .8431392      .84448
             |
     quarter |
          2  |  -.0266557   .0001183  -225.39   0.000    -.0268875   -.0264239
          3  |  -.0196669   .0001198  -164.21   0.000    -.0199017   -.0194322
          4  |  -.0430309   .0001191  -361.38   0.000    -.0432643   -.0427975
             |
        year |
       1984  |  -.0790887     .00033  -239.69   0.000    -.0797354    -.078442
       1985  |  -.0979802   .0003573  -274.19   0.000    -.0986806   -.0972798
       1986  |  -.1552204   .0003319  -467.67   0.000    -.1558709   -.1545699
       1987  |  -.1809471    .000334  -541.72   0.000    -.1816018   -.1802924
       1988  |  -.1375327   .0003315  -414.92   0.000    -.1381824   -.1368831
       1989  |  -.1964865   .0003188  -616.29   0.000    -.1971113   -.1958616
       1990  |  -.2732426   .0003214  -850.04   0.000    -.2738726   -.2726125
       1991  |  -.2563847   .0003221  -796.09   0.000    -.2570159   -.2557535
       1992  |  -.2312113    .000319  -724.71   0.000    -.2318366    -.230586
       1993  |  -.2513798   .0003189  -788.33   0.000    -.2520048   -.2507548
       1996  |  -.2839481    .000341  -832.64   0.000    -.2846165   -.2832797
       1997  |  -.3146419   .0003397  -926.19   0.000    -.3153078   -.3139761
       1998  |  -.3322578   .0003403  -976.43   0.000    -.3329247   -.3315908
       1999  |  -.3762673   .0003416 -1101.33   0.000    -.3769369   -.3755977
       2000  |  -.3326131   .0003446  -965.22   0.000    -.3332885   -.3319377
       2001  |  -.3311583   .0003485  -950.13   0.000    -.3318415   -.3304752
       2002  |  -.3509672   .0003518  -997.65   0.000    -.3516567   -.3502777
       2003  |  -.3911325    .000356 -1098.74   0.000    -.3918302   -.3904348
       2004  |  -.4506212   .0003653 -1233.52   0.000    -.4513372   -.4499052
       2005  |  -.4380931   .0003615 -1211.78   0.000    -.4388017   -.4373846
       2006  |  -.4635394   .0003574 -1296.81   0.000    -.4642399   -.4628388
       2007  |  -.4799527    .000354 -1355.81   0.000    -.4806465   -.4792589
       2008  |  -.5197867    .000357 -1455.81   0.000    -.5204865   -.5190869
       2009  |  -.4892581   .0003581 -1366.38   0.000    -.4899599   -.4885563
       2010  |  -.4931998   .0003621 -1361.89   0.000    -.4939096     -.49249
       2011  |   -.480174   .0003643 -1318.22   0.000     -.480888   -.4794601
       2012  |  -.4774401   .0003609 -1323.09   0.000    -.4781474   -.4767329
       2013  |  -.4770837   .0003635 -1312.37   0.000    -.4777962   -.4763712
       2014  |  -.5452502   .0003675 -1483.74   0.000    -.5459705   -.5445299
       2015  |  -.5034081   .0003619 -1390.96   0.000    -.5041175   -.5026988
       2016  |  -.4340273   .0003534 -1228.01   0.000      -.43472   -.4333346
       2017  |   -.542417   .0003658 -1482.81   0.000     -.543134      -.5417
       2018  |  -.6237281   .0003651 -1708.16   0.000    -.6244438   -.6230124
       2019  |  -.5633177   .0003608 -1561.28   0.000    -.5640248   -.5626105
             |
       _cons |  -3.579933   .0026157 -1368.64   0.000     -3.58506   -3.574807
------------------------------------------------------------------------------

.         predict pu1b1f
(option pr assumed; Pr(covered))
(422,782 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr partt public cmsa i.state i.nind i.nocc2 i.
> quarter i.year if nhblack == 0 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -3.788e+09  
Iteration 1:   log likelihood = -2.658e+09  
Iteration 2:   log likelihood = -2.593e+09  
Iteration 3:   log likelihood = -2.592e+09  
Iteration 4:   log likelihood = -2.592e+09  
Iteration 5:   log likelihood = -2.592e+09  

Probit regression                               Number of obs     = 9360242841
                                                LR chi2(132)      =   2.39e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -2.592e+09                     Pseudo R2         =     0.3157

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0803438   .0000457  1759.30   0.000     .0802543    .0804333
       exper |   .0915511   .0000404  2264.31   0.000     .0914718    .0916303
      exper2 |  -.0041016   3.00e-06 -1365.41   0.000    -.0041075   -.0040957
      exper3 |   .0001072   1.04e-07  1031.38   0.000      .000107    .0001074
      exper4 |  -1.03e-06   1.16e-09  -891.58   0.000    -1.03e-06   -1.03e-06
        edex |  -.0016066   1.68e-06  -956.99   0.000    -.0016099   -.0016033
             |
       ee_cl |
          2  |  -.0409037   .0002156  -189.72   0.000    -.0413262   -.0404811
          3  |  -.2596457   .0002383 -1089.70   0.000    -.2601127   -.2591787
          4  |  -.3669414   .0003176 -1155.21   0.000    -.3675639   -.3663188
          5  |  -.0963115   .0003208  -300.25   0.000    -.0969402   -.0956828
          6  |  -.0827412   .0002505  -330.29   0.000    -.0832322   -.0822502
          7  |  -.2304902   .0002684  -858.62   0.000    -.2310164   -.2299641
          8  |  -.3553384   .0003182 -1116.84   0.000     -.355962   -.3547149
          9  |  -.0185865    .000356   -52.22   0.000    -.0192842   -.0178889
         10  |  -.1270286   .0003016  -421.13   0.000    -.1276198   -.1264374
         11  |  -.2370387    .000308  -769.56   0.000    -.2376424    -.236435
         12  |  -.2744184   .0003334  -823.08   0.000    -.2750719    -.273765
         13  |   .0462898   .0004086   113.29   0.000      .045489    .0470907
         14  |  -.1009959   .0003476  -290.53   0.000    -.1016772   -.1003146
         15  |  -.2068264   .0003416  -605.42   0.000     -.207496   -.2061568
         16  |  -.2122623   .0003496  -607.08   0.000    -.2129476    -.211577
             |
        marr |  -.0103746   .0000429  -241.87   0.000    -.0104586   -.0102905
       partt |  -.3692389   .0000529 -6985.70   0.000    -.3693425   -.3691353
      public |   1.094968   .0000632  1.7e+04   0.000     1.094844    1.095091
        cmsa |   .1210947   .0000521  2325.71   0.000     .1209926    .1211967
             |
       state |
         NH  |  -.0955409   .0004182  -228.47   0.000    -.0963606   -.0947213
         VT  |  -.0384931   .0004641   -82.94   0.000    -.0394027   -.0375835
         MA  |   .1469774   .0003169   463.80   0.000     .1463562    .1475985
         RI  |   .2048226   .0003864   530.01   0.000     .2040651      .20558
         CT  |   .1820639   .0003346   544.13   0.000     .1814081    .1827197
         NY  |   .4382423   .0003039  1441.94   0.000     .4376466     .438838
         NJ  |   .2052513   .0003181   645.16   0.000     .2046278    .2058749
         PA  |   .1200472   .0003071   390.92   0.000     .1194453    .1206491
         OH  |   .0311357    .000306   101.77   0.000      .030536    .0317353
         IN  |   -.223713   .0003194  -700.45   0.000     -.224339    -.223087
         IL  |   .0022868   .0003091     7.40   0.000      .001681    .0028926
         MI  |    .239255   .0003084   775.70   0.000     .2386505    .2398595
         WI  |   .0439684   .0003155   139.34   0.000       .04335    .0445869
         MN  |   .2629943   .0003132   839.77   0.000     .2623805    .2636081
         IA  |  -.1327911   .0003436  -386.42   0.000    -.1334647   -.1321176
         MO  |  -.2796696   .0003225  -867.31   0.000    -.2803016   -.2790376
         ND  |  -.3796838   .0005847  -649.36   0.000    -.3808298   -.3785378
         SD  |  -.5293401   .0005356  -988.30   0.000    -.5303899   -.5282904
         NE  |  -.2752775   .0003732  -737.70   0.000    -.2760089   -.2745461
         KS  |  -.5075512   .0003538 -1434.75   0.000    -.5082445   -.5068578
         DE  |  -.1495021   .0008396  -178.07   0.000    -.1511476   -.1478565
         MD  |  -.1307994    .000333  -392.80   0.000    -.1314521   -.1301468
         DC  |  -.3397902   .0005885  -577.36   0.000    -.3409436   -.3386367
         VA  |   -.657406   .0003279 -2004.99   0.000    -.6580486   -.6567633
         WV  |  -.1251304   .0004014  -311.71   0.000    -.1259172   -.1243436
         NC  |  -.9693565   .0003399 -2852.05   0.000    -.9700227   -.9686904
         SC  |  -1.030559   .0003985 -2586.26   0.000     -1.03134   -1.029778
         GA  |  -.7871271   .0003368 -2337.05   0.000    -.7877872    -.786467
         FL  |  -.3747809    .000316 -1186.01   0.000    -.3754003   -.3741616
         KY  |  -.3444888   .0003302 -1043.39   0.000    -.3451359   -.3438417
         TN  |  -.5912403   .0003343 -1768.75   0.000    -.5918955   -.5905852
         AL  |  -.3730374   .0003532 -1056.13   0.000    -.3737297   -.3723451
         MS  |  -.8138193    .000398 -2045.03   0.000    -.8145992   -.8130393
         AR  |  -.6730584   .0003775 -1782.92   0.000    -.6737983   -.6723185
         LA  |  -.6454279   .0003774 -1710.35   0.000    -.6461675   -.6446883
         OK  |  -.4858516   .0003499 -1388.62   0.000    -.4865374   -.4851659
         TX  |  -.6641073   .0003122 -2127.06   0.000    -.6647193   -.6634954
         MT  |   .0992038   .0004304   230.51   0.000     .0983603    .1000473
         ID  |  -.4700397   .0004286 -1096.57   0.000    -.4708798   -.4691996
         WY  |  -.6312435    .000627 -1006.78   0.000    -.6324724   -.6300146
         CO  |  -.2178575   .0003376  -645.39   0.000    -.2185191   -.2171959
         NM  |  -.4410418   .0004612  -956.32   0.000    -.4419458   -.4401379
         AZ  |  -.4967776   .0003441 -1443.71   0.000    -.4974521   -.4961032
         UT  |  -.4678074   .0003768 -1241.45   0.000     -.468546   -.4670688
         NV  |   .1847083    .000375   492.56   0.000     .1839733    .1854433
         WA  |   .3925046   .0003155  1244.11   0.000     .3918863     .393123
         OR  |   .2805172   .0003281   855.01   0.000     .2798741    .2811602
         CA  |    .283089   .0003032   933.75   0.000     .2824948    .2836832
         AK  |   .3394909   .0004555   745.39   0.000     .3385982    .3403835
         HI  |   .3948885   .0005255   751.48   0.000     .3938586    .3959185
             |
        nind |
          2  |   .4425335   .0003982  1111.23   0.000      .441753     .443314
          3  |   .6464293   .0003379  1912.92   0.000     .6457669    .6470916
          4  |   .5345333   .0003408  1568.56   0.000     .5338654    .5352013
          5  |   1.307633    .000343  3812.87   0.000     1.306961    1.308305
          6  |   .1445524    .000354   408.30   0.000     .1438585    .1452463
          7  |   .1177621   .0003485   337.88   0.000      .117079    .1184452
          8  |   .4956846   .0003404  1456.29   0.000     .4950174    .4963517
          9  |   1.016594   .0003419  2973.26   0.000     1.015923    1.017264
         10  |   .2800976   .0003583   781.74   0.000     .2793953    .2807998
         11  |   .6905734   .0003464  1993.83   0.000     .6898946    .6912523
             |
       nocc2 |
          2  |   .2148435   .0001296  1658.03   0.000     .2145896    .2150975
          3  |   .3650929   .0001525  2393.38   0.000     .3647939    .3653918
          4  |   .9208678   .0001142  8064.87   0.000      .920644    .9210916
          5  |   .9732009    .000126  7721.64   0.000     .9729539     .973448
          6  |   .4865896   .0001094  4448.15   0.000     .4863752     .486804
          7  |   .6882486   .0001323  5202.33   0.000     .6879893    .6885079
          8  |   .5412278   .0003229  1676.08   0.000     .5405949    .5418607
          9  |   .6666212   .0001197  5569.57   0.000     .6663866    .6668558
         10  |   1.246467   .0001377  9051.58   0.000     1.246197    1.246737
         11  |   1.279095   .0002465  5189.19   0.000     1.278612    1.279578
         12  |   1.158473    .000153  7570.18   0.000     1.158173    1.158773
             |
     quarter |
          2  |  -.0048121   .0000545   -88.35   0.000    -.0049189   -.0047054
          3  |   .0015491   .0000553    27.99   0.000     .0014407    .0016576
          4  |  -.0139835   .0000544  -257.00   0.000    -.0140902   -.0138769
             |
        year |
       1984  |  -.0618898   .0001448  -427.54   0.000    -.0621736   -.0616061
       1985  |   -.094577   .0001581  -598.18   0.000    -.0948869   -.0942672
       1986  |   -.114198   .0001466  -778.88   0.000    -.1144854   -.1139107
       1987  |  -.1320941   .0001476  -895.16   0.000    -.1323833   -.1318048
       1988  |  -.1460933   .0001479  -987.87   0.000    -.1463832   -.1458034
       1989  |  -.1740404   .0001434 -1213.89   0.000    -.1743214   -.1737594
       1990  |  -.1719944   .0001434 -1199.00   0.000    -.1722756   -.1717133
       1991  |  -.1924137   .0001444 -1332.09   0.000    -.1926969   -.1921306
       1992  |  -.1718582   .0001432 -1200.40   0.000    -.1721388   -.1715776
       1993  |  -.1743218   .0001431 -1218.47   0.000    -.1746022   -.1740414
       1996  |  -.1689842   .0001509 -1119.47   0.000      -.16928   -.1686883
       1997  |  -.1910189   .0001514 -1261.50   0.000    -.1913157   -.1907221
       1998  |    -.21445   .0001526 -1404.87   0.000    -.2147492   -.2141508
       1999  |  -.2267963   .0001541 -1471.87   0.000    -.2270983   -.2264943
       2000  |   -.218162   .0001553 -1404.41   0.000    -.2184664   -.2178575
       2001  |  -.2125592   .0001566 -1357.66   0.000     -.212866   -.2122523
       2002  |  -.2231722   .0001574 -1417.70   0.000    -.2234807   -.2228637
       2003  |  -.2621658   .0001587 -1652.05   0.000    -.2624768   -.2618547
       2004  |  -.2747339   .0001594 -1723.38   0.000    -.2750464   -.2744215
       2005  |  -.2844462    .000159 -1788.69   0.000    -.2847579   -.2841346
       2006  |  -.2940065   .0001595 -1843.39   0.000    -.2943191   -.2936939
       2007  |  -.2832611   .0001585 -1787.10   0.000    -.2835718   -.2829505
       2008  |  -.2646564   .0001578 -1677.17   0.000    -.2649656   -.2643471
       2009  |  -.2631057   .0001582 -1662.76   0.000    -.2634159   -.2627956
       2010  |  -.2754794   .0001612 -1708.60   0.000    -.2757954   -.2751634
       2011  |  -.2732577    .000163 -1676.52   0.000    -.2735772   -.2729382
       2012  |  -.3142353   .0001647 -1907.44   0.000    -.3145582   -.3139124
       2013  |  -.2913213   .0001656 -1759.50   0.000    -.2916458   -.2909968
       2014  |  -.3109458   .0001671 -1860.35   0.000    -.3112734   -.3106182
       2015  |   -.309943   .0001673 -1853.16   0.000    -.3102708   -.3096151
       2016  |  -.3024147   .0001652 -1831.02   0.000    -.3027384   -.3020909
       2017  |  -.3281095   .0001663 -1973.03   0.000    -.3284355   -.3277836
       2018  |  -.3307728   .0001665 -1986.17   0.000    -.3310992   -.3304464
       2019  |  -.3355839   .0001677 -2000.70   0.000    -.3359127   -.3352552
             |
       _cons |  -3.799111   .0007091 -5357.71   0.000      -3.8005   -3.797721
------------------------------------------------------------------------------

.         predict pu1b0f
(option pr assumed; Pr(covered))
(376,543 missing values generated)

. 
. gen theta2f = (pb1f/(1-pb1f)) * (pu1b1f/pu1b0f) if nhblack == 0 & covered == 1
(1,582,012 missing values generated)

. 
. replace theta2f = theta2f * hweight if nhblack == 0 & covered == 1
(163,674 real changes made)

. 
. kdensity lwage3 [aweight = theta2f] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.065) ///
>         generate(cu_wfestpt cu_wfde) nograph

. 
. graph twoway (connected u_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected u_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid))  ///
>                          (connected cu_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc
> (eltblue) lp(longdash)),  /// 
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "white" 2 "Black" 3 "white - c.f.") c(1) pos(2) ring(0) symxsize(*.5
> ) size(large) region(lcolor(none))) ///
>                          subtitle("Women Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1wom/cu_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/cu_bhw_wom.png written in PNG format)

.         
. gen theta3f = (pb1f/(1-pb1f)) * ((1-pu1b1f)/(1-pu1b1f)) if nhblack == 0 & covered == 0
(756,370 missing values generated)

. 
. replace theta3f = theta3f * hweight if nhblack == 0 & covered == 0
(989,316 real changes made)

. 
. kdensity lwage3 [aweight = theta3f] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.065) ///
>         generate(cn_wfestpt cn_wfde) nograph

. 
. graph twoway (connected n_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(eltblue) lp(
> solid))  /// 
>                          (connected n_bfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc(
> magenta) lp(solid))  ///
>                          (connected cn_wfde kwage if kwage>=0 & kwage<=5.01, msymbol(i) clwidth(medthick) lc
> (eltblue) lp(longdash)),  ///
>                          xlabel(.69 "ln(2)" 1.61 "ln(5)" 2.3 "ln(10)" 3.22 "ln(25)", labsize(large)) ///
>                          ytitle("Density", size(large)) scheme(s1mono) plotregion(lwidth(none)) ///
>                          xtitle("") ylabel("0(.25)1.25", labsize(large)) ///
>                          legend(order(1 "white" 2 "Black" 3 "white - c.f.") c(1) pos(2) ring(0) symxsize(*.5
> ) size(large) region(lcolor(none))) ///
>                          subtitle("Women not Covered by Union - with Counterfactual", size(vlarge))

. graph export "$figs/kde1wom/cn_bhw_wom.png", replace
(file /Users/amedeusdsouza/econ499/figures/kde1wom/cn_bhw_wom.png written in PNG format)

.         
. restore

. 
. log close
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/dfl1/dfl1.log
  log type:  text
 closed on:  26 Mar 2021, 13:26:50
--------------------------------------------------------------------------------------------------------------
