------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/amedeusdsouza/econ499/dfl1/dfl1.log
  log type:  text
 opened on:   1 Mar 2021, 02:29:28

. 
. use cleaned_nber_morg, clear

. 
. do "$code/pareto_topcoding.do"

. ** In this do file we gen the top-code adjusted wage distribution using pareto 
. ** parameters adapting codes generously provided to us by
. ** Professor Nicole Fortin and Neil Lloyd
. 
. ** Generate topcode-adjusted wage distribution using Pareto parameter
. ** Output: lwage2
. 
. ** OG Source: https://eml.berkeley.edu/~saez/TabFig2015prel.xls
.         * Table A4 & Table B3
. 
. ** RE Source: https://eml.berkeley.edu/~saez/TabFig2018.xls
.         * Table A4 & Table B3
. 
. ** Use Pareto parameter from Piketty and Saez (top 1%): average of 5 year windows (e.g. 2000-2
> 004);
. ** OG: Due to a lack of availability for post 2011 data, the average of 2010 & 2011 is extende
> d to 2017.
. 
. set seed 486372893

. 
. gen ranuni = runiform() if topcode == 1
(10,848,910 missing values generated)

. 
. gen     pareto = 1/(ranuni^(1/2.68)) if inrange(year, 1975, 1979)
(10,912,373 missing values generated)

.         replace pareto = 1/(ranuni^(1/2.45)) if inrange(year, 1980, 1984) 
(12,848 real changes made)

.         replace pareto = 1/(ranuni^(1/2.15)) if inrange(year, 1985, 1989) 
(25,430 real changes made)

.         replace pareto = 1/(ranuni^(1/2.02)) if inrange(year, 1990, 1994) 
(7,087 real changes made)

.         replace pareto = 1/(ranuni^(1/1.89)) if inrange(year, 1995, 1999) 
(9,426 real changes made)

.         replace pareto = 1/(ranuni^(1/1.81)) if inrange(year, 2000, 2004) 
(4,963 real changes made)

.         replace pareto = 1/(ranuni^(1/1.78)) if inrange(year, 2005, 2009)
(878 real changes made)

. 
. ** FIXME revise parameters using Tables A4 and B3
.         replace pareto = 1/(ranuni^(1/1.86)) if inrange(year, 2010, 2017) 
(2,109 real changes made)

. 
. * lwage2 uses this imputation;
. gen lwage2 = lwage if topcode == 0
(4,507,850 missing values generated)

.         replace lwage2 = lwage + log(pareto) if topcode == 1
(62,113 real changes made)

.         lab var lwage2 "log trimmed imputed nom wage 1-100"

. 
. gen lwage3 = log(exp(lwage2) * 100 / cpi)
(4,445,737 missing values generated)

.         lab var lwage3 "log trimmed imputed real wage 1-100 in 1979 dollars"

. 
end of do-file

. 
. ** drop if allocated hourly wage, weekly earnings, or usual hrs and missing wage
. drop if alloc1 == 1
(1,625,280 observations deleted)

. drop if lwage3 ==.
(4,303,612 observations deleted)

. 
. ** drop obs in 1994 1995 - allocation flag missing
. drop if inrange(year, 1994, 1995)
(296,195 observations deleted)

. 
. ** hours weighted
. gen hweight = eweight * uhourse / 100.0

. 
. ** NOTE in current draft we have not dropped <83, self empl + w/o pay
. ********************************************************************************
. 
. drop if year < 1983
(556,661 observations deleted)

. 
. ** men
. preserve

. keep if sex == 1
(2,033,574 observations deleted)

. 
. qui sum lwage3, detail

. 
. gen xstep = (r(max) - r(min)) / 200

. 
. gen kwage = r(min) + (_n-1)*xstep if _n <= 200
(2,097,792 missing values generated)

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(wmestpt wmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2, at(kwage) gauss width(0.065) ///
>         generate(bmestpt bmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 3, at(kwage) gauss width(0.065) ///
>         generate(hmestpt hmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 1, at(kwage) gauss width(0.0
> 65) ///
>         generate(u_wmestpt u_wmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 1 & covered == 0, at(kwage) gauss width(0.0
> 65) ///
>         generate(n_wmestpt n_wmde) nograph

.         
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 1, at(kwage) gauss width(0.0
> 65) ///
>         generate(u_bmestpt u_bmde) nograph

. 
. kdensity lwage3 [aweight = hweight] if hisprace == 2 & covered == 0, at(kwage) gauss width(0.0
> 65) ///
>         generate(nbmestpt n_bmde) nograph

.         
. ** lab wmestpt "non hisp white men estimation points"
. ** lab wmde "non hisp white men density estimate"
. 
. ** probability of race that depends on other covariates
. 
. local nhr w b

. 
. clonevar nhrace = hisprace
(128,854 missing values generated)

. 
. replace nhrace =. if nhrace == 3
(209,076 real changes made, 209,076 to missing)

. 
. keep if inrange(nhrace, 1, 2)
(337,930 observations deleted)

. 
. gen nhblack = nhrace - 1

. 
. gen finalwt1 = round(eweight)

. 
. drop nind

. 
. rename nind2 nind

. 
. drop nocc2

. 
. recode nocc (1 6 = 1) (2 = 2) (3 4 = 3) (5 = 4) (7 = 5) (8 = 6) (9 = 7) (10 11 = 8) ///
>                 (12 = 9) (13 15 = 10) (14 = 11) (16 = 12), gen(nocc2)
(1377832 differences between nocc and nocc2)

.                 
. recode nocc2 (1 2 3 4 5 = 1) (6 7 8 = 2) (9 = 3) (10 11 12 = 4), gen(nocc3)
(1583739 differences between nocc2 and nocc3)

. 
. drop edex

. 
. gen edex = educ*exper

. 
. probit nhblack educ exper exper2 exper3 exper4 edex i.ee_cl marr public cmsa i.state i.nind i.
> nocc3 i.quarter i.year [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.116e+09  
Iteration 1:   log likelihood = -3.570e+09  
Iteration 2:   log likelihood = -3.545e+09  
Iteration 3:   log likelihood = -3.544e+09  
Iteration 4:   log likelihood = -3.544e+09  
Iteration 5:   log likelihood = -3.544e+09  
Iteration 6:   log likelihood = -3.544e+09  

Probit regression                               Number of obs     =  1.140e+10
                                                LR chi2(123)      =   1.14e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.544e+09                     Pseudo R2         =     0.1390

------------------------------------------------------------------------------
     nhblack |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |  -.0057106   .0000395  -144.72   0.000     -.005788   -.0056333
       exper |   .0926566   .0000307  3021.07   0.000     .0925965    .0927167
      exper2 |  -.0040041   2.26e-06 -1770.56   0.000    -.0040086   -.0039997
      exper3 |   .0000739   7.77e-08   950.14   0.000     .0000737     .000074
      exper4 |  -4.82e-07   8.58e-10  -562.05   0.000    -4.84e-07   -4.81e-07
        edex |  -.0012355   1.33e-06  -928.19   0.000    -.0012382   -.0012329
             |
       ee_cl |
          2  |   .1364805   .0001278  1067.83   0.000       .13623     .136731
          3  |   .0320732   .0001582   202.70   0.000     .0317631    .0323833
          4  |  -.1968046   .0002461  -799.59   0.000     -.197287   -.1963222
          5  |   .0712372    .000182   391.52   0.000     .0708805    .0715938
          6  |   .0535397   .0001595   335.73   0.000     .0532272    .0538523
          7  |   .0167928    .000181    92.75   0.000      .016438    .0171477
          8  |  -.1922795   .0002378  -808.55   0.000    -.1927456   -.1918134
          9  |     .16626   .0002328   714.03   0.000     .1658036    .1667163
         10  |   .0567844   .0002088   271.97   0.000     .0563752    .0571936
         11  |   .0248524   .0002194   113.29   0.000     .0244224    .0252823
         12  |  -.1418772   .0002523  -562.32   0.000    -.1423717   -.1413827
         13  |   .3337704   .0002922  1142.45   0.000     .3331977     .334343
         14  |   .0652913   .0002541   256.97   0.000     .0647933    .0657892
         15  |   .0471141   .0002556   184.36   0.000     .0466132     .047615
         16  |  -.0441112   .0002729  -161.62   0.000    -.0446461   -.0435762
             |
        marr |  -.3034235   .0000377 -8052.83   0.000    -.3034974   -.3033497
      public |   .2811873    .000068  4135.16   0.000      .281054    .2813205
        cmsa |   .4555456   .0000503  9062.56   0.000     .4554471    .4556441
             |
       state |
         NH  |   .0555321   .0009885    56.18   0.000     .0535947    .0574695
         VT  |   .0246969   .0012528    19.71   0.000     .0222415    .0271523
         MA  |   .6158839    .000795   774.74   0.000     .6143258    .6174419
         RI  |   .5119021   .0008468   604.49   0.000     .5102423    .5135619
         CT  |   .9310231   .0007986  1165.76   0.000     .9294578    .9325884
         NY  |    1.16128   .0007856  1478.16   0.000      1.15974    1.162819
         NJ  |   1.101629   .0007898  1394.90   0.000     1.100081    1.103177
         PA  |   .7877903   .0007878  1000.00   0.000     .7862463    .7893344
         OH  |   .8967144   .0007865  1140.11   0.000     .8951729     .898256
         IN  |    .799096   .0007918  1009.18   0.000      .797544    .8006479
         IL  |   1.128704   .0007866  1434.97   0.000     1.127162    1.130245
         MI  |   .9562181   .0007876  1214.11   0.000     .9546745    .9577618
         WI  |   .5313853   .0007967   667.00   0.000     .5298238    .5329468
         MN  |    .506546   .0007972   635.40   0.000     .5049836    .5081085
         IA  |   .2508664   .0008469   296.23   0.000     .2492066    .2525262
         MO  |   .9736383   .0007905  1231.64   0.000     .9720889    .9751877
         ND  |   .2980903   .0012114   246.06   0.000     .2957159    .3004647
         SD  |   .1912207   .0011213   170.54   0.000      .189023    .1934184
         NE  |   .5807162   .0008306   699.18   0.000     .5790883    .5823441
         KS  |   .7986623   .0008032   994.32   0.000      .797088    .8002366
         DE  |   1.747564    .000957  1825.99   0.000     1.745688     1.74944
         MD  |   1.700583   .0007888  2155.94   0.000     1.699037    1.702129
         DC  |   2.301638   .0008159  2820.99   0.000     2.300039    2.303237
         VA  |   1.482877   .0007872  1883.68   0.000     1.481335     1.48442
         WV  |    .522767    .000872   599.53   0.000      .521058     .524476
         NC  |   1.595465   .0007867  2028.12   0.000     1.593923    1.597007
         SC  |   1.773956   .0007907  2243.51   0.000     1.772406    1.775505
         GA  |   1.804683   .0007863  2295.19   0.000     1.803141    1.806224
         FL  |   1.350137   .0007861  1717.58   0.000     1.348596    1.351678
         KY  |   .8858906   .0007951  1114.17   0.000     .8843322     .887449
         TN  |   1.283609   .0007891  1626.73   0.000     1.282062    1.285155
         AL  |   1.643651   .0007906  2078.90   0.000     1.642101    1.645201
         MS  |    2.04594   .0007912  2585.85   0.000     2.044389    2.047491
         AR  |   1.327533   .0007972  1665.35   0.000      1.32597    1.329095
         LA  |   1.696976   .0007914  2144.22   0.000     1.695425    1.698527
         OK  |   .8477269   .0007996  1060.22   0.000     .8461597     .849294
         TX  |    1.32225   .0007853  1683.86   0.000     1.320711    1.323789
         MT  |  -.1303465   .0013135   -99.23   0.000     -.132921    -.127772
         ID  |  -.0346473   .0009939   -34.86   0.000    -.0365953   -.0326993
         WY  |   .1783654   .0012978   137.43   0.000     .1758217    .1809091
         CO  |   .6870501   .0008007   858.10   0.000     .6854808    .6886193
         NM  |   .7195407   .0008712   825.88   0.000     .7178331    .7212483
         AZ  |   .6585979   .0007985   824.75   0.000     .6570328     .660163
         UT  |   .0100105   .0008545    11.72   0.000     .0083358    .0116852
         NV  |    .941135   .0008094  1162.78   0.000     .9395487    .9427214
         WA  |   .5303366   .0007969   665.52   0.000     .5287748    .5318985
         OR  |   .2402244   .0008181   293.64   0.000      .238621    .2418278
         CA  |   .9783931   .0007854  1245.70   0.000     .9768537    .9799324
         AK  |   .6226827   .0009341   666.64   0.000      .620852    .6245134
         HI  |   .9045129   .0009338   968.68   0.000     .9026828    .9063431
             |
        nind |
          2  |  -.1751789   .0001407 -1244.85   0.000    -.1754547   -.1749031
          3  |   .1987414   .0001317  1509.15   0.000     .1984833    .1989995
          4  |   .1372791   .0001339  1025.59   0.000     .1370167    .1375414
          5  |   .3216043   .0001361  2362.88   0.000     .3213375    .3218711
          6  |   .2336402    .000151  1547.75   0.000     .2333443    .2339361
          7  |   .2155743   .0001376  1566.88   0.000     .2153046    .2158439
          8  |   .6511295   .0001474  4416.07   0.000     .6508405    .6514185
          9  |   .3067795   .0001546  1984.01   0.000     .3064764    .3070826
         10  |   .2232512     .00016  1395.51   0.000     .2229377    .2235648
         11  |   .0353362   .0001595   221.54   0.000     .0350236    .0356488
             |
       nocc3 |
          2  |   .2508675   .0000585  4289.83   0.000     .2507528    .2509821
          3  |   .4943939   .0000614  8045.62   0.000     .4942735    .4945144
          4  |   .3384823   .0000542  6247.69   0.000     .3383761    .3385885
             |
     quarter |
          2  |   .0000307   .0000466     0.66   0.510    -.0000606    .0001219
          3  |   .0035509   .0000471    75.37   0.000     .0034585    .0036432
          4  |   .0057171   .0000468   122.27   0.000     .0056255    .0058088
             |
        year |
       1984  |   .0141776   .0001309   108.33   0.000     .0139211    .0144341
       1985  |   .0303681   .0001421   213.72   0.000     .0300896    .0306466
       1986  |   .0463853   .0001311   353.93   0.000     .0461284    .0466422
       1987  |   .0582425   .0001315   442.96   0.000     .0579848    .0585002
       1988  |   .0569547   .0001316   432.63   0.000     .0566967    .0572127
       1989  |   .0764351   .0001265   604.39   0.000     .0761872    .0766829
       1990  |   .0774196   .0001266   611.45   0.000     .0771714    .0776678
       1991  |   .0735804   .0001273   577.96   0.000     .0733308    .0738299
       1992  |   .0567151   .0001274   445.16   0.000     .0564654    .0569648
       1993  |    .065012   .0001272   510.91   0.000     .0647626    .0652614
       1996  |   .0343804   .0001367   251.47   0.000     .0341124    .0346483
       1997  |   .0384711   .0001363   282.21   0.000     .0382039    .0387383
       1998  |   .0625586   .0001354   461.96   0.000     .0622932    .0628241
       1999  |   .0634119   .0001371   462.68   0.000     .0631433    .0636805
       2000  |   .0848736   .0001385   612.73   0.000     .0846021    .0851451
       2001  |   .0575862   .0001413   407.45   0.000     .0573092    .0578632
       2002  |   .0690546   .0001412   488.98   0.000     .0687778    .0693313
       2003  |   .0500156   .0001432   349.19   0.000     .0497349    .0502963
       2004  |   .0498912   .0001428   349.42   0.000     .0496113     .050171
       2005  |   .0600137   .0001414   424.46   0.000     .0597366    .0602908
       2006  |   .0847384     .00014   605.20   0.000      .084464    .0850129
       2007  |     .11208   .0001384   809.76   0.000     .1118088    .1123513
       2008  |   .1110288   .0001388   799.79   0.000     .1107567    .1113009
       2009  |   .0836939   .0001418   590.34   0.000     .0834161    .0839718
       2010  |   .1059454   .0001423   744.43   0.000     .1056665    .1062244
       2011  |   .0873458    .000143   611.02   0.000     .0870657     .087626
       2012  |   .1005321    .000142   708.03   0.000     .1002538    .1008104
       2013  |   .1528415   .0001419  1076.97   0.000     .1525633    .1531196
       2014  |   .1584743   .0001421  1115.54   0.000     .1581958    .1587527
       2015  |   .1929945   .0001409  1369.89   0.000     .1927183    .1932706
       2016  |   .2063599     .00014  1473.85   0.000     .2060855    .2066343
       2017  |   .2045466   .0001401  1459.94   0.000      .204272    .2048212
       2018  |   .2176493   .0001393  1562.15   0.000     .2173762    .2179224
       2019  |   .2086293     .00014  1490.65   0.000     .2083549    .2089036
             |
       _cons |  -3.356208     .00091 -3688.19   0.000    -3.357991   -3.354424
------------------------------------------------------------------------------

.         predict pb1m
(option pr assumed; Pr(nhblack))
(376,470 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr public cmsa i.state i.nind i.
> nocc3 i.quarter i.year if nhblack == 1 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -7.209e+08  
Iteration 1:   log likelihood = -5.590e+08  
Iteration 2:   log likelihood = -5.547e+08  
Iteration 3:   log likelihood = -5.547e+08  
Iteration 4:   log likelihood = -5.547e+08  

Probit regression                               Number of obs     = 1331972724
                                                LR chi2(123)      =   3.32e+08
                                                Prob > chi2       =     0.0000
Log likelihood = -5.547e+08                     Pseudo R2         =     0.2306

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0270021   .0001105   244.34   0.000     .0267855    .0272187
       exper |   .0721032   .0000863   835.26   0.000     .0719341    .0722724
      exper2 |  -.0032531   6.04e-06  -538.80   0.000    -.0032649   -.0032412
      exper3 |    .000074   1.96e-07   376.82   0.000     .0000736    .0000744
      exper4 |  -6.51e-07   2.10e-09  -310.33   0.000    -6.55e-07   -6.47e-07
        edex |  -.0001029   3.41e-06   -30.21   0.000    -.0001096   -.0000962
             |
       ee_cl |
          2  |   .2364987   .0004051   583.77   0.000     .2357046    .2372927
          3  |   .2760054   .0004824   572.16   0.000     .2750599    .2769509
          4  |   .2223262    .000707   314.48   0.000     .2209405    .2237118
          5  |   .0231602   .0005159    44.89   0.000      .022149    .0241714
          6  |   .2309038   .0004655   496.08   0.000     .2299915    .2318161
          7  |   .2989085   .0005198   575.07   0.000     .2978898    .2999273
          8  |   .1225586   .0006744   181.74   0.000     .1212369    .1238803
          9  |    .072193   .0006107   118.22   0.000     .0709962    .0733899
         10  |   .2703727     .00057   474.34   0.000     .2692555    .2714898
         11  |   .2826928   .0006018   469.77   0.000     .2815134    .2838723
         12  |   .1436885   .0006955   206.59   0.000     .1423253    .1450517
         13  |   .2280723   .0007295   312.63   0.000     .2266425    .2295021
         14  |   .3003988   .0006673   450.19   0.000      .299091    .3017067
         15  |   .3305265   .0006784   487.19   0.000     .3291968    .3318562
         16  |   .0610184   .0007375    82.74   0.000      .059573    .0624639
             |
        marr |   .0660749   .0000935   706.50   0.000     .0658916    .0662582
      public |   .8482079   .0001456  5826.89   0.000     .8479226    .8484932
        cmsa |   .2470517   .0001542  1601.72   0.000     .2467494     .247354
             |
       state |
         NH  |  -.0230666   .0044451    -5.19   0.000    -.0317788   -.0143544
         VT  |  -.2361674   .0060888   -38.79   0.000    -.2481012   -.2242336
         MA  |  -.0107402   .0036762    -2.92   0.003    -.0179454   -.0035351
         RI  |   -.007218   .0037882    -1.91   0.057    -.0146426    .0002067
         CT  |   .0917819   .0036754    24.97   0.000     .0845782    .0989856
         NY  |   .5431544   .0036554   148.59   0.000     .5359899    .5503189
         NJ  |   .2417592   .0036608    66.04   0.000     .2345841    .2489343
         PA  |   .2483519   .0036601    67.85   0.000     .2411783    .2555255
         OH  |   .0963465   .0036578    26.34   0.000     .0891774    .1035157
         IN  |    .054658   .0036673    14.90   0.000     .0474703    .0618457
         IL  |   .3204191   .0036569    87.62   0.000     .3132517    .3275864
         MI  |   .4212845   .0036587   115.15   0.000     .4141135    .4284555
         WI  |   .0545818   .0036799    14.83   0.000     .0473694    .0617943
         MN  |   .1238035   .0036833    33.61   0.000     .1165843    .1310228
         IA  |  -.0766496   .0038454   -19.93   0.000    -.0841865   -.0691127
         MO  |   .0844025   .0036638    23.04   0.000     .0772216    .0915833
         ND  |   .0395264   .0054221     7.29   0.000     .0288993    .0501535
         SD  |  -.3103784   .0049088   -63.23   0.000    -.3199995   -.3007573
         NE  |  -.0423585   .0037607   -11.26   0.000    -.0497293   -.0349877
         KS  |   -.183519   .0036924   -49.70   0.000    -.1907559   -.1762821
         DE  |  -.1337907   .0038702   -34.57   0.000    -.1413762   -.1262051
         MD  |  -.0016877   .0036576    -0.46   0.644    -.0088565    .0054811
         DC  |  -.0574088   .0036711   -15.64   0.000     -.064604   -.0502136
         VA  |  -.5140615   .0036581  -140.53   0.000    -.5212313   -.5068917
         WV  |  -.0694163   .0038817   -17.88   0.000    -.0770243   -.0618082
         NC  |  -.8046952   .0036585  -219.95   0.000    -.8118657   -.7975247
         SC  |  -.9693244   .0036661  -264.41   0.000    -.9765098   -.9621391
         GA  |  -.6046206   .0036563  -165.36   0.000    -.6117867   -.5974544
         FL  |  -.4981611   .0036572  -136.22   0.000     -.505329   -.4909932
         KY  |  -.0611342   .0036734   -16.64   0.000     -.068334   -.0539345
         TN  |  -.3807226   .0036612  -103.99   0.000    -.3878984   -.3735469
         AL  |  -.3349473   .0036605   -91.50   0.000    -.3421218   -.3277728
         MS  |  -.6616665   .0036618  -180.69   0.000    -.6688435   -.6544895
         AR  |  -.4837541   .0036772  -131.56   0.000    -.4909613    -.476547
         LA  |  -.4978129   .0036622  -135.93   0.000    -.5049907    -.490635
         OK  |  -.4136733   .0036882  -112.16   0.000    -.4209019   -.4064446
         TX  |  -.5658369    .003656  -154.77   0.000    -.5730025   -.5586712
         MT  |  -.1062332   .0062999   -16.86   0.000    -.1185807   -.0938856
         ID  |  -.6948701   .0049761  -139.64   0.000    -.7046231    -.685117
         WY  |   -.507056    .006741   -75.22   0.000    -.5202682   -.4938438
         CO  |  -.2017613   .0036895   -54.69   0.000    -.2089926   -.1945301
         NM  |  -.5895674    .003957  -148.99   0.000    -.5973229   -.5818119
         AZ  |  -.5857559   .0037001  -158.31   0.000    -.5930079   -.5785039
         UT  |  -.8598456   .0041567  -206.86   0.000    -.8679925   -.8516987
         NV  |   .2404574   .0036889    65.18   0.000     .2332273    .2476875
         WA  |   .2186697   .0036785    59.45   0.000       .21146    .2258794
         OR  |   .1804943   .0037335    48.34   0.000     .1731768    .1878119
         CA  |   .1796077   .0036556    49.13   0.000     .1724428    .1867727
         AK  |    .069238   .0039685    17.45   0.000       .06146    .0770161
         HI  |  -.3552154    .003964   -89.61   0.000    -.3629848   -.3474461
             |
        nind |
          2  |   .3570301   .0004819   740.86   0.000     .3560856    .3579746
          3  |   .7005519   .0004603  1521.85   0.000     .6996497    .7014541
          4  |   .0207464   .0004715    44.00   0.000     .0198224    .0216705
          5  |   .7925896   .0004667  1698.32   0.000     .7916749    .7935043
          6  |  -.1846072   .0005263  -350.76   0.000    -.1856387   -.1835757
          7  |  -.1123471   .0004846  -231.85   0.000    -.1132969   -.1113974
          8  |   .2386191   .0004896   487.42   0.000     .2376596    .2395786
          9  |   .5401696   .0004981  1084.37   0.000     .5391933     .541146
         10  |    .092049   .0005231   175.97   0.000     .0910238    .0930743
         11  |   .3232276   .0005009   645.28   0.000     .3222458    .3242094
             |
       nocc3 |
          2  |   .2013224   .0001699  1185.24   0.000     .2009895    .2016553
          3  |   .3483837   .0001598  2180.26   0.000     .3480705    .3486969
          4  |   .4990642   .0001531  3260.42   0.000     .4987642    .4993642
             |
     quarter |
          2  |  -.0116735   .0001199   -97.38   0.000    -.0119085   -.0114386
          3  |   -.035705   .0001215  -293.79   0.000    -.0359432   -.0354668
          4  |   -.036766   .0001206  -304.83   0.000    -.0370024   -.0365296
             |
        year |
       1984  |   -.102264    .000317  -322.55   0.000    -.1028854   -.1016426
       1985  |  -.2013289   .0003481  -578.29   0.000    -.2020113   -.2006466
       1986  |   -.182625    .000317  -576.11   0.000    -.1832463   -.1820037
       1987  |  -.2334494   .0003191  -731.60   0.000    -.2340748    -.232824
       1988  |  -.1998764   .0003192  -626.23   0.000     -.200502   -.1992509
       1989  |  -.2806053    .000307  -914.05   0.000     -.281207   -.2800036
       1990  |  -.3018881   .0003077  -981.15   0.000    -.3024911    -.301285
       1991  |  -.3088913   .0003094  -998.34   0.000    -.3094977   -.3082849
       1992  |  -.3427896   .0003111 -1101.86   0.000    -.3433994   -.3421799
       1993  |  -.3705656    .000311 -1191.70   0.000    -.3711751   -.3699562
       1996  |   -.378179   .0003393 -1114.70   0.000    -.3788439    -.377514
       1997  |  -.4256944   .0003398 -1252.68   0.000    -.4263604   -.4250283
       1998  |  -.4252416   .0003356 -1266.93   0.000    -.4258995   -.4245838
       1999  |  -.4468493    .000342 -1306.61   0.000    -.4475196    -.446179
       2000  |  -.4755432   .0003473 -1369.37   0.000    -.4762239   -.4748626
       2001  |  -.5114134   .0003597 -1421.89   0.000    -.5121183   -.5107084
       2002  |  -.5028723   .0003586 -1402.49   0.000    -.5035751   -.5021695
       2003  |  -.4793799   .0003634 -1319.17   0.000    -.4800921   -.4786676
       2004  |  -.5715362   .0003707 -1541.86   0.000    -.5722627   -.5708097
       2005  |  -.6095112   .0003677 -1657.75   0.000    -.6102318   -.6087906
       2006  |   -.650789   .0003634 -1790.61   0.000    -.6515013   -.6500766
       2007  |  -.6109954   .0003545 -1723.59   0.000    -.6116902   -.6103006
       2008  |  -.6165651   .0003578 -1723.42   0.000    -.6172662   -.6158639
       2009  |  -.6089857   .0003653 -1667.02   0.000    -.6097017   -.6082697
       2010  |   -.616228   .0003669 -1679.60   0.000    -.6169471   -.6155089
       2011  |  -.6632333    .000375 -1768.68   0.000    -.6639682   -.6624983
       2012  |  -.6316066     .00037 -1707.15   0.000    -.6323317   -.6308815
       2013  |  -.6128513   .0003637 -1685.00   0.000    -.6135641   -.6121384
       2014  |  -.6549111   .0003676 -1781.73   0.000    -.6556316   -.6541907
       2015  |  -.6696665   .0003635 -1842.17   0.000     -.670379    -.668954
       2016  |    -.67974   .0003629 -1872.88   0.000    -.6804513   -.6790287
       2017  |  -.6066235   .0003573 -1697.86   0.000    -.6073238   -.6059232
       2018  |  -.6921402    .000359 -1927.94   0.000    -.6928438   -.6914366
       2019  |  -.7123905   .0003632 -1961.22   0.000    -.7131024   -.7116785
             |
       _cons |  -2.398949   .0038971  -615.57   0.000    -2.406587   -2.391311
------------------------------------------------------------------------------

.         predict pu1b1m
(option pr assumed; Pr(covered))
(376,470 missing values generated)

. 
. probit covered educ exper exper2 exper3 exper4 edex i.ee_cl marr public cmsa i.state i.nind i.
> nocc3 i.quarter i.year if nhblack == 0 [w = finalwt1]
(frequency weights assumed)

Iteration 0:   log likelihood = -4.833e+09  
Iteration 1:   log likelihood = -3.705e+09  
Iteration 2:   log likelihood = -3.656e+09  
Iteration 3:   log likelihood = -3.656e+09  
Iteration 4:   log likelihood = -3.656e+09  
Iteration 5:   log likelihood = -3.656e+09  

Probit regression                               Number of obs     =  1.005e+10
                                                LR chi2(123)      =   2.36e+09
                                                Prob > chi2       =     0.0000
Log likelihood = -3.656e+09                     Pseudo R2         =     0.2436

------------------------------------------------------------------------------
     covered |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        educ |   .0525951   .0000421  1247.98   0.000     .0525125    .0526777
       exper |   .1037783   .0000346  2998.30   0.000     .1037104    .1038461
      exper2 |  -.0043332   2.52e-06 -1722.60   0.000    -.0043381   -.0043283
      exper3 |   .0001102   8.57e-08  1285.71   0.000       .00011    .0001103
      exper4 |  -1.12e-06   9.46e-10 -1179.26   0.000    -1.12e-06   -1.11e-06
        edex |  -.0014098   1.43e-06  -982.69   0.000    -.0014126    -.001407
             |
       ee_cl |
          2  |   .1460069   .0001617   903.08   0.000       .14569    .1463237
          3  |   .1264688   .0001905   663.82   0.000     .1260954    .1268422
          4  |  -.0130639   .0002749   -47.53   0.000    -.0136027   -.0125252
          5  |  -.1163176   .0002217  -524.77   0.000     -.116752   -.1158832
          6  |   .1660247   .0001885   880.93   0.000     .1656553    .1663941
          7  |   .1789153     .00021   851.81   0.000     .1785037     .179327
          8  |  -.1223071   .0002661  -459.55   0.000    -.1228287   -.1217854
          9  |   .0187094   .0002615    71.56   0.000     .0181969    .0192218
         10  |   .2047977   .0002323   881.73   0.000     .2043425    .2052529
         11  |    .156864   .0002426   646.56   0.000     .1563885    .1573395
         12  |  -.1255366   .0002756  -455.45   0.000    -.1260768   -.1249964
         13  |   .2150149   .0003141   684.48   0.000     .2143992    .2156305
         14  |   .2332994   .0002714   859.63   0.000     .2327675    .2338313
         15  |   .1337688   .0002715   492.74   0.000     .1332367    .1343009
         16  |   -.119314   .0002886  -413.38   0.000    -.1198797   -.1187483
             |
        marr |   .0691879   .0000396  1746.81   0.000     .0691103    .0692656
      public |   .9144811   .0000642  1.4e+04   0.000     .9143553    .9146068
        cmsa |    .172667   .0000436  3959.65   0.000     .1725816    .1727525
             |
       state |
         NH  |  -.2656462   .0003763  -705.95   0.000    -.2663838   -.2649087
         VT  |  -.2423902   .0004211  -575.62   0.000    -.2432156   -.2415649
         MA  |   .0131065   .0002756    47.56   0.000     .0125664    .0136465
         RI  |   .0426917   .0003457   123.49   0.000     .0420141    .0433692
         CT  |   .0193583   .0002923    66.22   0.000     .0187853    .0199313
         NY  |   .3496894   .0002625  1332.14   0.000     .3491749    .3502039
         NJ  |   .1793039   .0002745   653.23   0.000     .1787659    .1798418
         PA  |   .0887384   .0002641   336.05   0.000     .0882208     .089256
         OH  |   .0535503   .0002628   203.77   0.000     .0530352    .0540654
         IN  |  -.0387136   .0002707  -143.01   0.000    -.0392442    -.038183
         IL  |   .1440545   .0002649   543.88   0.000     .1435354    .1445737
         MI  |   .1910915   .0002652   720.46   0.000     .1905716    .1916113
         WI  |  -.0035468   .0002715   -13.07   0.000    -.0040789   -.0030148
         MN  |     .10313   .0002722   378.91   0.000     .1025966    .1036635
         IA  |  -.1171908   .0002956  -396.50   0.000    -.1177701   -.1166115
         MO  |  -.0358577   .0002731  -131.29   0.000     -.036393   -.0353224
         ND  |  -.3922393   .0005133  -764.15   0.000    -.3932453   -.3912332
         SD  |  -.5629217   .0004701 -1197.39   0.000    -.5638431   -.5620002
         NE  |  -.3034611   .0003244  -935.36   0.000    -.3040969   -.3028252
         KS  |  -.3213718   .0002962 -1085.16   0.000    -.3219522   -.3207913
         DE  |  -.2443721   .0007282  -335.58   0.000    -.2457994   -.2429448
         MD  |  -.2297121   .0002889  -795.23   0.000    -.2302782   -.2291459
         DC  |  -.2499702   .0005414  -461.73   0.000    -.2510313   -.2489092
         VA  |  -.6379052   .0002814 -2266.52   0.000    -.6384569   -.6373536
         WV  |   .0029645   .0003275     9.05   0.000     .0023225    .0036064
         NC  |  -.9280893   .0002912 -3187.36   0.000      -.92866   -.9275186
         SC  |  -.9299687   .0003358 -2769.19   0.000     -.930627   -.9293105
         GA  |  -.5893576   .0002844 -2072.15   0.000    -.5899151   -.5888002
         FL  |  -.4822023   .0002728 -1767.72   0.000     -.482737   -.4816677
         KY  |    -.19745   .0002807  -703.47   0.000    -.1980002   -.1968999
         TN  |  -.4729147   .0002825 -1673.95   0.000    -.4734684    -.472361
         AL  |   -.317307   .0002961 -1071.46   0.000    -.3178874   -.3167266
         MS  |  -.6285385   .0003275 -1919.06   0.000    -.6291804   -.6278965
         AR  |  -.6407345   .0003207 -1998.05   0.000    -.6413631    -.640106
         LA  |  -.5476864   .0003121 -1754.67   0.000    -.5482982   -.5470747
         OK  |  -.5135398   .0002984 -1720.87   0.000    -.5141247    -.512955
         TX  |  -.5930022   .0002679 -2213.48   0.000    -.5935273   -.5924771
         MT  |  -.0086503   .0003807   -22.72   0.000    -.0093964   -.0079042
         ID  |   -.438145   .0003582 -1223.19   0.000    -.4388471    -.437443
         WY  |  -.3852022   .0004929  -781.54   0.000    -.3861682   -.3842362
         CO  |  -.2877583   .0002922  -984.67   0.000    -.2883311   -.2871855
         NM  |  -.5287643   .0004093 -1291.83   0.000    -.5295666   -.5279621
         AZ  |  -.5466175   .0002962 -1845.46   0.000     -.547198    -.546037
         UT  |  -.5235242   .0003194 -1639.16   0.000    -.5241502   -.5228982
         NV  |   .0730904    .000321   227.68   0.000     .0724612    .0737196
         WA  |   .2374992   .0002727   870.98   0.000     .2369648    .2380337
         OR  |   .0619634   .0002843   217.97   0.000     .0614062    .0625206
         CA  |   .1301903   .0002615   497.87   0.000     .1296777    .1307028
         AK  |   .1556297   .0004012   387.90   0.000     .1548434    .1564161
         HI  |    .182275   .0004771   382.07   0.000     .1813399      .18321
             |
        nind |
          2  |   .4847008   .0001316  3683.90   0.000      .484443    .4849587
          3  |    .480117   .0001269  3783.21   0.000     .4798683    .4803658
          4  |   .0045568   .0001327    34.33   0.000     .0042966    .0048169
          5  |   .8475123   .0001307  6482.05   0.000      .847256    .8477685
          6  |     -.2523   .0001698 -1486.11   0.000    -.2526328   -.2519673
          7  |  -.1438258    .000142 -1012.99   0.000    -.1441041   -.1435475
          8  |     .27171   .0001545  1759.20   0.000     .2714073    .2720127
          9  |   .9424465   .0001455  6478.64   0.000     .9421614    .9427316
         10  |   .1597067   .0001688   946.06   0.000     .1593758    .1600376
         11  |   .5290132   .0001504  3517.42   0.000     .5287184     .529308
             |
       nocc3 |
          2  |   .2663782   .0000645  4130.48   0.000     .2662518    .2665046
          3  |   .5123607   .0000694  7387.13   0.000     .5122247    .5124966
          4  |   .7982495   .0000534  1.5e+04   0.000     .7981447    .7983542
             |
     quarter |
          2  |  -.0143092   .0000465  -307.58   0.000    -.0144004    -.014218
          3  |  -.0110644   .0000472  -234.45   0.000    -.0111569   -.0109719
          4  |  -.0181472   .0000467  -388.79   0.000    -.0182386   -.0180557
             |
        year |
       1984  |  -.0712582   .0001149  -620.38   0.000    -.0714833   -.0710331
       1985  |  -.1233962   .0001261  -978.67   0.000    -.1236433   -.1231491
       1986  |  -.1422556   .0001166 -1219.88   0.000    -.1424841    -.142027
       1987  |  -.1653974   .0001179 -1403.14   0.000    -.1656284   -.1651664
       1988  |  -.1785343   .0001182 -1510.36   0.000     -.178766   -.1783026
       1989  |  -.2184825   .0001146 -1906.53   0.000    -.2187072   -.2182579
       1990  |  -.2404449   .0001152 -2086.70   0.000    -.2406708   -.2402191
       1991  |  -.2568027   .0001163 -2208.90   0.000    -.2570305   -.2565748
       1992  |  -.2711313   .0001164 -2329.65   0.000    -.2713594   -.2709032
       1993  |  -.2727959   .0001165 -2340.70   0.000    -.2730243   -.2725674
       1996  |  -.3339784    .000126 -2649.96   0.000    -.3342254   -.3337313
       1997  |  -.3364995    .000126 -2671.48   0.000    -.3367464   -.3362526
       1998  |  -.3638608    .000127 -2865.41   0.000    -.3641096   -.3636119
       1999  |  -.3515398   .0001278 -2751.54   0.000    -.3517902   -.3512894
       2000  |  -.3767118    .000131 -2876.46   0.000    -.3769685   -.3764551
       2001  |  -.3937958   .0001325 -2971.53   0.000    -.3940555   -.3935361
       2002  |  -.3959846   .0001333 -2970.21   0.000    -.3962459   -.3957233
       2003  |  -.4107395   .0001349 -3045.44   0.000    -.4110038   -.4104752
       2004  |  -.4270687   .0001355 -3151.35   0.000    -.4273343   -.4268031
       2005  |  -.4632354   .0001359 -3408.73   0.000    -.4635018   -.4629691
       2006  |  -.4698135   .0001361 -3453.21   0.000    -.4700801   -.4695468
       2007  |  -.4705181   .0001352 -3479.38   0.000    -.4707831    -.470253
       2008  |  -.4214894    .000135 -3123.03   0.000    -.4217539   -.4212249
       2009  |  -.4396621   .0001374 -3199.71   0.000    -.4399314   -.4393927
       2010  |  -.4595362   .0001401 -3280.10   0.000    -.4598108   -.4592616
       2011  |  -.4888438   .0001415 -3454.58   0.000    -.4891211   -.4885665
       2012  |  -.4789735   .0001411 -3393.91   0.000    -.4792501   -.4786969
       2013  |  -.4836582   .0001431 -3379.80   0.000    -.4839386   -.4833777
       2014  |  -.4866673   .0001432 -3398.63   0.000    -.4869479   -.4863866
       2015  |  -.4943494   .0001444 -3422.57   0.000    -.4946325   -.4940663
       2016  |   -.496772   .0001433 -3467.66   0.000    -.4970528   -.4964912
       2017  |   -.468895   .0001424 -3293.78   0.000     -.469174   -.4686159
       2018  |  -.4605978    .000142 -3243.61   0.000    -.4608761   -.4603195
       2019  |  -.4887922   .0001441 -3391.13   0.000    -.4890747   -.4885097
             |
       _cons |  -3.036035   .0005614 -5408.11   0.000    -3.037136   -3.034935
------------------------------------------------------------------------------

.         predict pu1b0m
(option pr assumed; Pr(covered))
(376,470 missing values generated)

. 
. gen theta2m = (pb1m/(1-pb1m)) * (pu1b1m/pu1b0m) if nhblack == 0 & covered == 1
(1,520,652 missing values generated)

. 
. replace theta2m = theta2m * hweight if nhblack == 0 & covered == 1
(239,410 real changes made)

. 
. kdensity lwage3 [aweight = theta2m] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(cu_wmestpt cu_wmde) nograph

.         
. gen theta3m = (pb1m/(1-pb1m)) * ((1-pu1b1m)/(1-pu1b1m)) if nhblack == 0 & covered == 0
(746,827 missing values generated)

. 
. replace theta3m = theta3m * hweight if nhblack == 0 & covered == 0
(1,013,235 real changes made)

. 
. kdensity lwage3 [aweight = theta3m] if hisprace == 1, at(kwage) gauss width(0.065) ///
>         generate(cn_wmestpt cn_wmde) nograph

. 
. ** median
. ** FIXME run foreach loop for q20 q50 q80
. 
. qui tab state,   gen(dumstate)

. qui tab year,    gen(dumyear)

. qui tab nind,    gen(dumnind)

. qui tab ee_cl,   gen(dumee_cl)

. qui tab nocc3,   gen(dumnocc3)

. qui tab quarter, gen(dumquarter)

. 
. ** RIF for white men covered by a union
. forvalues qt = 20(30)80{
  2.         rifreg lwage1 dumstate* dumyear* dumnind* educ exper exper2 exper3 exper4 edex dume
> e_cl* marr public cmsa dumnocc3* dumquarter* if hisprace == 1 & covered == 1 [w = hweight], q(
> `qt') retain(rifwmu_`qt')
  3.         
.         rifreg lwage1 dumstate* dumyear* dumnind* educ exper exper2 exper3 exper4 edex dumee_c
> l* marr public cmsa dumnocc3* dumquarter* if hisprace == 2 & covered == 1 [w = hweight], q(`qt
> ') retain(rifbmu_`qt')
  4.         
.         rifreg lwage1 dumstate* dumyear* dumnind* educ exper exper2 exper3 exper4 edex dumee_c
> l* marr public cmsa dumnocc3* dumquarter* if hisprace == 1 & covered == 1 [w = theta2m], q(`qt
> ') retain(rifwmcu_`qt')
  5.         
.         rifreg lwage1 dumstate* dumyear* dumnind* educ exper exper2 exper3 exper4 edex dumee_c
> l* marr public cmsa dumnocc3* dumquarter* if hisprace == 1 & covered == 0 [w = hweight], q(`qt
> ') retain(rifwmn_`qt')
  6.         
.         rifreg lwage1 dumstate* dumyear* dumnind* educ exper exper2 exper3 exper4 edex dumee_c
> l* marr public cmsa dumnocc3* dumquarter* if hisprace == 2 & covered == 0 [w = hweight], q(`qt
> ') retain(rifbmn_`qt')
  7.         
.         rifreg lwage1 dumstate* dumyear* dumnind* educ exper exper2 exper3 exper4 edex dumee_c
> l* marr public cmsa dumnocc3* dumquarter* if hisprace == 1 & covered == 0 [w = theta3m], q(`qt
> ') retain(rifwmcn_`qt')
  8.         
. }
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(1,520,652 real changes made)

      Source |       SS       df       MS              Number of obs =  239410
-------------+------------------------------           F(124,239285) =  338.09
       Model |  15163.0859   124  122.282951           Prob > F      =  0.0000
    Residual |  71072.2247 239285  .297019139          R-squared     =  0.1758
-------------+------------------------------           Adj R-squared =  0.1754
       Total |  86235.3105 239409  .360200788          Root MSE      =  .54499
------------------------------------------------------------------------------
             |               Robust
   rifwmu_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.0650319   .0306776    -2.12   0.034    -.1251592   -.0049045
   dumstate2 |   -.055557   .0311042    -1.79   0.074    -.1165204    .0054064
   dumstate3 |  -.1477991   .0309621    -4.77   0.000    -.2084839   -.0871143
   dumstate4 |  -.0158612   .0287681    -0.55   0.581    -.0722459    .0405234
   dumstate5 |  -.0887124   .0296616    -2.99   0.003    -.1468483   -.0305765
   dumstate6 |     .04238    .029356     1.44   0.149    -.0151569     .099917
   dumstate7 |  -.0217884    .028318    -0.77   0.442    -.0772909    .0337142
   dumstate8 |   .0331743   .0286453     1.16   0.247    -.0229698    .0893184
   dumstate9 |  -.0948648   .0285259    -3.33   0.001    -.1507747   -.0389549
  dumstate10 |  -.0677768   .0284535    -2.38   0.017    -.1235448   -.0120087
  dumstate11 |  -.0961182   .0293481    -3.28   0.001    -.1536396   -.0385967
  dumstate12 |  -.0080327   .0284966    -0.28   0.778    -.0638853    .0478198
  dumstate13 |  -.0007527   .0284231    -0.03   0.979    -.0564611    .0549558
  dumstate14 |  -.0228541   .0289052    -0.79   0.429    -.0795076    .0337994
  dumstate15 |   .0200641   .0287954     0.70   0.486    -.0363741    .0765023
  dumstate16 |  -.1000129   .0299036    -3.34   0.001    -.1586231   -.0414027
  dumstate17 |   -.077691   .0294898    -2.63   0.008    -.1354901   -.0198918
  dumstate18 |  -.1140467   .0331072    -3.44   0.001     -.178936   -.0491575
  dumstate19 |  -.2130779   .0327746    -6.50   0.000    -.2773152   -.1488406
  dumstate20 |  -.1589509   .0302518    -5.25   0.000    -.2182436   -.0996581
  dumstate21 |  -.0670195   .0298528    -2.25   0.025    -.1255301   -.0085089
  dumstate22 |          0  (omitted)
  dumstate23 |    .018411   .0299766     0.61   0.539    -.0403424    .0771644
  dumstate24 |  -.0158386   .0321504    -0.49   0.622    -.0788525    .0471754
  dumstate25 |  -.0179871    .030306    -0.59   0.553     -.077386    .0414118
  dumstate26 |  -.0823707   .0304418    -2.71   0.007    -.1420359   -.0227055
  dumstate27 |  -.1389406   .0316288    -4.39   0.000    -.2009322   -.0769491
  dumstate28 |  -.1403256   .0382629    -3.67   0.000    -.2153199   -.0653312
  dumstate29 |  -.0823497   .0315105    -2.61   0.009    -.1441094   -.0205899
  dumstate30 |  -.1395947   .0296721    -4.70   0.000    -.1977513   -.0814382
  dumstate31 |  -.1390583   .0300064    -4.63   0.000    -.1978701   -.0802465
  dumstate32 |  -.1593422   .0310272    -5.14   0.000    -.2201547   -.0985297
  dumstate33 |  -.1282979    .031589    -4.06   0.000    -.1902115   -.0663843
  dumstate34 |  -.1916576   .0337366    -5.68   0.000    -.2577805   -.1255348
  dumstate35 |  -.2104598   .0325592    -6.46   0.000     -.274275   -.1466446
  dumstate36 |  -.0577056   .0331749    -1.74   0.082    -.1227275    .0073163
  dumstate37 |  -.1686205   .0314232    -5.37   0.000    -.2302092   -.1070319
  dumstate38 |  -.0813785   .0293993    -2.77   0.006    -.1390003   -.0237567
  dumstate39 |  -.1018063   .0302376    -3.37   0.001    -.1610712   -.0425414
  dumstate40 |  -.1217647   .0313484    -3.88   0.000    -.1832068   -.0603225
  dumstate41 |   .0614884   .0305842     2.01   0.044     .0015442    .1214327
  dumstate42 |  -.0782576   .0305137    -2.56   0.010    -.1380637   -.0184514
  dumstate43 |  -.1060331   .0356773    -2.97   0.003    -.1759596   -.0361066
  dumstate44 |  -.0836514   .0320554    -2.61   0.009    -.1464791   -.0208237
  dumstate45 |  -.1108833   .0306875    -3.61   0.000    -.1710299   -.0507367
  dumstate46 |  -.0070369   .0300712    -0.23   0.815    -.0659756    .0519018
  dumstate47 |   .0240303    .028917     0.83   0.406    -.0326463     .080707
  dumstate48 |  -.0402533   .0293618    -1.37   0.170    -.0978016    .0172949
  dumstate49 |   .0505923   .0283387     1.79   0.074    -.0049507    .1061353
  dumstate50 |   .1249991   .0287532     4.35   0.000     .0686436    .1813546
  dumstate51 |  -.0167362   .0327317    -0.51   0.609    -.0808896    .0474171
    dumyear1 |   .0667235   .0121585     5.49   0.000     .0428931     .090554
    dumyear2 |   .0543733   .0122466     4.44   0.000     .0303703    .0783762
    dumyear3 |   .0704278   .0125559     5.61   0.000     .0458185    .0950371
    dumyear4 |   .0819075   .0121252     6.76   0.000     .0581425    .1056725
    dumyear5 |   .0773356   .0122265     6.33   0.000     .0533719    .1012993
    dumyear6 |   .0511564   .0124575     4.11   0.000       .02674    .0755728
    dumyear7 |   .0340355   .0124506     2.73   0.006     .0096327    .0584383
    dumyear8 |  -.0195707   .0124565    -1.57   0.116    -.0439851    .0048436
    dumyear9 |  -.0270681   .0125251    -2.16   0.031     -.051617   -.0025191
   dumyear10 |  -.0109959   .0125644    -0.88   0.381    -.0356219      .01363
   dumyear11 |   -.033168    .012702    -2.61   0.009    -.0580636   -.0082724
   dumyear12 |  -.0222959   .0135822    -1.64   0.101    -.0489167    .0043249
   dumyear13 |  -.0042084   .0133627    -0.31   0.753    -.0303989     .021982
   dumyear14 |   .0030732   .0135024     0.23   0.820    -.0233911    .0295375
   dumyear15 |   .0208958   .0134804     1.55   0.121    -.0055254    .0473171
   dumyear16 |   .0387248   .0135592     2.86   0.004     .0121491    .0653005
   dumyear17 |    .014352   .0137848     1.04   0.298    -.0126659    .0413699
   dumyear18 |   .0206708   .0135406     1.53   0.127    -.0058684    .0472099
   dumyear19 |   .0350044    .013815     2.53   0.011     .0079274    .0620813
   dumyear20 |   .0395946   .0137889     2.87   0.004     .0125687    .0666205
   dumyear21 |   .0302336   .0137907     2.19   0.028     .0032041     .057263
   dumyear22 |   .0149797   .0141283     1.06   0.289    -.0127114    .0426709
   dumyear23 |    .027576   .0139883     1.97   0.049     .0001593    .0549927
   dumyear24 |   .0101077   .0141362     0.72   0.475     -.017599    .0378143
   dumyear25 |   .0090984   .0143909     0.63   0.527    -.0191073    .0373042
   dumyear26 |   .0221878   .0144354     1.54   0.124    -.0061052    .0504808
   dumyear27 |   .0018164   .0146228     0.12   0.901    -.0268438    .0304767
   dumyear28 |  -.0161905   .0150556    -1.08   0.282     -.045699    .0133179
   dumyear29 |  -.0037412   .0148596    -0.25   0.801    -.0328657    .0253833
   dumyear30 |  -.0084916   .0152707    -0.56   0.578    -.0384217    .0214385
   dumyear31 |          0  (omitted)
   dumyear32 |   .0040096   .0152114     0.26   0.792    -.0258044    .0338236
   dumyear33 |   .0222851   .0149418     1.49   0.136    -.0070004    .0515706
   dumyear34 |   .0265977   .0150451     1.77   0.077    -.0028903    .0560856
   dumyear35 |   .0125151     .01561     0.80   0.423    -.0180801    .0431103
    dumnind1 |     .22372   .0177561    12.60   0.000     .1889185    .2585215
    dumnind2 |   .2067955   .0139279    14.85   0.000     .1794972    .2340939
    dumnind3 |   .0602015   .0138513     4.35   0.000     .0330533    .0873498
    dumnind4 |  -.1076476   .0147057    -7.32   0.000    -.1364705   -.0788248
    dumnind5 |   .1877562   .0137355    13.67   0.000     .1608349    .2146775
    dumnind6 |          0  (omitted)
    dumnind7 |   .0122028   .0155937     0.78   0.434    -.0183605     .042766
    dumnind8 |  -.1627741   .0162844   -10.00   0.000    -.1946912   -.1308571
    dumnind9 |  -.0912995    .014401    -6.34   0.000     -.119525    -.063074
   dumnind10 |  -.1470286   .0182288    -8.07   0.000    -.1827566   -.1113005
   dumnind11 |   .1748132    .014419    12.12   0.000     .1465523    .2030741
        educ |   .0810021   .0037777    21.44   0.000     .0735979    .0884062
       exper |   .1291457   .0034172    37.79   0.000      .122448    .1358433
      exper2 |  -.0057715   .0002326   -24.81   0.000    -.0062274   -.0053156
      exper3 |   .0001341   7.42e-06    18.07   0.000     .0001195    .0001486
      exper4 |  -1.18e-06   7.94e-08   -14.83   0.000    -1.33e-06   -1.02e-06
        edex |  -.0012292   .0001225   -10.04   0.000    -.0014693   -.0009892
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |    .132774   .0189111     7.02   0.000     .0957088    .1698392
   dumee_cl3 |   .1580483   .0212036     7.45   0.000     .1164897    .1996069
   dumee_cl4 |   .1264251   .0271539     4.66   0.000     .0732042    .1796459
   dumee_cl5 |   .0250668   .0245822     1.02   0.308    -.0231137    .0732474
   dumee_cl6 |   .1336453   .0208903     6.40   0.000     .0927009    .1745897
   dumee_cl7 |   .1471194   .0224049     6.57   0.000     .1032065    .1910324
   dumee_cl8 |   .0437498   .0266034     1.64   0.100    -.0083922    .0958918
   dumee_cl9 |   .0744553   .0255097     2.92   0.004      .024457    .1244536
  dumee_cl10 |   .1387302   .0232323     5.97   0.000     .0931954     .184265
  dumee_cl11 |   .1400733   .0239789     5.84   0.000     .0930754    .1870713
  dumee_cl12 |   .0663081   .0264341     2.51   0.012      .014498    .1181183
  dumee_cl13 |   .0854599   .0282816     3.02   0.003     .0300287    .1408911
  dumee_cl14 |   .1247147   .0254502     4.90   0.000     .0748329    .1745965
  dumee_cl15 |   .1179758   .0253647     4.65   0.000     .0682616      .16769
  dumee_cl16 |   .0818074   .0264288     3.10   0.002     .0300075    .1336072
        marr |   .0865338   .0032602    26.54   0.000     .0801439    .0929237
      public |   -.013399   .0044634    -3.00   0.003    -.0221471    -.004651
        cmsa |   .1293102    .003659    35.34   0.000     .1221387    .1364817
   dumnocc31 |   .1183888   .0059816    19.79   0.000     .1066651    .1301125
   dumnocc32 |          0  (omitted)
   dumnocc33 |  -.0994054   .0070856   -14.03   0.000    -.1132929   -.0855178
   dumnocc34 |   .0695532   .0051262    13.57   0.000     .0595059    .0796005
 dumquarter1 |  -.0112449   .0036497    -3.08   0.002    -.0183981   -.0040917
 dumquarter2 |  -.0083935   .0036835    -2.28   0.023     -.015613    -.001174
 dumquarter3 |          0  (omitted)
 dumquarter4 |   .0056074   .0036647     1.53   0.126    -.0015754    .0127901
       _cons |  -.5031693   .0548497    -9.17   0.000    -.6106733   -.3956654
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate41 dropped because of collinearity
note: dumyear34 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl4 dropped because of collinearity
note: dumnocc31 dropped because of collinearity
note: dumquarter4 dropped because of collinearity
(1,728,357 real changes made)

      Source |       SS       df       MS              Number of obs =   31705
-------------+------------------------------           F(124, 31580) =   45.69
       Model |  2742.04143   124  22.1132373           Prob > F      =  0.0000
    Residual |  12085.3954 31580  .382691432           R-squared     =  0.1849
-------------+------------------------------           Adj R-squared =  0.1817
       Total |  14827.4368 31704  .467683473           Root MSE      =  .61862
------------------------------------------------------------------------------
             |               Robust
   rifbmu_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.0346842   .4329231    -0.08   0.936    -.8832305    .8138621
   dumstate2 |   .1825505   .3638481     0.50   0.616     -.530606     .895707
   dumstate3 |  -.1133897    .419487    -0.27   0.787    -.9356006    .7088212
   dumstate4 |  -.0272703   .3546965    -0.08   0.939    -.7224893    .6679488
   dumstate5 |  -.0662091   .3577669    -0.19   0.853    -.7674463    .6350281
   dumstate6 |   .0499841   .3540177     0.14   0.888    -.6439043    .7438726
   dumstate7 |  -.0432222   .3530856    -0.12   0.903    -.7352838    .6488393
   dumstate8 |   -.053593   .3533516    -0.15   0.879    -.7461759      .63899
   dumstate9 |  -.0847794    .353478    -0.24   0.810    -.7776101    .6080512
  dumstate10 |  -.0570445   .3532104    -0.16   0.872    -.7493506    .6352617
  dumstate11 |  -.0320723   .3546221    -0.09   0.928    -.7271456     .663001
  dumstate12 |  -.0657409   .3531584    -0.19   0.852    -.7579453    .6264634
  dumstate13 |   .0218213   .3531344     0.06   0.951    -.6703359    .7139786
  dumstate14 |  -.1076285   .3554408    -0.30   0.762    -.8043064    .5890495
  dumstate15 |  -.0006629   .3555451    -0.00   0.999    -.6975453    .6962194
  dumstate16 |  -.1052703   .3661169    -0.29   0.774    -.8228738    .6123332
  dumstate17 |  -.0882322   .3538678    -0.25   0.803    -.7818269    .6053624
  dumstate18 |    .253858    .375596     0.68   0.499    -.4823249     .990041
  dumstate19 |  -.5892147   .4088131    -1.44   0.150    -1.390504    .2120749
  dumstate20 |  -.1869238   .3575574    -0.52   0.601    -.8877503    .5139027
  dumstate21 |  -.0069947   .3546688    -0.02   0.984    -.7021594      .68817
  dumstate22 |  -.1772349   .3625062    -0.49   0.625    -.8877611    .5332914
  dumstate23 |  -.0317159   .3532863    -0.09   0.928    -.7241708    .6607391
  dumstate24 |    -.00471   .3531732    -0.01   0.989    -.6969432    .6875233
  dumstate25 |  -.0885596   .3536029    -0.25   0.802    -.7816352     .604516
  dumstate26 |   .1908679   .3582173     0.53   0.594    -.5112519    .8929878
  dumstate27 |   -.189749   .3537014    -0.54   0.592    -.8830175    .5035196
  dumstate28 |  -.1828542   .3556388    -0.51   0.607    -.8799203    .5142118
  dumstate29 |  -.0958024    .353686    -0.27   0.786    -.7890408     .597436
  dumstate30 |  -.1988498   .3537152    -0.56   0.574    -.8921454    .4944458
  dumstate31 |  -.0350423   .3544289    -0.10   0.921    -.7297367    .6596522
  dumstate32 |  -.1650168   .3541625    -0.47   0.641    -.8591891    .5291556
  dumstate33 |  -.1979004     .35344    -0.56   0.576    -.8906565    .4948558
  dumstate34 |  -.2654927   .3538852    -0.75   0.453    -.9591216    .4281362
  dumstate35 |  -.3291252   .3555227    -0.93   0.355    -1.025964    .3677133
  dumstate36 |  -.1535268   .3540974    -0.43   0.665    -.8475717     .540518
  dumstate37 |  -.1509397   .3557748    -0.42   0.671    -.8482723    .5463928
  dumstate38 |  -.0964189   .3533316    -0.27   0.785    -.7889627    .5961249
  dumstate39 |   .3994358   .3634659     1.10   0.272    -.3129716    1.111843
  dumstate40 |  -.9210889   .4584462    -2.01   0.045    -1.819661   -.0225165
  dumstate41 |          0  (omitted)
  dumstate42 |  -.0095818   .3562058    -0.03   0.979     -.707759    .6885954
  dumstate43 |  -.1981216   .3745616    -0.53   0.597     -.932277    .5360339
  dumstate44 |  -.0263831   .3581706    -0.07   0.941    -.7284115    .6756453
  dumstate45 |   .0590999    .368971     0.16   0.873    -.6640977    .7822974
  dumstate46 |   .0744378   .3549262     0.21   0.834    -.6212314     .770107
  dumstate47 |  -.0062494   .3548458    -0.02   0.986    -.7017609    .6892622
  dumstate48 |   -.065241   .3604574    -0.18   0.856    -.7717516    .6412696
  dumstate49 |   .0408018   .3530563     0.12   0.908    -.6512024    .7328061
  dumstate50 |   .0910609   .3545085     0.26   0.797    -.6037897    .7859114
  dumstate51 |  -.0815106   .3647627    -0.22   0.823    -.7964597    .6334385
    dumyear1 |   .0956363   .0373425     2.56   0.010     .0224435     .168829
    dumyear2 |   .0973647   .0374274     2.60   0.009     .0240055    .1707239
    dumyear3 |   .1132411   .0386196     2.93   0.003     .0375452    .1889371
    dumyear4 |   .1375411   .0366985     3.75   0.000     .0656105    .2094717
    dumyear5 |   .1017295   .0374643     2.72   0.007     .0282981    .1751609
    dumyear6 |   .1274994   .0376613     3.39   0.001     .0536818     .201317
    dumyear7 |   .0183224   .0386452     0.47   0.635    -.0574238    .0940685
    dumyear8 |  -.0133528    .038462    -0.35   0.728    -.0887399    .0620343
    dumyear9 |  -.0247818   .0385501    -0.64   0.520    -.1003414    .0507779
   dumyear10 |  -.0364722   .0392313    -0.93   0.353    -.1133671    .0404227
   dumyear11 |  -.0204523   .0387225    -0.53   0.597    -.0963498    .0554453
   dumyear12 |  -.0123737   .0415619    -0.30   0.766    -.0938366    .0690892
   dumyear13 |   .0140496   .0422534     0.33   0.740    -.0687687     .096868
   dumyear14 |   .0421685    .040827     1.03   0.302     -.037854     .122191
   dumyear15 |   .0707961   .0410108     1.73   0.084    -.0095867    .1511788
   dumyear16 |  -.0187411   .0424939    -0.44   0.659    -.1020307    .0645486
   dumyear17 |   .0295172   .0418688     0.70   0.481    -.0525472    .1115816
   dumyear18 |   .0552039   .0423009     1.31   0.192    -.0277076    .1381154
   dumyear19 |   .0369951   .0421317     0.88   0.380    -.0455847    .1195748
   dumyear20 |   .0601303   .0455447     1.32   0.187    -.0291392    .1493997
   dumyear21 |  -.0010837    .044508    -0.02   0.981    -.0883212    .0861538
   dumyear22 |    .035558   .0435113     0.82   0.414    -.0497258    .1208418
   dumyear23 |   .0742134   .0427035     1.74   0.082    -.0094871     .157914
   dumyear24 |   .0285723   .0450671     0.63   0.526    -.0597609    .1169055
   dumyear25 |   .0197897   .0438388     0.45   0.652     -.066136    .1057154
   dumyear26 |   .0138254   .0432105     0.32   0.749     -.070869    .0985197
   dumyear27 |   .0002707   .0458556     0.01   0.995     -.089608    .0901494
   dumyear28 |          0  (omitted)
   dumyear29 |  -.0048333   .0450315    -0.11   0.915    -.0930969    .0834302
   dumyear30 |    .022003   .0451985     0.49   0.626    -.0665877    .1105938
   dumyear31 |   -.041008   .0455448    -0.90   0.368    -.1302777    .0482616
   dumyear32 |  -.0024448   .0471953    -0.05   0.959    -.0949494    .0900598
   dumyear33 |   .0023337   .0473728     0.05   0.961    -.0905189    .0951863
   dumyear34 |  -.0289965   .0493485    -0.59   0.557    -.1257215    .0677286
   dumyear35 |   .0662357   .0484109     1.37   0.171    -.0286516     .161123
    dumnind1 |          0  (omitted)
    dumnind2 |   .0828743   .0756044     1.10   0.273    -.0653132    .2310618
    dumnind3 |   .0454013   .0742669     0.61   0.541    -.1001648    .1909673
    dumnind4 |  -.2145628   .0763926    -2.81   0.005    -.3642952   -.0648304
    dumnind5 |   .1006344   .0745471     1.35   0.177    -.0454809    .2467498
    dumnind6 |  -.0099684   .0804777    -0.12   0.901    -.1677079    .1477711
    dumnind7 |  -.2284513   .0778791    -2.93   0.003    -.3810973   -.0758052
    dumnind8 |  -.1929591   .0766539    -2.52   0.012    -.3432037   -.0427144
    dumnind9 |   -.113584   .0761835    -1.49   0.136    -.2629066    .0357386
   dumnind10 |  -.2452239   .0816425    -3.00   0.003    -.4052464   -.0852014
   dumnind11 |   .1101265   .0759135     1.45   0.147    -.0386669    .2589199
        educ |   .0587026   .0116004     5.06   0.000     .0359652    .0814399
       exper |   .1207849   .0104371    11.57   0.000     .1003278     .141242
      exper2 |  -.0052953   .0006914    -7.66   0.000    -.0066504   -.0039401
      exper3 |   .0001224    .000021     5.83   0.000     .0000812    .0001635
      exper4 |  -1.07e-06   2.17e-07    -4.94   0.000    -1.50e-06   -6.45e-07
        edex |  -.0012583   .0003407    -3.69   0.000    -.0019261   -.0005904
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |   .2209066   .0554732     3.98   0.000     .1121769    .3296362
   dumee_cl3 |   .3867617   .0635544     6.09   0.000     .2621926    .5113308
   dumee_cl4 |   .4348366   .0824054     5.28   0.000     .2733188    .5963543
   dumee_cl5 |   .0408154   .0717082     0.57   0.569    -.0997356    .1813663
   dumee_cl6 |   .2562888   .0617324     4.15   0.000     .1352908    .3772868
   dumee_cl7 |   .3240033   .0664661     4.87   0.000     .1937272    .4542793
   dumee_cl8 |   .3207669   .0799005     4.01   0.000     .1641589     .477375
   dumee_cl9 |   .1716771   .0730235     2.35   0.019     .0285481    .3148061
  dumee_cl10 |   .2836875   .0688969     4.12   0.000     .1486469    .4187281
  dumee_cl11 |   .3520664   .0716199     4.92   0.000     .2116886    .4924443
  dumee_cl12 |   .3102368   .0797688     3.89   0.000     .1538868    .4665868
  dumee_cl13 |   .2001254   .0802608     2.49   0.013     .0428111    .3574396
  dumee_cl14 |   .3002147   .0752587     3.99   0.000     .1527048    .4477247
  dumee_cl15 |   .3509485   .0758707     4.63   0.000     .2022389     .499658
  dumee_cl16 |   .3490263   .0797656     4.38   0.000     .1926827      .50537
        marr |   .0724898   .0087112     8.32   0.000     .0554155    .0895642
      public |   .0771544   .0119521     6.46   0.000     .0537278    .1005811
        cmsa |   .1676029   .0190085     8.82   0.000     .1303455    .2048604
   dumnocc31 |    .136296   .0170288     8.00   0.000     .1029189     .169673
   dumnocc32 |          0  (omitted)
   dumnocc33 |   -.105829   .0177774    -5.95   0.000    -.1406734   -.0709845
   dumnocc34 |   .0659718   .0137919     4.78   0.000     .0389392    .0930044
 dumquarter1 |   .0032978   .0114092     0.29   0.773    -.0190647    .0256602
 dumquarter2 |   .0067697   .0115098     0.59   0.556      -.01579    .0293294
 dumquarter3 |          0  (omitted)
 dumquarter4 |   .0044033   .0114644     0.38   0.701    -.0180674    .0268741
       _cons |  -.5116705   .3774903    -1.36   0.175    -1.251566    .2282253
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(1,520,652 real changes made)

      Source |       SS       df       MS              Number of obs =  239410
-------------+------------------------------           F(124,239285) =  159.76
       Model |  19559.7956   124  157.740287           Prob > F      =  0.0000
    Residual |  80737.4302 239285  .337411163          R-squared     =  0.1950
-------------+------------------------------           Adj R-squared =  0.1946
       Total |  100297.226 239409  .418936739          Root MSE      =  .58087
------------------------------------------------------------------------------
             |               Robust
  rifwmcu_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |   .0736554    .034632     2.13   0.033     .0057775    .1415332
   dumstate2 |   .0804217   .0314949     2.55   0.011     .0186926    .1421508
   dumstate3 |  -.0349729   .0288558    -1.21   0.226    -.0915296    .0215838
   dumstate4 |   .1171547   .0231136     5.07   0.000     .0718526    .1624568
   dumstate5 |   .0007197   .0263858     0.03   0.978    -.0509959    .0524353
   dumstate6 |   .1968932   .0245546     8.02   0.000     .1487669    .2450195
   dumstate7 |    .115583   .0214039     5.40   0.000      .073632    .1575341
   dumstate8 |   .1640474   .0224002     7.32   0.000     .1201435    .2079513
   dumstate9 |   .0300223    .021991     1.37   0.172    -.0130794     .073124
  dumstate10 |   .0550264   .0216179     2.55   0.011     .0126559    .0973968
  dumstate11 |   .0486264   .0241478     2.01   0.044     .0012974    .0959553
  dumstate12 |   .1243017    .021743     5.72   0.000      .081686    .1669174
  dumstate13 |   .1242431   .0217314     5.72   0.000     .0816502     .166836
  dumstate14 |   .1066625   .0232759     4.58   0.000     .0610424    .1522827
  dumstate15 |   .1857014   .0231793     8.01   0.000     .1402705    .2311323
  dumstate16 |   .0740409   .0271129     2.73   0.006     .0209003    .1271814
  dumstate17 |   .0702077   .0237512     2.96   0.003      .023656    .1167593
  dumstate18 |   .0020048   .0355379     0.06   0.955    -.0676485    .0716582
  dumstate19 |  -.1425819   .0374696    -3.81   0.000    -.2160212   -.0691425
  dumstate20 |  -.0161652   .0265369    -0.61   0.542     -.068177    .0358465
  dumstate21 |   .0963952   .0252477     3.82   0.000     .0469104    .1458801
  dumstate22 |    .116223   .0403561     2.88   0.004     .0371262    .1953199
  dumstate23 |   .1642587   .0254141     6.46   0.000     .1144477    .2140697
  dumstate24 |   .1358456   .0310674     4.37   0.000     .0749542    .1967369
  dumstate25 |   .1390325    .025414     5.47   0.000     .0892217    .1888433
  dumstate26 |  -.0389322   .0283978    -1.37   0.170    -.0945911    .0167268
  dumstate27 |   -.015882   .0276693    -0.57   0.566    -.0701131    .0383491
  dumstate28 |   .0010878   .0366178     0.03   0.976     -.070682    .0728577
  dumstate29 |   .0451126   .0274945     1.64   0.101     -.008776    .0990011
  dumstate30 |  -.0067523   .0242425    -0.28   0.781    -.0542669    .0407624
  dumstate31 |  -.0531707   .0256843    -2.07   0.038    -.1035111   -.0028302
  dumstate32 |  -.0540126   .0269492    -2.00   0.045    -.1068322   -.0011929
  dumstate33 |  -.0290211   .0274941    -1.06   0.291    -.0829089    .0248667
  dumstate34 |  -.0409851   .0320857    -1.28   0.201    -.1038722    .0219021
  dumstate35 |  -.1376486   .0311783    -4.41   0.000    -.1987573   -.0765398
  dumstate36 |   .0860965   .0293378     2.93   0.003     .0285953    .1435977
  dumstate37 |  -.0270018   .0272551    -0.99   0.322    -.0804211    .0264174
  dumstate38 |   .0751831   .0231416     3.25   0.001     .0298262      .12054
  dumstate39 |          0  (omitted)
  dumstate40 |   .0288341   .0315041     0.92   0.360    -.0329131    .0905813
  dumstate41 |   .1837067   .0298076     6.16   0.000     .1252847    .2421288
  dumstate42 |   .0582152   .0269019     2.16   0.030      .005488    .1109423
  dumstate43 |    .030875   .0382495     0.81   0.420    -.0440931     .105843
  dumstate44 |   .0309691   .0301298     1.03   0.304    -.0280845    .0900226
  dumstate45 |   .0387279   .0275541     1.41   0.160    -.0152775    .0927332
  dumstate46 |   .1421299   .0259429     5.48   0.000     .0912825    .1929774
  dumstate47 |    .155389   .0236546     6.57   0.000     .1090266    .2017513
  dumstate48 |   .0784078   .0252173     3.11   0.002     .0289826     .127833
  dumstate49 |   .1911468   .0214725     8.90   0.000     .1490612    .2332324
  dumstate50 |   .2592009   .0234616    11.05   0.000     .2132167    .3051851
  dumstate51 |    .084914   .0322151     2.64   0.008     .0217733    .1480547
    dumyear1 |   .0736647   .0228677     3.22   0.001     .0288446    .1184848
    dumyear2 |   .0665105   .0229632     2.90   0.004     .0215032    .1115178
    dumyear3 |   .0868638   .0236413     3.67   0.000     .0405275    .1332001
    dumyear4 |   .0798924   .0230865     3.46   0.001     .0346434    .1251413
    dumyear5 |   .0935236   .0229158     4.08   0.000     .0486093    .1384379
    dumyear6 |   .0694635   .0236031     2.94   0.003     .0232019     .115725
    dumyear7 |   .0433627   .0234761     1.85   0.065    -.0026498    .0893753
    dumyear8 |   .0352371   .0231145     1.52   0.127    -.0100667     .080541
    dumyear9 |  -.0324801   .0234505    -1.39   0.166    -.0784425    .0134823
   dumyear10 |  -.0140329   .0235502    -0.60   0.551    -.0601907    .0321249
   dumyear11 |  -.0311772   .0236314    -1.32   0.187    -.0774941    .0151397
   dumyear12 |   .0049664   .0251591     0.20   0.844    -.0443448    .0542775
   dumyear13 |  -.0025763   .0254201    -0.10   0.919     -.052399    .0472464
   dumyear14 |   .0180192   .0245576     0.73   0.463    -.0301131    .0661515
   dumyear15 |   .0014163   .0254926     0.06   0.956    -.0485486    .0513811
   dumyear16 |   .0345193   .0254745     1.36   0.175    -.0154101    .0844486
   dumyear17 |   .0116235   .0257702     0.45   0.652    -.0388855    .0621324
   dumyear18 |   .0436005   .0247565     1.76   0.078    -.0049216    .0921226
   dumyear19 |   .0550979   .0255003     2.16   0.031     .0051179    .1050779
   dumyear20 |   .0430769   .0252743     1.70   0.088      -.00646    .0926138
   dumyear21 |   .0718481   .0249268     2.88   0.004     .0229921    .1207041
   dumyear22 |   .0352382    .026197     1.35   0.179    -.0161071    .0865836
   dumyear23 |   .0466385   .0257469     1.81   0.070    -.0038248    .0971018
   dumyear24 |   .0514213   .0255264     2.01   0.044     .0013901    .1014524
   dumyear25 |   .0249754   .0271528     0.92   0.358    -.0282434    .0781942
   dumyear26 |    .031673   .0258579     1.22   0.221    -.0190079    .0823539
   dumyear27 |    .014071   .0264545     0.53   0.595    -.0377791    .0659211
   dumyear28 |    -.02536    .027845    -0.91   0.362    -.0799354    .0292154
   dumyear29 |  -.0044144   .0279489    -0.16   0.875    -.0591935    .0503647
   dumyear30 |   .0059876   .0270188     0.22   0.825    -.0469685    .0589436
   dumyear31 |    .004285   .0280234     0.15   0.878    -.0506401    .0592101
   dumyear32 |  -.0229728   .0279457    -0.82   0.411    -.0777457    .0318001
   dumyear33 |  -.0025659   .0271558    -0.09   0.925    -.0557905    .0506588
   dumyear34 |   .0284559   .0268204     1.06   0.289    -.0241115    .0810232
   dumyear35 |          0  (omitted)
    dumnind1 |   .1543308   .0322227     4.79   0.000     .0911751    .2174866
    dumnind2 |   .1772071   .0212587     8.34   0.000     .1355406    .2188736
    dumnind3 |   .0871109   .0209401     4.16   0.000      .046069    .1281529
    dumnind4 |  -.1354518   .0224866    -6.02   0.000    -.1795249   -.0913787
    dumnind5 |   .1839166   .0207159     8.88   0.000      .143314    .2245193
    dumnind6 |          0  (omitted)
    dumnind7 |  -.0096016   .0235431    -0.41   0.683    -.0557454    .0365423
    dumnind8 |  -.2049716   .0248777    -8.24   0.000    -.2537313   -.1562119
    dumnind9 |  -.1358857   .0221636    -6.13   0.000    -.1793258   -.0924457
   dumnind10 |  -.1888417   .0270521    -6.98   0.000    -.2418631   -.1358203
   dumnind11 |   .1762886   .0222981     7.91   0.000     .1325848    .2199924
        educ |    .073373    .006815    10.77   0.000     .0600159    .0867302
       exper |   .1412891   .0059078    23.92   0.000       .12971    .1528682
      exper2 |  -.0064983   .0004167   -15.60   0.000     -.007315   -.0056817
      exper3 |   .0001518   .0000139    10.93   0.000     .0001246     .000179
      exper4 |  -1.33e-06   1.52e-07    -8.73   0.000    -1.63e-06   -1.03e-06
        edex |   -.001101   .0002239    -4.92   0.000    -.0015399   -.0006621
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |   .1956912   .0302261     6.47   0.000     .1364488    .2549336
   dumee_cl3 |   .2655628    .034531     7.69   0.000      .197883    .3332427
   dumee_cl4 |   .2973156   .0450958     6.59   0.000      .208929    .3857022
   dumee_cl5 |   .0937919   .0388775     2.41   0.016     .0175929    .1699908
   dumee_cl6 |   .1847032   .0334219     5.53   0.000     .1191971    .2502092
   dumee_cl7 |   .2151969   .0361484     5.95   0.000     .1443469    .2860468
   dumee_cl8 |   .1390662    .043862     3.17   0.002     .0530978    .2250347
   dumee_cl9 |   .1022013   .0407996     2.50   0.012     .0222351    .1821675
  dumee_cl10 |   .1697202   .0372495     4.56   0.000     .0967123    .2427282
  dumee_cl11 |   .1915042   .0389323     4.92   0.000     .1151978    .2678106
  dumee_cl12 |   .1149067   .0433562     2.65   0.008     .0299296    .1998837
  dumee_cl13 |   .1089804   .0454589     2.40   0.017     .0198823    .1980786
  dumee_cl14 |   .1601422   .0407779     3.93   0.000     .0802186    .2400657
  dumee_cl15 |   .1559515   .0408428     3.82   0.000     .0759008    .2360022
  dumee_cl16 |   .1024398   .0434163     2.36   0.018      .017345    .1875345
        marr |   .0963549    .005029    19.16   0.000     .0864981    .1062117
      public |   .0342845   .0074999     4.57   0.000     .0195848    .0489842
        cmsa |   .1415448   .0064732    21.87   0.000     .1288575    .1542322
   dumnocc31 |          0  (omitted)
   dumnocc32 |  -.1335109   .0100112   -13.34   0.000    -.1531326   -.1138892
   dumnocc33 |   -.277286   .0103248   -26.86   0.000    -.2975223   -.2570497
   dumnocc34 |  -.0571975   .0078848    -7.25   0.000    -.0726516   -.0417435
 dumquarter1 |   -.016219   .0062318    -2.60   0.009    -.0284333   -.0040048
 dumquarter2 |  -.0069261   .0062407    -1.11   0.267    -.0191578    .0053055
 dumquarter3 |          0  (omitted)
 dumquarter4 |  -.0007945   .0063089    -0.13   0.900    -.0131599    .0115709
       _cons |  -.5935944   .0864992    -6.86   0.000    -.7631306   -.4240582
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc33 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(746,827 real changes made)

      Source |       SS       df       MS              Number of obs = 1013235
-------------+------------------------------           F(124,1013110) = 3223.35
       Model |  210402.445   124  1696.79391           Prob > F      =  0.0000
    Residual |  504129.441 1013110  .497605829         R-squared     =  0.2945
-------------+------------------------------           Adj R-squared =  0.2944
       Total |  714531.886 1013234  .705199279         Root MSE      =  .70541
------------------------------------------------------------------------------
             |               Robust
   rifwmn_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.0701976   .0189862    -3.70   0.000    -.1074099   -.0329853
   dumstate2 |   .0783019   .0177628     4.41   0.000     .0434874    .1131165
   dumstate3 |   .0120027   .0182009     0.66   0.510    -.0236705    .0476759
   dumstate4 |   .0352642   .0172771     2.04   0.041     .0014017    .0691266
   dumstate5 |  -.0206034   .0178991    -1.15   0.250     -.055685    .0144783
   dumstate6 |   .0216381   .0176827     1.22   0.221    -.0130194    .0562956
   dumstate7 |   -.058846   .0171672    -3.43   0.001    -.0924931    -.025199
   dumstate8 |   .0190855   .0173094     1.10   0.270    -.0148404    .0530113
   dumstate9 |  -.0845515   .0172228    -4.91   0.000    -.1183076   -.0507955
  dumstate10 |  -.1053198   .0171838    -6.13   0.000    -.1389994   -.0716402
  dumstate11 |  -.0698827   .0177612    -3.93   0.000     -.104694   -.0350714
  dumstate12 |   -.039028   .0172067    -2.27   0.023    -.0727524   -.0053035
  dumstate13 |  -.0840924   .0172663    -4.87   0.000    -.1179337   -.0502511
  dumstate14 |  -.0367537   .0175197    -2.10   0.036    -.0710918   -.0024155
  dumstate15 |  -.0163757    .017408    -0.94   0.347    -.0504949    .0177434
  dumstate16 |  -.0641223   .0180168    -3.56   0.000    -.0994345     -.02881
  dumstate17 |  -.1361763   .0178431    -7.63   0.000    -.1711481   -.1012044
  dumstate18 |  -.0596526   .0191293    -3.12   0.002    -.0971454   -.0221598
  dumstate19 |  -.1488581   .0183529    -8.11   0.000    -.1848292    -.112887
  dumstate20 |  -.1537919   .0178385    -8.62   0.000    -.1887548    -.118829
  dumstate21 |  -.1191806   .0177177    -6.73   0.000    -.1539068   -.0844544
  dumstate22 |          0  (omitted)
  dumstate23 |  -.0153532   .0177559    -0.86   0.387    -.0501542    .0194477
  dumstate24 |   .0197533   .0175324     1.13   0.260    -.0146096    .0541162
  dumstate25 |  -.0293858   .0174088    -1.69   0.091    -.0635065    .0047348
  dumstate26 |  -.2189976    .019311   -11.34   0.000    -.2568466   -.1811487
  dumstate27 |  -.0918717   .0173912    -5.28   0.000    -.1259579   -.0577854
  dumstate28 |  -.0678264   .0182773    -3.71   0.000    -.1036493   -.0320034
  dumstate29 |   -.036059   .0177434    -2.03   0.042    -.0708354   -.0012825
  dumstate30 |   -.112044   .0173468    -6.46   0.000    -.1460432   -.0780448
  dumstate31 |  -.1546613   .0179576    -8.61   0.000    -.1898577    -.119465
  dumstate32 |  -.1895597    .018048   -10.50   0.000    -.2249332   -.1541862
  dumstate33 |  -.1435891   .0185522    -7.74   0.000    -.1799509   -.1072274
  dumstate34 |  -.1203485    .018667    -6.45   0.000    -.1569352   -.0837617
  dumstate35 |  -.2528183   .0184027   -13.74   0.000    -.2888869   -.2167497
  dumstate36 |  -.0577567   .0187253    -3.08   0.002    -.0944577   -.0210558
  dumstate37 |   -.148157   .0180618    -8.20   0.000    -.1835574   -.1127566
  dumstate38 |  -.0585299    .017156    -3.41   0.001    -.0921551   -.0249047
  dumstate39 |  -.1266316   .0188111    -6.73   0.000    -.1635008   -.0897624
  dumstate40 |  -.0953367    .017996    -5.30   0.000    -.1306082   -.0600652
  dumstate41 |   .1282653   .0184441     6.95   0.000     .0921155    .1644151
  dumstate42 |   -.019703   .0176154    -1.12   0.263    -.0542285    .0148226
  dumstate43 |   -.110525   .0193522    -5.71   0.000    -.1484546   -.0725954
  dumstate44 |   -.083394    .017922    -4.65   0.000    -.1185205   -.0482674
  dumstate45 |  -.0949166   .0176682    -5.37   0.000    -.1295456   -.0602876
  dumstate46 |   .0132538   .0183188     0.72   0.469    -.0226504    .0491581
  dumstate47 |   .0034317   .0176725     0.19   0.846    -.0312058    .0380692
  dumstate48 |  -.0585879   .0177941    -3.29   0.001    -.0934637   -.0237122
  dumstate49 |   .0054053   .0170425     0.32   0.751    -.0279974     .038808
  dumstate50 |   .1965723   .0179065    10.98   0.000     .1614761    .2316684
  dumstate51 |   .0375062   .0206232     1.82   0.069    -.0029145    .0779269
    dumyear1 |   .0033968   .0070638     0.48   0.631     -.010448    .0172416
    dumyear2 |    .005016   .0070244     0.71   0.475    -.0087516    .0187836
    dumyear3 |   .0262761   .0073338     3.58   0.000     .0119021    .0406501
    dumyear4 |  -.0184599   .0068955    -2.68   0.007    -.0319749    -.004945
    dumyear5 |    .002767   .0069246     0.40   0.689     -.010805    .0163391
    dumyear6 |   .0008958   .0070488     0.13   0.899    -.0129197    .0147112
    dumyear7 |   .0177226    .006807     2.60   0.009     .0043811    .0310642
    dumyear8 |  -.0123229   .0067643    -1.82   0.068    -.0255807    .0009349
    dumyear9 |  -.0060691   .0068226    -0.89   0.374    -.0194413     .007303
   dumyear10 |  -.0494461   .0068948    -7.17   0.000    -.0629596   -.0359326
   dumyear11 |  -.0419877   .0069045    -6.08   0.000    -.0555203   -.0284551
   dumyear12 |  -.0465741   .0073496    -6.34   0.000     -.060979   -.0321691
   dumyear13 |  -.0271573    .007311    -3.71   0.000    -.0414866    -.012828
   dumyear14 |   .0121094   .0071791     1.69   0.092    -.0019613    .0261802
   dumyear15 |    .036806   .0071503     5.15   0.000     .0227916    .0508203
   dumyear16 |    .057839   .0072155     8.02   0.000     .0436968    .0719811
   dumyear17 |   .0680535   .0071823     9.48   0.000     .0539765    .0821305
   dumyear18 |   .0791852   .0070367    11.25   0.000     .0653935    .0929768
   dumyear19 |   .0378877    .007237     5.24   0.000     .0237033     .052072
   dumyear20 |   .0437152   .0072441     6.03   0.000     .0295171    .0579133
   dumyear21 |   .0440095   .0071751     6.13   0.000     .0299465    .0580726
   dumyear22 |   .0396216    .007207     5.50   0.000     .0254962    .0537471
   dumyear23 |   .0434367   .0072351     6.00   0.000     .0292562    .0576172
   dumyear24 |   .0382999   .0072795     5.26   0.000     .0240323    .0525675
   dumyear25 |   .0508244   .0071993     7.06   0.000      .036714    .0649349
   dumyear26 |   .0345438   .0073728     4.69   0.000     .0200934    .0489941
   dumyear27 |  -.0032095   .0075125    -0.43   0.669    -.0179338    .0115148
   dumyear28 |  -.0054804   .0075072    -0.73   0.465    -.0201942    .0092334
   dumyear29 |          0  (omitted)
   dumyear30 |     .00858   .0075629     1.13   0.257     -.006243    .0234031
   dumyear31 |   .0217092     .00753     2.88   0.004     .0069506    .0364677
   dumyear32 |   .0268138   .0073811     3.63   0.000     .0123471    .0412805
   dumyear33 |   .0466095   .0073561     6.34   0.000     .0321918    .0610271
   dumyear34 |   .0775232   .0072743    10.66   0.000     .0632658    .0917806
   dumyear35 |   .1042103   .0073212    14.23   0.000     .0898609    .1185596
    dumnind1 |          0  (omitted)
    dumnind2 |   .3227429    .006769    47.68   0.000     .3094758    .3360099
    dumnind3 |   .2653773   .0063842    41.57   0.000     .2528644    .2778902
    dumnind4 |   .0066915   .0065835     1.02   0.309     -.006212    .0195949
    dumnind5 |   .2041224   .0068203    29.93   0.000     .1907549    .2174899
    dumnind6 |   .2045027   .0066923    30.56   0.000      .191386    .2176195
    dumnind7 |   .1043378   .0065924    15.83   0.000      .091417    .1172587
    dumnind8 |   .0466798   .0074082     6.30   0.000       .03216    .0611997
    dumnind9 |   .0133496   .0076808     1.74   0.082    -.0017045    .0284038
   dumnind10 |  -.0632323    .008802    -7.18   0.000    -.0804839   -.0459806
   dumnind11 |   .2773405   .0080641    34.39   0.000     .2615351    .2931458
        educ |   .0549851   .0018509    29.71   0.000     .0513574    .0586128
       exper |   .1712178   .0016975   100.86   0.000     .1678907    .1745449
      exper2 |  -.0089866   .0001247   -72.05   0.000     -.009231   -.0087421
      exper3 |   .0002301   4.38e-06    52.56   0.000     .0002215    .0002387
      exper4 |  -2.15e-06   4.98e-08   -43.15   0.000    -2.24e-06   -2.05e-06
        edex |  -.0015504   .0000729   -21.26   0.000    -.0016933   -.0014074
   dumee_cl1 |  -.1222278   .0184216    -6.64   0.000    -.1583334   -.0861222
   dumee_cl2 |   .1194845   .0160462     7.45   0.000     .0880345    .1509344
   dumee_cl3 |   .2448343   .0153452    15.96   0.000     .2147581    .2749104
   dumee_cl4 |   .5204545   .0147558    35.27   0.000     .4915335    .5493754
   dumee_cl5 |  -.0800171   .0166464    -4.81   0.000    -.1126436   -.0473906
   dumee_cl6 |   .2172337   .0139066    15.62   0.000     .1899772    .2444902
   dumee_cl7 |    .318032    .013854    22.96   0.000     .2908786    .3451854
   dumee_cl8 |   .2995522   .0143757    20.84   0.000     .2713764     .327728
   dumee_cl9 |  -.0067687   .0138595    -0.49   0.625    -.0339328    .0203954
  dumee_cl10 |   .2551603   .0115074    22.17   0.000     .2326062    .2777145
  dumee_cl11 |   .3468398   .0121262    28.60   0.000     .3230728    .3706069
  dumee_cl12 |   .3182811   .0140317    22.68   0.000     .2907796    .3457827
  dumee_cl13 |          0  (omitted)
  dumee_cl14 |   .2444551    .009385    26.05   0.000     .2260609    .2628493
  dumee_cl15 |   .3200424   .0107519    29.77   0.000      .298969    .3411159
  dumee_cl16 |   .3456118   .0141189    24.48   0.000     .3179393    .3732844
        marr |   .1673483   .0020775    80.55   0.000     .1632764    .1714202
      public |   .0142564   .0041972     3.40   0.001       .00603    .0224828
        cmsa |   .1667041   .0025038    66.58   0.000     .1617967    .1716114
   dumnocc31 |   .3927388   .0039848    98.56   0.000     .3849288    .4005488
   dumnocc32 |   .2737421   .0041896    65.34   0.000     .2655307    .2819535
   dumnocc33 |          0  (omitted)
   dumnocc34 |   .2534786   .0040716    62.26   0.000     .2454985    .2614587
 dumquarter1 |  -.0177469   .0022612    -7.85   0.000    -.0221787    -.013315
 dumquarter2 |  -.0164398   .0022782    -7.22   0.000     -.020905   -.0119747
 dumquarter3 |  -.0113094   .0023054    -4.91   0.000     -.015828   -.0067908
 dumquarter4 |          0  (omitted)
       _cons |  -1.039397   .0380898   -27.29   0.000    -1.114052   -.9647421
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate41 dropped because of collinearity
note: dumyear19 dropped because of collinearity
note: dumnind11 dropped because of collinearity
note: dumee_cl13 dropped because of collinearity
note: dumnocc31 dropped because of collinearity
note: dumquarter2 dropped because of collinearity
(1,663,699 real changes made)

      Source |       SS       df       MS              Number of obs =   96363
-------------+------------------------------           F(124, 96238) =  194.24
       Model |  7546.25427   124  60.8568892           Prob > F      =  0.0000
    Residual |   26628.702 96238  .276696337           R-squared     =  0.2208
-------------+------------------------------           Adj R-squared =  0.2198
       Total |  34174.9563 96362  .354651795           Root MSE      =  .52602
------------------------------------------------------------------------------
             |               Robust
   rifbmn_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.2038981   .0993998    -2.05   0.040    -.3987206   -.0090757
   dumstate2 |  -.1323716   .0695561    -1.90   0.057    -.2687008    .0039576
   dumstate3 |          0  (omitted)
   dumstate4 |  -.1379272   .0561561    -2.46   0.014    -.2479925    -.027862
   dumstate5 |  -.2270884   .0591791    -3.84   0.000    -.3430787    -.111098
   dumstate6 |  -.1720354   .0568398    -3.03   0.002    -.2834407   -.0606302
   dumstate7 |  -.2483403   .0551156    -4.51   0.000    -.3563663   -.1403143
   dumstate8 |  -.2275312    .055709    -4.08   0.000    -.3367202   -.1183422
   dumstate9 |  -.2600756   .0559561    -4.65   0.000    -.3697489   -.1504022
  dumstate10 |  -.3167835   .0554737    -5.71   0.000    -.4255113   -.2080558
  dumstate11 |  -.3090043   .0582348    -5.31   0.000     -.423144   -.1948647
  dumstate12 |  -.2694105   .0552957    -4.87   0.000    -.3777895   -.1610316
  dumstate13 |    -.32362   .0558689    -5.79   0.000    -.4331224   -.2141177
  dumstate14 |  -.2755705    .058786    -4.69   0.000    -.3907905   -.1603506
  dumstate15 |  -.2626059   .0588272    -4.46   0.000    -.3779066   -.1473053
  dumstate16 |  -.3314454   .0731546    -4.53   0.000    -.4748276   -.1880632
  dumstate17 |  -.3030378   .0567319    -5.34   0.000    -.4142317   -.1918439
  dumstate18 |   .0857052   .0695482     1.23   0.218    -.0506085    .2220189
  dumstate19 |  -.1877846   .0730303    -2.57   0.010     -.330923   -.0446461
  dumstate20 |  -.1918185   .0583631    -3.29   0.001    -.3062096   -.0774274
  dumstate21 |  -.2662489   .0572932    -4.65   0.000    -.3785429   -.1539549
  dumstate22 |   -.105978   .0621086    -1.71   0.088    -.2277102    .0157541
  dumstate23 |  -.2171772   .0549968    -3.95   0.000    -.3249704   -.1093841
  dumstate24 |  -.1751904   .0548769    -3.19   0.001    -.2827486   -.0676322
  dumstate25 |   -.253074   .0550548    -4.60   0.000    -.3609809   -.1451671
  dumstate26 |  -.3733179   .0714127    -5.23   0.000     -.513286   -.2333497
  dumstate27 |  -.2787896    .054762    -5.09   0.000    -.3861225   -.1714566
  dumstate28 |  -.2902915   .0550795    -5.27   0.000    -.3982468   -.1823363
  dumstate29 |  -.2558924   .0548804    -4.66   0.000    -.3634575   -.1483274
  dumstate30 |  -.3082901   .0549937    -5.61   0.000    -.4160772    -.200503
  dumstate31 |  -.3115417   .0575958    -5.41   0.000    -.4244289   -.1986545
  dumstate32 |  -.3164158   .0558961    -5.66   0.000    -.4259714   -.2068602
  dumstate33 |  -.3803586   .0556356    -6.84   0.000    -.4894038   -.2713134
  dumstate34 |  -.3858747   .0549546    -7.02   0.000    -.4935852   -.2781642
  dumstate35 |  -.3885755   .0563887    -6.89   0.000    -.4990967   -.2780543
  dumstate36 |  -.3437294   .0556996    -6.17   0.000       -.4529   -.2345588
  dumstate37 |  -.3302212   .0577427    -5.72   0.000    -.4433963   -.2170462
  dumstate38 |   -.277956   .0548568    -5.07   0.000    -.3854748   -.1704372
  dumstate39 |   -.215447    .155338    -1.39   0.165    -.5199077    .0890137
  dumstate40 |  -.3247402   .0824207    -3.94   0.000    -.4862838   -.1631967
  dumstate41 |  -.0435725   .0979291    -0.44   0.656    -.2355124    .1483675
  dumstate42 |  -.2639074   .0580856    -4.54   0.000    -.3777545   -.1500603
  dumstate43 |  -.2004993   .0627281    -3.20   0.001    -.3234457    -.077553
  dumstate44 |  -.2614813   .0578445    -4.52   0.000    -.3748559   -.1481067
  dumstate45 |  -.2238203   .0654147    -3.42   0.001    -.3520324   -.0956082
  dumstate46 |  -.1959037   .0573875    -3.41   0.001    -.3083826   -.0834249
  dumstate47 |  -.1980151    .058697    -3.37   0.001    -.3130604   -.0829697
  dumstate48 |  -.2772203   .0657245    -4.22   0.000    -.4060396   -.1484011
  dumstate49 |  -.2093252   .0548901    -3.81   0.000    -.3169092   -.1017413
  dumstate50 |  -.0093699   .0580339    -0.16   0.872    -.1231158    .1043759
  dumstate51 |  -.2446527   .0707718    -3.46   0.001    -.3833646   -.1059408
    dumyear1 |  -.0241276   .0173765    -1.39   0.165    -.0581853    .0099302
    dumyear2 |   -.035468   .0171562    -2.07   0.039     -.069094   -.0018421
    dumyear3 |          0  (omitted)
    dumyear4 |  -.0062721   .0167064    -0.38   0.707    -.0390165    .0264723
    dumyear5 |   .0012303   .0164886     0.07   0.941    -.0310871    .0335477
    dumyear6 |    .034081   .0166986     2.04   0.041     .0013519      .06681
    dumyear7 |  -.0106135   .0162433    -0.65   0.513    -.0424502    .0212231
    dumyear8 |   .0025037   .0165547     0.15   0.880    -.0299433    .0349507
    dumyear9 |   -.022959   .0167871    -1.37   0.171    -.0558616    .0099436
   dumyear10 |  -.0203095   .0167298    -1.21   0.225    -.0530996    .0124807
   dumyear11 |  -.0756967   .0170211    -4.45   0.000    -.1090579   -.0423354
   dumyear12 |  -.0315164   .0183923    -1.71   0.087     -.067565    .0045322
   dumyear13 |   .0018387    .017879     0.10   0.918    -.0332039    .0368813
   dumyear14 |   .0555467   .0170997     3.25   0.001     .0220314     .089062
   dumyear15 |   .0710821   .0171802     4.14   0.000     .0374092    .1047551
   dumyear16 |   .0640051   .0174389     3.67   0.000     .0298252    .0981851
   dumyear17 |   .0961571   .0172319     5.58   0.000     .0623828    .1299314
   dumyear18 |   .0828701   .0171418     4.83   0.000     .0492723    .1164678
   dumyear19 |   .0988138   .0174703     5.66   0.000     .0645721    .1330554
   dumyear20 |   .1114089   .0171128     6.51   0.000      .077868    .1449498
   dumyear21 |   .0594233   .0176516     3.37   0.001     .0248264    .0940202
   dumyear22 |   .0364119   .0176656     2.06   0.039     .0017874    .0710363
   dumyear23 |    .069142   .0172704     4.00   0.000     .0352922    .1029917
   dumyear24 |    .066369   .0170386     3.90   0.000     .0329736    .0997644
   dumyear25 |   .0674922   .0172803     3.91   0.000     .0336229    .1013614
   dumyear26 |    .064654   .0171314     3.77   0.000     .0310768    .0982313
   dumyear27 |   .0208776   .0179284     1.16   0.244    -.0142619    .0560171
   dumyear28 |   .0225268   .0174129     1.29   0.196    -.0116023     .056656
   dumyear29 |   .0180785   .0177995     1.02   0.310    -.0168084    .0529653
   dumyear30 |   .0183302   .0178698     1.03   0.305    -.0166944    .0533548
   dumyear31 |   .0588685    .016917     3.48   0.001     .0257114    .0920256
   dumyear32 |    .000285   .0175894     0.02   0.987    -.0341899      .03476
   dumyear33 |   .0078532   .0180765     0.43   0.664    -.0275766    .0432829
   dumyear34 |   .0466568   .0176392     2.65   0.008     .0120842    .0812294
   dumyear35 |   .1060947   .0168652     6.29   0.000     .0730392    .1391502
    dumnind1 |  -.3472653    .020428   -17.00   0.000    -.3873039   -.3072267
    dumnind2 |   .0033641   .0122082     0.28   0.783    -.0205638    .0272921
    dumnind3 |   .0003358   .0108738     0.03   0.975    -.0209768    .0216484
    dumnind4 |  -.2111927   .0110166   -19.17   0.000     -.232785   -.1896003
    dumnind5 |  -.0456843   .0105198    -4.34   0.000     -.066303   -.0250656
    dumnind6 |  -.0610482   .0116386    -5.25   0.000    -.0838597   -.0382367
    dumnind7 |  -.1510602   .0109883   -13.75   0.000    -.1725971   -.1295232
    dumnind8 |  -.1067807   .0110027    -9.70   0.000    -.1283458   -.0852155
    dumnind9 |  -.1655128   .0108483   -15.26   0.000    -.1867753   -.1442503
   dumnind10 |  -.2069416   .0153043   -13.52   0.000    -.2369378   -.1769454
   dumnind11 |          0  (omitted)
        educ |   .0480987   .0045246    10.63   0.000     .0392306    .0569668
       exper |   .1040947    .003837    27.13   0.000     .0965743    .1116152
      exper2 |  -.0054812   .0002744   -19.98   0.000    -.0060191   -.0049434
      exper3 |   .0001349   9.15e-06    14.75   0.000      .000117    .0001528
      exper4 |  -1.19e-06   9.95e-08   -11.93   0.000    -1.38e-06   -9.92e-07
        edex |  -.0009546   .0001483    -6.43   0.000    -.0012453   -.0006638
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |   .2083337   .0173025    12.04   0.000      .174421    .2422463
   dumee_cl3 |   .3021846    .020818    14.52   0.000     .2613816    .3429876
   dumee_cl4 |   .3378144    .029347    11.51   0.000     .2802946    .3953341
   dumee_cl5 |   .0503219   .0240744     2.09   0.037     .0031363    .0975074
   dumee_cl6 |   .2006915   .0210013     9.56   0.000     .1595292    .2418537
   dumee_cl7 |   .2587624   .0229724    11.26   0.000     .2137369     .303788
   dumee_cl8 |   .1761524   .0288449     6.11   0.000     .1196168     .232688
   dumee_cl9 |   .1263907   .0285923     4.42   0.000     .0703501    .1824314
  dumee_cl10 |   .2548648   .0258386     9.86   0.000     .2042215    .3055082
  dumee_cl11 |   .2787189   .0267243    10.43   0.000     .2263395    .3310984
  dumee_cl12 |   .2067656   .0300487     6.88   0.000     .1478705    .2656608
  dumee_cl13 |   .1442164   .0348034     4.14   0.000     .0760021    .2124307
  dumee_cl14 |   .2642115   .0303931     8.69   0.000     .2046414    .3237817
  dumee_cl15 |   .2988375   .0301001     9.93   0.000     .2398417    .3578332
  dumee_cl16 |   .2431359   .0314232     7.74   0.000     .1815468    .3047249
        marr |   .0966396   .0041865    23.08   0.000     .0884341     .104845
      public |    .022813   .0077482     2.94   0.003     .0076266    .0379994
        cmsa |   .1437014   .0069211    20.76   0.000     .1301361    .1572667
   dumnocc31 |   .2127695   .0069302    30.70   0.000     .1991865    .2263525
   dumnocc32 |   .1600379   .0075722    21.13   0.000     .1451964    .1748794
   dumnocc33 |          0  (omitted)
   dumnocc34 |   .1491111   .0070794    21.06   0.000     .1352356    .1629867
 dumquarter1 |  -.0118862    .005487    -2.17   0.030    -.0226406   -.0011318
 dumquarter2 |  -.0003807   .0054713    -0.07   0.945    -.0111044    .0103431
 dumquarter3 |          0  (omitted)
 dumquarter4 |   .0033577    .005474     0.61   0.540    -.0073712    .0140867
       _cons |  -.1507685   .0757476    -1.99   0.047    -.2992329   -.0023041
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc33 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(746,827 real changes made)

      Source |       SS       df       MS              Number of obs = 1013235
-------------+------------------------------           F(124,1013110) = 1056.77
       Model |  131027.586   124  1056.67408           Prob > F      =  0.0000
    Residual |  400164.225 1013110  .394985959         R-squared     =  0.2467
-------------+------------------------------           Adj R-squared =  0.2466
       Total |  531191.811 1013234  .524253836         Root MSE      =  .62848
------------------------------------------------------------------------------
             |               Robust
  rifwmcn_20 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |   .1352628   .0200191     6.76   0.000      .096026    .1744995
   dumstate2 |   .2272119   .0177234    12.82   0.000     .1924746    .2619493
   dumstate3 |    .173369   .0190782     9.09   0.000     .1359764    .2107615
   dumstate4 |   .2113665   .0159506    13.25   0.000     .1801039     .242629
   dumstate5 |   .1455181   .0171677     8.48   0.000       .11187    .1791662
   dumstate6 |   .1788201   .0166534    10.74   0.000       .14618    .2114603
   dumstate7 |    .091562   .0154047     5.94   0.000     .0613693    .1217547
   dumstate8 |   .1751855   .0158688    11.04   0.000     .1440831    .2062879
   dumstate9 |   .0627109   .0155332     4.04   0.000     .0322664    .0931554
  dumstate10 |   .0280245   .0153782     1.82   0.068    -.0021162    .0581653
  dumstate11 |   .0779548   .0163274     4.77   0.000     .0459536     .109956
  dumstate12 |   .1049436   .0154067     6.81   0.000      .074747    .1351401
  dumstate13 |   .0552811   .0155961     3.54   0.000     .0247132     .085849
  dumstate14 |   .1093892   .0161793     6.76   0.000     .0776783    .1411001
  dumstate15 |   .1567071   .0160307     9.78   0.000     .1252875    .1881267
  dumstate16 |   .1071505   .0173657     6.17   0.000     .0731143    .1411866
  dumstate17 |   .0291562   .0165074     1.77   0.077    -.0031977    .0615101
  dumstate18 |   .1271446     .01897     6.70   0.000     .0899641    .1643251
  dumstate19 |   .0453622   .0178173     2.55   0.011     .0104409    .0802835
  dumstate20 |   .0504329   .0165134     3.05   0.002     .0180672    .0827986
  dumstate21 |   .0482884   .0163993     2.94   0.003     .0161463    .0804306
  dumstate22 |   .1700766   .0234862     7.24   0.000     .1240444    .2161089
  dumstate23 |   .1469186   .0163869     8.97   0.000     .1148008    .1790363
  dumstate24 |   .1408318   .0161373     8.73   0.000     .1092033    .1724603
  dumstate25 |   .1221026   .0156499     7.80   0.000     .0914294    .1527759
  dumstate26 |  -.1216859   .0195696    -6.22   0.000    -.1600417     -.08333
  dumstate27 |   .0726899   .0156078     4.66   0.000     .0420991    .1032807
  dumstate28 |   .0757081   .0167007     4.53   0.000     .0429752     .108441
  dumstate29 |   .1223521    .015968     7.66   0.000     .0910554    .1536489
  dumstate30 |   .0500096   .0155839     3.21   0.001     .0194656    .0805536
  dumstate31 |   .0044969    .016656     0.27   0.787    -.0281483     .037142
  dumstate32 |  -.0121744   .0164222    -0.74   0.458    -.0443614    .0200126
  dumstate33 |   .0064919    .017164     0.38   0.705    -.0271491    .0401328
  dumstate34 |   .0292874   .0169037     1.73   0.083    -.0038432     .062418
  dumstate35 |  -.0633851   .0170114    -3.73   0.000     -.096727   -.0300433
  dumstate36 |   .0716389   .0174498     4.11   0.000     .0374379    .1058398
  dumstate37 |  -.0207989   .0169247    -1.23   0.219    -.0539708     .012373
  dumstate38 |   .0791077   .0153084     5.17   0.000     .0491037    .1091116
  dumstate39 |          0  (omitted)
  dumstate40 |   .0247347   .0182696     1.35   0.176    -.0110731    .0605424
  dumstate41 |   .2319595   .0179786    12.90   0.000      .196722    .2671971
  dumstate42 |   .1389019   .0162554     8.54   0.000     .1070418     .170762
  dumstate43 |   .0032793     .01968     0.17   0.868    -.0352929    .0418516
  dumstate44 |   .0745984   .0168738     4.42   0.000     .0415263    .1076705
  dumstate45 |   .0395476   .0168247     2.35   0.019     .0065718    .0725235
  dumstate46 |   .1530606   .0172935     8.85   0.000     .1191658    .1869554
  dumstate47 |   .1566247   .0165278     9.48   0.000     .1242309    .1890186
  dumstate48 |   .0615784   .0174278     3.53   0.000     .0274206    .0957362
  dumstate49 |   .1407636   .0152169     9.25   0.000     .1109389    .1705883
  dumstate50 |   .2836045   .0170869    16.60   0.000     .2501148    .3170942
  dumstate51 |   .1629223   .0217965     7.47   0.000     .1202019    .2056426
    dumyear1 |   .0427115   .0099807     4.28   0.000     .0231497    .0622733
    dumyear2 |  -.0198499   .0101604    -1.95   0.051    -.0397638    .0000641
    dumyear3 |          0  (omitted)
    dumyear4 |   .0198588    .010166     1.95   0.051    -.0000662    .0397839
    dumyear5 |   .0154815   .0099142     1.56   0.118    -.0039499    .0349129
    dumyear6 |    .020401   .0103158     1.98   0.048     .0001824    .0406197
    dumyear7 |   .0439111   .0097272     4.51   0.000     .0248462    .0629761
    dumyear8 |   .0256409   .0097099     2.64   0.008     .0066099     .044672
    dumyear9 |  -.0020802   .0101184    -0.21   0.837     -.021912    .0177516
   dumyear10 |  -.0056085   .0099521    -0.56   0.573    -.0251144    .0138973
   dumyear11 |  -.0405501   .0100981    -4.02   0.000    -.0603419   -.0207582
   dumyear12 |  -.0165548   .0108842    -1.52   0.128    -.0378875    .0047779
   dumyear13 |    .020352   .0106124     1.92   0.055     -.000448    .0411521
   dumyear14 |   .0128346   .0109304     1.17   0.240    -.0085886    .0342578
   dumyear15 |   .0548101   .0105252     5.21   0.000      .034181    .0754391
   dumyear16 |    .062354   .0105812     5.89   0.000     .0416152    .0830928
   dumyear17 |   .0748576   .0107308     6.98   0.000     .0538256    .0958896
   dumyear18 |   .0963164   .0103492     9.31   0.000     .0760324    .1166004
   dumyear19 |   .1012308   .0105178     9.62   0.000     .0806162    .1218453
   dumyear20 |   .0909538    .011051     8.23   0.000     .0692941    .1126134
   dumyear21 |   .0818478   .0107877     7.59   0.000     .0607044    .1029913
   dumyear22 |   .0377407    .010866     3.47   0.001     .0164436    .0590377
   dumyear23 |   .0517308   .0109046     4.74   0.000     .0303582    .0731035
   dumyear24 |   .0366674   .0109419     3.35   0.001     .0152216    .0581132
   dumyear25 |   .0456934   .0111492     4.10   0.000     .0238413    .0675454
   dumyear26 |   .0378596    .011404     3.32   0.001     .0155081     .060211
   dumyear27 |    .007843   .0115043     0.68   0.495     -.014705    .0303911
   dumyear28 |   .0269573   .0111865     2.41   0.016     .0050322    .0488824
   dumyear29 |  -.0052919   .0117433    -0.45   0.652    -.0283083    .0177246
   dumyear30 |   .0062314   .0114134     0.55   0.585    -.0161385    .0286013
   dumyear31 |   .0238438    .011199     2.13   0.033     .0018941    .0457934
   dumyear32 |   .0650577   .0108277     6.01   0.000     .0438357    .0862797
   dumyear33 |   .0413128   .0115638     3.57   0.000     .0186481    .0639774
   dumyear34 |   .0685332   .0110272     6.21   0.000     .0469203    .0901461
   dumyear35 |   .0927336   .0111198     8.34   0.000     .0709391    .1145281
    dumnind1 |  -.2532091   .0127823   -19.81   0.000    -.2782621   -.2281562
    dumnind2 |   .0006978   .0092073     0.08   0.940    -.0173483    .0187438
    dumnind3 |   -.038113    .008771    -4.35   0.000    -.0553039   -.0209221
    dumnind4 |  -.2716044   .0088981   -30.52   0.000    -.2890443   -.2541645
    dumnind5 |  -.0806231   .0086995    -9.27   0.000    -.0976739   -.0635724
    dumnind6 |  -.0960559   .0090806   -10.58   0.000    -.1138535   -.0782583
    dumnind7 |  -.1853658    .008877   -20.88   0.000    -.2027643   -.1679672
    dumnind8 |  -.2318572   .0099842   -23.22   0.000    -.2514259   -.2122885
    dumnind9 |  -.2438704   .0086021   -28.35   0.000    -.2607303   -.2270106
   dumnind10 |  -.2951856   .0116485   -25.34   0.000    -.3180162    -.272355
   dumnind11 |          0  (omitted)
        educ |   .0584309   .0034863    16.76   0.000     .0515979    .0652639
       exper |    .149607   .0026456    56.55   0.000     .1444217    .1547924
      exper2 |   -.007962    .000186   -42.81   0.000    -.0083265   -.0075975
      exper3 |   .0001923   6.62e-06    29.04   0.000     .0001793    .0002053
      exper4 |  -1.68e-06   7.55e-08   -22.18   0.000    -1.82e-06   -1.53e-06
        edex |  -.0009273   .0001231    -7.53   0.000    -.0011685    -.000686
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |   .2413689   .0113535    21.26   0.000     .2191164    .2636213
   dumee_cl3 |   .3272494   .0141477    23.13   0.000     .2995205    .3549783
   dumee_cl4 |   .4499391   .0212151    21.21   0.000     .4083583    .4915199
   dumee_cl5 |   .0697288   .0164673     4.23   0.000     .0374535    .1020042
   dumee_cl6 |   .2415372   .0139933    17.26   0.000     .2141107    .2689637
   dumee_cl7 |   .2981881   .0159532    18.69   0.000     .2669204    .3294559
   dumee_cl8 |   .2171668   .0209501    10.37   0.000     .1761053    .2582284
   dumee_cl9 |   .1267326   .0210652     6.02   0.000     .0854454    .1680198
  dumee_cl10 |   .2822497   .0176453    16.00   0.000     .2476656    .3168339
  dumee_cl11 |   .3399842   .0183342    18.54   0.000     .3040499    .3759186
  dumee_cl12 |   .2327268   .0216044    10.77   0.000     .1903829    .2750707
  dumee_cl13 |   .1792919   .0261513     6.86   0.000     .1280362    .2305475
  dumee_cl14 |   .3016766   .0212376    14.20   0.000     .2600516    .3433015
  dumee_cl15 |   .3251335   .0209469    15.52   0.000     .2840783    .3661886
  dumee_cl16 |     .26609   .0223719    11.89   0.000     .2222418    .3099381
        marr |   .1457942    .002852    51.12   0.000     .1402043    .1513841
      public |   .0070829   .0065637     1.08   0.281    -.0057818    .0199475
        cmsa |   .1485819   .0038861    38.23   0.000     .1409653    .1561985
   dumnocc31 |          0  (omitted)
   dumnocc32 |  -.0709986   .0033387   -21.27   0.000    -.0775424   -.0644548
   dumnocc33 |  -.2791446   .0050974   -54.76   0.000    -.2891355   -.2691538
   dumnocc34 |  -.0658265    .003298   -19.96   0.000    -.0722905   -.0593625
 dumquarter1 |  -.0196132   .0035737    -5.49   0.000    -.0266176   -.0126087
 dumquarter2 |  -.0146749   .0035521    -4.13   0.000    -.0216369   -.0077129
 dumquarter3 |   -.009334   .0035729    -2.61   0.009    -.0163368   -.0023312
 dumquarter4 |          0  (omitted)
       _cons |  -.5351087   .0423054   -12.65   0.000    -.6180258   -.4521915
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(1,520,652 real changes made)

      Source |       SS       df       MS              Number of obs =  239410
-------------+------------------------------           F(124,239285) =  594.64
       Model |  9798.74153   124  79.0221091           Prob > F      =  0.0000
    Residual |  39623.9258 239285   .16559302          R-squared     =  0.1983
-------------+------------------------------           Adj R-squared =  0.1978
       Total |  49422.6673 239409  .206436129          Root MSE      =  .40693
------------------------------------------------------------------------------
             |               Robust
   rifwmu_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.0851055   .0208171    -4.09   0.000    -.1259065   -.0443046
   dumstate2 |  -.0394741   .0212258    -1.86   0.063    -.0810761    .0021279
   dumstate3 |  -.1153705   .0205749    -5.61   0.000    -.1556966   -.0750443
   dumstate4 |  -.0119017   .0197675    -0.60   0.547    -.0506455    .0268421
   dumstate5 |  -.0618801   .0202612    -3.05   0.002    -.1015915   -.0221686
   dumstate6 |   .0363603   .0205139     1.77   0.076    -.0038465    .0765671
   dumstate7 |   .0172189   .0193343     0.89   0.373    -.0206758    .0551136
   dumstate8 |   .0673649   .0197207     3.42   0.001     .0287128    .1060169
   dumstate9 |  -.0948291   .0194307    -4.88   0.000    -.1329128   -.0567454
  dumstate10 |  -.0727312     .01941    -3.75   0.000    -.1107743   -.0346882
  dumstate11 |  -.0578503   .0199801    -2.90   0.004    -.0970107   -.0186898
  dumstate12 |       .022   .0194758     1.13   0.259     -.016172    .0601719
  dumstate13 |   .0277615   .0194332     1.43   0.153     -.010327    .0658501
  dumstate14 |  -.0632477     .01977    -3.20   0.001    -.1019963   -.0244991
  dumstate15 |   -.003976   .0197705    -0.20   0.841    -.0427257    .0347737
  dumstate16 |  -.1144099   .0201059    -5.69   0.000     -.153817   -.0750028
  dumstate17 |  -.0268965   .0201506    -1.33   0.182    -.0663912    .0125982
  dumstate18 |  -.0792001   .0222168    -3.56   0.000    -.1227445   -.0356557
  dumstate19 |  -.1227832   .0215976    -5.69   0.000    -.1651139   -.0804525
  dumstate20 |  -.1431104   .0204118    -7.01   0.000     -.183117   -.1031037
  dumstate21 |  -.0463306   .0204635    -2.26   0.024    -.0864386   -.0062226
  dumstate22 |          0  (omitted)
  dumstate23 |   .0299145   .0208905     1.43   0.152    -.0110304    .0708594
  dumstate24 |   .0756868    .022645     3.34   0.001     .0313031    .1200704
  dumstate25 |  -.0004347   .0209904    -0.02   0.983    -.0415753     .040706
  dumstate26 |  -.0201692    .020727    -0.97   0.331    -.0607937    .0204553
  dumstate27 |  -.0726696   .0215594    -3.37   0.001    -.1149255   -.0304137
  dumstate28 |  -.0855558   .0263607    -3.25   0.001    -.1372221   -.0338895
  dumstate29 |  -.0421083   .0218577    -1.93   0.054    -.0849488    .0007323
  dumstate30 |  -.0821695   .0202359    -4.06   0.000    -.1218313   -.0425076
  dumstate31 |  -.0921315   .0202795    -4.54   0.000    -.1318789   -.0523841
  dumstate32 |  -.0982357    .020996    -4.68   0.000    -.1393874    -.057084
  dumstate33 |  -.0807293    .021394    -3.77   0.000    -.1226611   -.0387976
  dumstate34 |  -.0996956   .0226292    -4.41   0.000    -.1440483   -.0553429
  dumstate35 |  -.1102698    .021635    -5.10   0.000    -.1526737   -.0678658
  dumstate36 |  -.0607466   .0232493    -2.61   0.009    -.1063146   -.0151786
  dumstate37 |  -.1269234   .0210369    -6.03   0.000    -.1681551   -.0856917
  dumstate38 |  -.0406334   .0201424    -2.02   0.044     -.080112   -.0011548
  dumstate39 |  -.1103776   .0204161    -5.41   0.000    -.1503927   -.0703625
  dumstate40 |     -.0772   .0211264    -3.65   0.000    -.1186071   -.0357929
  dumstate41 |   .1074855   .0217161     4.95   0.000     .0649225    .1500486
  dumstate42 |  -.0400001   .0209904    -1.91   0.057    -.0811408    .0011405
  dumstate43 |  -.0814803   .0247789    -3.29   0.001    -.1300463   -.0329143
  dumstate44 |  -.0579233   .0223247    -2.59   0.009    -.1016792   -.0141674
  dumstate45 |  -.1237878   .0211509    -5.85   0.000    -.1652431   -.0823325
  dumstate46 |    .004189   .0207845     0.20   0.840     -.036548    .0449261
  dumstate47 |    .033417   .0199139     1.68   0.093    -.0056138    .0724478
  dumstate48 |  -.0454484   .0201523    -2.26   0.024    -.0849464   -.0059505
  dumstate49 |   .0920051   .0193957     4.74   0.000     .0539901    .1300202
  dumstate50 |   .2013461    .019913    10.11   0.000     .1623171    .2403751
  dumstate51 |  -.0242364   .0228264    -1.06   0.288    -.0689756    .0205028
    dumyear1 |   .0348418   .0089024     3.91   0.000     .0173934    .0522902
    dumyear2 |   .0185552   .0089648     2.07   0.038     .0009845    .0361259
    dumyear3 |   .0424261   .0092644     4.58   0.000     .0242681    .0605842
    dumyear4 |   .0695286   .0090013     7.72   0.000     .0518863    .0871709
    dumyear5 |   .0340894    .009068     3.76   0.000     .0163164    .0518625
    dumyear6 |   .0262276   .0092341     2.84   0.005     .0081291    .0443261
    dumyear7 |   .0143348   .0091661     1.56   0.118    -.0036305    .0323002
    dumyear8 |  -.0104265   .0090468    -1.15   0.249    -.0281579     .007305
    dumyear9 |    .000676   .0091126     0.07   0.941    -.0171845    .0185365
   dumyear10 |  -.0227544   .0091738    -2.48   0.013    -.0407348    -.004774
   dumyear11 |  -.0122536   .0092176    -1.33   0.184    -.0303199    .0058128
   dumyear12 |  -.0006837   .0098316    -0.07   0.945    -.0199535     .018586
   dumyear13 |   .0050443   .0098066     0.51   0.607    -.0141763     .024265
   dumyear14 |   .0115354   .0098769     1.17   0.243    -.0078231    .0308939
   dumyear15 |   .0122348   .0099764     1.23   0.220    -.0073186    .0317882
   dumyear16 |   .0216279   .0101528     2.13   0.033     .0017287    .0415271
   dumyear17 |   .0185543   .0101971     1.82   0.069    -.0014317    .0385404
   dumyear18 |   .0270705   .0100789     2.69   0.007     .0073161     .046825
   dumyear19 |   .0321649   .0102912     3.13   0.002     .0119945    .0523353
   dumyear20 |   .0279125   .0103334     2.70   0.007     .0076593    .0481657
   dumyear21 |   .0297507   .0104098     2.86   0.004     .0093477    .0501536
   dumyear22 |   .0267958   .0105238     2.55   0.011     .0061694    .0474222
   dumyear23 |   .0248333   .0104698     2.37   0.018     .0043128    .0453538
   dumyear24 |   .0185818    .010541     1.76   0.078    -.0020783    .0392419
   dumyear25 |   .0349511   .0106206     3.29   0.001      .014135    .0557672
   dumyear26 |   .0408212   .0107615     3.79   0.000     .0197289    .0619135
   dumyear27 |   .0334012   .0109321     3.06   0.002     .0119746    .0548278
   dumyear28 |   .0279466   .0110294     2.53   0.011     .0063292    .0495641
   dumyear29 |   .0019272   .0110152     0.17   0.861    -.0196624    .0235167
   dumyear30 |  -.0011316   .0112102    -0.10   0.920    -.0231034    .0208401
   dumyear31 |          0  (omitted)
   dumyear32 |   .0038512   .0112599     0.34   0.732     -.018218    .0259204
   dumyear33 |   .0328153   .0112927     2.91   0.004     .0106818    .0549488
   dumyear34 |   .0402039   .0113566     3.54   0.000     .0179452    .0624626
   dumyear35 |   .0444912   .0117637     3.78   0.000     .0214347    .0675477
    dumnind1 |   .1482389    .013204    11.23   0.000     .1223594    .1741183
    dumnind2 |   .2208693   .0099473    22.20   0.000     .2013729    .2403658
    dumnind3 |   .0068337   .0097787     0.70   0.485    -.0123322    .0259997
    dumnind4 |  -.1016636    .010085   -10.08   0.000    -.1214299   -.0818972
    dumnind5 |   .1604929   .0097774    16.41   0.000     .1413294    .1796563
    dumnind6 |          0  (omitted)
    dumnind7 |      .0155   .0110243     1.41   0.160    -.0061074    .0371073
    dumnind8 |  -.0843934   .0111007    -7.60   0.000    -.1061504   -.0626363
    dumnind9 |  -.0642325   .0101921    -6.30   0.000    -.0842088   -.0442562
   dumnind10 |  -.0701278   .0121362    -5.78   0.000    -.0939145   -.0463411
   dumnind11 |   .1647566   .0102479    16.08   0.000     .1446709    .1848422
        educ |   .0553064   .0026409    20.94   0.000     .0501302    .0604826
       exper |   .0365619   .0020516    17.82   0.000     .0325408    .0405831
      exper2 |  -.0006029    .000145    -4.16   0.000    -.0008871   -.0003188
      exper3 |  -7.81e-08   4.82e-06    -0.02   0.987    -9.52e-06    9.36e-06
      exper4 |   5.50e-08   5.24e-08     1.05   0.294    -4.77e-08    1.58e-07
        edex |  -.0004611    .000084    -5.49   0.000    -.0006257   -.0002965
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |   -.037669   .0087485    -4.31   0.000    -.0548158   -.0205222
   dumee_cl3 |  -.0688289   .0109636    -6.28   0.000    -.0903173   -.0473405
   dumee_cl4 |  -.1223233   .0162738    -7.52   0.000    -.1542195   -.0904271
   dumee_cl5 |   -.087618   .0120995    -7.24   0.000    -.1113328   -.0639033
   dumee_cl6 |  -.0543584   .0103507    -5.25   0.000    -.0746455   -.0340713
   dumee_cl7 |  -.0347116   .0118729    -2.92   0.003    -.0579821   -.0114411
   dumee_cl8 |  -.0774318   .0156276    -4.95   0.000    -.1080614   -.0468022
   dumee_cl9 |  -.0934954   .0142911    -6.54   0.000    -.1215057   -.0654851
  dumee_cl10 |  -.0593125   .0128882    -4.60   0.000     -.084573   -.0340521
  dumee_cl11 |  -.0400966   .0136479    -2.94   0.003    -.0668462   -.0133471
  dumee_cl12 |  -.0552361   .0159336    -3.47   0.001    -.0864657   -.0240066
  dumee_cl13 |  -.0647207   .0169603    -3.82   0.000    -.0979625   -.0314789
  dumee_cl14 |  -.0655467   .0149808    -4.38   0.000    -.0949088   -.0361847
  dumee_cl15 |  -.0407361   .0151599    -2.69   0.007     -.070449   -.0110231
  dumee_cl16 |  -.0402062   .0164104    -2.45   0.014    -.0723701   -.0080422
        marr |   .0559644   .0023232    24.09   0.000      .051411    .0605178
      public |  -.1026255   .0034505   -29.74   0.000    -.1093884   -.0958626
        cmsa |    .111247   .0024922    44.64   0.000     .1063624    .1161316
   dumnocc31 |   .1565047   .0044742    34.98   0.000     .1477354     .165274
   dumnocc32 |          0  (omitted)
   dumnocc33 |  -.0037921   .0046908    -0.81   0.419     -.012986    .0054018
   dumnocc34 |   .0636354   .0037029    17.19   0.000     .0563778    .0708929
 dumquarter1 |  -.0096064   .0027016    -3.56   0.000    -.0149015   -.0043114
 dumquarter2 |  -.0063514   .0027368    -2.32   0.020    -.0117155   -.0009873
 dumquarter3 |          0  (omitted)
 dumquarter4 |   .0033542   .0027384     1.22   0.221    -.0020131    .0087214
       _cons |   .8187145   .0372737    21.96   0.000      .745659      .89177
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate41 dropped because of collinearity
note: dumyear34 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl4 dropped because of collinearity
note: dumnocc31 dropped because of collinearity
note: dumquarter4 dropped because of collinearity
(1,728,357 real changes made)

      Source |       SS       df       MS              Number of obs =   31705
-------------+------------------------------           F(124, 31580) =   84.44
       Model |  1864.04108   124  15.0325893           Prob > F      =  0.0000
    Residual |  7149.16924 31580  .226382813           R-squared     =  0.2068
-------------+------------------------------           Adj R-squared =  0.2037
       Total |  9013.21031 31704  .284292528           Root MSE      =   .4758
------------------------------------------------------------------------------
             |               Robust
   rifbmu_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |   .2639249   .3270828     0.81   0.420    -.3771702      .90502
   dumstate2 |   .2389186   .3013866     0.79   0.428    -.3518109    .8296482
   dumstate3 |  -.1209797   .3034769    -0.40   0.690    -.7158064    .4738469
   dumstate4 |   .0033104   .2830577     0.01   0.991    -.5514937    .5581145
   dumstate5 |  -.0125868   .2840467    -0.04   0.965    -.5693295    .5441559
   dumstate6 |     .07084   .2825064     0.25   0.802    -.4828837    .6245636
   dumstate7 |     .02754   .2814262     0.10   0.922    -.5240664    .5791464
   dumstate8 |   .0338081   .2816719     0.12   0.904    -.5182799    .5858961
   dumstate9 |  -.0097002   .2817191    -0.03   0.973    -.5618806    .5424802
  dumstate10 |  -.0095858   .2815564    -0.03   0.973    -.5614475    .5422758
  dumstate11 |   .0282446   .2826131     0.10   0.920    -.5256882    .5821773
  dumstate12 |  -.0053028    .281476    -0.02   0.985    -.5570067    .5464011
  dumstate13 |   .1408302   .2815295     0.50   0.617    -.4109785     .692639
  dumstate14 |  -.0776112   .2829691    -0.27   0.784    -.6322417    .4770194
  dumstate15 |   .0048336   .2832853     0.02   0.986    -.5504168    .5600839
  dumstate16 |  -.0503787   .2904771    -0.17   0.862    -.6197251    .5189677
  dumstate17 |   .0062785   .2820667     0.02   0.982    -.5465832    .5591402
  dumstate18 |   .1976843   .2949618     0.67   0.503    -.3804523    .7758208
  dumstate19 |  -.3360225   .2850663    -1.18   0.239    -.8947635    .2227186
  dumstate20 |  -.1569819   .2841588    -0.55   0.581    -.7139442    .3999804
  dumstate21 |   .0299787   .2828871     0.11   0.916    -.5244912    .5844485
  dumstate22 |  -.0903459   .2845785    -0.32   0.751    -.6481309    .4674391
  dumstate23 |   .0447914   .2816084     0.16   0.874     -.507172    .5967548
  dumstate24 |    .031101    .281502     0.11   0.912    -.5206539     .582856
  dumstate25 |  -.0428098    .281772    -0.15   0.879    -.5950939    .5094743
  dumstate26 |   .1611351   .2883107     0.56   0.576    -.4039652    .7262354
  dumstate27 |  -.1013854   .2817753    -0.36   0.719     -.653676    .4509053
  dumstate28 |  -.1819319   .2829234    -0.64   0.520    -.7364729    .3726091
  dumstate29 |  -.0574885   .2817592    -0.20   0.838    -.6097476    .4947706
  dumstate30 |  -.1158601   .2815945    -0.41   0.681    -.6677963    .4360762
  dumstate31 |  -.0170354   .2826958    -0.06   0.952    -.5711303    .5370595
  dumstate32 |  -.1448411   .2819843    -0.51   0.608    -.6975415    .4078592
  dumstate33 |  -.1417419   .2816186    -0.50   0.615    -.6937254    .4102416
  dumstate34 |  -.2040779   .2816388    -0.72   0.469     -.756101    .3479451
  dumstate35 |   -.223424   .2821622    -0.79   0.428    -.7764729    .3296249
  dumstate36 |  -.1090405   .2820241    -0.39   0.699    -.6618188    .4437378
  dumstate37 |  -.1136304   .2834636    -0.40   0.689    -.6692302    .4419694
  dumstate38 |  -.0419916   .2816464    -0.15   0.881    -.5940296    .5100463
  dumstate39 |   .0326542   .3350559     0.10   0.922    -.6240685    .6893769
  dumstate40 |  -.3205152   .3257676    -0.98   0.325    -.9590324    .3180019
  dumstate41 |          0  (omitted)
  dumstate42 |  -.0519227   .2840779    -0.18   0.855    -.6087265     .504881
  dumstate43 |  -.0619602     .29588    -0.21   0.834    -.6418965    .5179762
  dumstate44 |   .0052421   .2865995     0.02   0.985    -.5565041    .5669884
  dumstate45 |   -.265001   .3030078    -0.87   0.382    -.8589081    .3289062
  dumstate46 |  -.0316182   .2824999    -0.11   0.911    -.5853291    .5220927
  dumstate47 |   .0690561     .28291     0.24   0.807    -.4854585    .6235708
  dumstate48 |   .0576824   .2861358     0.20   0.840    -.5031549    .6185198
  dumstate49 |   .1146114   .2814667     0.41   0.684    -.4370743    .6662971
  dumstate50 |   .2103629   .2832536     0.74   0.458    -.3448253    .7655511
  dumstate51 |   .0141972   .2908469     0.05   0.961    -.5558741    .5842686
    dumyear1 |   .0773262   .0283396     2.73   0.006     .0217795    .1328729
    dumyear2 |   .0976517   .0285062     3.43   0.001     .0417783    .1535251
    dumyear3 |   .1037098   .0299288     3.47   0.001     .0450482    .1623713
    dumyear4 |   .0641616   .0285198     2.25   0.024     .0082617    .1200614
    dumyear5 |    .068344   .0286938     2.38   0.017      .012103    .1245851
    dumyear6 |   .1025469   .0294238     3.49   0.000     .0448751    .1602187
    dumyear7 |   .0455207   .0288587     1.58   0.115    -.0110434    .1020848
    dumyear8 |   .0434317   .0287286     1.51   0.131    -.0128776    .0997409
    dumyear9 |  -.0070208   .0287904    -0.24   0.807     -.063451    .0494094
   dumyear10 |   .0137409   .0291143     0.47   0.637    -.0433242     .070806
   dumyear11 |   .0096993   .0290641     0.33   0.739    -.0472674    .0666661
   dumyear12 |  -.0297084   .0311702    -0.95   0.341    -.0908033    .0313864
   dumyear13 |   .0523291   .0319155     1.64   0.101    -.0102265    .1148848
   dumyear14 |   .0854278   .0312229     2.74   0.006     .0242297    .1466259
   dumyear15 |   .0389002   .0320557     1.21   0.225    -.0239303    .1017307
   dumyear16 |   .0405823   .0320097     1.27   0.205    -.0221579    .1033224
   dumyear17 |   .0533459    .032334     1.65   0.099      -.01003    .1167218
   dumyear18 |   .0668709   .0320477     2.09   0.037     .0040561    .1296857
   dumyear19 |   .1062184   .0325185     3.27   0.001     .0424808    .1699559
   dumyear20 |   .0765427   .0342463     2.24   0.025     .0094187    .1436667
   dumyear21 |   .0684809   .0336647     2.03   0.042     .0024967     .134465
   dumyear22 |   .0693724   .0338958     2.05   0.041     .0029353    .1358095
   dumyear23 |   .0636852   .0338253     1.88   0.060    -.0026137    .1299841
   dumyear24 |   .0274385   .0344165     0.80   0.425    -.0400191    .0948961
   dumyear25 |   .0498644   .0335623     1.49   0.137     -.015919    .1156478
   dumyear26 |   .0588006   .0337856     1.74   0.082    -.0074204    .1250217
   dumyear27 |  -.0010285   .0348738    -0.03   0.976    -.0693825    .0673256
   dumyear28 |          0  (omitted)
   dumyear29 |  -.0016419   .0354191    -0.05   0.963    -.0710647    .0677809
   dumyear30 |    .031884   .0349517     0.91   0.362    -.0366226    .1003907
   dumyear31 |   .0536165   .0343299     1.56   0.118    -.0136715    .1209044
   dumyear32 |  -.0018361   .0372736    -0.05   0.961    -.0748937    .0712215
   dumyear33 |   .0352379   .0354334     0.99   0.320    -.0342129    .1046888
   dumyear34 |   .0092219   .0365701     0.25   0.801    -.0624569    .0809007
   dumyear35 |   .0131745   .0373446     0.35   0.724    -.0600223    .0863713
    dumnind1 |          0  (omitted)
    dumnind2 |   .0285407   .0480036     0.59   0.552    -.0655482    .1226296
    dumnind3 |  -.0572772   .0466156    -1.23   0.219    -.1486455    .0340911
    dumnind4 |  -.2230486    .047527    -4.69   0.000    -.3162033   -.1298939
    dumnind5 |   .0500046   .0469001     1.07   0.286    -.0419215    .1419307
    dumnind6 |     -.1869   .0518111    -3.61   0.000    -.2884518   -.0853482
    dumnind7 |  -.2376121   .0485975    -4.89   0.000    -.3328652    -.142359
    dumnind8 |  -.3290347   .0481535    -6.83   0.000    -.4234174    -.234652
    dumnind9 |  -.2317995   .0483853    -4.79   0.000    -.3266366   -.1369624
   dumnind10 |  -.2942533   .0504568    -5.83   0.000    -.3931506   -.1953559
   dumnind11 |  -.0034091   .0483291    -0.07   0.944     -.098136    .0913178
        educ |   .0613959   .0083038     7.39   0.000     .0451202    .0776716
       exper |   .0389971   .0063506     6.14   0.000     .0265497    .0514444
      exper2 |  -.0003394   .0004346    -0.78   0.435    -.0011911    .0005124
      exper3 |  -1.32e-06   .0000136    -0.10   0.922     -.000028    .0000253
      exper4 |   7.38e-09   1.42e-07     0.05   0.959    -2.71e-07    2.85e-07
        edex |  -.0010319   .0002443    -4.22   0.000    -.0015107   -.0005531
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |  -.0277022   .0269571    -1.03   0.304    -.0805392    .0251347
   dumee_cl3 |  -.0232083   .0342194    -0.68   0.498    -.0902796     .043863
   dumee_cl4 |    .022572    .051747     0.44   0.663    -.0788541    .1239981
   dumee_cl5 |  -.0957016   .0352921    -2.71   0.007    -.1648755   -.0265278
   dumee_cl6 |  -.0154001   .0322392    -0.48   0.633    -.0785902    .0477901
   dumee_cl7 |   .0200855   .0367757     0.55   0.585    -.0519964    .0921673
   dumee_cl8 |   .0349146   .0490258     0.71   0.476    -.0611778     .131007
   dumee_cl9 |  -.1060791   .0421612    -2.52   0.012    -.1887167   -.0234415
  dumee_cl10 |  -.0469404   .0401984    -1.17   0.243    -.1257308      .03185
  dumee_cl11 |   .0158421   .0427936     0.37   0.711     -.068035    .0997192
  dumee_cl12 |   .0414084    .049544     0.84   0.403    -.0556997    .1385165
  dumee_cl13 |  -.1079088   .0497977    -2.17   0.030    -.2055142   -.0103035
  dumee_cl14 |  -.0394667   .0465285    -0.85   0.396    -.1306643    .0517309
  dumee_cl15 |   .0404159   .0474244     0.85   0.394    -.0525377    .1333695
  dumee_cl16 |   .0602903   .0514682     1.17   0.241    -.0405894      .16117
        marr |   .0494781   .0067726     7.31   0.000     .0362036    .0627526
      public |    .031714   .0093911     3.38   0.001     .0133072    .0501208
        cmsa |     .08939   .0122067     7.32   0.000     .0654643    .1133157
   dumnocc31 |   .1654317   .0136197    12.15   0.000     .1387364    .1921269
   dumnocc32 |          0  (omitted)
   dumnocc33 |  -.0304701   .0122316    -2.49   0.013    -.0544445   -.0064956
   dumnocc34 |    .046596   .0104968     4.44   0.000     .0260219    .0671701
 dumquarter1 |  -.0011895   .0087097    -0.14   0.891    -.0182608    .0158819
 dumquarter2 |  -.0037112   .0088403    -0.42   0.675    -.0210385     .013616
 dumquarter3 |          0  (omitted)
 dumquarter4 |   .0023603    .008836     0.27   0.789    -.0149586    .0196792
       _cons |   .6354385   .2961504     2.15   0.032     .0549723    1.215905
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(1,520,652 real changes made)

      Source |       SS       df       MS              Number of obs =  239410
-------------+------------------------------           F(124,239285) =  304.99
       Model |  10249.8655   124  82.6602059           Prob > F      =  0.0000
    Residual |  41806.7953 239285  .174715487          R-squared     =  0.1969
-------------+------------------------------           Adj R-squared =  0.1965
       Total |  52056.6609 239409  .217438195          Root MSE      =  .41799
------------------------------------------------------------------------------
             |               Robust
  rifwmcu_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |   .0242926   .0199546     1.22   0.223    -.0148179    .0634031
   dumstate2 |   .0886716   .0174364     5.09   0.000     .0544968    .1228464
   dumstate3 |  -.0164413   .0136195    -1.21   0.227    -.0431351    .0102525
   dumstate4 |   .0683678   .0119568     5.72   0.000     .0449327    .0918029
   dumstate5 |  -.0018494   .0131055    -0.14   0.888    -.0275358    .0238371
   dumstate6 |   .1396031   .0141228     9.88   0.000     .1119229    .1672833
   dumstate7 |   .1118322   .0108211    10.33   0.000     .0906232    .1330412
   dumstate8 |   .1558943   .0118639    13.14   0.000     .1326414    .1791472
   dumstate9 |  -.0107934   .0110983    -0.97   0.331    -.0325458    .0109589
  dumstate10 |   .0111101   .0110306     1.01   0.314    -.0105097    .0327298
  dumstate11 |   .0302051   .0127881     2.36   0.018     .0051406    .0552695
  dumstate12 |   .1192305    .011227    10.62   0.000     .0972259    .1412351
  dumstate13 |   .1312179   .0111576    11.76   0.000     .1093493    .1530864
  dumstate14 |   .0218281   .0122941     1.78   0.076    -.0022679    .0459242
  dumstate15 |   .1092357    .012446     8.78   0.000     .0848418    .1336296
  dumstate16 |  -.0088134   .0140832    -0.63   0.531    -.0364161    .0187893
  dumstate17 |    .068644   .0130497     5.26   0.000     .0430668    .0942211
  dumstate18 |   .0528751   .0174835     3.02   0.002     .0186079    .0871423
  dumstate19 |  -.0409467   .0169593    -2.41   0.016    -.0741864    -.007707
  dumstate20 |  -.0277071   .0138397    -2.00   0.045    -.0548326   -.0005816
  dumstate21 |   .0740606   .0139764     5.30   0.000     .0466671     .101454
  dumstate22 |   .0896246   .0238067     3.76   0.000     .0429641     .136285
  dumstate23 |   .1307773   .0144366     9.06   0.000     .1024819    .1590727
  dumstate24 |   .1633206   .0182492     8.95   0.000     .1275527    .1990885
  dumstate25 |   .0917426   .0147716     6.21   0.000     .0627907    .1206945
  dumstate26 |   .0281876   .0146521     1.92   0.054    -.0005302    .0569054
  dumstate27 |   .0125621   .0154964     0.81   0.418    -.0178105    .0429346
  dumstate28 |  -.0193501   .0233052    -0.83   0.406    -.0650276    .0263275
  dumstate29 |   .0563087   .0159681     3.53   0.000     .0250116    .0876058
  dumstate30 |   .0318574   .0131269     2.43   0.015      .006129    .0575858
  dumstate31 |  -.0189859   .0132157    -1.44   0.151    -.0448884    .0069166
  dumstate32 |  -.0143146    .014583    -0.98   0.326    -.0428969    .0142676
  dumstate33 |   .0029716   .0151026     0.20   0.844    -.0266292    .0325724
  dumstate34 |  -.0358313   .0173073    -2.07   0.038    -.0697531   -.0019095
  dumstate35 |  -.0452516   .0156996    -2.88   0.004    -.0760224   -.0144808
  dumstate36 |   .0555457   .0186469     2.98   0.003     .0189981    .0920932
  dumstate37 |  -.0103499   .0153518    -0.67   0.500     -.040439    .0197392
  dumstate38 |   .0732669   .0126937     5.77   0.000     .0483876    .0981463
  dumstate39 |          0  (omitted)
  dumstate40 |   .0105096   .0183633     0.57   0.567     -.025482    .0465011
  dumstate41 |    .198656   .0167282    11.88   0.000     .1658692    .2314428
  dumstate42 |   .0551931   .0148816     3.71   0.000     .0260255    .0843607
  dumstate43 |   .0275098   .0236722     1.16   0.245    -.0188872    .0739067
  dumstate44 |   .0584425   .0171528     3.41   0.001     .0248234    .0920616
  dumstate45 |  -.0141038   .0161752    -0.87   0.383    -.0458068    .0175992
  dumstate46 |   .1076167   .0140636     7.65   0.000     .0800523     .135181
  dumstate47 |   .1248127   .0124539    10.02   0.000     .1004033     .149222
  dumstate48 |   .0509092   .0132975     3.83   0.000     .0248464    .0769719
  dumstate49 |   .1897625   .0110099    17.24   0.000     .1681833    .2113416
  dumstate50 |   .2809372   .0135566    20.72   0.000     .2543666    .3075079
  dumstate51 |   .0856216   .0202887     4.22   0.000     .0458562     .125387
    dumyear1 |  -.0146058   .0140816    -1.04   0.300    -.0422054    .0129938
    dumyear2 |  -.0091682   .0142166    -0.64   0.519    -.0370323    .0186959
    dumyear3 |  -.0205098   .0148413    -1.38   0.167    -.0495984    .0085787
    dumyear4 |   .0144115   .0143068     1.01   0.314    -.0136294    .0424524
    dumyear5 |   .0277323   .0144196     1.92   0.054    -.0005297    .0559943
    dumyear6 |   .0010461   .0147407     0.07   0.943    -.0278454    .0299375
    dumyear7 |  -.0276333   .0146297    -1.89   0.059    -.0563071    .0010404
    dumyear8 |  -.0295281   .0144334    -2.05   0.041    -.0578173    -.001239
    dumyear9 |   -.041116   .0146165    -2.81   0.005     -.069764   -.0124681
   dumyear10 |  -.0355022   .0147428    -2.41   0.016    -.0643977   -.0066067
   dumyear11 |  -.0606688   .0145995    -4.16   0.000    -.0892834   -.0320542
   dumyear12 |  -.0249985   .0156131    -1.60   0.109    -.0555998    .0056028
   dumyear13 |  -.0407809   .0157579    -2.59   0.010     -.071666   -.0098959
   dumyear14 |   -.026046   .0156899    -1.66   0.097    -.0567978    .0047058
   dumyear15 |  -.0205838   .0158313    -1.30   0.194    -.0516128    .0104453
   dumyear16 |  -.0235528   .0162421    -1.45   0.147    -.0553868    .0082813
   dumyear17 |   .0045118   .0168311     0.27   0.789    -.0284766    .0375003
   dumyear18 |     .00622   .0157672     0.39   0.693    -.0246833    .0371233
   dumyear19 |  -.0056972   .0162467    -0.35   0.726    -.0375403    .0261459
   dumyear20 |   .0173337    .016134     1.07   0.283    -.0142885    .0489558
   dumyear21 |   .0018267   .0165018     0.11   0.912    -.0305165    .0341699
   dumyear22 |  -.0102114   .0170452    -0.60   0.549    -.0436194    .0231967
   dumyear23 |   .0062517   .0166525     0.38   0.707    -.0263869    .0388902
   dumyear24 |  -.0021086    .016674    -0.13   0.899    -.0347893     .030572
   dumyear25 |   -.008241   .0175147    -0.47   0.638    -.0425693    .0260872
   dumyear26 |   .0119375   .0168979     0.71   0.480    -.0211819    .0450569
   dumyear27 |    .018921   .0169962     1.11   0.266    -.0143911    .0522331
   dumyear28 |  -.0247872   .0176974    -1.40   0.161    -.0594736    .0098992
   dumyear29 |  -.0372327   .0170636    -2.18   0.029    -.0706768   -.0037885
   dumyear30 |   -.027832   .0172546    -1.61   0.107    -.0616507    .0059866
   dumyear31 |  -.0188437   .0174049    -1.08   0.279    -.0529569    .0152695
   dumyear32 |  -.0452045   .0172188    -2.63   0.009    -.0789529   -.0114561
   dumyear33 |   .0132179   .0173862     0.76   0.447    -.0208585    .0472944
   dumyear34 |   .0062633   .0173669     0.36   0.718    -.0277753    .0403018
   dumyear35 |          0  (omitted)
    dumnind1 |   .1331929     .02238     5.95   0.000     .0893286    .1770572
    dumnind2 |   .1912188   .0127426    15.01   0.000     .1662436    .2161939
    dumnind3 |   .0334209   .0123812     2.70   0.007     .0091541    .0576878
    dumnind4 |  -.0857214   .0127938    -6.70   0.000     -.110797   -.0606458
    dumnind5 |   .1702291    .012302    13.84   0.000     .1461174    .1943408
    dumnind6 |          0  (omitted)
    dumnind7 |   .0259942   .0140222     1.85   0.064    -.0014891    .0534774
    dumnind8 |  -.1127008   .0142974    -7.88   0.000    -.1407234   -.0846783
    dumnind9 |  -.1134938   .0129886    -8.74   0.000    -.1389512   -.0880364
   dumnind10 |  -.0730569   .0150102    -4.87   0.000    -.1024765   -.0436372
   dumnind11 |   .1727215   .0132593    13.03   0.000     .1467336    .1987094
        educ |   .0481025   .0042344    11.36   0.000     .0398032    .0564017
       exper |   .0388534   .0031664    12.27   0.000     .0326474    .0450594
      exper2 |  -.0006534   .0002083    -3.14   0.002    -.0010616   -.0002452
      exper3 |   6.47e-07   6.83e-06     0.09   0.925    -.0000127     .000014
      exper4 |   5.04e-08   7.37e-08     0.68   0.494    -9.40e-08    1.95e-07
        edex |  -.0004999   .0001385    -3.61   0.000    -.0007713   -.0002285
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |  -.0102816   .0119662    -0.86   0.390    -.0337351    .0131719
   dumee_cl3 |  -.0205285   .0160121    -1.28   0.200    -.0519118    .0108548
   dumee_cl4 |  -.0246507   .0250272    -0.98   0.325    -.0737033    .0244019
   dumee_cl5 |  -.0768774   .0174987    -4.39   0.000    -.1111745   -.0425804
   dumee_cl6 |  -.0205752   .0143587    -1.43   0.152    -.0487179    .0075675
   dumee_cl7 |   .0238592   .0169684     1.41   0.160    -.0093984    .0571167
   dumee_cl8 |   .0192737   .0234126     0.82   0.410    -.0266144    .0651618
   dumee_cl9 |  -.0815376    .020737    -3.93   0.000    -.1221816   -.0408935
  dumee_cl10 |  -.0271606    .018489    -1.47   0.142    -.0633985    .0090773
  dumee_cl11 |   .0076453   .0198157     0.39   0.700    -.0311928    .0464835
  dumee_cl12 |   .0106445   .0234378     0.45   0.650    -.0352931     .056582
  dumee_cl13 |  -.0582673   .0253549    -2.30   0.022    -.1079623   -.0085723
  dumee_cl14 |  -.0202905   .0219905    -0.92   0.356    -.0633912    .0228103
  dumee_cl15 |  -.0031298   .0221736    -0.14   0.888    -.0465896    .0403299
  dumee_cl16 |   .0233017   .0242802     0.96   0.337    -.0242869    .0708904
        marr |   .0612082    .003446    17.76   0.000     .0544542    .0679623
      public |  -.0450513   .0052723    -8.54   0.000    -.0553848   -.0347178
        cmsa |   .0951462   .0038912    24.45   0.000     .0875196    .1027728
   dumnocc31 |          0  (omitted)
   dumnocc32 |  -.1618799   .0068646   -23.58   0.000    -.1753344   -.1484253
   dumnocc33 |  -.2086115   .0061588   -33.87   0.000    -.2206827   -.1965404
   dumnocc34 |  -.0952581   .0056849   -16.76   0.000    -.1064004   -.0841158
 dumquarter1 |  -.0117559    .004176    -2.82   0.005    -.0199407    -.003571
 dumquarter2 |  -.0065029   .0042296    -1.54   0.124    -.0147929     .001787
 dumquarter3 |          0  (omitted)
 dumquarter4 |  -.0022649   .0042419    -0.53   0.593    -.0105789    .0060492
       _cons |   .9393284   .0516591    18.18   0.000     .8380779    1.040579
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc33 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(746,827 real changes made)

      Source |       SS       df       MS              Number of obs = 1013235
-------------+------------------------------           F(124,1013110) = 7278.62
       Model |  222100.294   124  1791.13141           Prob > F      =  0.0000
    Residual |  393060.086 1013110   .38797375         R-squared     =  0.3610
-------------+------------------------------           Adj R-squared =  0.3610
       Total |   615160.38 1013234  .607125679         Root MSE      =  .62288
------------------------------------------------------------------------------
             |               Robust
   rifwmn_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.0710023    .014503    -4.90   0.000    -.0994277   -.0425768
   dumstate2 |   .0615753   .0140841     4.37   0.000     .0339709    .0891797
   dumstate3 |  -.0377675   .0140106    -2.70   0.007    -.0652278   -.0103073
   dumstate4 |   .0721379    .013615     5.30   0.000     .0454529    .0988228
   dumstate5 |  -.0393628   .0142522    -2.76   0.006    -.0672967    -.011429
   dumstate6 |   .1073409   .0141708     7.57   0.000     .0795665    .1351152
   dumstate7 |   .0248032   .0133633     1.86   0.063    -.0013884    .0509948
   dumstate8 |     .12126   .0136879     8.86   0.000     .0944322    .1480879
   dumstate9 |  -.0460852    .013392    -3.44   0.001    -.0723331   -.0198373
  dumstate10 |  -.0640871   .0133483    -4.80   0.000    -.0902493   -.0379249
  dumstate11 |  -.0692489   .0138736    -4.99   0.000    -.0964406   -.0420572
  dumstate12 |   .0358096   .0134236     2.67   0.008     .0094997    .0621194
  dumstate13 |  -.0172205   .0134422    -1.28   0.200    -.0435666    .0091257
  dumstate14 |  -.0292952   .0137212    -2.14   0.033    -.0561882   -.0024021
  dumstate15 |   .0161733   .0136599     1.18   0.236    -.0105996    .0429462
  dumstate16 |    -.07969   .0139706    -5.70   0.000    -.1070718   -.0523081
  dumstate17 |  -.0781305    .013875    -5.63   0.000    -.1053251   -.0509359
  dumstate18 |  -.0176346   .0149297    -1.18   0.238    -.0468963     .011627
  dumstate19 |  -.1505426   .0139973   -10.76   0.000    -.1779768   -.1231085
  dumstate20 |  -.1286775   .0137919    -9.33   0.000    -.1557091   -.1016458
  dumstate21 |  -.0877824   .0137386    -6.39   0.000    -.1147096   -.0608553
  dumstate22 |          0  (omitted)
  dumstate23 |   .0754114   .0141439     5.33   0.000     .0476898     .103133
  dumstate24 |   .1340618   .0142652     9.40   0.000     .1061024    .1620212
  dumstate25 |   .0496671   .0136611     3.64   0.000     .0228917    .0764424
  dumstate26 |  -.0533068   .0146947    -3.63   0.000    -.0821078   -.0245058
  dumstate27 |  -.0808845   .0135333    -5.98   0.000    -.1074093   -.0543598
  dumstate28 |  -.0779634   .0144595    -5.39   0.000    -.1063035   -.0496233
  dumstate29 |  -.0118982   .0139702    -0.85   0.394    -.0392794     .015483
  dumstate30 |  -.1015043   .0134992    -7.52   0.000    -.1279623   -.0750464
  dumstate31 |  -.0872857   .0138649    -6.30   0.000    -.1144605   -.0601109
  dumstate32 |  -.1361916   .0138881    -9.81   0.000    -.1634119   -.1089713
  dumstate33 |  -.0747382   .0144039    -5.19   0.000    -.1029694    -.046507
  dumstate34 |  -.0924705   .0144614    -6.39   0.000    -.1208145   -.0641266
  dumstate35 |   -.176503   .0139663   -12.64   0.000    -.2038765   -.1491295
  dumstate36 |  -.0016626   .0149003    -0.11   0.911    -.0308666    .0275415
  dumstate37 |  -.0900352   .0140327    -6.42   0.000    -.1175387   -.0625316
  dumstate38 |   .0008601   .0133462     0.06   0.949     -.025298    .0270183
  dumstate39 |  -.0624729   .0144432    -4.33   0.000    -.0907812   -.0341646
  dumstate40 |  -.0688517   .0140187    -4.91   0.000    -.0963279   -.0413754
  dumstate41 |   .2056239   .0147738    13.92   0.000     .1766678      .23458
  dumstate42 |   .0247878   .0139606     1.78   0.076    -.0025746    .0521502
  dumstate43 |  -.0317136   .0153633    -2.06   0.039    -.0618251   -.0016021
  dumstate44 |  -.0344575   .0142029    -2.43   0.015    -.0622946   -.0066204
  dumstate45 |  -.0591446   .0139247    -4.25   0.000    -.0864365   -.0318527
  dumstate46 |   .0343605    .014632     2.35   0.019     .0056823    .0630388
  dumstate47 |   .0651316   .0140287     4.64   0.000     .0376357    .0926274
  dumstate48 |  -.0251003   .0140704    -1.78   0.074    -.0526778    .0024773
  dumstate49 |   .1148161   .0132881     8.64   0.000     .0887719    .1408602
  dumstate50 |   .3085682   .0146318    21.09   0.000     .2798903    .3372461
  dumstate51 |   .0875815   .0177749     4.93   0.000     .0527434    .1224197
    dumyear1 |   .0023855   .0061661     0.39   0.699    -.0096999    .0144709
    dumyear2 |   .0242167   .0061738     3.92   0.000     .0121163     .036317
    dumyear3 |   .0425633   .0065196     6.53   0.000      .029785    .0553416
    dumyear4 |    .068545   .0061088    11.22   0.000     .0565719     .080518
    dumyear5 |    .008651   .0061338     1.41   0.158    -.0033711     .020673
    dumyear6 |   .0128952   .0062799     2.05   0.040     .0005869    .0252036
    dumyear7 |   .0216948   .0061105     3.55   0.000     .0097185    .0336711
    dumyear8 |   .0148818   .0060223     2.47   0.013     .0030783    .0266854
    dumyear9 |  -.0081093   .0060883    -1.33   0.183    -.0200421    .0038236
   dumyear10 |  -.0285488   .0061022    -4.68   0.000    -.0405088   -.0165888
   dumyear11 |  -.0402761   .0061361    -6.56   0.000    -.0523026   -.0282497
   dumyear12 |  -.0454345   .0064818    -7.01   0.000    -.0581386   -.0327305
   dumyear13 |  -.0339059   .0064792    -5.23   0.000    -.0466049   -.0212069
   dumyear14 |   .0034395   .0064805     0.53   0.596    -.0092621    .0161411
   dumyear15 |   .0152413   .0065254     2.34   0.020     .0024518    .0280308
   dumyear16 |   .0306741   .0066274     4.63   0.000     .0176846    .0436636
   dumyear17 |   .0444422   .0066151     6.72   0.000     .0314768    .0574076
   dumyear18 |   .0434265   .0065511     6.63   0.000     .0305866    .0562664
   dumyear19 |   .0560689   .0066002     8.50   0.000     .0431327    .0690051
   dumyear20 |   .0429517   .0066551     6.45   0.000     .0299079    .0559955
   dumyear21 |   .0341592   .0066087     5.17   0.000     .0212064     .047112
   dumyear22 |   .0386191   .0066289     5.83   0.000     .0256268    .0516114
   dumyear23 |   .0390746   .0066223     5.90   0.000     .0260952     .052054
   dumyear24 |   .0280722   .0066781     4.20   0.000     .0149833     .041161
   dumyear25 |   .0285711   .0067098     4.26   0.000     .0154202     .041722
   dumyear26 |   .0298278   .0068215     4.37   0.000     .0164579    .0431977
   dumyear27 |  -.0110334   .0068249    -1.62   0.106      -.02441    .0023433
   dumyear28 |   .0020085   .0068098     0.29   0.768    -.0113384    .0153555
   dumyear29 |          0  (omitted)
   dumyear30 |   .0077908   .0069384     1.12   0.262    -.0058082    .0213898
   dumyear31 |   .0287124   .0069412     4.14   0.000     .0151078     .042317
   dumyear32 |   .0349901   .0068537     5.11   0.000     .0215571     .048423
   dumyear33 |   .0403709   .0068799     5.87   0.000     .0268865    .0538554
   dumyear34 |   .0612433   .0069258     8.84   0.000     .0476689    .0748177
   dumyear35 |   .0693676   .0070238     9.88   0.000     .0556012     .083134
    dumnind1 |          0  (omitted)
    dumnind2 |   .0692508   .0050566    13.70   0.000     .0593401    .0791616
    dumnind3 |   .0879877    .004635    18.98   0.000     .0789032    .0970722
    dumnind4 |  -.1166251   .0047428   -24.59   0.000    -.1259208   -.1073294
    dumnind5 |   .0462933   .0051645     8.96   0.000      .036171    .0564156
    dumnind6 |   .0658135   .0052706    12.49   0.000     .0554832    .0761438
    dumnind7 |  -.0566264   .0048724   -11.62   0.000    -.0661761   -.0470766
    dumnind8 |   -.157351   .0057511   -27.36   0.000     -.168623   -.1460791
    dumnind9 |  -.2658661   .0062519   -42.53   0.000    -.2781195   -.2536127
   dumnind10 |  -.2118741   .0063673   -33.28   0.000    -.2243538   -.1993945
   dumnind11 |   .0463164   .0067439     6.87   0.000     .0330986    .0595342
        educ |   .0485415   .0016117    30.12   0.000     .0453825    .0517005
       exper |   .0389234   .0012319    31.60   0.000      .036509    .0413379
      exper2 |  -.0001827    .000098    -1.86   0.062    -.0003748    9.46e-06
      exper3 |  -.0000234   3.54e-06    -6.61   0.000    -.0000303   -.0000165
      exper4 |   3.24e-07   4.03e-08     8.04   0.000     2.45e-07    4.03e-07
        edex |  -.0002442   .0000592    -4.12   0.000    -.0003603   -.0001281
   dumee_cl1 |   .1589296   .0142173    11.18   0.000     .1310643     .186795
   dumee_cl2 |   .0522435   .0130265     4.01   0.000      .026712     .077775
   dumee_cl3 |   .0527315   .0127126     4.15   0.000     .0278152    .0776477
   dumee_cl4 |   .2699516   .0128312    21.04   0.000     .2448028    .2951004
   dumee_cl5 |  -.0681665   .0126957    -5.37   0.000    -.0930496   -.0432833
   dumee_cl6 |   .0322522   .0116621     2.77   0.006     .0093948    .0551095
   dumee_cl7 |   .1457293   .0117878    12.36   0.000     .1226256     .168833
   dumee_cl8 |   .3241294   .0123389    26.27   0.000     .2999455    .3483132
   dumee_cl9 |  -.0985258   .0102175    -9.64   0.000    -.1185517   -.0784999
  dumee_cl10 |   .0525635   .0094749     5.55   0.000      .033993    .0711339
  dumee_cl11 |   .1837682   .0101631    18.08   0.000     .1638489    .2036875
  dumee_cl12 |   .2633462   .0116916    22.52   0.000      .240431    .2862614
  dumee_cl13 |          0  (omitted)
  dumee_cl14 |   .1037826   .0073337    14.15   0.000     .0894088    .1181564
  dumee_cl15 |   .2017373   .0086925    23.21   0.000     .1847003    .2187743
  dumee_cl16 |   .2574508   .0114068    22.57   0.000     .2350939    .2798078
        marr |   .1606275   .0018168    88.41   0.000     .1570667    .1641883
      public |   .0089444   .0038393     2.33   0.020     .0014195    .0164694
        cmsa |    .189431   .0020121    94.15   0.000     .1854874    .1933746
   dumnocc31 |   .4081793    .003001   136.01   0.000     .4022974    .4140612
   dumnocc32 |   .1725209   .0030324    56.89   0.000     .1665776    .1784642
   dumnocc33 |          0  (omitted)
   dumnocc34 |   .0614204   .0028116    21.85   0.000     .0559098     .066931
 dumquarter1 |   -.017566   .0020475    -8.58   0.000    -.0215791   -.0135529
 dumquarter2 |   -.011419   .0020548    -5.56   0.000    -.0154463   -.0073917
 dumquarter3 |  -.0098502   .0020752    -4.75   0.000    -.0139176   -.0057828
 dumquarter4 |          0  (omitted)
       _cons |   .2221047   .0307776     7.22   0.000     .1617817    .2824277
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate41 dropped because of collinearity
note: dumyear19 dropped because of collinearity
note: dumnind11 dropped because of collinearity
note: dumee_cl13 dropped because of collinearity
note: dumnocc31 dropped because of collinearity
note: dumquarter2 dropped because of collinearity
(1,663,699 real changes made)

      Source |       SS       df       MS              Number of obs =   96363
-------------+------------------------------           F(124, 96238) =  498.45
       Model |  13068.7898   124  105.393467           Prob > F      =  0.0000
    Residual |  30175.2959 96238  .313548659           R-squared     =  0.3022
-------------+------------------------------           Adj R-squared =  0.3013
       Total |  43244.0857 96362  .448767001           Root MSE      =  .55995
------------------------------------------------------------------------------
             |               Robust
   rifbmn_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.0325284   .1231312    -0.26   0.792     -.273864    .2088073
   dumstate2 |  -.0279758   .1121452    -0.25   0.803     -.247779    .1918275
   dumstate3 |          0  (omitted)
   dumstate4 |  -.1370134   .0922172    -1.49   0.137    -.3177581    .0437313
   dumstate5 |   -.241076   .0937623    -2.57   0.010    -.4248491   -.0573029
   dumstate6 |  -.0588476   .0921664    -0.64   0.523    -.2394927    .1217975
   dumstate7 |  -.1422356   .0900956    -1.58   0.114     -.318822    .0343509
   dumstate8 |  -.0916831   .0906544    -1.01   0.312    -.2693647    .0859985
   dumstate9 |  -.2003163   .0906593    -2.21   0.027    -.3780075   -.0226251
  dumstate10 |  -.2563339   .0903269    -2.84   0.005    -.4333736   -.0792942
  dumstate11 |  -.2358687   .0921522    -2.56   0.010    -.4164861   -.0552514
  dumstate12 |  -.1608101   .0901961    -1.78   0.075    -.3375934    .0159732
  dumstate13 |   -.231938   .0904445    -2.56   0.010    -.4092082   -.0546679
  dumstate14 |  -.2575242    .093108    -2.77   0.006    -.4400147   -.0750336
  dumstate15 |  -.2049307   .0926194    -2.21   0.027    -.3864636   -.0233978
  dumstate16 |  -.3039579   .1020973    -2.98   0.003    -.5040674   -.1038485
  dumstate17 |  -.2519895   .0911245    -2.77   0.006    -.4305924   -.0733866
  dumstate18 |   .0674371   .1253886     0.54   0.591    -.1783231    .3131974
  dumstate19 |  -.3760283   .1058349    -3.55   0.000    -.5834635   -.1685932
  dumstate20 |  -.2426004   .0935724    -2.59   0.010    -.4260012   -.0591996
  dumstate21 |  -.1992774   .0917661    -2.17   0.030     -.379138   -.0194168
  dumstate22 |  -.2010386    .094173    -2.13   0.033    -.3856166   -.0164606
  dumstate23 |  -.0870143   .0901412    -0.97   0.334      -.26369    .0896614
  dumstate24 |  -.0759581   .0899533    -0.84   0.398    -.2522656    .1003494
  dumstate25 |  -.1508335   .0900451    -1.68   0.094    -.3273208    .0256538
  dumstate26 |  -.3011368   .0997685    -3.02   0.003     -.496682   -.1055916
  dumstate27 |  -.2370052   .0898165    -2.64   0.008    -.4130445   -.0609658
  dumstate28 |  -.2353922   .0900026    -2.62   0.009    -.4117964   -.0589881
  dumstate29 |  -.1791961   .0898598    -1.99   0.046    -.3553204   -.0030719
  dumstate30 |  -.2722011   .0899445    -3.03   0.002    -.4484913    -.095911
  dumstate31 |  -.2199087   .0915013    -2.40   0.016    -.3992502   -.0405672
  dumstate32 |  -.2908215   .0905245    -3.21   0.001    -.4682486   -.1133944
  dumstate33 |  -.3217956   .0902179    -3.57   0.000    -.4986217   -.1449695
  dumstate34 |  -.3187337   .0898313    -3.55   0.000     -.494802   -.1426654
  dumstate35 |   -.359032     .09052    -3.97   0.000    -.5364501    -.181614
  dumstate36 |   -.244888   .0903229    -2.71   0.007    -.4219198   -.0678562
  dumstate37 |  -.2967707   .0916427    -3.24   0.001    -.4763894    -.117152
  dumstate38 |  -.1939258   .0898952    -2.16   0.031    -.3701193   -.0177323
  dumstate39 |  -.3153622   .1190069    -2.65   0.008    -.5486143   -.0821101
  dumstate40 |  -.3515983    .121101    -2.90   0.004    -.5889549   -.1142416
  dumstate41 |   .1372846   .1456252     0.94   0.346    -.1481392    .4227083
  dumstate42 |  -.1945642   .0929892    -2.09   0.036     -.376822   -.0123063
  dumstate43 |   -.115269   .0968543    -1.19   0.234    -.3051024    .0745644
  dumstate44 |  -.2272142   .0924816    -2.46   0.014     -.408477   -.0459514
  dumstate45 |   -.220919   .1005666    -2.20   0.028    -.4180285   -.0238096
  dumstate46 |  -.1671074   .0921065    -1.81   0.070    -.3476351    .0134204
  dumstate47 |  -.1134279   .0934063    -1.21   0.225    -.2965031    .0696474
  dumstate48 |   -.241745   .0986772    -2.45   0.014    -.4351512   -.0483388
  dumstate49 |  -.0762871   .0900269    -0.85   0.397    -.2527388    .1001646
  dumstate50 |    .031701   .0954233     0.33   0.740    -.1553276    .2187296
  dumstate51 |  -.1191177   .1043059    -1.14   0.253     -.323556    .0853207
    dumyear1 |   -.000151   .0163584    -0.01   0.993    -.0322132    .0319112
    dumyear2 |  -.0051799   .0160087    -0.32   0.746    -.0365568     .026197
    dumyear3 |          0  (omitted)
    dumyear4 |   .0271936   .0160517     1.69   0.090    -.0042674    .0586547
    dumyear5 |  -.0049143   .0161343    -0.30   0.761    -.0365373    .0267087
    dumyear6 |   .0142696   .0164269     0.87   0.385     -.017927    .0464663
    dumyear7 |   .0207184   .0161844     1.28   0.200    -.0110029    .0524397
    dumyear8 |  -.0005158   .0161773    -0.03   0.975    -.0322231    .0311915
    dumyear9 |  -.0099772   .0164461    -0.61   0.544    -.0422114     .022257
   dumyear10 |  -.0207228   .0163547    -1.27   0.205    -.0527778    .0113322
   dumyear11 |   -.043951   .0160752    -2.73   0.006    -.0754583   -.0124437
   dumyear12 |  -.0136234   .0179985    -0.76   0.449    -.0489003    .0216536
   dumyear13 |  -.0534593   .0179653    -2.98   0.003    -.0886712   -.0182474
   dumyear14 |   .0052764   .0179586     0.29   0.769    -.0299222     .040475
   dumyear15 |   .0548646   .0180239     3.04   0.002      .019538    .0901913
   dumyear16 |   .0452047   .0178678     2.53   0.011      .010184    .0802254
   dumyear17 |   .0662261   .0183648     3.61   0.000     .0302312    .1022209
   dumyear18 |   .0909907   .0181492     5.01   0.000     .0554184    .1265629
   dumyear19 |   .0876041     .01876     4.67   0.000     .0508347    .1243734
   dumyear20 |   .1032131   .0190378     5.42   0.000     .0658992     .140527
   dumyear21 |   .0437289   .0183304     2.39   0.017     .0078016    .0796562
   dumyear22 |   .0174522   .0180828     0.97   0.334    -.0179899    .0528944
   dumyear23 |   .0429751   .0178415     2.41   0.016     .0080059    .0779443
   dumyear24 |   .0551062   .0178465     3.09   0.002     .0201273    .0900851
   dumyear25 |   .0456686   .0180581     2.53   0.011      .010275    .0810623
   dumyear26 |   .0263997   .0180348     1.46   0.143    -.0089483    .0617476
   dumyear27 |    .011186   .0180956     0.62   0.536    -.0242811    .0466531
   dumyear28 |    .040238   .0180015     2.24   0.025     .0049553    .0755206
   dumyear29 |  -.0122976   .0180098    -0.68   0.495    -.0475967    .0230015
   dumyear30 |   .0066811   .0184228     0.36   0.717    -.0294273    .0427895
   dumyear31 |   .0122754   .0179629     0.68   0.494    -.0229317    .0474824
   dumyear32 |   .0555917   .0177166     3.14   0.002     .0208674    .0903159
   dumyear33 |   .0176672    .018435     0.96   0.338    -.0184652    .0537996
   dumyear34 |   .0351144   .0186741     1.88   0.060    -.0014867    .0717155
   dumyear35 |   .0943422   .0188819     5.00   0.000     .0573339    .1313505
    dumnind1 |  -.2253973   .0191846   -11.75   0.000    -.2629988   -.1877957
    dumnind2 |  -.0637374   .0152122    -4.19   0.000     -.093553   -.0339217
    dumnind3 |   -.078843   .0136378    -5.78   0.000     -.105573    -.052113
    dumnind4 |  -.2607565   .0134387   -19.40   0.000    -.2870963   -.2344168
    dumnind5 |  -.0673716   .0135092    -4.99   0.000    -.0938495   -.0408937
    dumnind6 |  -.0891662   .0147612    -6.04   0.000    -.1180981   -.0602343
    dumnind7 |  -.2382504   .0135041   -17.64   0.000    -.2647183   -.2117824
    dumnind8 |  -.2800951   .0136301   -20.55   0.000      -.30681   -.2533802
    dumnind9 |  -.2640082   .0129005   -20.46   0.000     -.289293   -.2387234
   dumnind10 |  -.2906313   .0164861   -17.63   0.000    -.3229439   -.2583186
   dumnind11 |          0  (omitted)
        educ |   .0504759   .0045112    11.19   0.000     .0416339    .0593179
       exper |   .0533875   .0032799    16.28   0.000      .046959     .059816
      exper2 |  -.0014572   .0002598    -5.61   0.000    -.0019664   -.0009479
      exper3 |   .0000214   8.73e-06     2.45   0.014     4.30e-06    .0000385
      exper4 |  -1.30e-07   9.40e-08    -1.39   0.166    -3.14e-07    5.40e-08
        edex |  -.0007205   .0001423    -5.06   0.000    -.0009995   -.0004415
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |   -.007735   .0116651    -0.66   0.507    -.0305985    .0151284
   dumee_cl3 |   .0589748    .016537     3.57   0.000     .0265625    .0913872
   dumee_cl4 |   .2617308   .0274405     9.54   0.000     .2079477    .3155138
   dumee_cl5 |  -.1350624    .017891    -7.55   0.000    -.1701285   -.0999963
   dumee_cl6 |  -.0087191   .0167559    -0.52   0.603    -.0415605    .0241223
   dumee_cl7 |    .130943   .0197893     6.62   0.000     .0921561    .1697299
   dumee_cl8 |   .1723357   .0260848     6.61   0.000     .1212099    .2234615
   dumee_cl9 |  -.1343942   .0257515    -5.22   0.000    -.1848669   -.0839215
  dumee_cl10 |  -.0113902   .0242702    -0.47   0.639    -.0589595    .0361792
  dumee_cl11 |   .1238944   .0256805     4.82   0.000     .0735609     .174228
  dumee_cl12 |   .1206814   .0287128     4.20   0.000     .0644046    .1769582
  dumee_cl13 |  -.1407155   .0334863    -4.20   0.000    -.2063483   -.0750828
  dumee_cl14 |   .0055098    .030279     0.18   0.856    -.0538367    .0648562
  dumee_cl15 |   .1059094   .0308171     3.44   0.001     .0455083    .1663105
  dumee_cl16 |   .0832819   .0321326     2.59   0.010     .0203023    .1462615
        marr |   .1268402   .0048543    26.13   0.000     .1173259    .1363546
      public |   .0306141   .0090237     3.39   0.001     .0129277    .0483004
        cmsa |    .153629   .0068351    22.48   0.000     .1402323    .1670256
   dumnocc31 |   .3676336   .0077138    47.66   0.000     .3525146    .3827526
   dumnocc32 |   .1471006   .0075247    19.55   0.000     .1323523     .161849
   dumnocc33 |          0  (omitted)
   dumnocc34 |   .1231006   .0066592    18.49   0.000     .1100486    .1361526
 dumquarter1 |  -.0149971   .0059912    -2.50   0.012    -.0267397   -.0032545
 dumquarter2 |    -.00227   .0059913    -0.38   0.705    -.0140127    .0094728
 dumquarter3 |          0  (omitted)
 dumquarter4 |   -.000049    .006026    -0.01   0.994    -.0118599    .0117618
       _cons |   .4370767   .1032301     4.23   0.000      .234747    .6394064
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc33 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(746,827 real changes made)

      Source |       SS       df       MS              Number of obs = 1013235
-------------+------------------------------           F(124,1013110) = 2783.62
       Model |  162564.956   124  1311.00771           Prob > F      =  0.0000
    Residual |  358623.027 1013110  .353982319         R-squared     =  0.3119
-------------+------------------------------           Adj R-squared =  0.3118
       Total |  521187.983 1013234  .514380669         Root MSE      =  .59496
------------------------------------------------------------------------------
             |               Robust
  rifwmcn_50 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.0213799   .0146557    -1.46   0.145    -.0501045    .0073447
   dumstate2 |   .0885563   .0128252     6.90   0.000     .0634192    .1136933
   dumstate3 |   .0082078   .0114546     0.72   0.474    -.0142429    .0306584
   dumstate4 |   .0996261   .0108856     9.15   0.000     .0782907    .1209616
   dumstate5 |   .0021372   .0118723     0.18   0.857     -.021132    .0254065
   dumstate6 |     .13753   .0120228    11.44   0.000     .1139658    .1610943
   dumstate7 |   .0400424   .0100479     3.99   0.000     .0203488    .0597361
   dumstate8 |   .1354194   .0109061    12.42   0.000     .1140437     .156795
   dumstate9 |  -.0211208   .0101824    -2.07   0.038    -.0410781   -.0011636
  dumstate10 |  -.0441601   .0099663    -4.43   0.000    -.0636937   -.0246265
  dumstate11 |  -.0398813   .0111961    -3.56   0.000    -.0618253   -.0179373
  dumstate12 |   .0583585    .010147     5.75   0.000     .0384706    .0782463
  dumstate13 |  -.0071079   .0101544    -0.70   0.484    -.0270101    .0127943
  dumstate14 |    .010927   .0109869     0.99   0.320     -.010607     .032461
  dumstate15 |   .0671377   .0110761     6.06   0.000      .045429    .0888465
  dumstate16 |  -.0289758   .0119595    -2.42   0.015     -.052416   -.0055356
  dumstate17 |   -.039794   .0110451    -3.60   0.000     -.061442   -.0181461
  dumstate18 |    .043105   .0129391     3.33   0.001     .0177449    .0684651
  dumstate19 |  -.0909418   .0116031    -7.84   0.000    -.1136834   -.0682002
  dumstate20 |  -.0785031   .0110492    -7.10   0.000    -.1001593    -.056847
  dumstate21 |  -.0568781    .010931    -5.20   0.000    -.0783026   -.0354537
  dumstate22 |    .053395   .0178014     3.00   0.003     .0185049    .0882851
  dumstate23 |   .0908271   .0115772     7.85   0.000     .0681362    .1135181
  dumstate24 |   .1325776   .0114128    11.62   0.000     .1102089    .1549462
  dumstate25 |   .0793621   .0105903     7.49   0.000     .0586054    .1001188
  dumstate26 |  -.0871489   .0131965    -6.60   0.000    -.1130136   -.0612842
  dumstate27 |  -.0504831   .0102982    -4.90   0.000    -.0706672   -.0302989
  dumstate28 |  -.0497019   .0116517    -4.27   0.000    -.0725389   -.0268649
  dumstate29 |    .018067   .0108674     1.66   0.096    -.0032327    .0393667
  dumstate30 |  -.0665215   .0101729    -6.54   0.000    -.0864601   -.0465829
  dumstate31 |  -.0784764   .0110574    -7.10   0.000    -.1001485   -.0568043
  dumstate32 |  -.1175345   .0108532   -10.83   0.000    -.1388063   -.0962627
  dumstate33 |  -.0583449   .0117227    -4.98   0.000     -.081321   -.0353688
  dumstate34 |  -.0630469   .0116576    -5.41   0.000    -.0858954   -.0401983
  dumstate35 |  -.1581021   .0112069   -14.11   0.000    -.1800673   -.1361369
  dumstate36 |   .0301568   .0124355     2.43   0.015     .0057835      .05453
  dumstate37 |  -.0812468   .0113079    -7.18   0.000    -.1034099   -.0590837
  dumstate38 |   .0174464   .0099401     1.76   0.079    -.0020358    .0369286
  dumstate39 |          0  (omitted)
  dumstate40 |  -.0676709   .0124757    -5.42   0.000    -.0921228   -.0432189
  dumstate41 |   .2205514   .0126659    17.41   0.000     .1957267    .2453761
  dumstate42 |   .0675208   .0116065     5.82   0.000     .0447725    .0902691
  dumstate43 |  -.0431893   .0144295    -2.99   0.003    -.0714707   -.0149079
  dumstate44 |  -.0058572   .0117961    -0.50   0.620    -.0289771    .0172628
  dumstate45 |  -.0265936   .0114675    -2.32   0.020    -.0490696   -.0041177
  dumstate46 |   .0467481   .0122325     3.82   0.000     .0227728    .0707235
  dumstate47 |   .0871776    .011633     7.49   0.000     .0643772    .1099779
  dumstate48 |  -.0115872   .0117627    -0.99   0.325    -.0346416    .0114673
  dumstate49 |   .1188624    .009898    12.01   0.000     .0994626    .1382622
  dumstate50 |   .2675754   .0128522    20.82   0.000     .2423856    .2927653
  dumstate51 |   .0813091   .0173197     4.69   0.000     .0473631     .115255
    dumyear1 |  -.0204019   .0083204    -2.45   0.014    -.0367096   -.0040943
    dumyear2 |   -.018352    .008445    -2.17   0.030    -.0349038   -.0018001
    dumyear3 |          0  (omitted)
    dumyear4 |   .0085445   .0085435     1.00   0.317    -.0082005    .0252895
    dumyear5 |   .0178853   .0085379     2.09   0.036     .0011512    .0346194
    dumyear6 |  -.0044746   .0087103    -0.51   0.607    -.0215465    .0125974
    dumyear7 |   .0312618   .0086355     3.62   0.000     .0143365    .0481871
    dumyear8 |  -.0358549   .0084947    -4.22   0.000    -.0525043   -.0192055
    dumyear9 |   -.038244   .0085727    -4.46   0.000    -.0550462   -.0214417
   dumyear10 |   -.025841   .0086711    -2.98   0.003     -.042836   -.0088459
   dumyear11 |  -.0601252   .0086911    -6.92   0.000    -.0771594    -.043091
   dumyear12 |  -.0748899   .0091681    -8.17   0.000    -.0928591   -.0569208
   dumyear13 |  -.0571479    .009105    -6.28   0.000    -.0749935   -.0393023
   dumyear14 |  -.0376264   .0091712    -4.10   0.000    -.0556017   -.0196511
   dumyear15 |   .0017497   .0095007     0.18   0.854    -.0168713    .0203707
   dumyear16 |   .0249381   .0096473     2.58   0.010     .0060298    .0438465
   dumyear17 |   .0312006   .0098198     3.18   0.001     .0119541     .050447
   dumyear18 |   .0244307   .0095359     2.56   0.010     .0057406    .0431208
   dumyear19 |   .0491889   .0099827     4.93   0.000     .0296233    .0687546
   dumyear20 |   .0443789   .0099133     4.48   0.000     .0249493    .0638086
   dumyear21 |   .0126809   .0096551     1.31   0.189    -.0062428    .0316046
   dumyear22 |   .0239246   .0095653     2.50   0.012     .0051768    .0426724
   dumyear23 |   .0229179   .0098369     2.33   0.020     .0036379     .042198
   dumyear24 |    .003558   .0097011     0.37   0.714    -.0154558    .0225718
   dumyear25 |   .0264323   .0097967     2.70   0.007      .007231    .0456336
   dumyear26 |   .0014715   .0101169     0.15   0.884    -.0183572    .0213003
   dumyear27 |  -.0309885   .0100335    -3.09   0.002    -.0506538   -.0113232
   dumyear28 |  -.0176047   .0100751    -1.75   0.081    -.0373516    .0021422
   dumyear29 |  -.0183139   .0102031    -1.79   0.073    -.0383116    .0016837
   dumyear30 |  -.0277577   .0099537    -2.79   0.005    -.0472667   -.0082488
   dumyear31 |  -.0096078   .0099054    -0.97   0.332    -.0290219    .0098064
   dumyear32 |  -.0009356   .0096263    -0.10   0.923    -.0198029    .0179317
   dumyear33 |   .0119968   .0099448     1.21   0.228    -.0074947    .0314883
   dumyear34 |   .0197593    .010129     1.95   0.051    -.0000931    .0396118
   dumyear35 |   .0179368   .0100786     1.78   0.075    -.0018169    .0376904
    dumnind1 |  -.1247395   .0114963   -10.85   0.000    -.1472719   -.1022071
    dumnind2 |  -.0341714   .0090775    -3.76   0.000    -.0519629   -.0163799
    dumnind3 |  -.0326241   .0086458    -3.77   0.000    -.0495695   -.0156787
    dumnind4 |  -.2091955   .0086343   -24.23   0.000    -.2261184   -.1922726
    dumnind5 |  -.0513709   .0088405    -5.81   0.000    -.0686979   -.0340439
    dumnind6 |  -.0575189   .0090984    -6.32   0.000    -.0753514   -.0396864
    dumnind7 |  -.1529944   .0085955   -17.80   0.000    -.1698413   -.1361474
    dumnind8 |  -.2453878   .0091757   -26.74   0.000    -.2633718   -.2274037
    dumnind9 |  -.2914586   .0081531   -35.75   0.000    -.3074385   -.2754788
   dumnind10 |  -.2507176   .0102212   -24.53   0.000    -.2707507   -.2306844
   dumnind11 |          0  (omitted)
        educ |   .0415684    .002365    17.58   0.000     .0369329    .0462038
       exper |   .0514782   .0018329    28.09   0.000     .0478858    .0550707
      exper2 |  -.0011378   .0001441    -7.90   0.000    -.0014202   -.0008554
      exper3 |   3.89e-06   5.11e-06     0.76   0.447    -6.13e-06    .0000139
      exper4 |   7.27e-08   5.72e-08     1.27   0.204    -3.94e-08    1.85e-07
        edex |  -.0003338   .0000875    -3.82   0.000    -.0005053   -.0001623
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |  -.0236949   .0065238    -3.63   0.000    -.0364812   -.0109086
   dumee_cl3 |   .0397629   .0088392     4.50   0.000     .0224384    .0570874
   dumee_cl4 |    .275337    .014228    19.35   0.000     .2474506    .3032234
   dumee_cl5 |  -.1624421   .0106379   -15.27   0.000    -.1832921   -.1415922
   dumee_cl6 |   .0049515   .0094835     0.52   0.602    -.0136359    .0235388
   dumee_cl7 |   .1281851   .0110516    11.60   0.000     .1065243    .1498459
   dumee_cl8 |   .2566124   .0140477    18.27   0.000     .2290794    .2841453
   dumee_cl9 |  -.1703995   .0156148   -10.91   0.000     -.201004   -.1397949
  dumee_cl10 |   .0330851   .0138665     2.39   0.017     .0059072    .0602631
  dumee_cl11 |   .1506521   .0143848    10.47   0.000     .1224584    .1788458
  dumee_cl12 |   .1941609   .0156677    12.39   0.000     .1634527    .2248692
  dumee_cl13 |  -.0898059   .0212826    -4.22   0.000    -.1315192   -.0480927
  dumee_cl14 |   .0597539   .0174925     3.42   0.001     .0254693    .0940386
  dumee_cl15 |   .1633345   .0172786     9.45   0.000      .129469       .1972
  dumee_cl16 |   .1885241    .017414    10.83   0.000     .1543932     .222655
        marr |   .1712441   .0027333    62.65   0.000      .165887    .1766013
      public |  -.0000129   .0060913    -0.00   0.998    -.0119516    .0119258
        cmsa |   .1725293   .0031965    53.97   0.000     .1662642    .1787943
   dumnocc31 |          0  (omitted)
   dumnocc32 |  -.2000182   .0034921   -57.28   0.000    -.2068627   -.1931737
   dumnocc33 |    -.38174   .0042868   -89.05   0.000     -.390142   -.3733381
   dumnocc34 |  -.2512702   .0034971   -71.85   0.000    -.2581244   -.2444161
 dumquarter1 |  -.0224464   .0032431    -6.92   0.000    -.0288027   -.0160901
 dumquarter2 |  -.0145292   .0032574    -4.46   0.000    -.0209136   -.0081447
 dumquarter3 |  -.0114774   .0032827    -3.50   0.000    -.0179113   -.0050435
 dumquarter4 |          0  (omitted)
       _cons |   .8034316   .0295919    27.15   0.000     .7454325    .8614306
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(1,520,652 real changes made)

      Source |       SS       df       MS              Number of obs =  239410
-------------+------------------------------           F(124,239285) =  321.21
       Model |  12344.2653   124  99.5505262           Prob > F      =  0.0000
    Residual |  55729.6317 239285  .232900649          R-squared     =  0.1813
-------------+------------------------------           Adj R-squared =  0.1809
       Total |   68073.897 239409  .284341428          Root MSE      =   .4826
------------------------------------------------------------------------------
             |               Robust
   rifwmu_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.1172293   .0205549    -5.70   0.000    -.1575164   -.0769422
   dumstate2 |  -.0589479   .0218912    -2.69   0.007    -.1018541   -.0160417
   dumstate3 |  -.1291476   .0203398    -6.35   0.000     -.169013   -.0892821
   dumstate4 |  -.0155073   .0202059    -0.77   0.443    -.0551103    .0240958
   dumstate5 |  -.0700886   .0205966    -3.40   0.001    -.1104574   -.0297198
   dumstate6 |     .03291   .0212439     1.55   0.121    -.0087275    .0745474
   dumstate7 |   .0556992   .0194959     2.86   0.004     .0174878    .0939105
   dumstate8 |   .1252268   .0203481     6.15   0.000     .0853451    .1651086
   dumstate9 |  -.0892384    .019487    -4.58   0.000    -.1274324   -.0510443
  dumstate10 |  -.1082579   .0194293    -5.57   0.000    -.1463387    -.070177
  dumstate11 |  -.0853009   .0199675    -4.27   0.000    -.1244367   -.0461651
  dumstate12 |   .0199864   .0196746     1.02   0.310    -.0185753    .0585481
  dumstate13 |  -.0422543    .019532    -2.16   0.031    -.0805366    -.003972
  dumstate14 |  -.1045399   .0197554    -5.29   0.000    -.1432599   -.0658198
  dumstate15 |  -.0429971   .0200357    -2.15   0.032    -.0822665   -.0037277
  dumstate16 |  -.1300715   .0197945    -6.57   0.000    -.1688682   -.0912747
  dumstate17 |  -.0771166   .0203627    -3.79   0.000    -.1170268   -.0372063
  dumstate18 |  -.1193235   .0217895    -5.48   0.000    -.1620304   -.0766167
  dumstate19 |  -.1148096   .0215262    -5.33   0.000    -.1570004   -.0726189
  dumstate20 |  -.1448136   .0205247    -7.06   0.000    -.1850414   -.1045857
  dumstate21 |  -.1036216   .0205675    -5.04   0.000    -.1439334   -.0633098
  dumstate22 |          0  (omitted)
  dumstate23 |   .0249391   .0217999     1.14   0.253    -.0177882    .0676663
  dumstate24 |   .2034003   .0273855     7.43   0.000     .1497255    .2570751
  dumstate25 |   .0204069   .0220269     0.93   0.354    -.0227652     .063579
  dumstate26 |  -.0713458    .020429    -3.49   0.000    -.1113862   -.0313055
  dumstate27 |  -.0897615    .021775    -4.12   0.000    -.1324399   -.0470832
  dumstate28 |  -.1459988   .0257792    -5.66   0.000    -.1965254   -.0954722
  dumstate29 |  -.0788836   .0223706    -3.53   0.000    -.1227295   -.0350377
  dumstate30 |  -.0911392   .0206576    -4.41   0.000    -.1316275   -.0506508
  dumstate31 |  -.1033782   .0202202    -5.11   0.000    -.1430092   -.0637471
  dumstate32 |  -.1168269   .0208213    -5.61   0.000    -.1576362   -.0760176
  dumstate33 |  -.1008455    .021293    -4.74   0.000    -.1425793   -.0591117
  dumstate34 |   -.106823   .0226967    -4.71   0.000    -.1513079   -.0623382
  dumstate35 |  -.0859101   .0218229    -3.94   0.000    -.1286823   -.0431378
  dumstate36 |   -.081039   .0241012    -3.36   0.001    -.1282767   -.0338012
  dumstate37 |  -.1057146   .0212002    -4.99   0.000    -.1472664   -.0641628
  dumstate38 |    -.07068   .0204705    -3.45   0.001    -.1108016   -.0305584
  dumstate39 |  -.1232291   .0203259    -6.06   0.000    -.1630673   -.0833909
  dumstate40 |  -.1226532   .0211227    -5.81   0.000     -.164053   -.0812533
  dumstate41 |   .0863747   .0237867     3.63   0.000     .0397535     .132996
  dumstate42 |  -.0726874   .0217951    -3.34   0.001    -.1154053   -.0299695
  dumstate43 |  -.1194493   .0261137    -4.57   0.000    -.1706314   -.0682671
  dumstate44 |  -.0661114   .0236905    -2.79   0.005    -.1125441   -.0196787
  dumstate45 |  -.1488324   .0216704    -6.87   0.000    -.1913059   -.1063589
  dumstate46 |  -.0300397   .0217721    -1.38   0.168    -.0727125    .0126331
  dumstate47 |   .0093428   .0204379     0.46   0.648     -.030715    .0494007
  dumstate48 |  -.0816705   .0204082    -4.00   0.000    -.1216701   -.0416709
  dumstate49 |   .1270724   .0196918     6.45   0.000      .088477    .1656678
  dumstate50 |   .3184366   .0214014    14.88   0.000     .2764904    .3603828
  dumstate51 |   .0041379   .0249303     0.17   0.868    -.0447249    .0530006
    dumyear1 |  -.0907583   .0113361    -8.01   0.000    -.1129767   -.0685398
    dumyear2 |  -.1095802   .0113184    -9.68   0.000     -.131764   -.0873965
    dumyear3 |  -.0966491   .0116654    -8.29   0.000    -.1195129   -.0737852
    dumyear4 |  -.0893428   .0115025    -7.77   0.000    -.1118874   -.0667983
    dumyear5 |  -.0852796   .0115548    -7.38   0.000    -.1079267   -.0626325
    dumyear6 |  -.0888152   .0117428    -7.56   0.000    -.1118309   -.0657996
    dumyear7 |   -.079373   .0117629    -6.75   0.000    -.1024279    -.056318
    dumyear8 |  -.0911808   .0115665    -7.88   0.000    -.1138509   -.0685106
    dumyear9 |  -.0863339   .0116751    -7.39   0.000    -.1092167   -.0634511
   dumyear10 |  -.1098956    .011595    -9.48   0.000    -.1326214   -.0871698
   dumyear11 |  -.0951521     .01169    -8.14   0.000    -.1180641   -.0722401
   dumyear12 |  -.0534725    .012598    -4.24   0.000    -.0781641   -.0287808
   dumyear13 |   -.061566   .0125269    -4.91   0.000    -.0861184   -.0370136
   dumyear14 |  -.0547294   .0126635    -4.32   0.000    -.0795495   -.0299092
   dumyear15 |  -.0407011   .0129354    -3.15   0.002    -.0660541   -.0153481
   dumyear16 |  -.0494675    .013067    -3.79   0.000    -.0750785   -.0238565
   dumyear17 |  -.0443933   .0132834    -3.34   0.001    -.0704284   -.0183582
   dumyear18 |  -.0268463   .0131836    -2.04   0.042    -.0526858   -.0010067
   dumyear19 |  -.0133796   .0136083    -0.98   0.326    -.0400516    .0132924
   dumyear20 |  -.0152224   .0135955    -1.12   0.263    -.0418692    .0114244
   dumyear21 |  -.0052549   .0138363    -0.38   0.704    -.0323736    .0218638
   dumyear22 |  -.0241921   .0137315    -1.76   0.078    -.0511055    .0027213
   dumyear23 |   -.022472   .0137853    -1.63   0.103    -.0494908    .0045468
   dumyear24 |  -.0255214    .013844    -1.84   0.065    -.0526552    .0016125
   dumyear25 |    -.01664   .0139831    -1.19   0.234    -.0440465    .0107664
   dumyear26 |  -.0027642   .0142377    -0.19   0.846    -.0306698    .0251414
   dumyear27 |   .0010771    .014483     0.07   0.941    -.0273092    .0294634
   dumyear28 |  -.0110645   .0145908    -0.76   0.448     -.039662    .0175331
   dumyear29 |  -.0242742   .0145489    -1.67   0.095    -.0527896    .0042413
   dumyear30 |  -.0070398   .0148353    -0.47   0.635    -.0361166     .022037
   dumyear31 |          0  (omitted)
   dumyear32 |   .0113896   .0151096     0.75   0.451    -.0182249    .0410041
   dumyear33 |   .0399151   .0153411     2.60   0.009     .0098469    .0699833
   dumyear34 |     .02819   .0152751     1.85   0.065    -.0017487    .0581288
   dumyear35 |   .0357492   .0158898     2.25   0.024     .0046056    .0668928
    dumnind1 |  -.0453675    .015475    -2.93   0.003    -.0756982   -.0150369
    dumnind2 |   .1897047   .0136041    13.94   0.000      .163041    .2163684
    dumnind3 |  -.0749958   .0131893    -5.69   0.000    -.1008465   -.0491451
    dumnind4 |  -.1543946   .0133158   -11.59   0.000    -.1804932    -.128296
    dumnind5 |   .0161356   .0132391     1.22   0.223    -.0098127     .042084
    dumnind6 |          0  (omitted)
    dumnind7 |   -.024285   .0149921    -1.62   0.105    -.0536691    .0050991
    dumnind8 |  -.1241288   .0147872    -8.39   0.000    -.1531112   -.0951464
    dumnind9 |   -.134776   .0137781    -9.78   0.000    -.1617808   -.1077712
   dumnind10 |  -.0794641   .0160867    -4.94   0.000    -.1109936   -.0479347
   dumnind11 |   .0943866   .0137692     6.85   0.000     .0673993     .121374
        educ |   .0501631   .0032184    15.59   0.000     .0438552     .056471
       exper |   .0060762   .0022759     2.67   0.008     .0016156    .0105369
      exper2 |   .0008551   .0001596     5.36   0.000     .0005423    .0011679
      exper3 |  -.0000371   5.37e-06    -6.91   0.000    -.0000476   -.0000266
      exper4 |   4.01e-07   5.83e-08     6.87   0.000     2.87e-07    5.15e-07
        edex |  -1.11e-06   .0001002    -0.01   0.991    -.0001974    .0001952
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |  -.0881867   .0084976   -10.38   0.000    -.1048417   -.0715316
   dumee_cl3 |  -.1572107   .0116555   -13.49   0.000    -.1800552   -.1343662
   dumee_cl4 |  -.2429942   .0188043   -12.92   0.000    -.2798501   -.2061384
   dumee_cl5 |  -.0892686    .011143    -8.01   0.000    -.1111087   -.0674286
   dumee_cl6 |  -.1297259   .0103592   -12.52   0.000    -.1500298   -.1094221
   dumee_cl7 |  -.1498547    .012603   -11.89   0.000    -.1745563   -.1251531
   dumee_cl8 |  -.1467219   .0178635    -8.21   0.000    -.1817338     -.11171
   dumee_cl9 |  -.1371003   .0141845    -9.67   0.000    -.1649015   -.1092991
  dumee_cl10 |  -.1694585   .0135221   -12.53   0.000    -.1959614   -.1429556
  dumee_cl11 |  -.1582941    .014791   -10.70   0.000     -.187284   -.1293041
  dumee_cl12 |  -.0803097   .0183147    -4.38   0.000     -.116206   -.0444134
  dumee_cl13 |  -.0994966   .0177984    -5.59   0.000    -.1343809   -.0646123
  dumee_cl14 |  -.1740017   .0160012   -10.87   0.000    -.2053637   -.1426398
  dumee_cl15 |  -.1564333    .016704    -9.37   0.000    -.1891726   -.1236939
  dumee_cl16 |  -.0802824   .0192482    -4.17   0.000    -.1180083   -.0425566
        marr |   .0501745   .0027464    18.27   0.000     .0447916    .0555574
      public |   -.126632   .0040454   -31.30   0.000    -.1345609   -.1187031
        cmsa |   .0962567   .0025767    37.36   0.000     .0912064     .101307
   dumnocc31 |   .2237348   .0054406    41.12   0.000     .2130714    .2343981
   dumnocc32 |          0  (omitted)
   dumnocc33 |   .0758821   .0051416    14.76   0.000     .0658046    .0859596
   dumnocc34 |   .0777215   .0038048    20.43   0.000     .0702642    .0851789
 dumquarter1 |  -.0053305   .0032381    -1.65   0.100    -.0116771    .0010161
 dumquarter2 |  -.0031092   .0032764    -0.95   0.343    -.0095307    .0033124
 dumquarter3 |          0  (omitted)
 dumquarter4 |   .0110561   .0033033     3.35   0.001     .0045817    .0175305
       _cons |   1.548018   .0437157    35.41   0.000     1.462337      1.6337
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate41 dropped because of collinearity
note: dumyear34 dropped because of collinearity
note: dumnind1 dropped because of collinearity
note: dumee_cl4 dropped because of collinearity
note: dumnocc31 dropped because of collinearity
note: dumquarter4 dropped because of collinearity
(1,728,357 real changes made)

      Source |       SS       df       MS              Number of obs =   31705
-------------+------------------------------           F(124, 31580) =   40.06
       Model |  1248.17163   124  10.0659003           Prob > F      =  0.0000
    Residual |  6556.54866 31580   .20761712           R-squared     =  0.1599
-------------+------------------------------           Adj R-squared =  0.1566
       Total |   7804.7203 31704  .246174625           Root MSE      =  .45565
------------------------------------------------------------------------------
             |               Robust
   rifbmu_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |   .1526092   .2677029     0.57   0.569    -.3720989    .6773174
   dumstate2 |   .2653698   .2315359     1.15   0.252    -.1884496    .7191891
   dumstate3 |   -.116899    .206193    -0.57   0.571    -.5210452    .2872473
   dumstate4 |   .0710084   .1772559     0.40   0.689    -.2764201    .4184369
   dumstate5 |  -.0323435   .1783103    -0.18   0.856    -.3818387    .3171517
   dumstate6 |   .0578346   .1758068     0.33   0.742    -.2867536    .4024227
   dumstate7 |   .0553893     .17428     0.32   0.751    -.2862063    .3969849
   dumstate8 |   .0584866   .1746878     0.33   0.738    -.2839083    .4008815
   dumstate9 |  -.0177814   .1746587    -0.10   0.919    -.3601192    .3245564
  dumstate10 |  -.0008634   .1744768    -0.00   0.996    -.3428447    .3411179
  dumstate11 |  -.0302953   .1755557    -0.17   0.863    -.3743913    .3138008
  dumstate12 |   .0159171   .1743308     0.09   0.927     -.325778    .3576122
  dumstate13 |   .0927538   .1744707     0.53   0.595    -.2492156    .4347232
  dumstate14 |  -.0291058   .1761942    -0.17   0.869    -.3744533    .3162417
  dumstate15 |    .029093   .1770151     0.16   0.869    -.3178636    .3760496
  dumstate16 |   .0366601   .1936298     0.19   0.850    -.3428618    .4161821
  dumstate17 |  -.0061126   .1751471    -0.03   0.972    -.3494078    .3371826
  dumstate18 |    .278905   .2188748     1.27   0.203    -.1500983    .7079082
  dumstate19 |  -.1563733    .177281    -0.88   0.378    -.5038509    .1911044
  dumstate20 |  -.0484813    .177511    -0.27   0.785    -.3964098    .2994473
  dumstate21 |  -.0323589   .1763241    -0.18   0.854    -.3779611    .3132434
  dumstate22 |   -.077454   .1757073    -0.44   0.659    -.4218472    .2669392
  dumstate23 |   .0614905   .1745983     0.35   0.725     -.280729    .4037101
  dumstate24 |   .0399073   .1743817     0.23   0.819    -.3018876    .3817021
  dumstate25 |   .0065563   .1747282     0.04   0.970    -.3359179    .3490305
  dumstate26 |   .0712121   .1883314     0.38   0.705    -.2979248    .4403491
  dumstate27 |  -.0532603    .174654    -0.30   0.760     -.395589    .2890683
  dumstate28 |  -.1514185   .1753951    -0.86   0.388    -.4951997    .1923628
  dumstate29 |  -.0441949   .1745479    -0.25   0.800    -.3863155    .2979258
  dumstate30 |  -.0788776   .1743138    -0.45   0.651    -.4205394    .2627842
  dumstate31 |  -.0956057   .1750602    -0.55   0.585    -.4387305    .2475191
  dumstate32 |   -.082147   .1748286    -0.47   0.638     -.424818    .2605239
  dumstate33 |  -.0945965   .1743502    -0.54   0.587    -.4363298    .2471367
  dumstate34 |   -.127556   .1742667    -0.73   0.464    -.4691256    .2140135
  dumstate35 |  -.1257999   .1745843    -0.72   0.471    -.4679918    .2163921
  dumstate36 |  -.0660317   .1749532    -0.38   0.706    -.4089468    .2768834
  dumstate37 |  -.1479479   .1760755    -0.84   0.401    -.4930628     .197167
  dumstate38 |  -.0162599    .174605    -0.09   0.926    -.3584925    .3259727
  dumstate39 |  -.2786741   .1881017    -1.48   0.138    -.6473608    .0900127
  dumstate40 |  -.2736131   .1796141    -1.52   0.128    -.6256637    .0784375
  dumstate41 |          0  (omitted)
  dumstate42 |  -.0255343   .1765806    -0.14   0.885    -.3716393    .3205706
  dumstate43 |  -.0139966   .2155522    -0.06   0.948    -.4364872    .4084941
  dumstate44 |    .010359   .1829928     0.06   0.955    -.3483142    .3690321
  dumstate45 |  -.1682206   .1932822    -0.87   0.384    -.5470613    .2106201
  dumstate46 |  -.0295375   .1753143    -0.17   0.866    -.3731603    .3140854
  dumstate47 |   .0486922   .1771473     0.27   0.783    -.2985234    .3959079
  dumstate48 |  -.0073152   .1817575    -0.04   0.968    -.3635671    .3489366
  dumstate49 |   .1361271   .1744256     0.78   0.435    -.2057539    .4780082
  dumstate50 |   .2267361   .1800957     1.26   0.208    -.1262586    .5797307
  dumstate51 |   .0381125   .1945377     0.20   0.845    -.3431891     .419414
    dumyear1 |  -.0925576   .0261481    -3.54   0.000    -.1438088   -.0413063
    dumyear2 |  -.0970062   .0263549    -3.68   0.000    -.1486629   -.0453496
    dumyear3 |  -.0667493   .0278104    -2.40   0.016    -.1212588   -.0122399
    dumyear4 |  -.0383231   .0270477    -1.42   0.157    -.0913376    .0146914
    dumyear5 |   -.056085   .0268662    -2.09   0.037    -.1087437   -.0034262
    dumyear6 |  -.0391686   .0276949    -1.41   0.157    -.0934517    .0151145
    dumyear7 |  -.0525484   .0273822    -1.92   0.055    -.1062185    .0011218
    dumyear8 |  -.0934888    .026634    -3.51   0.000    -.1456924   -.0412851
    dumyear9 |  -.0740275    .027354    -2.71   0.007    -.1276425   -.0204126
   dumyear10 |  -.0775857    .027349    -2.84   0.005     -.131191   -.0239805
   dumyear11 |  -.0534094   .0273523    -1.95   0.051    -.1070209    .0002022
   dumyear12 |   -.073522   .0290879    -2.53   0.011    -.1305354   -.0165086
   dumyear13 |  -.0493691   .0299217    -1.65   0.099    -.1080168    .0092786
   dumyear14 |  -.0455262   .0290672    -1.57   0.117    -.1024991    .0114467
   dumyear15 |   .0059219   .0310275     0.19   0.849    -.0548932    .0667371
   dumyear16 |  -.0105028   .0308223    -0.34   0.733    -.0709157    .0499101
   dumyear17 |  -.0137394   .0317338    -0.43   0.665     -.075939    .0484602
   dumyear18 |  -.0062775   .0314275    -0.20   0.842    -.0678766    .0553215
   dumyear19 |   .0084291   .0327355     0.26   0.797    -.0557337    .0725919
   dumyear20 |   .0247006   .0352612     0.70   0.484    -.0444128     .093814
   dumyear21 |  -.0028501   .0340127    -0.08   0.933    -.0695163     .063816
   dumyear22 |   .0085755    .034207     0.25   0.802    -.0584716    .0756227
   dumyear23 |   .0082602   .0332718     0.25   0.804    -.0569539    .0734743
   dumyear24 |  -.0399485   .0333344    -1.20   0.231    -.1052853    .0253883
   dumyear25 |   .0076048    .034008     0.22   0.823    -.0590522    .0742618
   dumyear26 |   .0418194   .0342827     1.22   0.223    -.0253761    .1090149
   dumyear27 |  -.0133937   .0357043    -0.38   0.708    -.0833755     .056588
   dumyear28 |          0  (omitted)
   dumyear29 |   -.044094   .0342139    -1.29   0.197    -.1111546    .0229666
   dumyear30 |   -.029085   .0342041    -0.85   0.395    -.0961262    .0379563
   dumyear31 |  -.0168359    .035065    -0.48   0.631    -.0855647     .051893
   dumyear32 |  -.0469282   .0349773    -1.34   0.180     -.115485    .0216287
   dumyear33 |  -.0167176   .0347207    -0.48   0.630    -.0847715    .0513363
   dumyear34 |  -.0371357   .0357299    -1.04   0.299    -.1071677    .0328962
   dumyear35 |   .0157568   .0387826     0.41   0.685    -.0602585    .0917722
    dumnind1 |          0  (omitted)
    dumnind2 |    .091322    .039301     2.32   0.020     .0142905    .1683535
    dumnind3 |   -.066112   .0370923    -1.78   0.075    -.1388144    .0065905
    dumnind4 |  -.1474437   .0376409    -3.92   0.000    -.2212212   -.0736661
    dumnind5 |   .0118773   .0376221     0.32   0.752    -.0618634    .0856181
    dumnind6 |  -.1346763   .0422547    -3.19   0.001    -.2174972   -.0518554
    dumnind7 |  -.1293048   .0391256    -3.30   0.001    -.2059926   -.0526171
    dumnind8 |  -.2000565   .0387345    -5.16   0.000    -.2759777   -.1241353
    dumnind9 |  -.1276477   .0393346    -3.25   0.001    -.2047452   -.0505503
   dumnind10 |  -.1512995   .0410585    -3.68   0.000    -.2317758   -.0708233
   dumnind11 |   .0755024   .0394111     1.92   0.055    -.0017449    .1527498
        educ |    .052914   .0082756     6.39   0.000     .0366936    .0691344
       exper |   .0120784   .0055569     2.17   0.030     .0011866    .0229702
      exper2 |   .0008521   .0003769     2.26   0.024     .0001133    .0015909
      exper3 |  -.0000296    .000012    -2.46   0.014    -.0000532   -6.01e-06
      exper4 |   2.69e-07   1.26e-07     2.14   0.032     2.25e-08    5.16e-07
        edex |  -.0007676   .0002356    -3.26   0.001    -.0012293   -.0003059
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |  -.0617997   .0173215    -3.57   0.000    -.0957505   -.0278489
   dumee_cl3 |  -.1195719   .0268252    -4.46   0.000    -.1721504   -.0669934
   dumee_cl4 |  -.1461248    .047353    -3.09   0.002    -.2389385   -.0533111
   dumee_cl5 |  -.1045424   .0211659    -4.94   0.000    -.1460285   -.0630563
   dumee_cl6 |  -.1173854   .0224052    -5.24   0.000    -.1613005   -.0734702
   dumee_cl7 |  -.1046095   .0284675    -3.67   0.000     -.160407    -.048812
   dumee_cl8 |  -.0745942   .0430225    -1.73   0.083      -.15892    .0097316
   dumee_cl9 |  -.1371063    .031816    -4.31   0.000    -.1994669   -.0747458
  dumee_cl10 |  -.1666064   .0310533    -5.37   0.000     -.227472   -.1057408
  dumee_cl11 |  -.0919745   .0347455    -2.65   0.008     -.160077   -.0238721
  dumee_cl12 |   .0023801    .044143     0.05   0.957    -.0841419    .0889021
  dumee_cl13 |  -.1861642   .0399599    -4.66   0.000    -.2644871   -.1078413
  dumee_cl14 |  -.1705887   .0385249    -4.43   0.000     -.246099   -.0950784
  dumee_cl15 |  -.0851909   .0405785    -2.10   0.036    -.1647263   -.0056556
  dumee_cl16 |   .0288103   .0472969     0.61   0.542    -.0638935    .1215141
        marr |    .039323   .0064484     6.10   0.000     .0266838    .0519621
      public |  -.0400685   .0091155    -4.40   0.000    -.0579352   -.0222018
        cmsa |   .0267134    .010026     2.66   0.008      .007062    .0463648
   dumnocc31 |    .215738     .01346    16.03   0.000     .1893558    .2421201
   dumnocc32 |          0  (omitted)
   dumnocc33 |   .0661677   .0104723     6.32   0.000     .0456416    .0866939
   dumnocc34 |   .0897573   .0091921     9.76   0.000     .0717404    .1077742
 dumquarter1 |  -.0077843   .0084601    -0.92   0.358    -.0243664    .0087977
 dumquarter2 |  -.0093683   .0084665    -1.11   0.269    -.0259629    .0072263
 dumquarter3 |          0  (omitted)
 dumquarter4 |   .0014425   .0084884     0.17   0.865    -.0151951      .01808
       _cons |   1.401199   .1974756     7.10   0.000      1.01414    1.788259
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc32 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(1,520,652 real changes made)

      Source |       SS       df       MS              Number of obs =  239410
-------------+------------------------------           F(124,239285) =  220.39
       Model |   11726.036   124  94.5648067           Prob > F      =  0.0000
    Residual |  54124.5744 239285  .226192927          R-squared     =  0.1781
-------------+------------------------------           Adj R-squared =  0.1776
       Total |  65850.6105 239409  .275054866          Root MSE      =   .4756
------------------------------------------------------------------------------
             |               Robust
  rifwmcu_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |   .0132164   .0168786     0.78   0.434    -.0198652    .0462981
   dumstate2 |   .0661071   .0177837     3.72   0.000     .0312514    .1009627
   dumstate3 |  -.0051702    .011313    -0.46   0.648    -.0273435     .017003
   dumstate4 |   .0526877   .0103773     5.08   0.000     .0323484    .0730269
   dumstate5 |   .0126243   .0110521     1.14   0.253    -.0090375     .034286
   dumstate6 |   .1026177    .013077     7.85   0.000     .0769872    .1282483
   dumstate7 |   .1305843    .009377    13.93   0.000     .1122057    .1489629
   dumstate8 |   .1844177   .0112412    16.41   0.000     .1623852    .2064502
   dumstate9 |  -.0026192   .0093666    -0.28   0.780    -.0209775    .0157391
  dumstate10 |   -.020111   .0092699    -2.17   0.030    -.0382798   -.0019422
  dumstate11 |   .0063735   .0110742     0.58   0.565    -.0153317    .0280787
  dumstate12 |   .0923892   .0098566     9.37   0.000     .0730705    .1117079
  dumstate13 |   .0504288   .0095004     5.31   0.000     .0318083    .0690494
  dumstate14 |  -.0145314   .0101461    -1.43   0.152    -.0344175    .0053547
  dumstate15 |   .0581093   .0109982     5.28   0.000      .036553    .0796655
  dumstate16 |  -.0377303   .0109081    -3.46   0.001    -.0591098   -.0163507
  dumstate17 |   .0186099   .0115366     1.61   0.107    -.0040014    .0412212
  dumstate18 |   .0067555    .014792     0.46   0.648    -.0222364    .0357474
  dumstate19 |  -.0057095   .0156233    -0.37   0.715    -.0363308    .0249118
  dumstate20 |  -.0340344   .0127903    -2.66   0.008     -.059103   -.0089658
  dumstate21 |   .0104317   .0129332     0.81   0.420    -.0149171    .0357805
  dumstate22 |   .0609368   .0183786     3.32   0.001     .0249153    .0969584
  dumstate23 |   .1018116    .013876     7.34   0.000     .0746151    .1290082
  dumstate24 |   .2485616    .023697    10.49   0.000      .202116    .2950072
  dumstate25 |   .1019581   .0145647     7.00   0.000     .0734117    .1305045
  dumstate26 |   .0042426   .0133127     0.32   0.750    -.0218499    .0303351
  dumstate27 |  -.0028378   .0145577    -0.19   0.845    -.0313706    .0256949
  dumstate28 |  -.0804065   .0225527    -3.57   0.000    -.1246092   -.0362039
  dumstate29 |   .0292303   .0155429     1.88   0.060    -.0012333    .0596939
  dumstate30 |   .0130939   .0120581     1.09   0.278    -.0105396    .0367275
  dumstate31 |  -.0308592   .0110121    -2.80   0.005    -.0524427   -.0092757
  dumstate32 |  -.0341782   .0124177    -2.75   0.006    -.0585166   -.0098399
  dumstate33 |  -.0160132   .0141895    -1.13   0.259    -.0438241    .0117978
  dumstate34 |  -.0500699   .0156093    -3.21   0.001    -.0806637   -.0194761
  dumstate35 |  -.0165823   .0146142    -1.13   0.257    -.0452259    .0120612
  dumstate36 |    .028781   .0201745     1.43   0.154    -.0107605    .0683225
  dumstate37 |  -.0252332   .0139336    -1.81   0.070    -.0525428    .0020763
  dumstate38 |   .0309023   .0117668     2.63   0.009     .0078397     .053965
  dumstate39 |          0  (omitted)
  dumstate40 |  -.0465672   .0153265    -3.04   0.002    -.0766068   -.0165276
  dumstate41 |   .1711656   .0172884     9.90   0.000     .1372808    .2050505
  dumstate42 |   .0267222   .0146708     1.82   0.069    -.0020322    .0554767
  dumstate43 |   -.030453   .0277929    -1.10   0.273    -.0849264    .0240205
  dumstate44 |   .0333618   .0180506     1.85   0.065    -.0020168    .0687405
  dumstate45 |  -.0218882   .0150711    -1.45   0.146    -.0514271    .0076508
  dumstate46 |   .0682181   .0138939     4.91   0.000     .0409864    .0954499
  dumstate47 |   .0957266   .0115392     8.30   0.000       .07311    .1183432
  dumstate48 |   .0159511   .0117928     1.35   0.176    -.0071625    .0390647
  dumstate49 |   .1985336   .0098943    20.07   0.000     .1791411    .2179261
  dumstate50 |    .363899   .0150359    24.20   0.000      .334429     .393369
  dumstate51 |   .0879064   .0204259     4.30   0.000     .0478722    .1279405
    dumyear1 |  -.1382572   .0163643    -8.45   0.000    -.1703308   -.1061837
    dumyear2 |  -.1350776   .0163665    -8.25   0.000    -.1671556   -.1029997
    dumyear3 |  -.1454677   .0167359    -8.69   0.000    -.1782696   -.1126658
    dumyear4 |  -.1200871   .0166036    -7.23   0.000    -.1526297   -.0875446
    dumyear5 |   -.112292   .0167833    -6.69   0.000    -.1451869   -.0793972
    dumyear6 |  -.1177287   .0169872    -6.93   0.000    -.1510232   -.0844341
    dumyear7 |  -.0956348   .0170388    -5.61   0.000    -.1290304   -.0622392
    dumyear8 |  -.1271369   .0167091    -7.61   0.000    -.1598864   -.0943874
    dumyear9 |  -.1312135   .0168357    -7.79   0.000    -.1642111   -.0982159
   dumyear10 |  -.1178495   .0169443    -6.96   0.000    -.1510599   -.0846392
   dumyear11 |  -.1324417   .0168546    -7.86   0.000    -.1654763   -.0994071
   dumyear12 |  -.0853523   .0186782    -4.57   0.000     -.121961   -.0487435
   dumyear13 |  -.0952588   .0180215    -5.29   0.000    -.1305806   -.0599371
   dumyear14 |  -.0770771   .0186221    -4.14   0.000    -.1135759   -.0405782
   dumyear15 |   -.056493   .0190507    -2.97   0.003    -.0938318   -.0191542
   dumyear16 |   -.071188   .0188132    -3.78   0.000    -.1080615   -.0343146
   dumyear17 |  -.0635701   .0204654    -3.11   0.002    -.1036818   -.0234583
   dumyear18 |  -.0575199   .0191108    -3.01   0.003    -.0949767   -.0200632
   dumyear19 |  -.0354332   .0196029    -1.81   0.071    -.0738544     .002988
   dumyear20 |  -.0258497   .0200897    -1.29   0.198    -.0652249    .0135255
   dumyear21 |  -.0118344   .0204965    -0.58   0.564    -.0520071    .0283383
   dumyear22 |   -.029591    .020031    -1.48   0.140    -.0688512    .0096692
   dumyear23 |   -.026793   .0203894    -1.31   0.189    -.0667558    .0131697
   dumyear24 |  -.0443361    .020031    -2.21   0.027    -.0835963   -.0050759
   dumyear25 |  -.0306674    .020819    -1.47   0.141    -.0714722    .0101373
   dumyear26 |  -.0249249   .0203612    -1.22   0.221    -.0648323    .0149824
   dumyear27 |  -.0341756   .0203813    -1.68   0.094    -.0741224    .0057712
   dumyear28 |  -.0229293   .0218337    -1.05   0.294    -.0657227    .0198641
   dumyear29 |  -.0418614   .0205011    -2.04   0.041    -.0820432   -.0016797
   dumyear30 |  -.0215317   .0213813    -1.01   0.314    -.0634385    .0203752
   dumyear31 |  -.0199683   .0213037    -0.94   0.349    -.0617229    .0217863
   dumyear32 |  -.0285641   .0206795    -1.38   0.167    -.0690955    .0119672
   dumyear33 |   .0024125   .0219648     0.11   0.913     -.040638     .045463
   dumyear34 |   .0005184   .0217239     0.02   0.981    -.0420599    .0430968
   dumyear35 |          0  (omitted)
    dumnind1 |  -.0852498   .0234966    -3.63   0.000    -.1313024   -.0391971
    dumnind2 |   .1561254   .0162977     9.58   0.000     .1241824    .1880684
    dumnind3 |  -.0873664   .0156907    -5.57   0.000    -.1181198    -.056613
    dumnind4 |  -.1638338   .0158263   -10.35   0.000    -.1948529   -.1328147
    dumnind5 |   .0060424    .015761     0.38   0.701    -.0248487    .0369334
    dumnind6 |          0  (omitted)
    dumnind7 |  -.0327077   .0180917    -1.81   0.071    -.0681669    .0027516
    dumnind8 |  -.1546908    .017655    -8.76   0.000    -.1892943   -.1200874
    dumnind9 |   -.157057   .0163908    -9.58   0.000    -.1891826   -.1249315
   dumnind10 |  -.1132969   .0180178    -6.29   0.000    -.1486114   -.0779824
   dumnind11 |   .1223328   .0165326     7.40   0.000     .0899293    .1547362
        educ |   .0503549   .0048133    10.46   0.000     .0409209    .0597889
       exper |   .0128145   .0031793     4.03   0.000      .006583    .0190459
      exper2 |   .0007333    .000204     3.59   0.000     .0003334    .0011333
      exper3 |   -.000033   6.66e-06    -4.95   0.000     -.000046   -.0000199
      exper4 |   3.54e-07   7.12e-08     4.97   0.000     2.14e-07    4.93e-07
        edex |  -.0004803   .0001494    -3.21   0.001    -.0007732   -.0001874
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |  -.0867144   .0101997    -8.50   0.000    -.1067055   -.0667234
   dumee_cl3 |   -.136073   .0158873    -8.56   0.000    -.1672117   -.1049343
   dumee_cl4 |  -.2069052   .0278166    -7.44   0.000     -.261425   -.1523853
   dumee_cl5 |   -.095278   .0146465    -6.51   0.000    -.1239849   -.0665712
   dumee_cl6 |  -.1317829   .0125156   -10.53   0.000    -.1563131   -.1072527
   dumee_cl7 |  -.1121526   .0164267    -6.83   0.000    -.1443486   -.0799566
   dumee_cl8 |  -.0475343   .0254145    -1.87   0.061    -.0973461    .0022774
   dumee_cl9 |  -.1512748   .0185349    -8.16   0.000    -.1876028   -.1149468
  dumee_cl10 |  -.1467616   .0175625    -8.36   0.000    -.1811835   -.1123396
  dumee_cl11 |  -.1070135   .0196806    -5.44   0.000     -.145587     -.06844
  dumee_cl12 |   .0193394   .0250652     0.77   0.440    -.0297877    .0684664
  dumee_cl13 |  -.1341467    .024225    -5.54   0.000    -.1816271   -.0866663
  dumee_cl14 |  -.1390097   .0217248    -6.40   0.000    -.1815896   -.0964297
  dumee_cl15 |  -.0977387   .0226272    -4.32   0.000    -.1420874   -.0533899
  dumee_cl16 |   .0356571   .0265718     1.34   0.180    -.0164229    .0877371
        marr |   .0553836   .0037498    14.77   0.000     .0480341    .0627331
      public |   -.098001    .005808   -16.87   0.000    -.1093846   -.0866174
        cmsa |   .0726957   .0036118    20.13   0.000     .0656167    .0797747
   dumnocc31 |          0  (omitted)
   dumnocc32 |  -.2470499   .0079388   -31.12   0.000    -.2626097     -.23149
   dumnocc33 |  -.1977627   .0070786   -27.94   0.000    -.2116366   -.1838888
   dumnocc34 |  -.1439213   .0071267   -20.19   0.000    -.1578895    -.129953
 dumquarter1 |  -.0069262   .0045307    -1.53   0.126    -.0158063    .0019539
 dumquarter2 |  -.0012557   .0045815    -0.27   0.784    -.0102354    .0077239
 dumquarter3 |          0  (omitted)
 dumquarter4 |    .011258   .0046208     2.44   0.015     .0022014    .0203146
       _cons |   1.715839   .0575025    29.84   0.000     1.603136    1.828543
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc33 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(746,827 real changes made)

      Source |       SS       df       MS              Number of obs = 1013235
-------------+------------------------------           F(124,1013110) = 2268.19
       Model |  250589.032   124  2020.87929           Prob > F      =  0.0000
    Residual |   582841.15 1013110  .575298981         R-squared     =  0.3007
-------------+------------------------------           Adj R-squared =  0.3006
       Total |  833430.182 1013234  .822544627         Root MSE      =  .75848
------------------------------------------------------------------------------
             |               Robust
   rifwmn_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.0470623   .0128659    -3.66   0.000    -.0722791   -.0218455
   dumstate2 |   .0365005   .0131832     2.77   0.006     .0106619    .0623391
   dumstate3 |   -.032887   .0124626    -2.64   0.008    -.0573133   -.0084608
   dumstate4 |   .1091188   .0129047     8.46   0.000     .0838261    .1344114
   dumstate5 |  -.0571579   .0133384    -4.29   0.000    -.0833008   -.0310151
   dumstate6 |   .1091678   .0139715     7.81   0.000     .0817841    .1365515
   dumstate7 |   .0906372    .012291     7.37   0.000     .0665471    .1147272
   dumstate8 |   .2111379   .0132717    15.91   0.000     .1851257    .2371501
   dumstate9 |  -.0217545   .0121487    -1.79   0.073    -.0455655    .0020565
  dumstate10 |  -.0610549   .0120261    -5.08   0.000    -.0846256   -.0374841
  dumstate11 |  -.0710389   .0125718    -5.65   0.000    -.0956792   -.0463986
  dumstate12 |   .0577386   .0123424     4.68   0.000     .0335479    .0819294
  dumstate13 |   .0096613   .0122557     0.79   0.431    -.0143595    .0336821
  dumstate14 |  -.0612496   .0124822    -4.91   0.000    -.0857142    -.036785
  dumstate15 |   .0164785   .0126664     1.30   0.193    -.0083472    .0413041
  dumstate16 |  -.0761063   .0124827    -6.10   0.000    -.1005719   -.0516407
  dumstate17 |  -.0566639   .0127143    -4.46   0.000    -.0815835   -.0317443
  dumstate18 |  -.0492899   .0130014    -3.79   0.000    -.0747721   -.0238076
  dumstate19 |   -.082207   .0124313    -6.61   0.000     -.106572    -.057842
  dumstate20 |  -.0839647   .0125326    -6.70   0.000    -.1085282   -.0594012
  dumstate21 |  -.0523524   .0125769    -4.16   0.000    -.0770028   -.0277021
  dumstate22 |          0  (omitted)
  dumstate23 |   .1766693   .0140291    12.59   0.000     .1491726    .2041659
  dumstate24 |   .3215782   .0154648    20.79   0.000     .2912678    .3518886
  dumstate25 |   .1429571   .0128675    11.11   0.000     .1177374    .1681769
  dumstate26 |  -.0097976   .0129835    -0.75   0.450    -.0352447    .0156496
  dumstate27 |  -.0418086   .0123283    -3.39   0.001    -.0659716   -.0176457
  dumstate28 |  -.0973188   .0132688    -7.33   0.000    -.1233252   -.0713125
  dumstate29 |   -.007425   .0130982    -0.57   0.571    -.0330969     .018247
  dumstate30 |  -.0765466    .012277    -6.23   0.000     -.100609   -.0524841
  dumstate31 |  -.0705799    .012468    -5.66   0.000    -.0950167   -.0461431
  dumstate32 |   -.071548   .0126911    -5.64   0.000    -.0964222   -.0466739
  dumstate33 |   -.044219   .0132673    -3.33   0.001    -.0702225   -.0182155
  dumstate34 |  -.0707967   .0128897    -5.49   0.000    -.0960602   -.0455333
  dumstate35 |   -.077317    .012498    -6.19   0.000    -.1018125   -.0528214
  dumstate36 |  -.0112317   .0140368    -0.80   0.424    -.0387434    .0162801
  dumstate37 |  -.0671826   .0127288    -5.28   0.000    -.0921306   -.0422346
  dumstate38 |   .0449565   .0121595     3.70   0.000     .0211242    .0687888
  dumstate39 |  -.0754174   .0128411    -5.87   0.000    -.1005856   -.0502492
  dumstate40 |  -.0648628   .0127017    -5.11   0.000    -.0897577   -.0399679
  dumstate41 |   .0529784   .0133319     3.97   0.000     .0268483    .0791086
  dumstate42 |   .0237823   .0132639     1.79   0.073    -.0022146    .0497792
  dumstate43 |  -.0224972   .0148334    -1.52   0.129    -.0515701    .0065756
  dumstate44 |  -.0287568    .013486    -2.13   0.033    -.0551888   -.0023247
  dumstate45 |  -.0823178   .0129127    -6.37   0.000    -.1076263   -.0570093
  dumstate46 |  -.0145533   .0138581    -1.05   0.294    -.0417148    .0126082
  dumstate47 |   .0700112   .0134457     5.21   0.000     .0436581    .0963643
  dumstate48 |  -.0419498   .0131295    -3.20   0.001    -.0676832   -.0162165
  dumstate49 |   .1833102   .0122116    15.01   0.000     .1593758    .2072445
  dumstate50 |   .2520901   .0146113    17.25   0.000     .2234524    .2807278
  dumstate51 |   .0489776   .0192478     2.54   0.011     .0112525    .0867026
    dumyear1 |  -.0755756   .0074689   -10.12   0.000    -.0902144   -.0609369
    dumyear2 |  -.0620192   .0074719    -8.30   0.000     -.076664   -.0473744
    dumyear3 |  -.0757206   .0078304    -9.67   0.000     -.091068   -.0603732
    dumyear4 |  -.0622278   .0075156    -8.28   0.000    -.0769582   -.0474975
    dumyear5 |  -.0643245   .0075462    -8.52   0.000    -.0791148   -.0495342
    dumyear6 |  -.0841715   .0077283   -10.89   0.000    -.0993188   -.0690242
    dumyear7 |  -.0492342   .0075854    -6.49   0.000    -.0641014    -.034367
    dumyear8 |   -.082901   .0074272   -11.16   0.000    -.0974581   -.0683439
    dumyear9 |  -.0817398   .0074964   -10.90   0.000    -.0964326    -.067047
   dumyear10 |  -.0532412   .0075035    -7.10   0.000    -.0679479   -.0385345
   dumyear11 |  -.0804778   .0075255   -10.69   0.000    -.0952274   -.0657281
   dumyear12 |  -.0814882   .0079262   -10.28   0.000    -.0970233   -.0659531
   dumyear13 |  -.0832115   .0079987   -10.40   0.000    -.0988887   -.0675343
   dumyear14 |  -.0488647    .008063    -6.06   0.000     -.064668   -.0330614
   dumyear15 |  -.0247267   .0082047    -3.01   0.003    -.0408077   -.0086458
   dumyear16 |  -.0017578   .0084281    -0.21   0.835    -.0182765    .0147609
   dumyear17 |    .020965   .0084953     2.47   0.014     .0043145    .0376155
   dumyear18 |   .0215064    .008432     2.55   0.011       .00498    .0380328
   dumyear19 |    .046249   .0085437     5.41   0.000     .0295037    .0629944
   dumyear20 |   .0208572   .0085278     2.45   0.014     .0041429    .0375714
   dumyear21 |   .0084708   .0084054     1.01   0.314    -.0080035    .0249451
   dumyear22 |   .0014794   .0084095     0.18   0.860    -.0150029    .0179616
   dumyear23 |   .0074576   .0084578     0.88   0.378    -.0091195    .0240346
   dumyear24 |   .0233358   .0085691     2.72   0.006     .0065407     .040131
   dumyear25 |   .0356886    .008728     4.09   0.000     .0185821    .0527951
   dumyear26 |   .0121793   .0087478     1.39   0.164     -.004966    .0293246
   dumyear27 |  -.0032421   .0087573    -0.37   0.711    -.0204062     .013922
   dumyear28 |   .0140025   .0087466     1.60   0.109    -.0031405    .0311456
   dumyear29 |          0  (omitted)
   dumyear30 |  -.0009939   .0089201    -0.11   0.911    -.0184769    .0164892
   dumyear31 |   .0287771   .0090837     3.17   0.002     .0109733    .0465809
   dumyear32 |   .0516388   .0090404     5.71   0.000     .0339199    .0693578
   dumyear33 |   .0578271    .009102     6.35   0.000     .0399875    .0756666
   dumyear34 |   .0367913   .0091634     4.02   0.000     .0188313    .0547513
   dumyear35 |    .074956   .0093672     8.00   0.000     .0565966    .0933155
    dumnind1 |          0  (omitted)
    dumnind2 |    -.06521   .0049691   -13.12   0.000    -.0749492   -.0554708
    dumnind3 |   .0029904   .0047308     0.63   0.527    -.0062818    .0122626
    dumnind4 |  -.1289221   .0047866   -26.93   0.000    -.1383036   -.1195406
    dumnind5 |  -.0164943   .0054469    -3.03   0.002    -.0271699   -.0058186
    dumnind6 |   .0956483   .0064778    14.77   0.000     .0829521    .1083445
    dumnind7 |  -.0695486    .005265   -13.21   0.000    -.0798678   -.0592293
    dumnind8 |  -.2017368   .0066422   -30.37   0.000    -.2147552   -.1887183
    dumnind9 |  -.4695473   .0071322   -65.83   0.000    -.4835262   -.4555684
   dumnind10 |  -.2261072   .0064314   -35.16   0.000    -.2387125   -.2135018
   dumnind11 |  -.0655049   .0079997    -8.19   0.000    -.0811839   -.0498258
        educ |   .0895708   .0022256    40.25   0.000     .0852088    .0939329
       exper |  -.0136886   .0015105    -9.06   0.000    -.0166492    -.010728
      exper2 |   .0033592    .000115    29.22   0.000     .0031339    .0035846
      exper3 |  -.0001259   4.22e-06   -29.81   0.000    -.0001342   -.0001176
      exper4 |   1.35e-06   4.79e-08    28.14   0.000     1.25e-06    1.44e-06
        edex |   .0003052   .0000785     3.89   0.000     .0001515     .000459
   dumee_cl1 |   .2479732    .014162    17.51   0.000     .2202161    .2757302
   dumee_cl2 |   .0360782   .0132769     2.72   0.007     .0100558    .0621006
   dumee_cl3 |  -.1372376   .0134403   -10.21   0.000    -.1635802    -.110895
   dumee_cl4 |  -.3053537   .0154961   -19.71   0.000    -.3357256   -.2749817
   dumee_cl5 |   .0332905   .0121888     2.73   0.006     .0094008    .0571801
   dumee_cl6 |  -.1698662   .0120283   -14.12   0.000    -.1934414   -.1462911
   dumee_cl7 |  -.2824818   .0127916   -22.08   0.000     -.307553   -.2574106
   dumee_cl8 |   -.003236   .0150197    -0.22   0.829    -.0326741     .026202
   dumee_cl9 |  -.0890444   .0089717    -9.93   0.000    -.1066285   -.0714602
  dumee_cl10 |  -.2852206   .0097142   -29.36   0.000    -.3042602    -.266181
  dumee_cl11 |  -.2910258   .0112639   -25.84   0.000    -.3131026    -.268949
  dumee_cl12 |   .0426618   .0145235     2.94   0.003     .0141963    .0711273
  dumee_cl13 |          0  (omitted)
  dumee_cl14 |  -.2445622   .0072458   -33.75   0.000    -.2587636   -.2303607
  dumee_cl15 |  -.2341545   .0097762   -23.95   0.000    -.2533156   -.2149934
  dumee_cl16 |   .0150395   .0147181     1.02   0.307    -.0138075    .0438864
        marr |   .1334749   .0020719    64.42   0.000      .129414    .1375358
      public |  -.0381027   .0046714    -8.16   0.000    -.0472586   -.0289468
        cmsa |    .136652   .0019412    70.39   0.000     .1328472    .1404567
   dumnocc31 |   .3199846   .0031708   100.92   0.000     .3137699    .3261993
   dumnocc32 |   .0726372   .0030408    23.89   0.000     .0666774    .0785969
   dumnocc33 |          0  (omitted)
   dumnocc34 |  -.0415454    .002582   -16.09   0.000    -.0466061   -.0364847
 dumquarter1 |  -.0159537   .0025542    -6.25   0.000    -.0209599   -.0109474
 dumquarter2 |  -.0104071   .0025534    -4.08   0.000    -.0154116   -.0054026
 dumquarter3 |  -.0080706   .0025756    -3.13   0.002    -.0131188   -.0030224
 dumquarter4 |          0  (omitted)
       _cons |   .8209243   .0345909    23.73   0.000     .7531273    .8887212
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate41 dropped because of collinearity
note: dumyear19 dropped because of collinearity
note: dumnind11 dropped because of collinearity
note: dumee_cl13 dropped because of collinearity
note: dumnocc31 dropped because of collinearity
note: dumquarter2 dropped because of collinearity
(1,663,699 real changes made)

      Source |       SS       df       MS              Number of obs =   96363
-------------+------------------------------           F(124, 96238) =  240.90
       Model |  23726.4584   124  191.342406           Prob > F      =  0.0000
    Residual |  53759.4187 96238   .55860906           R-squared     =  0.3062
-------------+------------------------------           Adj R-squared =  0.3053
       Total |   77485.877 96362  .804112379           Root MSE      =   .7474
------------------------------------------------------------------------------
             |               Robust
   rifbmn_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |   .0597729       .117     0.51   0.609    -.1695457    .2890915
   dumstate2 |   .1465791    .110896     1.32   0.186    -.0707759    .3639341
   dumstate3 |          0  (omitted)
   dumstate4 |   .0636327     .08723     0.73   0.466     -.107337    .2346025
   dumstate5 |   .0074371   .0897846     0.08   0.934    -.1685398    .1834139
   dumstate6 |   .1542526   .0874814     1.76   0.078    -.0172101    .3257152
   dumstate7 |   .1250877   .0827646     1.51   0.131    -.0371299    .2873053
   dumstate8 |   .2119399   .0845777     2.51   0.012     .0461686    .3777111
   dumstate9 |   .0469547   .0835475     0.56   0.574    -.1167974    .2107068
  dumstate10 |  -.0407737   .0828579    -0.49   0.623    -.2031742    .1216268
  dumstate11 |  -.0059718   .0859712    -0.07   0.945    -.1744742    .1625307
  dumstate12 |   .1006953   .0829043     1.21   0.225    -.0617963    .2631868
  dumstate13 |   .0975978   .0834004     1.17   0.242    -.0658659    .2610615
  dumstate14 |  -.0855548   .0864526    -0.99   0.322    -.2550009    .0838912
  dumstate15 |   .0005696   .0880491     0.01   0.995    -.1720056    .1731447
  dumstate16 |  -.0512675   .1014156    -0.51   0.613     -.250041     .147506
  dumstate17 |  -.0498307   .0844344    -0.59   0.555    -.2153213    .1156598
  dumstate18 |   .0903589   .1467636     0.62   0.538    -.1972961     .378014
  dumstate19 |  -.0323309   .1160598    -0.28   0.781    -.2598069     .195145
  dumstate20 |   .0014914   .0899672     0.02   0.987    -.1748434    .1778261
  dumstate21 |  -.0047905    .085528    -0.06   0.955    -.1724245    .1628434
  dumstate22 |   .0161197   .0855046     0.19   0.850    -.1514682    .1837077
  dumstate23 |   .2716111   .0831138     3.27   0.001      .108709    .4345132
  dumstate24 |    .165879   .0823304     2.01   0.044     .0045123    .3272457
  dumstate25 |   .0904936    .082509     1.10   0.273    -.0712232    .2522103
  dumstate26 |   .0828863   .1012864     0.82   0.413    -.1156339    .2814065
  dumstate27 |  -.0354386   .0819529    -0.43   0.665    -.1960654    .1251882
  dumstate28 |  -.0768355   .0820247    -0.94   0.349    -.2376029    .0839319
  dumstate29 |   .0378941   .0820431     0.46   0.644    -.1229094    .1986975
  dumstate30 |  -.0648977   .0820755    -0.79   0.429    -.2257648    .0959693
  dumstate31 |   .0046929    .084977     0.06   0.956     -.161861    .1712468
  dumstate32 |  -.0506887   .0830121    -0.61   0.541    -.2133916    .1120141
  dumstate33 |  -.0721751   .0823202    -0.88   0.381    -.2335217    .0891715
  dumstate34 |  -.0910027   .0817452    -1.11   0.266    -.2512224    .0692171
  dumstate35 |  -.1513573   .0824551    -1.84   0.066    -.3129684    .0102537
  dumstate36 |  -.0298303   .0826028    -0.36   0.718    -.1917309    .1320703
  dumstate37 |  -.0385558   .0854326    -0.45   0.652    -.2060026    .1288911
  dumstate38 |   .0316447   .0821404     0.39   0.700    -.1293494    .1926389
  dumstate39 |  -.0498017   .1457668    -0.34   0.733     -.335503    .2358995
  dumstate40 |   .0631373   .1346487     0.47   0.639    -.2007727    .3270473
  dumstate41 |   .3064347   .1592421     1.92   0.054     -.005678    .6185474
  dumstate42 |    .047337   .0885827     0.53   0.593    -.1262841    .2209582
  dumstate43 |   .0950045   .0982869     0.97   0.334    -.0976366    .2876457
  dumstate44 |  -.0207741   .0879681    -0.24   0.813    -.1931906    .1516425
  dumstate45 |  -.1468182   .0969208    -1.51   0.130     -.336782    .0431455
  dumstate46 |   .0334405   .0861265     0.39   0.698    -.1353665    .2022476
  dumstate47 |   .1766722    .090649     1.95   0.051    -.0009988    .3543432
  dumstate48 |   .0077103   .1027012     0.08   0.940    -.1935829    .2090035
  dumstate49 |   .2361415   .0828808     2.85   0.004      .073696    .3985869
  dumstate50 |   .2646593   .0957708     2.76   0.006     .0769496    .4523691
  dumstate51 |   .1900635   .1167482     1.63   0.104    -.0387618    .4188887
    dumyear1 |  -.0138301   .0194821    -0.71   0.478    -.0520147    .0243545
    dumyear2 |  -.0138982   .0194819    -0.71   0.476    -.0520825    .0242862
    dumyear3 |          0  (omitted)
    dumyear4 |   .0097318   .0194052     0.50   0.616    -.0283022    .0477658
    dumyear5 |   .0026159   .0193881     0.13   0.893    -.0353846    .0406164
    dumyear6 |  -.0204271   .0202472    -1.01   0.313    -.0601114    .0192572
    dumyear7 |   .0050743   .0198697     0.26   0.798      -.03387    .0440186
    dumyear8 |  -.0030036   .0198737    -0.15   0.880    -.0419558    .0359486
    dumyear9 |  -.0128929    .019932    -0.65   0.518    -.0519594    .0261736
   dumyear10 |  -.0133186   .0204247    -0.65   0.514    -.0533507    .0267136
   dumyear11 |  -.0138307   .0198673    -0.70   0.486    -.0527705     .025109
   dumyear12 |  -.0395667   .0228593    -1.73   0.083    -.0843707    .0052373
   dumyear13 |  -.0508224   .0221242    -2.30   0.022    -.0941855   -.0074593
   dumyear14 |   .0213381    .023461     0.91   0.363    -.0246452    .0673215
   dumyear15 |   .0139627   .0240576     0.58   0.562    -.0331898    .0611153
   dumyear16 |   .0105453   .0229124     0.46   0.645    -.0343627    .0554533
   dumyear17 |   .0396757   .0243004     1.63   0.103    -.0079529    .0873043
   dumyear18 |   .0489341   .0236464     2.07   0.039     .0025873    .0952808
   dumyear19 |   .0377501   .0252506     1.50   0.135    -.0117408    .0872411
   dumyear20 |   .0373636   .0246941     1.51   0.130    -.0110365    .0857637
   dumyear21 |   .0329717   .0243307     1.36   0.175    -.0147162    .0806597
   dumyear22 |   .0154665    .023546     0.66   0.511    -.0306834    .0616165
   dumyear23 |   .0074092   .0230312     0.32   0.748    -.0377318    .0525501
   dumyear24 |   .0125494   .0230925     0.54   0.587    -.0327116    .0578104
   dumyear25 |   .0288819   .0244575     1.18   0.238    -.0190546    .0768184
   dumyear26 |   .0424062   .0239494     1.77   0.077    -.0045343    .0893467
   dumyear27 |  -.0027108   .0236034    -0.11   0.909    -.0489733    .0435517
   dumyear28 |   .0380002   .0239763     1.58   0.113    -.0089931    .0849935
   dumyear29 |  -.0096499   .0236989    -0.41   0.684    -.0560995    .0367997
   dumyear30 |  -.0416129   .0237311    -1.75   0.080    -.0881257    .0048999
   dumyear31 |   .0107719   .0236211     0.46   0.648    -.0355251    .0570689
   dumyear32 |   .0710142   .0247532     2.87   0.004     .0224981    .1195303
   dumyear33 |   .0158748   .0242216     0.66   0.512    -.0315992    .0633488
   dumyear34 |   .0232417   .0254714     0.91   0.362    -.0266818    .0731653
   dumyear35 |     .07452    .026252     2.84   0.005     .0230663    .1259737
    dumnind1 |   .0508291   .0265297     1.92   0.055    -.0011689     .102827
    dumnind2 |  -.0297172   .0223401    -1.33   0.183    -.0735035     .014069
    dumnind3 |   .0169255   .0212391     0.80   0.426    -.0247029     .058554
    dumnind4 |  -.1827231   .0205019    -8.91   0.000    -.2229066   -.1425396
    dumnind5 |   .0231984   .0213676     1.09   0.278     -.018682    .0650787
    dumnind6 |  -.0209321   .0242227    -0.86   0.388    -.0684084    .0265442
    dumnind7 |  -.1593121   .0212127    -7.51   0.000    -.2008888   -.1177353
    dumnind8 |  -.3216888   .0210812   -15.26   0.000    -.3630078   -.2803699
    dumnind9 |  -.3605197   .0210817   -17.10   0.000    -.4018396   -.3191999
   dumnind10 |  -.2651482   .0230379   -11.51   0.000    -.3103023   -.2199941
   dumnind11 |          0  (omitted)
        educ |   .0919601   .0073224    12.56   0.000     .0776083    .1063119
       exper |   .0200426   .0042738     4.69   0.000     .0116661    .0284191
      exper2 |   .0017642    .000327     5.40   0.000     .0011233     .002405
      exper3 |  -.0000633   .0000108    -5.85   0.000    -.0000845   -.0000421
      exper4 |   6.05e-07   1.14e-07     5.32   0.000     3.82e-07    8.28e-07
        edex |  -.0013421   .0002115    -6.35   0.000    -.0017566   -.0009276
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |   -.176911    .013077   -13.53   0.000    -.2025417   -.1512803
   dumee_cl3 |  -.2716266   .0217574   -12.48   0.000    -.3142708   -.2289823
   dumee_cl4 |  -.1759795    .041996    -4.19   0.000    -.2582912   -.0936679
   dumee_cl5 |  -.2234981   .0174603   -12.80   0.000    -.2577201   -.1892761
   dumee_cl6 |  -.3068147   .0189611   -16.18   0.000    -.3439781   -.2696512
   dumee_cl7 |  -.2750743   .0250086   -11.00   0.000    -.3240909   -.2260577
   dumee_cl8 |   .0604465   .0393082     1.54   0.124    -.0165972    .1374902
   dumee_cl9 |  -.3902168   .0288331   -13.53   0.000    -.4467293   -.3337043
  dumee_cl10 |  -.4002739   .0298411   -13.41   0.000    -.4587621   -.3417857
  dumee_cl11 |  -.2299063   .0339856    -6.76   0.000    -.2965176    -.163295
  dumee_cl12 |   .0977516   .0420167     2.33   0.020     .0153993    .1801038
  dumee_cl13 |  -.4246439   .0395132   -10.75   0.000    -.5020893   -.3471985
  dumee_cl14 |  -.4111642   .0387247   -10.62   0.000    -.4870641   -.3352643
  dumee_cl15 |  -.2817056   .0416794    -6.76   0.000    -.3633966   -.2000145
  dumee_cl16 |   .0499389   .0471822     1.06   0.290    -.0425377    .1424154
        marr |   .1249365    .006596    18.94   0.000     .1120084    .1378645
      public |    .047504   .0129776     3.66   0.000     .0220681    .0729399
        cmsa |   .1075304    .007405    14.52   0.000     .0930168     .122044
   dumnocc31 |   .5035973   .0113436    44.39   0.000     .4813639    .5258308
   dumnocc32 |   .0648972    .009122     7.11   0.000     .0470181    .0827762
   dumnocc33 |          0  (omitted)
   dumnocc34 |  -.0106337    .007557    -1.41   0.159    -.0254452    .0041779
 dumquarter1 |  -.0105728   .0081462    -1.30   0.194    -.0265392    .0053937
 dumquarter2 |  -.0165527   .0081309    -2.04   0.042    -.0324893   -.0006161
 dumquarter3 |          0  (omitted)
 dumquarter4 |  -.0054317   .0081728    -0.66   0.506    -.0214502    .0105868
       _cons |   .5583227   .1158677     4.82   0.000     .3312233    .7854221
------------------------------------------------------------------------------
(analytic weights assumed)
note: dumstate22 dropped because of collinearity
note: dumyear35 dropped because of collinearity
note: dumnind10 dropped because of collinearity
note: dumee_cl1 dropped because of collinearity
note: dumnocc33 dropped because of collinearity
note: dumquarter3 dropped because of collinearity
(746,827 real changes made)

      Source |       SS       df       MS              Number of obs = 1013235
-------------+------------------------------           F(124,1013110) = 1816.67
       Model |  276802.754   124  2232.28028           Prob > F      =  0.0000
    Residual |  620822.748 1013110  .612789084         R-squared     =  0.3084
-------------+------------------------------           Adj R-squared =  0.3083
       Total |  897625.503 1013234  .885901483         Root MSE      =  .78281
------------------------------------------------------------------------------
             |               Robust
  rifwmcn_80 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   dumstate1 |  -.0220504   .0128077    -1.72   0.085     -.047153    .0030523
   dumstate2 |   .0505138   .0124423     4.06   0.000     .0261273    .0749004
   dumstate3 |   .0023262    .010062     0.23   0.817    -.0173949    .0220473
   dumstate4 |   .0802563   .0106907     7.51   0.000     .0593029    .1012097
   dumstate5 |  -.0438228   .0110684    -3.96   0.000    -.0655165   -.0221291
   dumstate6 |   .1187876   .0124334     9.55   0.000     .0944185    .1431567
   dumstate7 |   .0824532   .0098331     8.39   0.000     .0631807    .1017257
   dumstate8 |   .1923018   .0115616    16.63   0.000     .1696414    .2149621
   dumstate9 |  -.0292257   .0096193    -3.04   0.002    -.0480793   -.0103721
  dumstate10 |  -.0653075   .0093187    -7.01   0.000    -.0835718   -.0470432
  dumstate11 |  -.0718943   .0104221    -6.90   0.000    -.0923214   -.0514673
  dumstate12 |   .0629298   .0099371     6.33   0.000     .0434535    .0824061
  dumstate13 |   .0139989   .0096524     1.45   0.147    -.0049195    .0329172
  dumstate14 |  -.0555461   .0102778    -5.40   0.000    -.0756903   -.0354019
  dumstate15 |   .0408046   .0113171     3.61   0.000     .0186234    .0629857
  dumstate16 |  -.0580693   .0109022    -5.33   0.000    -.0794372   -.0367015
  dumstate17 |  -.0466688   .0108032    -4.32   0.000    -.0678427   -.0254949
  dumstate18 |   .0323851   .0119037     2.72   0.007     .0090542    .0557159
  dumstate19 |  -.0767645   .0101814    -7.54   0.000    -.0967196   -.0568093
  dumstate20 |  -.0625685   .0109501    -5.71   0.000    -.0840303   -.0411067
  dumstate21 |  -.0452562   .0104852    -4.32   0.000    -.0658069   -.0247055
  dumstate22 |  -.0078981   .0148975    -0.53   0.596    -.0370967    .0213006
  dumstate23 |   .1524989   .0125802    12.12   0.000     .1278421    .1771558
  dumstate24 |   .3234562   .0142588    22.68   0.000     .2955094     .351403
  dumstate25 |   .1418435   .0109272    12.98   0.000     .1204264    .1632605
  dumstate26 |   -.022089   .0115406    -1.91   0.056    -.0447081    .0005301
  dumstate27 |  -.0712594   .0097489    -7.31   0.000     -.090367   -.0521518
  dumstate28 |  -.1056135   .0113796    -9.28   0.000    -.1279171   -.0833099
  dumstate29 |   -.002787   .0108821    -0.26   0.798    -.0241156    .0185416
  dumstate30 |  -.0785508    .009719    -8.08   0.000    -.0975997   -.0595018
  dumstate31 |  -.0710008   .0104446    -6.80   0.000    -.0914719   -.0505297
  dumstate32 |  -.0994568   .0102331    -9.72   0.000    -.1195132   -.0794003
  dumstate33 |  -.0766526    .011195    -6.85   0.000    -.0985945   -.0547107
  dumstate34 |  -.1025622   .0108949    -9.41   0.000    -.1239158   -.0812085
  dumstate35 |  -.1027456   .0106555    -9.64   0.000    -.1236299   -.0818613
  dumstate36 |   .0216264   .0131874     1.64   0.101    -.0042204    .0474731
  dumstate37 |  -.0899454   .0105696    -8.51   0.000    -.1106614   -.0692293
  dumstate38 |   .0354864   .0096233     3.69   0.000     .0166251    .0543477
  dumstate39 |          0  (omitted)
  dumstate40 |  -.0595873   .0116119    -5.13   0.000    -.0823461   -.0368284
  dumstate41 |   .1472513   .0122771    11.99   0.000     .1231886     .171314
  dumstate42 |   .0403306   .0119534     3.37   0.001     .0169023    .0637588
  dumstate43 |  -.0302062   .0149435    -2.02   0.043    -.0594949   -.0009175
  dumstate44 |    -.01858   .0119249    -1.56   0.119    -.0419524    .0047924
  dumstate45 |  -.0496751   .0110972    -4.48   0.000    -.0714253    -.027925
  dumstate46 |   .0311197   .0123727     2.52   0.012     .0068697    .0553698
  dumstate47 |   .0806135   .0117861     6.84   0.000     .0575131    .1037139
  dumstate48 |  -.0359273   .0110772    -3.24   0.001    -.0576382   -.0142164
  dumstate49 |   .1855528   .0097878    18.96   0.000      .166369    .2047365
  dumstate50 |   .3017509   .0150918    19.99   0.000     .2721715    .3313303
  dumstate51 |   .1004315   .0204709     4.91   0.000     .0603092    .1405538
    dumyear1 |  -.0261133   .0087565    -2.98   0.003    -.0432757   -.0089508
    dumyear2 |  -.0170283   .0090313    -1.89   0.059    -.0347293    .0006727
    dumyear3 |          0  (omitted)
    dumyear4 |   .0085577   .0092316     0.93   0.354    -.0095359    .0266513
    dumyear5 |     .02652    .009401     2.82   0.005     .0080944    .0449457
    dumyear6 |  -.0017967   .0096341    -0.19   0.852    -.0206793    .0170858
    dumyear7 |   .0123722   .0096457     1.28   0.200     -.006533    .0312774
    dumyear8 |   .0081734   .0093384     0.88   0.381    -.0101296    .0264764
    dumyear9 |   -.028526   .0092266    -3.09   0.002    -.0466098   -.0104421
   dumyear10 |  -.0172355   .0094857    -1.82   0.069    -.0358273    .0013562
   dumyear11 |  -.0288316    .009612    -3.00   0.003    -.0476707   -.0099925
   dumyear12 |   -.060426   .0099095    -6.10   0.000    -.0798483   -.0410038
   dumyear13 |  -.0329443   .0101141    -3.26   0.001    -.0527676    -.013121
   dumyear14 |  -.0126362   .0100821    -1.25   0.210    -.0323967    .0071243
   dumyear15 |  -.0093125   .0103228    -0.90   0.367    -.0295449    .0109199
   dumyear16 |   .0255589   .0109226     2.34   0.019      .004151    .0469668
   dumyear17 |   .0543611   .0113629     4.78   0.000     .0320901    .0766321
   dumyear18 |   .0374196   .0108822     3.44   0.001     .0160908    .0587484
   dumyear19 |   .0633896   .0113057     5.61   0.000     .0412309    .0855484
   dumyear20 |   .0341605   .0109196     3.13   0.002     .0127583    .0555626
   dumyear21 |   .0198762    .010538     1.89   0.059     -.000778    .0405304
   dumyear22 |   .0197327   .0105826     1.86   0.062    -.0010089    .0404743
   dumyear23 |   .0199943    .010789     1.85   0.064    -.0011519    .0411404
   dumyear24 |   .0271637   .0107364     2.53   0.011     .0061206    .0482067
   dumyear25 |   .0520178    .011352     4.58   0.000     .0297683    .0742674
   dumyear26 |   .0410069   .0121602     3.37   0.001     .0171733    .0648406
   dumyear27 |  -.0011605   .0114214    -0.10   0.919    -.0235461     .021225
   dumyear28 |   .0089891   .0112089     0.80   0.423    -.0129799    .0309582
   dumyear29 |   .0114479   .0115083     0.99   0.320    -.0111079    .0340038
   dumyear30 |   .0177673   .0117291     1.51   0.130    -.0052212    .0407559
   dumyear31 |   .0354046   .0117223     3.02   0.003     .0124293    .0583799
   dumyear32 |   .0473779   .0113618     4.17   0.000     .0251091    .0696467
   dumyear33 |   .0375275   .0113205     3.32   0.001     .0153397    .0597153
   dumyear34 |   .0618163   .0118322     5.22   0.000     .0386256    .0850071
   dumyear35 |   .0865644   .0119313     7.26   0.000     .0631795    .1099493
    dumnind1 |  -.0280869   .0131646    -2.13   0.033    -.0538891   -.0022847
    dumnind2 |  -.0813754    .010563    -7.70   0.000    -.1020785   -.0606724
    dumnind3 |  -.0272231   .0106101    -2.57   0.010    -.0480187   -.0064276
    dumnind4 |  -.1669877   .0104632   -15.96   0.000    -.1874953   -.1464802
    dumnind5 |  -.0201699   .0109291    -1.85   0.065    -.0415905    .0012506
    dumnind6 |   .0559645   .0118137     4.74   0.000       .03281     .079119
    dumnind7 |   -.096342   .0106389    -9.06   0.000     -.117194   -.0754901
    dumnind8 |  -.2571834   .0111832   -23.00   0.000    -.2791022   -.2352647
    dumnind9 |  -.4424199   .0101831   -43.45   0.000    -.4623784   -.4224615
   dumnind10 |  -.2381972   .0114229   -20.85   0.000    -.2605858   -.2158087
   dumnind11 |          0  (omitted)
        educ |   .0664587    .003272    20.31   0.000     .0600456    .0728718
       exper |   .0074296   .0020486     3.63   0.000     .0034144    .0114448
      exper2 |   .0022467   .0001556    14.43   0.000     .0019417    .0025518
      exper3 |  -.0000848   5.49e-06   -15.46   0.000    -.0000956   -.0000741
      exper4 |   8.64e-07   6.06e-08    14.27   0.000     7.46e-07    9.83e-07
        edex |  -.0004864   .0001038    -4.69   0.000    -.0006898    -.000283
   dumee_cl1 |          0  (omitted)
   dumee_cl2 |  -.1674489   .0065037   -25.75   0.000    -.1801959    -.154702
   dumee_cl3 |  -.2508632   .0102383   -24.50   0.000      -.27093   -.2307964
   dumee_cl4 |  -.1855141   .0190286    -9.75   0.000    -.2228096   -.1482186
   dumee_cl5 |  -.2280221   .0087519   -26.05   0.000    -.2451757   -.2108686
   dumee_cl6 |  -.3087214   .0091882   -33.60   0.000      -.32673   -.2907127
   dumee_cl7 |  -.2784396   .0120417   -23.12   0.000    -.3020409   -.2548383
   dumee_cl8 |   .1969757   .0181803    10.83   0.000     .1613429    .2326086
   dumee_cl9 |  -.3632446   .0149265   -24.34   0.000    -.3925001   -.3339891
  dumee_cl10 |  -.3688949   .0146725   -25.14   0.000    -.3976524   -.3401373
  dumee_cl11 |  -.2292659   .0164689   -13.92   0.000    -.2615445   -.1969873
  dumee_cl12 |    .248915   .0197064    12.63   0.000     .2102911    .2875388
  dumee_cl13 |  -.3372397   .0218154   -15.46   0.000    -.3799972   -.2944822
  dumee_cl14 |  -.3457201   .0193174   -17.90   0.000    -.3835817   -.3078586
  dumee_cl15 |  -.1808434   .0203149    -8.90   0.000      -.22066   -.1410269
  dumee_cl16 |   .2101974   .0221176     9.50   0.000     .1668478    .2535471
        marr |   .1626768   .0032091    50.69   0.000      .156387    .1689666
      public |  -.0381418   .0073507    -5.19   0.000     -.052549   -.0237346
        cmsa |   .1199471   .0029851    40.18   0.000     .1140965    .1257977
   dumnocc31 |          0  (omitted)
   dumnocc32 |  -.3358907    .005134   -65.43   0.000    -.3459531   -.3258283
   dumnocc33 |  -.4736233   .0052634   -89.98   0.000    -.4839394   -.4633071
   dumnocc34 |  -.4753404   .0048142   -98.74   0.000    -.4847762   -.4659047
 dumquarter1 |  -.0224448   .0037845    -5.93   0.000    -.0298624   -.0150272
 dumquarter2 |  -.0112579   .0038266    -2.94   0.003    -.0187578   -.0037579
 dumquarter3 |  -.0095442   .0038748    -2.46   0.014    -.0171387   -.0019498
 dumquarter4 |          0  (omitted)
       _cons |   1.517918   .0384957    39.43   0.000     1.442468    1.593368
------------------------------------------------------------------------------

. 
. 
end of do-file

. do "/Users/amedeusdsouza/econ499/code/linreg.do"

. ** In this dofile we gen prelim linear regs
. 
. clear *

. 
. ********************************************************************************
. *********************************** PREAMBLE ***********************************
. ********************************************************************************
. 
. ** ssc install grstyle, replace 
. ** ssc install palettes, replace 
. ** ssc install xtable, replace 
. 
. set scheme s2color 

. grstyle init 

. grstyle set compact 

. grstyle set horizontal 

. grstyle set legend 6, nobox 

. grstyle color background white 

. grstyle color major_grid black%10

. 
. set maxvar 25000


. 
. cd /Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output
/Users/amedeusdsouza/Desktop/econ499data/morg/clean_nber_morg_output

. 
. global code "/Users/amedeusdsouza/econ499/code"

. global tabs "/Users/amedeusdsouza/econ499/tabs"

. global figs "/Users/amedeusdsouza/econ499/figures"

. global estimation "/Users/amedeusdsouza/Desktop/econ499data/estimation"

. global distreg "/Users/amedeusdsouza/econ499/distreg"

. global mwagedata "/Users/amedeusdsouza/Desktop/econ499data/zipperer-min-wage"

. global linreg "/Users/amedeusdsouza/econ499/linreg"

. global dfl1 "/Users/amedeusdsouza/econ499/dfl1"

. 
. cap log close
